; ModuleID = 'coreutils-8.27/src/b2sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"BLAKE2\00", align 1
@.str.39 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!34 = !DIEnumerator(name: "_ISlower", value: 512)
!35 = !DIEnumerator(name: "_ISalpha", value: 1024)
!36 = !DIEnumerator(name: "_ISdigit", value: 2048)
!37 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!38 = !DIEnumerator(name: "_ISspace", value: 8192)
!39 = !DIEnumerator(name: "_ISprint", value: 16384)
!40 = !DIEnumerator(name: "_ISgraph", value: 32768)
!41 = !DIEnumerator(name: "_ISblank", value: 1)
!42 = !DIEnumerator(name: "_IScntrl", value: 2)
!43 = !DIEnumerator(name: "_ISpunct", value: 4)
!44 = !DIEnumerator(name: "_ISalnum", value: 8)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !47, file: !46, line: 187, size: 32, elements: !57)
!46 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!47 = distinct !DISubprogram(name: "select_plural", scope: !46, file: !46, line: 183, type: !48, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !55)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !51}
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !52, line: 136, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !54, line: 62, baseType: !50)
!54 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!55 = !{!56}
!56 = !DILocalVariable(name: "n", arg: 1, scope: !47, file: !46, line: 183, type: !51)
!57 = !{!58}
!58 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 45, size: 32, elements: !61)
!60 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!61 = !{!62, !63, !64, !65, !66, !67}
!62 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!63 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!64 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!65 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!66 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!67 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!68 = !{!69, !71, !72, !74, !76, !79, !81, !82, !83, !84, !78}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 62, baseType: !50)
!73 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!84 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!85 = !{!86, !89, !91, !93, !95, !97, !0, !126, !128, !130, !132, !134, !136, !141, !147, !263, !265, !273}
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !88, isLocal: true, isDefinition: true)
!88 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !72, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !72, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "b2_algorithm", scope: !2, file: !3, line: 180, type: !5, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "b2_length", scope: !2, file: !3, line: 181, type: !51, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98)
!98 = distinct !DIGlobalVariable(name: "infomap", scope: !99, file: !46, line: 632, type: !123, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !46, file: !46, line: 630, type: !100, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !79}
!102 = !{!103, !104, !105, !112, !114, !115, !116, !119, !120, !122}
!103 = !DILocalVariable(name: "program", arg: 1, scope: !99, file: !46, line: 630, type: !79)
!104 = !DILocalVariable(name: "node", scope: !99, file: !46, line: 642, type: !79)
!105 = !DILocalVariable(name: "map_prog", scope: !99, file: !46, line: 643, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !99, file: !46, line: 632, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !108, file: !46, line: 632, baseType: !79, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !108, file: !46, line: 632, baseType: !79, size: 64, offset: 64)
!112 = !DILocalVariable(name: "__s1_len", scope: !113, file: !46, line: 645, type: !72)
!113 = distinct !DILexicalBlock(scope: !99, file: !46, line: 645, column: 33)
!114 = !DILocalVariable(name: "__s2_len", scope: !113, file: !46, line: 645, type: !72)
!115 = !DILocalVariable(name: "lc_messages", scope: !99, file: !46, line: 655, type: !79)
!116 = !DILocalVariable(name: "__s1_len", scope: !117, file: !46, line: 656, type: !72)
!117 = distinct !DILexicalBlock(scope: !118, file: !46, line: 656, column: 22)
!118 = distinct !DILexicalBlock(scope: !99, file: !46, line: 656, column: 7)
!119 = !DILocalVariable(name: "__s2_len", scope: !117, file: !46, line: 656, type: !72)
!120 = !DILocalVariable(name: "__s2", scope: !121, file: !46, line: 656, type: !76)
!121 = distinct !DILexicalBlock(scope: !117, file: !46, line: 656, column: 22)
!122 = !DILocalVariable(name: "__result", scope: !121, file: !46, line: 656, type: !81)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 896, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 7)
!126 = !DIGlobalVariableExpression(var: !127)
!127 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !88, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129)
!129 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !88, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !88, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !88, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135)
!135 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !88, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "blake2_max_len", scope: !2, file: !3, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 1)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "algorithm_in_string", scope: !2, file: !3, line: 161, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, elements: !145)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!145 = !{!146}
!146 = !DISubrange(count: 2)
!147 = !DIGlobalVariableExpression(var: !148)
!148 = distinct !DIGlobalVariable(name: "bin2hex", scope: !149, file: !3, line: 723, type: !260, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 644, type: !150, isLocal: true, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!88, !79}
!152 = !{!153, !154, !207, !208, !209, !210, !211, !212, !213, !217, !218, !219, !220, !221, !222, !224, !225, !227, !228, !230, !231, !232, !236, !239, !240, !242, !243, !245, !246, !247, !251, !252, !258}
!153 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !149, file: !3, line: 644, type: !79)
!154 = !DILocalVariable(name: "checkfile_stream", scope: !149, file: !3, line: 646, type: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !157, line: 49, baseType: !158)
!157 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !159, line: 241, size: 1728, elements: !160)
!159 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !181, !182, !183, !184, !187, !188, !190, !192, !195, !197, !198, !199, !200, !201, !202, !203}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !158, file: !159, line: 242, baseType: !81, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !158, file: !159, line: 247, baseType: !69, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !158, file: !159, line: 248, baseType: !69, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !158, file: !159, line: 249, baseType: !69, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !158, file: !159, line: 250, baseType: !69, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !158, file: !159, line: 251, baseType: !69, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !158, file: !159, line: 252, baseType: !69, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !158, file: !159, line: 253, baseType: !69, size: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !158, file: !159, line: 254, baseType: !69, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !158, file: !159, line: 256, baseType: !69, size: 64, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !158, file: !159, line: 257, baseType: !69, size: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !158, file: !159, line: 258, baseType: !69, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !158, file: !159, line: 260, baseType: !174, size: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !159, line: 156, size: 192, elements: !176)
!176 = !{!177, !178, !180}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !175, file: !159, line: 157, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !175, file: !159, line: 158, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !175, file: !159, line: 162, baseType: !81, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !158, file: !159, line: 262, baseType: !179, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !158, file: !159, line: 264, baseType: !81, size: 32, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !158, file: !159, line: 268, baseType: !81, size: 32, offset: 928)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !158, file: !159, line: 270, baseType: !185, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 140, baseType: !186)
!186 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !158, file: !159, line: 274, baseType: !84, size: 16, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !158, file: !159, line: 275, baseType: !189, size: 8, offset: 1040)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !158, file: !159, line: 276, baseType: !191, size: 8, offset: 1048)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !139)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !158, file: !159, line: 280, baseType: !193, size: 64, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !159, line: 150, baseType: null)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !158, file: !159, line: 289, baseType: !196, size: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 141, baseType: !186)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !158, file: !159, line: 297, baseType: !71, size: 64, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !158, file: !159, line: 298, baseType: !71, size: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !158, file: !159, line: 299, baseType: !71, size: 64, offset: 1344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !158, file: !159, line: 300, baseType: !71, size: 64, offset: 1408)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !158, file: !159, line: 302, baseType: !72, size: 64, offset: 1472)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !158, file: !159, line: 303, baseType: !81, size: 32, offset: 1536)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !158, file: !159, line: 305, baseType: !204, size: 160, offset: 1568)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 20)
!207 = !DILocalVariable(name: "n_misformatted_lines", scope: !149, file: !3, line: 647, type: !51)
!208 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !149, file: !3, line: 648, type: !51)
!209 = !DILocalVariable(name: "n_mismatched_checksums", scope: !149, file: !3, line: 649, type: !51)
!210 = !DILocalVariable(name: "n_open_or_read_failures", scope: !149, file: !3, line: 650, type: !51)
!211 = !DILocalVariable(name: "properly_formatted_lines", scope: !149, file: !3, line: 651, type: !88)
!212 = !DILocalVariable(name: "matched_checksums", scope: !149, file: !3, line: 652, type: !88)
!213 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !149, file: !3, line: 653, type: !214)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 576, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 72)
!217 = !DILocalVariable(name: "bin_buffer", scope: !149, file: !3, line: 655, type: !83)
!218 = !DILocalVariable(name: "line_number", scope: !149, file: !3, line: 656, type: !51)
!219 = !DILocalVariable(name: "line", scope: !149, file: !3, line: 657, type: !69)
!220 = !DILocalVariable(name: "line_chars_allocated", scope: !149, file: !3, line: 658, type: !72)
!221 = !DILocalVariable(name: "is_stdin", scope: !149, file: !3, line: 659, type: !88)
!222 = !DILocalVariable(name: "__s1_len", scope: !223, file: !3, line: 659, type: !72)
!223 = distinct !DILexicalBlock(scope: !149, file: !3, line: 659, column: 19)
!224 = !DILocalVariable(name: "__s2_len", scope: !223, file: !3, line: 659, type: !72)
!225 = !DILocalVariable(name: "__s2", scope: !226, file: !3, line: 659, type: !76)
!226 = distinct !DILexicalBlock(scope: !223, file: !3, line: 659, column: 19)
!227 = !DILocalVariable(name: "__result", scope: !226, file: !3, line: 659, type: !81)
!228 = !DILocalVariable(name: "filename", scope: !229, file: !3, line: 682, type: !69)
!229 = distinct !DILexicalBlock(scope: !149, file: !3, line: 681, column: 5)
!230 = !DILocalVariable(name: "binary", scope: !229, file: !3, line: 683, type: !81)
!231 = !DILocalVariable(name: "hex_digest", scope: !229, file: !3, line: 684, type: !83)
!232 = !DILocalVariable(name: "line_length", scope: !229, file: !3, line: 685, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !234, line: 109, baseType: !235)
!234 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !54, line: 181, baseType: !186)
!236 = !DILocalVariable(name: "__s1_len", scope: !237, file: !3, line: 705, type: !72)
!237 = distinct !DILexicalBlock(scope: !238, file: !3, line: 705, column: 32)
!238 = distinct !DILexicalBlock(scope: !229, file: !3, line: 704, column: 11)
!239 = !DILocalVariable(name: "__s2_len", scope: !237, file: !3, line: 705, type: !72)
!240 = !DILocalVariable(name: "__s2", scope: !241, file: !3, line: 705, type: !76)
!241 = distinct !DILexicalBlock(scope: !237, file: !3, line: 705, column: 32)
!242 = !DILocalVariable(name: "__result", scope: !241, file: !3, line: 705, type: !81)
!243 = !DILocalVariable(name: "ok", scope: !244, file: !3, line: 727, type: !88)
!244 = distinct !DILexicalBlock(scope: !238, file: !3, line: 722, column: 9)
!245 = !DILocalVariable(name: "missing", scope: !244, file: !3, line: 728, type: !88)
!246 = !DILocalVariable(name: "needs_escape", scope: !244, file: !3, line: 731, type: !88)
!247 = !DILocalVariable(name: "digest_bin_bytes", scope: !248, file: !3, line: 755, type: !72)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 754, column: 13)
!249 = distinct !DILexicalBlock(scope: !250, file: !3, line: 748, column: 20)
!250 = distinct !DILexicalBlock(scope: !244, file: !3, line: 737, column: 15)
!251 = !DILocalVariable(name: "cnt", scope: !248, file: !3, line: 756, type: !72)
!252 = !DILocalVariable(name: "__res", scope: !253, file: !3, line: 762, type: !81)
!253 = distinct !DILexicalBlock(scope: !254, file: !3, line: 762, column: 23)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 762, column: 23)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 761, column: 17)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 760, column: 15)
!257 = distinct !DILexicalBlock(scope: !248, file: !3, line: 760, column: 15)
!258 = !DILocalVariable(name: "__res", scope: !259, file: !3, line: 764, type: !81)
!259 = distinct !DILexicalBlock(scope: !254, file: !3, line: 764, column: 27)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 128, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 16)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !81, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "blake2fns", scope: !2, file: !3, line: 182, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 64, elements: !139)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2fn", file: !269, line: 17, baseType: !270)
!269 = !DIFile(filename: "src/blake2/b2sum.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!81, !155, !71, !72}
!273 = !DIGlobalVariableExpression(var: !274)
!274 = distinct !DIGlobalVariable(name: "algorithm_out_string", scope: !2, file: !3, line: 165, type: !143, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 3328, elements: !285)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !278, line: 104, size: 256, elements: !279)
!278 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!279 = !{!280, !281, !282, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !277, file: !278, line: 106, baseType: !79, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !277, file: !278, line: 109, baseType: !81, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !278, line: 110, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !277, file: !278, line: 111, baseType: !81, size: 32, offset: 192)
!285 = !{!286}
!286 = !DISubrange(count: 13)
!287 = !DIGlobalVariableExpression(var: !288)
!288 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !289, file: !290, line: 23, type: !326, isLocal: true, isDefinition: true)
!289 = distinct !DICompileUnit(language: DW_LANG_C99, file: !290, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !300, globals: !306)
!290 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!291 = !{!292}
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !293, line: 40, size: 32, elements: !294)
!293 = !DIFile(filename: "src/blake2/blake2.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!296 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!297 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!298 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!299 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!300 = !{!301, !303, !76, !71, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !52, line: 50, baseType: !78)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !52, line: 57, baseType: !50)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!306 = !{!287, !307, !321}
!307 = !DIGlobalVariableExpression(var: !308)
!308 = distinct !DIGlobalVariable(name: "memset_v", scope: !309, file: !310, line: 156, type: !316, isLocal: true, isDefinition: true)
!309 = distinct !DISubprogram(name: "secure_zero_memory", scope: !310, file: !310, line: 154, type: !311, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !289, variables: !313)
!310 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!311 = !DISubroutineType(types: !312)
!312 = !{null, !71, !72}
!313 = !{!314, !315}
!314 = !DILocalVariable(name: "v", arg: 1, scope: !309, file: !310, line: 154, type: !71)
!315 = !DILocalVariable(name: "n", arg: 2, scope: !309, file: !310, line: 154, type: !72)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!71, !71, !81, !72}
!321 = !DIGlobalVariableExpression(var: !322)
!322 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !289, file: !290, line: 31, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 1536, elements: !324)
!324 = !{!325, !262}
!325 = !DISubrange(count: 12)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, elements: !328)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!328 = !{!329}
!329 = !DISubrange(count: 8)
!330 = !DIGlobalVariableExpression(var: !331)
!331 = distinct !DIGlobalVariable(name: "Version", scope: !332, file: !333, line: 2, type: !79, isLocal: false, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !335)
!333 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !{}
!335 = !{!330}
!336 = !DIGlobalVariableExpression(var: !337)
!337 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !338, file: !343, line: 69, type: !344, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !341, globals: !342)
!339 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!340 = !{!8}
!341 = !{!72, !71, !78}
!342 = !{!336}
!343 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !345, line: 55, baseType: !346)
!345 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null}
!349 = !DIGlobalVariableExpression(var: !350)
!350 = distinct !DIGlobalVariable(name: "file_name", scope: !351, file: !356, line: 36, type: !79, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !353)
!352 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!353 = !{!349, !354}
!354 = !DIGlobalVariableExpression(var: !355)
!355 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !351, file: !356, line: 46, type: !88, isLocal: true, isDefinition: true)
!356 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!357 = !DIGlobalVariableExpression(var: !358)
!358 = distinct !DIGlobalVariable(name: "exit_failure", scope: !359, file: !362, line: 24, type: !363, isLocal: false, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !361)
!360 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!361 = !{!357}
!362 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!363 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !81)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "program_name", scope: !366, file: !370, line: 33, type: !79, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !368, globals: !369)
!367 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!368 = !{!71, !69}
!369 = !{!364}
!370 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !373, file: !385, line: 77, type: !418, isLocal: false, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !381, globals: !382)
!374 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!375 = !{!8, !376, !30}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !9, line: 242, size: 32, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!379 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!380 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!381 = !{!81, !84, !72, !69}
!382 = !{!371, !383, !390, !400, !402, !407, !414, !416}
!383 = !DIGlobalVariableExpression(var: !384)
!384 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !373, file: !385, line: 93, type: !386, isLocal: false, isDefinition: true)
!385 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 320, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!388 = !{!389}
!389 = !DISubrange(count: 10)
!390 = !DIGlobalVariableExpression(var: !391)
!391 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !373, file: !385, line: 1043, type: !392, isLocal: false, isDefinition: true)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !385, line: 57, size: 448, elements: !393)
!393 = !{!394, !395, !396, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !392, file: !385, line: 60, baseType: !8, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !392, file: !385, line: 63, baseType: !81, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !392, file: !385, line: 67, baseType: !397, size: 256, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !328)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !392, file: !385, line: 70, baseType: !79, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !392, file: !385, line: 73, baseType: !79, size: 64, offset: 384)
!400 = !DIGlobalVariableExpression(var: !401)
!401 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !373, file: !385, line: 108, type: !392, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403)
!403 = distinct !DIGlobalVariable(name: "slot0", scope: !373, file: !385, line: 834, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 256)
!407 = !DIGlobalVariableExpression(var: !408)
!408 = distinct !DIGlobalVariable(name: "slotvec", scope: !373, file: !385, line: 837, type: !409, isLocal: true, isDefinition: true)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !385, line: 826, size: 128, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !410, file: !385, line: 828, baseType: !72, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !410, file: !385, line: 829, baseType: !69, size: 64, offset: 64)
!414 = !DIGlobalVariableExpression(var: !415)
!415 = distinct !DIGlobalVariable(name: "nslots", scope: !373, file: !385, line: 835, type: !81, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417)
!417 = distinct !DIGlobalVariable(name: "slotvec0", scope: !373, file: !385, line: 836, type: !410, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 704, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 11)
!421 = !DIGlobalVariableExpression(var: !422)
!422 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !423, file: !426, line: 26, type: !427, isLocal: false, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !425)
!424 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!425 = !{!421}
!426 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 376, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 47)
!430 = !DIGlobalVariableExpression(var: !431)
!431 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !432, file: !433, line: 335, type: !81, isLocal: true, isDefinition: true)
!432 = distinct !DISubprogram(name: "rpl_fcntl", scope: !433, file: !433, line: 272, type: !434, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !436, variables: !439)
!433 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!434 = !DISubroutineType(types: !435)
!435 = !{!81, !81, !81, null}
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !438)
!437 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!438 = !{!430}
!439 = !{!440, !441, !442, !453, !454, !457, !460, !463}
!440 = !DILocalVariable(name: "fd", arg: 1, scope: !432, file: !433, line: 272, type: !81)
!441 = !DILocalVariable(name: "action", arg: 2, scope: !432, file: !433, line: 272, type: !81)
!442 = !DILocalVariable(name: "arg", scope: !432, file: !433, line: 274, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !444, line: 30, baseType: !445)
!444 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !437, line: 274, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 192, elements: !139)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !437, line: 274, size: 192, elements: !448)
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !447, file: !437, line: 274, baseType: !82, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !447, file: !437, line: 274, baseType: !82, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !447, file: !437, line: 274, baseType: !71, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !447, file: !437, line: 274, baseType: !71, size: 64, offset: 128)
!453 = !DILocalVariable(name: "result", scope: !432, file: !433, line: 275, type: !81)
!454 = !DILocalVariable(name: "target", scope: !455, file: !433, line: 322, type: !81)
!455 = distinct !DILexicalBlock(scope: !456, file: !433, line: 321, column: 7)
!456 = distinct !DILexicalBlock(scope: !432, file: !433, line: 278, column: 5)
!457 = !DILocalVariable(name: "flags", scope: !458, file: !433, line: 359, type: !81)
!458 = distinct !DILexicalBlock(scope: !459, file: !433, line: 358, column: 11)
!459 = distinct !DILexicalBlock(scope: !455, file: !433, line: 357, column: 13)
!460 = !DILocalVariable(name: "saved_errno", scope: !461, file: !433, line: 362, type: !81)
!461 = distinct !DILexicalBlock(scope: !462, file: !433, line: 361, column: 15)
!462 = distinct !DILexicalBlock(scope: !458, file: !433, line: 360, column: 17)
!463 = !DILocalVariable(name: "p", scope: !464, file: !433, line: 404, type: !71)
!464 = distinct !DILexicalBlock(scope: !456, file: !433, line: 402, column: 7)
!465 = !DIGlobalVariableExpression(var: !466)
!466 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !467, file: !810, line: 120, type: !811, isLocal: true, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !469, retainedTypes: !808, globals: !809)
!468 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!469 = !{!470}
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !471, line: 41, size: 32, elements: !472)
!471 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!473 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!474 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!475 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!476 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!477 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!478 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!479 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!480 = !DIEnumerator(name: "DAY_1", value: 131079)
!481 = !DIEnumerator(name: "DAY_2", value: 131080)
!482 = !DIEnumerator(name: "DAY_3", value: 131081)
!483 = !DIEnumerator(name: "DAY_4", value: 131082)
!484 = !DIEnumerator(name: "DAY_5", value: 131083)
!485 = !DIEnumerator(name: "DAY_6", value: 131084)
!486 = !DIEnumerator(name: "DAY_7", value: 131085)
!487 = !DIEnumerator(name: "ABMON_1", value: 131086)
!488 = !DIEnumerator(name: "ABMON_2", value: 131087)
!489 = !DIEnumerator(name: "ABMON_3", value: 131088)
!490 = !DIEnumerator(name: "ABMON_4", value: 131089)
!491 = !DIEnumerator(name: "ABMON_5", value: 131090)
!492 = !DIEnumerator(name: "ABMON_6", value: 131091)
!493 = !DIEnumerator(name: "ABMON_7", value: 131092)
!494 = !DIEnumerator(name: "ABMON_8", value: 131093)
!495 = !DIEnumerator(name: "ABMON_9", value: 131094)
!496 = !DIEnumerator(name: "ABMON_10", value: 131095)
!497 = !DIEnumerator(name: "ABMON_11", value: 131096)
!498 = !DIEnumerator(name: "ABMON_12", value: 131097)
!499 = !DIEnumerator(name: "MON_1", value: 131098)
!500 = !DIEnumerator(name: "MON_2", value: 131099)
!501 = !DIEnumerator(name: "MON_3", value: 131100)
!502 = !DIEnumerator(name: "MON_4", value: 131101)
!503 = !DIEnumerator(name: "MON_5", value: 131102)
!504 = !DIEnumerator(name: "MON_6", value: 131103)
!505 = !DIEnumerator(name: "MON_7", value: 131104)
!506 = !DIEnumerator(name: "MON_8", value: 131105)
!507 = !DIEnumerator(name: "MON_9", value: 131106)
!508 = !DIEnumerator(name: "MON_10", value: 131107)
!509 = !DIEnumerator(name: "MON_11", value: 131108)
!510 = !DIEnumerator(name: "MON_12", value: 131109)
!511 = !DIEnumerator(name: "AM_STR", value: 131110)
!512 = !DIEnumerator(name: "PM_STR", value: 131111)
!513 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!514 = !DIEnumerator(name: "D_FMT", value: 131113)
!515 = !DIEnumerator(name: "T_FMT", value: 131114)
!516 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!517 = !DIEnumerator(name: "ERA", value: 131116)
!518 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!519 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!520 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!521 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!522 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!523 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!524 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!525 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!526 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!527 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!528 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!529 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!530 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!531 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!532 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!533 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!534 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!535 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!536 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!537 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!538 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!539 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!540 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!541 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!542 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!543 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!544 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!545 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!546 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!547 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!548 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!549 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!550 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!551 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!552 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!553 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!554 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!555 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!556 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!557 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!558 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!559 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!560 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!561 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!562 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!563 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!564 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!565 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!566 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!567 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!568 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!569 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!570 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!571 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!572 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!573 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!574 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!575 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!576 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!577 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!578 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!579 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!580 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!581 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!582 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!583 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!584 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!585 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!586 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!587 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!588 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!589 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!590 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!591 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!592 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!593 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!594 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!595 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!596 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!597 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!598 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!599 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!600 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!601 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!602 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!603 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!604 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!605 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!606 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!607 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!608 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!609 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!610 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!611 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!612 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!613 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!614 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!615 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!616 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!617 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!618 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!619 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!620 = !DIEnumerator(name: "CODESET", value: 14)
!621 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!622 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!623 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!624 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!629 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!630 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!631 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!632 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!633 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!634 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!635 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!636 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!637 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!638 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!639 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!640 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!647 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!649 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!650 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!651 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!652 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!653 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!654 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!655 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!656 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!657 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!658 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!659 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!660 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!661 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!662 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!667 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!668 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!669 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!670 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!671 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!672 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!673 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!674 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!675 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!676 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!677 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!678 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!679 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!680 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!681 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!682 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!683 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!684 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!685 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!686 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!687 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!688 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!689 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!690 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!691 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!692 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!693 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!694 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!695 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!696 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!697 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!698 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!699 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!700 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!701 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!702 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!703 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!704 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!705 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!706 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!707 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!708 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!709 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!710 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!711 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!712 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!713 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!714 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!715 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!717 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!718 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!719 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!720 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!721 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!722 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!723 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!724 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!725 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!726 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!727 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!728 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!729 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!730 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!731 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!732 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!735 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!736 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!737 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!738 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!739 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!740 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!741 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!742 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!743 = !DIEnumerator(name: "THOUSEP", value: 65537)
!744 = !DIEnumerator(name: "__GROUPING", value: 65538)
!745 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!746 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!747 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!748 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!749 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!750 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!751 = !DIEnumerator(name: "__YESSTR", value: 327682)
!752 = !DIEnumerator(name: "__NOSTR", value: 327683)
!753 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!754 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!755 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!756 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!757 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!758 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!759 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!760 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!761 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!762 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!763 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!764 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!765 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!766 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!767 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!768 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!769 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!770 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!771 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!772 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!773 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!774 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!775 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!776 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!777 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!778 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!779 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!780 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!781 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!782 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!783 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!784 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!785 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!786 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!787 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!788 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!789 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!790 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!791 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!792 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!793 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!794 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!795 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!796 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!797 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!798 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!799 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!800 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!801 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!802 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!803 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!804 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!805 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!806 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!807 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!808 = !{!71, !69, !83}
!809 = !{!465}
!810 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!811 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !79)
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !814, globals: !815)
!813 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!814 = !{!305}
!815 = !{!816}
!816 = !DIGlobalVariableExpression(var: !817)
!817 = distinct !DIGlobalVariable(name: "buffer_length", scope: !818, file: !813, line: 35, type: !886, isLocal: true, isDefinition: true)
!818 = distinct !DISubprogram(name: "blake2b_stream", scope: !813, file: !813, line: 30, type: !819, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, unit: !812, variables: !861)
!819 = !DISubroutineType(types: !820)
!820 = !{!81, !821, !71, !72}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !157, line: 49, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !159, line: 241, size: 1728, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !823, file: !159, line: 242, baseType: !81, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !823, file: !159, line: 247, baseType: !69, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !823, file: !159, line: 248, baseType: !69, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !823, file: !159, line: 249, baseType: !69, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !823, file: !159, line: 250, baseType: !69, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !823, file: !159, line: 251, baseType: !69, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !823, file: !159, line: 252, baseType: !69, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !823, file: !159, line: 253, baseType: !69, size: 64, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !823, file: !159, line: 254, baseType: !69, size: 64, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !823, file: !159, line: 256, baseType: !69, size: 64, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !823, file: !159, line: 257, baseType: !69, size: 64, offset: 640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !823, file: !159, line: 258, baseType: !69, size: 64, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !823, file: !159, line: 260, baseType: !838, size: 64, offset: 768)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !159, line: 156, size: 192, elements: !840)
!840 = !{!841, !842, !844}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !839, file: !159, line: 157, baseType: !838, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !839, file: !159, line: 158, baseType: !843, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !839, file: !159, line: 162, baseType: !81, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !823, file: !159, line: 262, baseType: !843, size: 64, offset: 832)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !823, file: !159, line: 264, baseType: !81, size: 32, offset: 896)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !823, file: !159, line: 268, baseType: !81, size: 32, offset: 928)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !823, file: !159, line: 270, baseType: !185, size: 64, offset: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !823, file: !159, line: 274, baseType: !84, size: 16, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !823, file: !159, line: 275, baseType: !189, size: 8, offset: 1040)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !823, file: !159, line: 276, baseType: !191, size: 8, offset: 1048)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !823, file: !159, line: 280, baseType: !193, size: 64, offset: 1088)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !823, file: !159, line: 289, baseType: !196, size: 64, offset: 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !823, file: !159, line: 297, baseType: !71, size: 64, offset: 1216)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !823, file: !159, line: 298, baseType: !71, size: 64, offset: 1280)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !823, file: !159, line: 299, baseType: !71, size: 64, offset: 1344)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !823, file: !159, line: 300, baseType: !71, size: 64, offset: 1408)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !823, file: !159, line: 302, baseType: !72, size: 64, offset: 1472)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !823, file: !159, line: 303, baseType: !81, size: 32, offset: 1536)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !823, file: !159, line: 305, baseType: !204, size: 160, offset: 1568)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !885}
!862 = !DILocalVariable(name: "stream", arg: 1, scope: !818, file: !813, line: 30, type: !821)
!863 = !DILocalVariable(name: "resstream", arg: 2, scope: !818, file: !813, line: 30, type: !71)
!864 = !DILocalVariable(name: "outbytes", arg: 3, scope: !818, file: !813, line: 30, type: !72)
!865 = !DILocalVariable(name: "ret", scope: !818, file: !813, line: 32, type: !81)
!866 = !DILocalVariable(name: "sum", scope: !818, file: !813, line: 33, type: !72)
!867 = !DILocalVariable(name: "n", scope: !818, file: !813, line: 33, type: !72)
!868 = !DILocalVariable(name: "S", scope: !818, file: !813, line: 34, type: !869)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 1984, elements: !139)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !293, line: 69, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !293, line: 60, size: 1984, elements: !872)
!872 = !{!873, !875, !877, !878, !882, !883, !884}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !871, file: !293, line: 62, baseType: !874, size: 512)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 512, elements: !328)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !871, file: !293, line: 63, baseType: !876, size: 128, offset: 512)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !145)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !871, file: !293, line: 64, baseType: !876, size: 128, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !871, file: !293, line: 65, baseType: !879, size: 1024, offset: 768)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 1024, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !871, file: !293, line: 66, baseType: !72, size: 64, offset: 1792)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !871, file: !293, line: 67, baseType: !72, size: 64, offset: 1856)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !871, file: !293, line: 68, baseType: !303, size: 8, offset: 1920)
!885 = !DILocalVariable(name: "buffer", scope: !818, file: !813, line: 36, type: !305)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !889)
!888 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!889 = !{!59}
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!891 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!893 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !896, retainedTypes: !901)
!895 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!896 = !{!897}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 41, size: 32, elements: !899)
!898 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!899 = !{!900}
!900 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!901 = !{!71}
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !904, retainedTypes: !918)
!903 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!904 = !{!905}
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !907, file: !906, line: 192, size: 32, elements: !916)
!906 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!907 = distinct !DISubprogram(name: "x2nrealloc", scope: !906, file: !906, line: 180, type: !908, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !902, variables: !911)
!908 = !DISubroutineType(types: !909)
!909 = !{!71, !71, !910, !72}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!911 = !{!912, !913, !914, !915}
!912 = !DILocalVariable(name: "p", arg: 1, scope: !907, file: !906, line: 180, type: !71)
!913 = !DILocalVariable(name: "pn", arg: 2, scope: !907, file: !906, line: 180, type: !910)
!914 = !DILocalVariable(name: "s", arg: 3, scope: !907, file: !906, line: 180, type: !72)
!915 = !DILocalVariable(name: "n", scope: !907, file: !906, line: 182, type: !72)
!916 = !{!917}
!917 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!918 = !{!72, !69, !71}
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!920 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !923)
!922 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = !{!22}
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !926, retainedTypes: !927)
!925 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!926 = !{!22, !30}
!927 = !{!81, !84, !69}
!928 = distinct !DICompileUnit(language: DW_LANG_C99, file: !929, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !926, retainedTypes: !927)
!929 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !901)
!931 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!933 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !901)
!935 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !901)
!937 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !940)
!939 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!940 = !{!72}
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!942 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !945)
!944 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!945 = !{!72, !74, !76, !79}
!946 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!947 = !{i32 2, !"Dwarf Version", i32 4}
!948 = !{i32 2, !"Debug Info Version", i32 3}
!949 = !{i32 1, !"PIC Level", i32 2}
!950 = !{i32 1, !"PIE Level", i32 2}
!951 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 223, type: !952, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !954)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !81}
!954 = !{!955}
!955 = !DILocalVariable(name: "status", arg: 1, scope: !951, file: !3, line: 223, type: !81)
!956 = !DIExpression()
!957 = !DILocation(line: 223, column: 12, scope: !951)
!958 = !DILocation(line: 225, column: 14, scope: !959)
!959 = distinct !DILexicalBlock(scope: !951, file: !3, line: 225, column: 7)
!960 = !DILocation(line: 225, column: 7, scope: !951)
!961 = !DILocation(line: 226, column: 5, scope: !962)
!962 = !DILexicalBlockFile(scope: !963, file: !3, discriminator: 1)
!963 = distinct !DILexicalBlock(scope: !959, file: !3, line: 226, column: 5)
!964 = !{!965, !965, i64 0}
!965 = !{!"any pointer", !966, i64 0}
!966 = !{!"omnipotent char", !967, i64 0}
!967 = !{!"Simple C/C++ TBAA"}
!968 = !DILocation(line: 226, column: 5, scope: !969)
!969 = !DILexicalBlockFile(scope: !963, file: !3, discriminator: 3)
!970 = !DILocation(line: 226, column: 5, scope: !971)
!971 = !DILexicalBlockFile(scope: !963, file: !3, discriminator: 2)
!972 = !DILocation(line: 229, column: 7, scope: !973)
!973 = distinct !DILexicalBlock(scope: !959, file: !3, line: 228, column: 5)
!974 = !DILocation(line: 229, column: 7, scope: !975)
!975 = !DILexicalBlockFile(scope: !973, file: !3, discriminator: 1)
!976 = !DILocation(line: 580, column: 3, scope: !977, inlinedAt: !978)
!977 = distinct !DISubprogram(name: "emit_stdin_note", scope: !46, file: !46, line: 578, type: !347, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !334)
!978 = distinct !DILocation(line: 237, column: 7, scope: !973)
!979 = !DILocation(line: 580, column: 3, scope: !980, inlinedAt: !978)
!980 = !DILexicalBlockFile(scope: !977, file: !46, discriminator: 1)
!981 = !DILocation(line: 244, column: 9, scope: !982)
!982 = distinct !DILexicalBlock(scope: !973, file: !3, line: 238, column: 11)
!983 = !DILocation(line: 244, column: 9, scope: !984)
!984 = !DILexicalBlockFile(scope: !982, file: !3, discriminator: 1)
!985 = !DILocation(line: 249, column: 7, scope: !973)
!986 = !DILocation(line: 249, column: 7, scope: !975)
!987 = !DILocation(line: 253, column: 9, scope: !973)
!988 = !DILocation(line: 253, column: 9, scope: !975)
!989 = !DILocation(line: 258, column: 7, scope: !973)
!990 = !DILocation(line: 258, column: 7, scope: !975)
!991 = !DILocation(line: 266, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !973, file: !3, line: 261, column: 11)
!993 = !DILocation(line: 266, column: 9, scope: !994)
!994 = !DILexicalBlockFile(scope: !992, file: !3, discriminator: 1)
!995 = !DILocation(line: 269, column: 7, scope: !973)
!996 = !DILocation(line: 269, column: 7, scope: !975)
!997 = !DILocation(line: 279, column: 7, scope: !973)
!998 = !DILocation(line: 279, column: 7, scope: !975)
!999 = !DILocation(line: 280, column: 7, scope: !973)
!1000 = !DILocation(line: 280, column: 7, scope: !975)
!1001 = !DILocation(line: 281, column: 7, scope: !973)
!1002 = !DILocation(line: 281, column: 7, scope: !975)
!1003 = !DILocation(line: 642, column: 15, scope: !99, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 288, column: 7, scope: !973)
!1005 = !DILocation(line: 651, column: 3, scope: !99, inlinedAt: !1004)
!1006 = !DILocation(line: 651, column: 3, scope: !1007, inlinedAt: !1004)
!1007 = !DILexicalBlockFile(scope: !99, file: !46, discriminator: 1)
!1008 = !DILocation(line: 655, column: 29, scope: !99, inlinedAt: !1004)
!1009 = !DILocation(line: 655, column: 15, scope: !99, inlinedAt: !1004)
!1010 = !DILocation(line: 656, column: 7, scope: !118, inlinedAt: !1004)
!1011 = !DILocation(line: 656, column: 19, scope: !118, inlinedAt: !1004)
!1012 = !DILocation(line: 656, column: 22, scope: !1013, inlinedAt: !1004)
!1013 = !DILexicalBlockFile(scope: !118, file: !46, discriminator: 16)
!1014 = !DILocation(line: 656, column: 7, scope: !1015, inlinedAt: !1004)
!1015 = !DILexicalBlockFile(scope: !99, file: !46, discriminator: 16)
!1016 = !DILocation(line: 662, column: 7, scope: !1017, inlinedAt: !1004)
!1017 = distinct !DILexicalBlock(scope: !118, file: !46, line: 657, column: 5)
!1018 = !DILocation(line: 662, column: 7, scope: !1019, inlinedAt: !1004)
!1019 = !DILexicalBlockFile(scope: !1017, file: !46, discriminator: 1)
!1020 = !DILocation(line: 664, column: 5, scope: !1017, inlinedAt: !1004)
!1021 = !DILocation(line: 665, column: 3, scope: !99, inlinedAt: !1004)
!1022 = !DILocation(line: 665, column: 3, scope: !1007, inlinedAt: !1004)
!1023 = !DILocation(line: 667, column: 3, scope: !99, inlinedAt: !1004)
!1024 = !DILocation(line: 667, column: 3, scope: !1007, inlinedAt: !1004)
!1025 = !DILocation(line: 291, column: 3, scope: !951)
!1026 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 854, type: !1027, isLocal: false, isDefinition: true, scopeLine: 855, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1030)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!81, !81, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1045, !1048, !1051, !1052, !1055}
!1031 = !DILocalVariable(name: "argc", arg: 1, scope: !1026, file: !3, line: 854, type: !81)
!1032 = !DILocalVariable(name: "argv", arg: 2, scope: !1026, file: !3, line: 854, type: !1029)
!1033 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !1026, file: !3, line: 856, type: !214)
!1034 = !DILocalVariable(name: "bin_buffer", scope: !1026, file: !3, line: 858, type: !83)
!1035 = !DILocalVariable(name: "do_check", scope: !1026, file: !3, line: 859, type: !88)
!1036 = !DILocalVariable(name: "opt", scope: !1026, file: !3, line: 860, type: !81)
!1037 = !DILocalVariable(name: "ok", scope: !1026, file: !3, line: 861, type: !88)
!1038 = !DILocalVariable(name: "binary", scope: !1026, file: !3, line: 862, type: !81)
!1039 = !DILocalVariable(name: "prefix_tag", scope: !1026, file: !3, line: 863, type: !88)
!1040 = !DILocalVariable(name: "short_opts", scope: !1026, file: !3, line: 879, type: !79)
!1041 = !DILocalVariable(name: "b2_length_str", scope: !1026, file: !3, line: 880, type: !79)
!1042 = !DILocalVariable(name: "operand_lim", scope: !1026, file: !3, line: 1021, type: !1029)
!1043 = !DILocalVariable(name: "operandp", scope: !1044, file: !3, line: 1025, type: !1029)
!1044 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1025, column: 3)
!1045 = !DILocalVariable(name: "file", scope: !1046, file: !3, line: 1027, type: !69)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 1026, column: 5)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 1025, column: 3)
!1048 = !DILocalVariable(name: "file_is_binary", scope: !1049, file: !3, line: 1033, type: !81)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 1032, column: 9)
!1050 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 1029, column: 11)
!1051 = !DILocalVariable(name: "missing", scope: !1049, file: !3, line: 1034, type: !88)
!1052 = !DILocalVariable(name: "needs_escape", scope: !1053, file: !3, line: 1047, type: !88)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1039, column: 13)
!1054 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1036, column: 15)
!1055 = !DILocalVariable(name: "i", scope: !1053, file: !3, line: 1066, type: !72)
!1056 = !DILocation(line: 653, column: 17, scope: !149, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 1030, column: 15, scope: !1050)
!1058 = !DILocation(line: 854, column: 11, scope: !1026)
!1059 = !DILocation(line: 854, column: 24, scope: !1026)
!1060 = !DILocation(line: 856, column: 3, scope: !1026)
!1061 = !DILocation(line: 856, column: 17, scope: !1026)
!1062 = !DILocalVariable(name: "alignment", arg: 2, scope: !1063, file: !46, line: 498, type: !72)
!1063 = distinct !DISubprogram(name: "ptr_align", scope: !46, file: !46, line: 498, type: !1064, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1066)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!71, !74, !72}
!1066 = !{!1067, !1062, !1068, !1069}
!1067 = !DILocalVariable(name: "ptr", arg: 1, scope: !1063, file: !46, line: 498, type: !74)
!1068 = !DILocalVariable(name: "p0", scope: !1063, file: !46, line: 500, type: !79)
!1069 = !DILocalVariable(name: "p1", scope: !1063, file: !46, line: 501, type: !79)
!1070 = !DILocation(line: 498, column: 36, scope: !1063, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 858, column: 31, scope: !1026)
!1072 = !DILocation(line: 501, column: 35, scope: !1063, inlinedAt: !1071)
!1073 = !DILocation(line: 501, column: 15, scope: !1063, inlinedAt: !1071)
!1074 = !DILocation(line: 502, column: 25, scope: !1063, inlinedAt: !1071)
!1075 = !DILocation(line: 502, column: 37, scope: !1063, inlinedAt: !1071)
!1076 = !DILocation(line: 502, column: 23, scope: !1063, inlinedAt: !1071)
!1077 = !DILocation(line: 858, column: 18, scope: !1026)
!1078 = !DILocation(line: 859, column: 8, scope: !1026)
!1079 = !DILocation(line: 861, column: 8, scope: !1026)
!1080 = !DILocation(line: 862, column: 7, scope: !1026)
!1081 = !DILocation(line: 863, column: 8, scope: !1026)
!1082 = !DILocation(line: 867, column: 21, scope: !1026)
!1083 = !DILocation(line: 867, column: 3, scope: !1026)
!1084 = !DILocation(line: 868, column: 3, scope: !1026)
!1085 = !DILocation(line: 869, column: 3, scope: !1026)
!1086 = !DILocation(line: 870, column: 3, scope: !1026)
!1087 = !DILocation(line: 872, column: 3, scope: !1026)
!1088 = !DILocation(line: 876, column: 12, scope: !1026)
!1089 = !DILocation(line: 876, column: 3, scope: !1026)
!1090 = !DILocation(line: 885, column: 3, scope: !1026)
!1091 = !DILocation(line: 880, column: 15, scope: !1026)
!1092 = !DILocation(line: 885, column: 17, scope: !1093)
!1093 = !DILexicalBlockFile(scope: !1026, file: !3, discriminator: 1)
!1094 = !DILocation(line: 860, column: 7, scope: !1026)
!1095 = !DILocation(line: 885, column: 3, scope: !1093)
!1096 = !DILocation(line: 890, column: 33, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 887, column: 7)
!1098 = !DILocation(line: 891, column: 33, scope: !1097)
!1099 = !DILocation(line: 890, column: 21, scope: !1097)
!1100 = !DILocation(line: 890, column: 19, scope: !1097)
!1101 = !{!1102, !1102, i64 0}
!1102 = !{!"long", !966, i64 0}
!1103 = !DILocation(line: 892, column: 25, scope: !1097)
!1104 = !DILocation(line: 893, column: 23, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 893, column: 13)
!1106 = !DILocation(line: 893, column: 27, scope: !1105)
!1107 = !DILocation(line: 893, column: 13, scope: !1097)
!1108 = !DILocation(line: 895, column: 26, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 894, column: 11)
!1110 = !DILocation(line: 895, column: 51, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 1)
!1112 = !DILocation(line: 895, column: 13, scope: !1113)
!1113 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 2)
!1114 = !DILocation(line: 896, column: 13, scope: !1109)
!1115 = !DILocation(line: 896, column: 13, scope: !1111)
!1116 = !DILocation(line: 905, column: 9, scope: !1097)
!1117 = !DILocation(line: 910, column: 9, scope: !1097)
!1118 = !DILocation(line: 913, column: 9, scope: !1097)
!1119 = !DILocation(line: 918, column: 9, scope: !1097)
!1120 = !DILocation(line: 921, column: 9, scope: !1097)
!1121 = !DILocation(line: 926, column: 9, scope: !1097)
!1122 = !DILocation(line: 929, column: 9, scope: !1097)
!1123 = !DILocation(line: 933, column: 9, scope: !1097)
!1124 = distinct !{!1124, !1090, !1125}
!1125 = !DILocation(line: 938, column: 7, scope: !1026)
!1126 = !DILocation(line: 934, column: 7, scope: !1097)
!1127 = !DILocation(line: 935, column: 7, scope: !1097)
!1128 = !DILocation(line: 935, column: 7, scope: !1129)
!1129 = !DILexicalBlockFile(scope: !1097, file: !3, discriminator: 1)
!1130 = !DILocation(line: 937, column: 9, scope: !1097)
!1131 = !DILocation(line: 942, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 942, column: 7)
!1133 = !DILocation(line: 942, column: 17, scope: !1132)
!1134 = !DILocation(line: 942, column: 7, scope: !1026)
!1135 = !DILocation(line: 944, column: 20, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 943, column: 5)
!1137 = !DILocation(line: 944, column: 45, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1136, file: !3, discriminator: 1)
!1139 = !DILocation(line: 944, column: 7, scope: !1140)
!1140 = !DILexicalBlockFile(scope: !1136, file: !3, discriminator: 2)
!1141 = !DILocation(line: 945, column: 7, scope: !1136)
!1142 = !{!966, !966, i64 0}
!1143 = !DILocation(line: 945, column: 7, scope: !1138)
!1144 = !DILocation(line: 945, column: 7, scope: !1140)
!1145 = !DILocation(line: 950, column: 17, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 950, column: 7)
!1147 = !DILocation(line: 950, column: 27, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1146, file: !3, discriminator: 1)
!1149 = !DILocation(line: 950, column: 22, scope: !1146)
!1150 = !DILocation(line: 951, column: 15, scope: !1146)
!1151 = !DILocation(line: 951, column: 5, scope: !1146)
!1152 = !DILocation(line: 952, column: 22, scope: !1026)
!1153 = !DILocation(line: 952, column: 32, scope: !1026)
!1154 = !DILocation(line: 952, column: 20, scope: !1026)
!1155 = !DILocation(line: 957, column: 7, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 957, column: 7)
!1157 = !DILocation(line: 957, column: 18, scope: !1156)
!1158 = !DILocation(line: 957, column: 22, scope: !1159)
!1159 = !DILexicalBlockFile(scope: !1156, file: !3, discriminator: 1)
!1160 = !DILocation(line: 964, column: 19, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 958, column: 4)
!1162 = !DILocation(line: 964, column: 6, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1161, file: !3, discriminator: 1)
!1164 = !DILocation(line: 965, column: 6, scope: !1161)
!1165 = !DILocation(line: 968, column: 18, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 968, column: 7)
!1167 = !DILocation(line: 970, column: 20, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 969, column: 5)
!1169 = !DILocation(line: 970, column: 7, scope: !1170)
!1170 = !DILexicalBlockFile(scope: !1168, file: !3, discriminator: 1)
!1171 = !DILocation(line: 972, column: 7, scope: !1168)
!1172 = !DILocation(line: 975, column: 9, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 975, column: 7)
!1174 = !DILocation(line: 975, column: 19, scope: !1173)
!1175 = !DILocation(line: 977, column: 20, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 976, column: 5)
!1177 = !DILocation(line: 977, column: 7, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1176, file: !3, discriminator: 1)
!1179 = !DILocation(line: 979, column: 7, scope: !1176)
!1180 = !DILocation(line: 982, column: 22, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 982, column: 7)
!1182 = !DILocation(line: 985, column: 14, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 983, column: 5)
!1184 = !DILocation(line: 984, column: 7, scope: !1183)
!1185 = !DILocation(line: 987, column: 7, scope: !1183)
!1186 = !DILocation(line: 990, column: 19, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 990, column: 7)
!1188 = !DILocation(line: 993, column: 8, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 991, column: 5)
!1190 = !DILocation(line: 992, column: 7, scope: !1189)
!1191 = !DILocation(line: 994, column: 7, scope: !1189)
!1192 = !DILocation(line: 997, column: 12, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 997, column: 7)
!1194 = !DILocation(line: 1000, column: 8, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 998, column: 5)
!1196 = !DILocation(line: 999, column: 7, scope: !1195)
!1197 = !DILocation(line: 1001, column: 7, scope: !1195)
!1198 = !DILocation(line: 1004, column: 13, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1004, column: 7)
!1200 = !DILocation(line: 1007, column: 8, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 1005, column: 5)
!1202 = !DILocation(line: 1006, column: 7, scope: !1201)
!1203 = !DILocation(line: 1008, column: 7, scope: !1201)
!1204 = !DILocation(line: 1011, column: 17, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1011, column: 7)
!1206 = !DILocation(line: 1011, column: 16, scope: !1205)
!1207 = !DILocation(line: 1011, column: 14, scope: !1205)
!1208 = !DILocation(line: 1011, column: 7, scope: !1026)
!1209 = !DILocation(line: 1014, column: 9, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 1012, column: 4)
!1211 = !DILocation(line: 1013, column: 6, scope: !1210)
!1212 = !DILocation(line: 1015, column: 6, scope: !1210)
!1213 = !DILocation(line: 1018, column: 7, scope: !1026)
!1214 = !DILocation(line: 1021, column: 29, scope: !1026)
!1215 = !DILocation(line: 1021, column: 10, scope: !1026)
!1216 = !DILocation(line: 1022, column: 7, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1022, column: 7)
!1218 = !{!1219, !1219, i64 0}
!1219 = !{!"int", !966, i64 0}
!1220 = !DILocation(line: 1022, column: 14, scope: !1217)
!1221 = !DILocation(line: 1022, column: 7, scope: !1026)
!1222 = !DILocation(line: 1023, column: 17, scope: !1217)
!1223 = !DILocation(line: 1023, column: 20, scope: !1217)
!1224 = !DILocation(line: 1023, column: 5, scope: !1217)
!1225 = !DILocation(line: 1025, column: 31, scope: !1044)
!1226 = !DILocation(line: 1025, column: 15, scope: !1044)
!1227 = !DILocation(line: 1025, column: 50, scope: !1228)
!1228 = !DILexicalBlockFile(scope: !1047, file: !3, discriminator: 1)
!1229 = !DILocation(line: 1025, column: 3, scope: !1230)
!1230 = !DILexicalBlockFile(scope: !1044, file: !3, discriminator: 1)
!1231 = !DILocation(line: 1090, column: 23, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1090, column: 7)
!1233 = !DILocation(line: 1027, column: 20, scope: !1046)
!1234 = !DILocation(line: 1027, column: 13, scope: !1046)
!1235 = !DILocation(line: 1029, column: 11, scope: !1046)
!1236 = !DILocation(line: 644, column: 27, scope: !149, inlinedAt: !1057)
!1237 = !DILocation(line: 647, column: 13, scope: !149, inlinedAt: !1057)
!1238 = !DILocation(line: 648, column: 13, scope: !149, inlinedAt: !1057)
!1239 = !DILocation(line: 649, column: 13, scope: !149, inlinedAt: !1057)
!1240 = !DILocation(line: 650, column: 13, scope: !149, inlinedAt: !1057)
!1241 = !DILocation(line: 651, column: 8, scope: !149, inlinedAt: !1057)
!1242 = !DILocation(line: 652, column: 8, scope: !149, inlinedAt: !1057)
!1243 = !DILocation(line: 653, column: 3, scope: !149, inlinedAt: !1057)
!1244 = !DILocation(line: 498, column: 36, scope: !1063, inlinedAt: !1245)
!1245 = distinct !DILocation(line: 655, column: 31, scope: !149, inlinedAt: !1057)
!1246 = !DILocation(line: 501, column: 15, scope: !1063, inlinedAt: !1245)
!1247 = !DILocation(line: 655, column: 18, scope: !149, inlinedAt: !1057)
!1248 = !DILocation(line: 657, column: 3, scope: !149, inlinedAt: !1057)
!1249 = !DILocation(line: 658, column: 3, scope: !149, inlinedAt: !1057)
!1250 = !DILocation(line: 659, column: 19, scope: !223, inlinedAt: !1057)
!1251 = !DILocation(line: 659, column: 19, scope: !226, inlinedAt: !1057)
!1252 = !DILocation(line: 659, column: 19, scope: !1253, inlinedAt: !1057)
!1253 = !DILexicalBlockFile(scope: !226, file: !3, discriminator: 2)
!1254 = !DILocation(line: 659, column: 19, scope: !1255, inlinedAt: !1057)
!1255 = !DILexicalBlockFile(scope: !1256, file: !3, discriminator: 3)
!1256 = distinct !DILexicalBlock(scope: !226, file: !3, line: 659, column: 19)
!1257 = !DILocation(line: 659, column: 19, scope: !1258, inlinedAt: !1057)
!1258 = !DILexicalBlockFile(scope: !1256, file: !3, discriminator: 2)
