; ModuleID = 'coreutils-8.27/src/dircolors.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.6 }
%union.anon.6 = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 80, type: !294, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !241, globals: !247)
!3 = !DIFile(filename: "src/dircolors.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !10, !212, !226}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !3, line: 42, size: 32, elements: !6)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0)
!8 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1)
!9 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !11, file: !3, line: 250, size: 32, elements: !207)
!11 = distinct !DISubprogram(name: "dc_parse_stream", scope: !3, file: !3, line: 239, type: !12, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !80)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15, !78}
!14 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 49, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !19, line: 241, size: 1728, elements: !20)
!19 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!20 = !{!21, !23, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !44, !45, !46, !47, !51, !53, !55, !59, !62, !64, !66, !67, !68, !69, !73, !74}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !18, file: !19, line: 242, baseType: !22, size: 32)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !18, file: !19, line: 247, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !18, file: !19, line: 248, baseType: !24, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !18, file: !19, line: 249, baseType: !24, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !18, file: !19, line: 250, baseType: !24, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !18, file: !19, line: 251, baseType: !24, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !18, file: !19, line: 252, baseType: !24, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !18, file: !19, line: 253, baseType: !24, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !18, file: !19, line: 254, baseType: !24, size: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !18, file: !19, line: 256, baseType: !24, size: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !18, file: !19, line: 257, baseType: !24, size: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !18, file: !19, line: 258, baseType: !24, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !18, file: !19, line: 260, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !19, line: 156, size: 192, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !38, file: !19, line: 157, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !38, file: !19, line: 158, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !38, file: !19, line: 162, baseType: !22, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !18, file: !19, line: 262, baseType: !42, size: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !18, file: !19, line: 264, baseType: !22, size: 32, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !18, file: !19, line: 268, baseType: !22, size: 32, offset: 928)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !18, file: !19, line: 270, baseType: !48, size: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 140, baseType: !50)
!49 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !18, file: !19, line: 274, baseType: !52, size: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !18, file: !19, line: 275, baseType: !54, size: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !18, file: !19, line: 276, baseType: !56, size: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !18, file: !19, line: 280, baseType: !60, size: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !19, line: 150, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !18, file: !19, line: 289, baseType: !63, size: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 141, baseType: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !18, file: !19, line: 297, baseType: !65, size: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !18, file: !19, line: 298, baseType: !65, size: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !18, file: !19, line: 299, baseType: !65, size: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !18, file: !19, line: 300, baseType: !65, size: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !18, file: !19, line: 302, baseType: !70, size: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 62, baseType: !72)
!71 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !18, file: !19, line: 303, baseType: !22, size: 32, offset: 1536)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !18, file: !19, line: 305, baseType: !75, size: 160, offset: 1568)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 20)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !93, !94, !95, !154, !159, !161, !164, !166, !169, !173, !176, !178, !181, !184, !189, !192, !194, !197, !199, !202, !204}
!81 = !DILocalVariable(name: "fp", arg: 1, scope: !11, file: !3, line: 239, type: !15)
!82 = !DILocalVariable(name: "filename", arg: 2, scope: !11, file: !3, line: 239, type: !78)
!83 = !DILocalVariable(name: "line_number", scope: !11, file: !3, line: 241, type: !70)
!84 = !DILocalVariable(name: "next_G_line", scope: !11, file: !3, line: 242, type: !78)
!85 = !DILocalVariable(name: "input_line", scope: !11, file: !3, line: 243, type: !24)
!86 = !DILocalVariable(name: "input_line_size", scope: !11, file: !3, line: 244, type: !70)
!87 = !DILocalVariable(name: "line", scope: !11, file: !3, line: 245, type: !78)
!88 = !DILocalVariable(name: "term", scope: !11, file: !3, line: 246, type: !78)
!89 = !DILocalVariable(name: "ok", scope: !11, file: !3, line: 247, type: !14)
!90 = !DILocalVariable(name: "state", scope: !11, file: !3, line: 250, type: !10)
!91 = !DILocalVariable(name: "keywd", scope: !92, file: !3, line: 259, type: !24)
!92 = distinct !DILexicalBlock(scope: !11, file: !3, line: 258, column: 5)
!93 = !DILocalVariable(name: "arg", scope: !92, file: !3, line: 259, type: !24)
!94 = !DILocalVariable(name: "unrecognized", scope: !92, file: !3, line: 260, type: !14)
!95 = !DILocalVariable(name: "__o", scope: !96, file: !3, line: 312, type: !103)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 312, column: 19)
!97 = distinct !DILexicalBlock(scope: !98, file: !3, line: 311, column: 17)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 310, column: 19)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 309, column: 13)
!100 = distinct !DILexicalBlock(scope: !101, file: !3, line: 308, column: 15)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 304, column: 9)
!102 = distinct !DILexicalBlock(scope: !92, file: !3, line: 296, column: 11)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !105, line: 174, size: 704, elements: !106)
!105 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !{!107, !108, !118, !119, !120, !121, !126, !127, !138, !149, !150, !152, !153}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !104, file: !105, line: 176, baseType: !70, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !104, file: !105, line: 177, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !105, line: 167, size: 128, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !110, file: !105, line: 169, baseType: !24, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !105, line: 170, baseType: !109, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !110, file: !105, line: 171, baseType: !115, offset: 128)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: -1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !104, file: !105, line: 178, baseType: !24, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !104, file: !105, line: 179, baseType: !24, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !104, file: !105, line: 180, baseType: !24, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !104, file: !105, line: 185, baseType: !122, size: 64, offset: 320)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !105, line: 181, size: 64, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !122, file: !105, line: 183, baseType: !70, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !122, file: !105, line: 184, baseType: !65, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !104, file: !105, line: 186, baseType: !70, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !104, file: !105, line: 193, baseType: !128, size: 64, offset: 448)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !105, line: 189, size: 64, elements: !129)
!129 = !{!130, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !128, file: !105, line: 191, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!65, !70}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !128, file: !105, line: 192, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!65, !65, !70}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !104, file: !105, line: 198, baseType: !139, size: 64, offset: 512)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !105, line: 194, size: 64, elements: !140)
!140 = !{!141, !145}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !139, file: !105, line: 196, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !65}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !139, file: !105, line: 197, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !65, !65}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !104, file: !105, line: 200, baseType: !65, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !104, file: !105, line: 201, baseType: !151, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!151 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !104, file: !105, line: 202, baseType: !151, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !104, file: !105, line: 206, baseType: !151, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!154 = !DILocalVariable(name: "__o1", scope: !155, file: !3, line: 312, type: !157)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 312, column: 19)
!156 = distinct !DILexicalBlock(scope: !96, file: !3, line: 312, column: 19)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!159 = !DILocalVariable(name: "__o", scope: !160, file: !3, line: 314, type: !103)
!160 = distinct !DILexicalBlock(scope: !97, file: !3, line: 314, column: 19)
!161 = !DILocalVariable(name: "__o1", scope: !162, file: !3, line: 314, type: !157)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 314, column: 19)
!163 = distinct !DILexicalBlock(scope: !160, file: !3, line: 314, column: 19)
!164 = !DILocalVariable(name: "__o", scope: !165, file: !3, line: 316, type: !103)
!165 = distinct !DILexicalBlock(scope: !97, file: !3, line: 316, column: 19)
!166 = !DILocalVariable(name: "__o1", scope: !167, file: !3, line: 316, type: !157)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 316, column: 19)
!168 = distinct !DILexicalBlock(scope: !165, file: !3, line: 316, column: 19)
!169 = !DILocalVariable(name: "__o", scope: !170, file: !3, line: 321, type: !103)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 321, column: 19)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 319, column: 17)
!172 = distinct !DILexicalBlock(scope: !98, file: !3, line: 318, column: 24)
!173 = !DILocalVariable(name: "__o1", scope: !174, file: !3, line: 321, type: !157)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 321, column: 19)
!175 = distinct !DILexicalBlock(scope: !170, file: !3, line: 321, column: 19)
!176 = !DILocalVariable(name: "__o", scope: !177, file: !3, line: 323, type: !103)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 323, column: 19)
!178 = !DILocalVariable(name: "__o1", scope: !179, file: !3, line: 323, type: !157)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 323, column: 19)
!180 = distinct !DILexicalBlock(scope: !177, file: !3, line: 323, column: 19)
!181 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 333, type: !22)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 332, column: 17)
!183 = distinct !DILexicalBlock(scope: !172, file: !3, line: 325, column: 24)
!184 = !DILocalVariable(name: "__o", scope: !185, file: !3, line: 341, type: !103)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 341, column: 23)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 340, column: 21)
!188 = distinct !DILexicalBlock(scope: !182, file: !3, line: 339, column: 23)
!189 = !DILocalVariable(name: "__o1", scope: !190, file: !3, line: 341, type: !157)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 341, column: 23)
!191 = distinct !DILexicalBlock(scope: !185, file: !3, line: 341, column: 23)
!192 = !DILocalVariable(name: "__o", scope: !193, file: !3, line: 341, type: !103)
!193 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!194 = !DILocalVariable(name: "__o1", scope: !195, file: !3, line: 341, type: !157)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 341, column: 23)
!196 = distinct !DILexicalBlock(scope: !193, file: !3, line: 341, column: 23)
!197 = !DILocalVariable(name: "__o", scope: !198, file: !3, line: 342, type: !103)
!198 = distinct !DILexicalBlock(scope: !187, file: !3, line: 342, column: 23)
!199 = !DILocalVariable(name: "__o1", scope: !200, file: !3, line: 342, type: !157)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 342, column: 23)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 342, column: 23)
!202 = !DILocalVariable(name: "__o", scope: !203, file: !3, line: 344, type: !103)
!203 = distinct !DILexicalBlock(scope: !187, file: !3, line: 344, column: 23)
!204 = !DILocalVariable(name: "__o1", scope: !205, file: !3, line: 344, type: !157)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 344, column: 23)
!206 = distinct !DILexicalBlock(scope: !203, file: !3, line: 344, column: 23)
!207 = !{!208, !209, !210, !211}
!208 = !DIEnumerator(name: "ST_TERMNO", value: 0)
!209 = !DIEnumerator(name: "ST_TERMYES", value: 1)
!210 = !DIEnumerator(name: "ST_TERMSURE", value: 2)
!211 = !DIEnumerator(name: "ST_GLOBAL", value: 3)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !213, line: 32, size: 32, elements: !214)
!213 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!215 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!216 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!217 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!218 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!219 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!220 = !DIEnumerator(name: "c_quoting_style", value: 5)
!221 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!222 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!223 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!224 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!225 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 46, size: 32, elements: !228)
!227 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!229 = !DIEnumerator(name: "_ISupper", value: 256)
!230 = !DIEnumerator(name: "_ISlower", value: 512)
!231 = !DIEnumerator(name: "_ISalpha", value: 1024)
!232 = !DIEnumerator(name: "_ISdigit", value: 2048)
!233 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!234 = !DIEnumerator(name: "_ISspace", value: 8192)
!235 = !DIEnumerator(name: "_ISprint", value: 16384)
!236 = !DIEnumerator(name: "_ISgraph", value: 32768)
!237 = !DIEnumerator(name: "_ISblank", value: 1)
!238 = !DIEnumerator(name: "_IScntrl", value: 2)
!239 = !DIEnumerator(name: "_ISpunct", value: 4)
!240 = !DIEnumerator(name: "_ISalnum", value: 8)
!241 = !{!24, !65, !70, !242, !244, !78, !72, !22, !52}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !{!248, !250, !0, !280, !286, !292}
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "lsc_obstack", scope: !2, file: !3, line: 60, type: !104, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "infomap", scope: !252, file: !253, line: 632, type: !277, isLocal: true, isDefinition: true)
!252 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !253, file: !253, line: 630, type: !254, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !256)
!253 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!254 = !DISubroutineType(types: !255)
!255 = !{null, !78}
!256 = !{!257, !258, !259, !266, !268, !269, !270, !273, !274, !276}
!257 = !DILocalVariable(name: "program", arg: 1, scope: !252, file: !253, line: 630, type: !78)
!258 = !DILocalVariable(name: "node", scope: !252, file: !253, line: 642, type: !78)
!259 = !DILocalVariable(name: "map_prog", scope: !252, file: !253, line: 643, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !252, file: !253, line: 632, size: 128, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !262, file: !253, line: 632, baseType: !78, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !262, file: !253, line: 632, baseType: !78, size: 64, offset: 64)
!266 = !DILocalVariable(name: "__s1_len", scope: !267, file: !253, line: 645, type: !70)
!267 = distinct !DILexicalBlock(scope: !252, file: !253, line: 645, column: 33)
!268 = !DILocalVariable(name: "__s2_len", scope: !267, file: !253, line: 645, type: !70)
!269 = !DILocalVariable(name: "lc_messages", scope: !252, file: !253, line: 655, type: !78)
!270 = !DILocalVariable(name: "__s1_len", scope: !271, file: !253, line: 656, type: !70)
!271 = distinct !DILexicalBlock(scope: !272, file: !253, line: 656, column: 22)
!272 = distinct !DILexicalBlock(scope: !252, file: !253, line: 656, column: 7)
!273 = !DILocalVariable(name: "__s2_len", scope: !271, file: !253, line: 656, type: !70)
!274 = !DILocalVariable(name: "__s2", scope: !275, file: !253, line: 656, type: !244)
!275 = distinct !DILexicalBlock(scope: !271, file: !253, line: 656, column: 22)
!276 = !DILocalVariable(name: "__result", scope: !275, file: !253, line: 656, type: !22)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 896, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 7)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !282, line: 1, type: !283, isLocal: true, isDefinition: true)
!282 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 33384, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 4173)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "slack_codes", scope: !2, file: !3, line: 62, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 2432, elements: !290)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!290 = !{!291}
!291 = !DISubrange(count: 38)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "ls_codes", scope: !2, file: !3, line: 72, type: !288, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 2048, elements: !304)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !297, line: 104, size: 256, elements: !298)
!297 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!298 = !{!299, !300, !301, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !297, line: 106, baseType: !78, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !296, file: !297, line: 109, baseType: !22, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !297, line: 110, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !296, file: !297, line: 111, baseType: !22, size: 32, offset: 192)
!304 = !{!305}
!305 = !DISubrange(count: 8)
!306 = !DIGlobalVariableExpression(var: !307)
!307 = distinct !DIGlobalVariable(name: "Version", scope: !308, file: !309, line: 2, type: !78, isLocal: false, isDefinition: true)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !311)
!309 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!310 = !{}
!311 = !{!306}
!312 = !DIGlobalVariableExpression(var: !313)
!313 = distinct !DIGlobalVariable(name: "file_name", scope: !314, file: !319, line: 36, type: !78, isLocal: true, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !316)
!315 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!316 = !{!312, !317}
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !314, file: !319, line: 46, type: !14, isLocal: true, isDefinition: true)
!319 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!320 = !DIGlobalVariableExpression(var: !321)
!321 = distinct !DIGlobalVariable(name: "exit_failure", scope: !322, file: !325, line: 24, type: !326, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !324)
!323 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!324 = !{!320}
!325 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !22)
!327 = !DIGlobalVariableExpression(var: !328)
!328 = distinct !DIGlobalVariable(name: "program_name", scope: !329, file: !333, line: 33, type: !78, isLocal: false, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !331, globals: !332)
!330 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!331 = !{!65, !24}
!332 = !{!327}
!333 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !DIGlobalVariableExpression(var: !335)
!335 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !336, file: !348, line: 77, type: !381, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !344, globals: !345)
!337 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!338 = !{!212, !339, !226}
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !213, line: 242, size: 32, elements: !340)
!340 = !{!341, !342, !343}
!341 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!342 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!343 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!344 = !{!22, !52, !70, !24}
!345 = !{!334, !346, !353, !363, !365, !370, !377, !379}
!346 = !DIGlobalVariableExpression(var: !347)
!347 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !336, file: !348, line: 93, type: !349, isLocal: false, isDefinition: true)
!348 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 320, elements: !351)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!351 = !{!352}
!352 = !DISubrange(count: 10)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !336, file: !348, line: 1043, type: !355, isLocal: false, isDefinition: true)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !348, line: 57, size: 448, elements: !356)
!356 = !{!357, !358, !359, !361, !362}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !355, file: !348, line: 60, baseType: !212, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !348, line: 63, baseType: !22, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !355, file: !348, line: 67, baseType: !360, size: 256, offset: 64)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 256, elements: !304)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !355, file: !348, line: 70, baseType: !78, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !355, file: !348, line: 73, baseType: !78, size: 64, offset: 384)
!363 = !DIGlobalVariableExpression(var: !364)
!364 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !336, file: !348, line: 108, type: !355, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366)
!366 = distinct !DIGlobalVariable(name: "slot0", scope: !336, file: !348, line: 834, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 256)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "slotvec", scope: !336, file: !348, line: 837, type: !372, isLocal: true, isDefinition: true)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !348, line: 826, size: 128, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !348, line: 828, baseType: !70, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !373, file: !348, line: 829, baseType: !24, size: 64, offset: 64)
!377 = !DIGlobalVariableExpression(var: !378)
!378 = distinct !DIGlobalVariable(name: "nslots", scope: !336, file: !348, line: 835, type: !22, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "slotvec0", scope: !336, file: !348, line: 836, type: !373, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 704, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 11)
!384 = !DIGlobalVariableExpression(var: !385)
!385 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !386, file: !389, line: 26, type: !390, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, globals: !388)
!387 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!384}
!389 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 376, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 47)
!393 = !DIGlobalVariableExpression(var: !394)
!394 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !395, file: !399, line: 351, type: !400, isLocal: false, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !397, globals: !398)
!396 = !DIFile(filename: "./lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!397 = !{!24, !65}
!398 = !{!393}
!399 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null}
!403 = !DIGlobalVariableExpression(var: !404)
!404 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !405, file: !749, line: 120, type: !750, isLocal: true, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !407, retainedTypes: !746, globals: !748)
!406 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 41, size: 32, elements: !410)
!409 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!411 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!412 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!413 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!414 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!415 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!416 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!417 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!418 = !DIEnumerator(name: "DAY_1", value: 131079)
!419 = !DIEnumerator(name: "DAY_2", value: 131080)
!420 = !DIEnumerator(name: "DAY_3", value: 131081)
!421 = !DIEnumerator(name: "DAY_4", value: 131082)
!422 = !DIEnumerator(name: "DAY_5", value: 131083)
!423 = !DIEnumerator(name: "DAY_6", value: 131084)
!424 = !DIEnumerator(name: "DAY_7", value: 131085)
!425 = !DIEnumerator(name: "ABMON_1", value: 131086)
!426 = !DIEnumerator(name: "ABMON_2", value: 131087)
!427 = !DIEnumerator(name: "ABMON_3", value: 131088)
!428 = !DIEnumerator(name: "ABMON_4", value: 131089)
!429 = !DIEnumerator(name: "ABMON_5", value: 131090)
!430 = !DIEnumerator(name: "ABMON_6", value: 131091)
!431 = !DIEnumerator(name: "ABMON_7", value: 131092)
!432 = !DIEnumerator(name: "ABMON_8", value: 131093)
!433 = !DIEnumerator(name: "ABMON_9", value: 131094)
!434 = !DIEnumerator(name: "ABMON_10", value: 131095)
!435 = !DIEnumerator(name: "ABMON_11", value: 131096)
!436 = !DIEnumerator(name: "ABMON_12", value: 131097)
!437 = !DIEnumerator(name: "MON_1", value: 131098)
!438 = !DIEnumerator(name: "MON_2", value: 131099)
!439 = !DIEnumerator(name: "MON_3", value: 131100)
!440 = !DIEnumerator(name: "MON_4", value: 131101)
!441 = !DIEnumerator(name: "MON_5", value: 131102)
!442 = !DIEnumerator(name: "MON_6", value: 131103)
!443 = !DIEnumerator(name: "MON_7", value: 131104)
!444 = !DIEnumerator(name: "MON_8", value: 131105)
!445 = !DIEnumerator(name: "MON_9", value: 131106)
!446 = !DIEnumerator(name: "MON_10", value: 131107)
!447 = !DIEnumerator(name: "MON_11", value: 131108)
!448 = !DIEnumerator(name: "MON_12", value: 131109)
!449 = !DIEnumerator(name: "AM_STR", value: 131110)
!450 = !DIEnumerator(name: "PM_STR", value: 131111)
!451 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!452 = !DIEnumerator(name: "D_FMT", value: 131113)
!453 = !DIEnumerator(name: "T_FMT", value: 131114)
!454 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!455 = !DIEnumerator(name: "ERA", value: 131116)
!456 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!457 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!458 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!459 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!460 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!461 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!462 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!463 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!464 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!465 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!466 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!467 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!468 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!469 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!470 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!471 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!472 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!473 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!474 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!475 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!476 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!477 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!478 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!479 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!480 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!481 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!482 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!483 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!484 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!485 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!486 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!487 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!488 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!489 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!490 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!491 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!492 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!493 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!494 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!495 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!496 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!497 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!498 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!499 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!500 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!501 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!502 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!503 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!504 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!505 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!506 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!507 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!508 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!509 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!510 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!511 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!512 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!513 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!514 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!515 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!516 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!517 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!518 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!519 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!520 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!521 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!522 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!523 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!524 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!525 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!526 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!527 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!528 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!529 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!530 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!531 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!532 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!533 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!534 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!535 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!536 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!537 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!538 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!539 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!540 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!541 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!542 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!543 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!544 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!545 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!546 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!547 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!548 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!549 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!550 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!551 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!552 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!553 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!554 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!555 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!556 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!557 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!558 = !DIEnumerator(name: "CODESET", value: 14)
!559 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!560 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!561 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!562 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!567 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!568 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!569 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!570 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!571 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!572 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!573 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!574 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!575 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!576 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!577 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!578 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!579 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!580 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!581 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!582 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!583 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!584 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!587 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!588 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!589 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!590 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!591 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!592 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!593 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!594 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!595 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!596 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!597 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!598 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!599 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!600 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!601 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!602 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!603 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!604 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!605 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!606 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!607 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!608 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!609 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!610 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!611 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!612 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!613 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!614 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!615 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!616 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!617 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!618 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!619 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!620 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!621 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!622 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!623 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!624 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!625 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!626 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!627 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!628 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!629 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!630 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!631 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!632 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!633 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!634 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!635 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!636 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!637 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!638 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!639 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!640 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!641 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!642 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!643 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!644 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!645 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!646 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!647 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!648 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!649 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!650 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!651 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!652 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!653 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!654 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!655 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!656 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!657 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!658 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!659 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!660 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!661 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!662 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!663 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!664 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!665 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!666 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!667 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!668 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!669 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!670 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!671 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!672 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!673 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!674 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!675 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!676 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!677 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!678 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!679 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!680 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!681 = !DIEnumerator(name: "THOUSEP", value: 65537)
!682 = !DIEnumerator(name: "__GROUPING", value: 65538)
!683 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!684 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!685 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!686 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!687 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!688 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!689 = !DIEnumerator(name: "__YESSTR", value: 327682)
!690 = !DIEnumerator(name: "__NOSTR", value: 327683)
!691 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!692 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!693 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!694 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!695 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!696 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!697 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!698 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!699 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!700 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!701 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!702 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!703 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!704 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!705 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!706 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!707 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!708 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!709 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!710 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!711 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!712 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!713 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!714 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!715 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!716 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!717 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!718 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!719 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!720 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!721 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!722 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!723 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!724 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!725 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!726 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!727 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!728 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!729 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!730 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!731 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!732 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!733 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!734 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!735 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!736 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!737 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!738 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!739 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!740 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!741 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!742 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!743 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!744 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!745 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!746 = !{!65, !24, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!748 = !{!403}
!749 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!750 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !78)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !753)
!752 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!753 = !{!244}
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !756)
!755 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!756 = !{!24}
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310)
!758 = !DIFile(filename: "./lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !761, retainedTypes: !766)
!760 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!761 = !{!762}
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 41, size: 32, elements: !764)
!763 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!764 = !{!765}
!765 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!766 = !{!65}
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, retainedTypes: !783)
!768 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!769 = !{!770}
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !772, file: !771, line: 192, size: 32, elements: !781)
!771 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!772 = distinct !DISubprogram(name: "x2nrealloc", scope: !771, file: !771, line: 180, type: !773, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !767, variables: !776)
!773 = !DISubroutineType(types: !774)
!774 = !{!65, !65, !775, !70}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!776 = !{!777, !778, !779, !780}
!777 = !DILocalVariable(name: "p", arg: 1, scope: !772, file: !771, line: 180, type: !65)
!778 = !DILocalVariable(name: "pn", arg: 2, scope: !772, file: !771, line: 180, type: !775)
!779 = !DILocalVariable(name: "s", arg: 3, scope: !772, file: !771, line: 180, type: !70)
!780 = !DILocalVariable(name: "n", scope: !772, file: !771, line: 182, type: !70)
!781 = !{!782}
!782 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!783 = !{!70, !24, !65}
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310)
!785 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310)
!787 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !766)
!789 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310)
!791 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !766)
!793 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310)
!795 = !DIFile(filename: "./lib/freopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !766)
!797 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !800)
!799 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!800 = !{!70}
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310)
!802 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !805)
!804 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!805 = !{!70, !242, !244, !78}
!806 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!807 = !{i32 2, !"Dwarf Version", i32 4}
!808 = !{i32 2, !"Debug Info Version", i32 3}
!809 = !{i32 1, !"PIC Level", i32 2}
!810 = !{i32 1, !"PIE Level", i32 2}
!811 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 93, type: !812, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !22}
!814 = !{!815}
!815 = !DILocalVariable(name: "status", arg: 1, scope: !811, file: !3, line: 93, type: !22)
!816 = !DIExpression()
!817 = !DILocation(line: 93, column: 12, scope: !811)
!818 = !DILocation(line: 95, column: 14, scope: !819)
!819 = distinct !DILexicalBlock(scope: !811, file: !3, line: 95, column: 7)
!820 = !DILocation(line: 95, column: 7, scope: !811)
!821 = !DILocation(line: 96, column: 5, scope: !822)
!822 = !DILexicalBlockFile(scope: !823, file: !3, discriminator: 1)
!823 = distinct !DILexicalBlock(scope: !819, file: !3, line: 96, column: 5)
!824 = !{!825, !825, i64 0}
!825 = !{!"any pointer", !826, i64 0}
!826 = !{!"omnipotent char", !827, i64 0}
!827 = !{!"Simple C/C++ TBAA"}
!828 = !DILocation(line: 96, column: 5, scope: !829)
!829 = !DILexicalBlockFile(scope: !823, file: !3, discriminator: 3)
!830 = !DILocation(line: 96, column: 5, scope: !831)
!831 = !DILexicalBlockFile(scope: !823, file: !3, discriminator: 2)
!832 = !DILocation(line: 99, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !819, file: !3, line: 98, column: 5)
!834 = !DILocation(line: 99, column: 7, scope: !835)
!835 = !DILexicalBlockFile(scope: !833, file: !3, discriminator: 1)
!836 = !DILocation(line: 100, column: 7, scope: !833)
!837 = !DILocation(line: 100, column: 7, scope: !835)
!838 = !DILocation(line: 108, column: 7, scope: !833)
!839 = !DILocation(line: 108, column: 7, scope: !835)
!840 = !DILocation(line: 109, column: 7, scope: !833)
!841 = !DILocation(line: 109, column: 7, scope: !835)
!842 = !DILocation(line: 110, column: 7, scope: !833)
!843 = !DILocation(line: 110, column: 7, scope: !835)
!844 = !DILocation(line: 642, column: 15, scope: !252, inlinedAt: !845)
!845 = distinct !DILocation(line: 116, column: 7, scope: !833)
!846 = !DILocation(line: 651, column: 3, scope: !252, inlinedAt: !845)
!847 = !DILocation(line: 651, column: 3, scope: !848, inlinedAt: !845)
!848 = !DILexicalBlockFile(scope: !252, file: !253, discriminator: 1)
!849 = !DILocation(line: 655, column: 29, scope: !252, inlinedAt: !845)
!850 = !DILocation(line: 655, column: 15, scope: !252, inlinedAt: !845)
!851 = !DILocation(line: 656, column: 7, scope: !272, inlinedAt: !845)
!852 = !DILocation(line: 656, column: 19, scope: !272, inlinedAt: !845)
!853 = !DILocation(line: 656, column: 22, scope: !854, inlinedAt: !845)
!854 = !DILexicalBlockFile(scope: !272, file: !253, discriminator: 16)
!855 = !DILocation(line: 656, column: 7, scope: !856, inlinedAt: !845)
!856 = !DILexicalBlockFile(scope: !252, file: !253, discriminator: 16)
!857 = !DILocation(line: 662, column: 7, scope: !858, inlinedAt: !845)
!858 = distinct !DILexicalBlock(scope: !272, file: !253, line: 657, column: 5)
!859 = !DILocation(line: 662, column: 7, scope: !860, inlinedAt: !845)
!860 = !DILexicalBlockFile(scope: !858, file: !253, discriminator: 1)
!861 = !DILocation(line: 664, column: 5, scope: !858, inlinedAt: !845)
!862 = !DILocation(line: 665, column: 3, scope: !252, inlinedAt: !845)
!863 = !DILocation(line: 665, column: 3, scope: !848, inlinedAt: !845)
!864 = !DILocation(line: 667, column: 3, scope: !252, inlinedAt: !845)
!865 = !DILocation(line: 667, column: 3, scope: !848, inlinedAt: !845)
!866 = !DILocation(line: 119, column: 3, scope: !811)
!867 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 396, type: !868, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !871)
!868 = !DISubroutineType(types: !869)
!869 = !{!22, !22, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !881, !885, !887, !888, !890, !891, !892}
!872 = !DILocalVariable(name: "argc", arg: 1, scope: !867, file: !3, line: 396, type: !22)
!873 = !DILocalVariable(name: "argv", arg: 2, scope: !867, file: !3, line: 396, type: !870)
!874 = !DILocalVariable(name: "ok", scope: !867, file: !3, line: 398, type: !14)
!875 = !DILocalVariable(name: "optc", scope: !867, file: !3, line: 399, type: !22)
!876 = !DILocalVariable(name: "syntax", scope: !867, file: !3, line: 400, type: !5)
!877 = !DILocalVariable(name: "print_database", scope: !867, file: !3, line: 401, type: !14)
!878 = !DILocalVariable(name: "p", scope: !879, file: !3, line: 459, type: !78)
!879 = distinct !DILexicalBlock(scope: !880, file: !3, line: 458, column: 5)
!880 = distinct !DILexicalBlock(scope: !867, file: !3, line: 457, column: 7)
!881 = !DILocalVariable(name: "len", scope: !882, file: !3, line: 487, type: !70)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 486, column: 9)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 485, column: 11)
!884 = distinct !DILexicalBlock(scope: !880, file: !3, line: 467, column: 5)
!885 = !DILocalVariable(name: "__o", scope: !886, file: !3, line: 487, type: !157)
!886 = distinct !DILexicalBlock(scope: !882, file: !3, line: 487, column: 24)
!887 = !DILocalVariable(name: "s", scope: !882, file: !3, line: 488, type: !24)
!888 = !DILocalVariable(name: "__o1", scope: !889, file: !3, line: 488, type: !103)
!889 = distinct !DILexicalBlock(scope: !882, file: !3, line: 488, column: 21)
!890 = !DILocalVariable(name: "__value", scope: !889, file: !3, line: 488, type: !65)
!891 = !DILocalVariable(name: "prefix", scope: !882, file: !3, line: 489, type: !78)
!892 = !DILocalVariable(name: "suffix", scope: !882, file: !3, line: 490, type: !78)
!893 = !DILocation(line: 396, column: 11, scope: !867)
!894 = !DILocation(line: 396, column: 24, scope: !867)
!895 = !DILocation(line: 398, column: 8, scope: !867)
!896 = !DILocation(line: 400, column: 21, scope: !867)
!897 = !DILocation(line: 401, column: 8, scope: !867)
!898 = !DILocation(line: 404, column: 21, scope: !867)
!899 = !DILocation(line: 404, column: 3, scope: !867)
!900 = !DILocation(line: 405, column: 3, scope: !867)
!901 = !DILocation(line: 406, column: 3, scope: !867)
!902 = !DILocation(line: 407, column: 3, scope: !867)
!903 = !DILocation(line: 409, column: 3, scope: !867)
!904 = !DILocation(line: 411, column: 3, scope: !867)
!905 = !DILocation(line: 411, column: 18, scope: !906)
!906 = !DILexicalBlockFile(scope: !867, file: !3, discriminator: 1)
!907 = !DILocation(line: 399, column: 7, scope: !867)
!908 = !DILocation(line: 411, column: 3, scope: !906)
!909 = !DILocation(line: 420, column: 9, scope: !910)
!910 = distinct !DILexicalBlock(scope: !867, file: !3, line: 413, column: 7)
!911 = distinct !{!911, !904, !912}
!912 = !DILocation(line: 432, column: 7, scope: !867)
!913 = !DILocation(line: 426, column: 7, scope: !910)
!914 = !DILocation(line: 428, column: 7, scope: !910)
!915 = !DILocation(line: 428, column: 7, scope: !916)
!916 = !DILexicalBlockFile(scope: !910, file: !3, discriminator: 1)
!917 = !DILocation(line: 431, column: 9, scope: !910)
!918 = !DILocation(line: 434, column: 11, scope: !867)
!919 = !{!920, !920, i64 0}
!920 = !{!"int", !826, i64 0}
!921 = !DILocation(line: 434, column: 8, scope: !867)
!922 = !DILocation(line: 435, column: 8, scope: !867)
!923 = !DILocation(line: 439, column: 7, scope: !924)
!924 = distinct !DILexicalBlock(scope: !867, file: !3, line: 439, column: 7)
!925 = !DILocation(line: 439, column: 32, scope: !926)
!926 = !DILexicalBlockFile(scope: !924, file: !3, discriminator: 1)
!927 = !DILocation(line: 439, column: 22, scope: !924)
!928 = !DILocation(line: 442, column: 14, scope: !929)
!929 = distinct !DILexicalBlock(scope: !924, file: !3, line: 440, column: 5)
!930 = !DILocation(line: 441, column: 7, scope: !929)
!931 = !DILocation(line: 444, column: 7, scope: !929)
!932 = !DILocation(line: 447, column: 8, scope: !933)
!933 = distinct !DILexicalBlock(scope: !867, file: !3, line: 447, column: 7)
!934 = !DILocation(line: 447, column: 25, scope: !933)
!935 = !DILocation(line: 447, column: 7, scope: !867)
!936 = !DILocation(line: 449, column: 20, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !3, line: 448, column: 5)
!938 = !DILocation(line: 449, column: 50, scope: !937)
!939 = !DILocation(line: 449, column: 43, scope: !940)
!940 = !DILexicalBlockFile(scope: !937, file: !3, discriminator: 1)
!941 = !DILocation(line: 449, column: 7, scope: !942)
!942 = !DILexicalBlockFile(scope: !937, file: !3, discriminator: 2)
!943 = !DILocation(line: 450, column: 11, scope: !937)
!944 = !DILocation(line: 451, column: 9, scope: !945)
!945 = distinct !DILexicalBlock(scope: !937, file: !3, line: 450, column: 11)
!946 = !DILocation(line: 451, column: 9, scope: !947)
!947 = !DILexicalBlockFile(scope: !945, file: !3, discriminator: 1)
!948 = !DILocation(line: 454, column: 7, scope: !937)
!949 = !DILocation(line: 457, column: 7, scope: !867)
!950 = !DILocation(line: 462, column: 11, scope: !951)
!951 = distinct !DILexicalBlock(scope: !879, file: !3, line: 461, column: 9)
!952 = !DILocation(line: 463, column: 16, scope: !951)
!953 = !DILocation(line: 463, column: 27, scope: !951)
!954 = !DILocation(line: 463, column: 13, scope: !951)
!955 = !DILocation(line: 459, column: 19, scope: !879)
!956 = !DILocation(line: 460, column: 16, scope: !957)
!957 = !DILexicalBlockFile(scope: !879, file: !3, discriminator: 1)
!958 = !DILocation(line: 460, column: 25, scope: !957)
!959 = !DILocation(line: 460, column: 7, scope: !957)
!960 = distinct !{!960, !961, !962}
!961 = !DILocation(line: 460, column: 7, scope: !879)
!962 = !DILocation(line: 464, column: 9, scope: !879)
!963 = !DILocation(line: 469, column: 18, scope: !964)
!964 = distinct !DILexicalBlock(scope: !884, file: !3, line: 469, column: 11)
!965 = !DILocation(line: 469, column: 11, scope: !884)
!966 = !DILocation(line: 130, column: 11, scope: !967, inlinedAt: !985)
!967 = distinct !DISubprogram(name: "guess_shell_syntax", scope: !3, file: !3, line: 126, type: !968, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!5}
!970 = !{!971, !972, !975, !976, !978, !979, !981, !982, !984}
!971 = !DILocalVariable(name: "shell", scope: !967, file: !3, line: 128, type: !24)
!972 = !DILocalVariable(name: "__s1_len", scope: !973, file: !3, line: 136, type: !70)
!973 = distinct !DILexicalBlock(scope: !974, file: !3, line: 136, column: 7)
!974 = distinct !DILexicalBlock(scope: !967, file: !3, line: 136, column: 7)
!975 = !DILocalVariable(name: "__s2_len", scope: !973, file: !3, line: 136, type: !70)
!976 = !DILocalVariable(name: "__s2", scope: !977, file: !3, line: 136, type: !244)
!977 = distinct !DILexicalBlock(scope: !973, file: !3, line: 136, column: 7)
!978 = !DILocalVariable(name: "__result", scope: !977, file: !3, line: 136, type: !22)
!979 = !DILocalVariable(name: "__s1_len", scope: !980, file: !3, line: 136, type: !70)
!980 = distinct !DILexicalBlock(scope: !974, file: !3, line: 136, column: 31)
!981 = !DILocalVariable(name: "__s2_len", scope: !980, file: !3, line: 136, type: !70)
!982 = !DILocalVariable(name: "__s2", scope: !983, file: !3, line: 136, type: !244)
!983 = distinct !DILexicalBlock(scope: !980, file: !3, line: 136, column: 31)
!984 = !DILocalVariable(name: "__result", scope: !983, file: !3, line: 136, type: !22)
!985 = distinct !DILocation(line: 471, column: 20, scope: !986)
!986 = distinct !DILexicalBlock(scope: !964, file: !3, line: 470, column: 9)
!987 = !DILocation(line: 128, column: 9, scope: !967, inlinedAt: !985)
!988 = !DILocation(line: 131, column: 13, scope: !989, inlinedAt: !985)
!989 = distinct !DILexicalBlock(scope: !967, file: !3, line: 131, column: 7)
!990 = !DILocation(line: 131, column: 21, scope: !989, inlinedAt: !985)
!991 = !DILocation(line: 131, column: 24, scope: !992, inlinedAt: !985)
!992 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 1)
!993 = !{!826, !826, i64 0}
!994 = !DILocation(line: 131, column: 31, scope: !992, inlinedAt: !985)
!995 = !DILocation(line: 131, column: 7, scope: !996, inlinedAt: !985)
!996 = !DILexicalBlockFile(scope: !967, file: !3, discriminator: 1)
!997 = !DILocation(line: 134, column: 11, scope: !967, inlinedAt: !985)
!998 = !DILocation(line: 136, column: 7, scope: !973, inlinedAt: !985)
!999 = !DILocation(line: 136, column: 7, scope: !977, inlinedAt: !985)
!1000 = !DILocation(line: 136, column: 7, scope: !1001, inlinedAt: !985)
!1001 = !DILexicalBlockFile(scope: !977, file: !3, discriminator: 2)
!1002 = !DILocation(line: 136, column: 7, scope: !1003, inlinedAt: !985)
!1003 = !DILexicalBlockFile(scope: !1004, file: !3, discriminator: 3)
!1004 = distinct !DILexicalBlock(scope: !977, file: !3, line: 136, column: 7)
!1005 = !DILocation(line: 136, column: 7, scope: !1006, inlinedAt: !985)
!1006 = !DILexicalBlockFile(scope: !1004, file: !3, discriminator: 2)
!1007 = !DILocation(line: 136, column: 7, scope: !1008, inlinedAt: !985)
!1008 = !DILexicalBlockFile(scope: !1009, file: !3, discriminator: 4)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 136, column: 7)
!1010 = !DILocation(line: 136, column: 7, scope: !1011, inlinedAt: !985)
!1011 = !DILexicalBlockFile(scope: !1012, file: !3, discriminator: 5)
!1012 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 136, column: 7)
!1013 = !DILocation(line: 136, column: 7, scope: !1014, inlinedAt: !985)
!1014 = !DILexicalBlockFile(scope: !1012, file: !3, discriminator: 4)
!1015 = !DILocation(line: 136, column: 7, scope: !1016, inlinedAt: !985)
!1016 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 6)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 136, column: 7)
!1018 = !DILocation(line: 136, column: 7, scope: !1019, inlinedAt: !985)
!1019 = !DILexicalBlockFile(scope: !1020, file: !3, discriminator: 7)
!1020 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 136, column: 7)
!1021 = !DILocation(line: 136, column: 7, scope: !1022, inlinedAt: !985)
!1022 = !DILexicalBlockFile(scope: !1020, file: !3, discriminator: 6)
!1023 = !DILocation(line: 136, column: 7, scope: !1024, inlinedAt: !985)
!1024 = !DILexicalBlockFile(scope: !1020, file: !3, discriminator: 8)
!1025 = !DILocation(line: 136, column: 7, scope: !1026, inlinedAt: !985)
!1026 = !DILexicalBlockFile(scope: !973, file: !3, discriminator: 11)
!1027 = !DILocation(line: 136, column: 28, scope: !1028, inlinedAt: !985)
!1028 = !DILexicalBlockFile(scope: !974, file: !3, discriminator: 13)
!1029 = !DILocation(line: 136, column: 31, scope: !980, inlinedAt: !985)
!1030 = !DILocation(line: 136, column: 31, scope: !1031, inlinedAt: !985)
!1031 = !DILexicalBlockFile(scope: !980, file: !3, discriminator: 26)
!1032 = !DILocation(line: 136, column: 31, scope: !1033, inlinedAt: !985)
!1033 = !DILexicalBlockFile(scope: !974, file: !3, discriminator: 27)
!1034 = !DILocation(line: 136, column: 7, scope: !1035, inlinedAt: !985)
!1035 = !DILexicalBlockFile(scope: !967, file: !3, discriminator: 27)
!1036 = !DILocation(line: 474, column: 15, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 473, column: 13)
!1038 = distinct !DILexicalBlock(scope: !986, file: !3, line: 472, column: 15)
!1039 = !DILocation(line: 474, column: 15, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1037, file: !3, discriminator: 1)
!1041 = !DILocation(line: 479, column: 7, scope: !884)
!1042 = !DILocation(line: 480, column: 16, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !884, file: !3, line: 480, column: 11)
!1044 = !DILocation(line: 480, column: 11, scope: !884)
!1045 = !DILocation(line: 481, column: 14, scope: !1043)
!1046 = !DILocation(line: 485, column: 11, scope: !884)
!1047 = !DILocation(line: 483, column: 29, scope: !1043)
!1048 = !DILocalVariable(name: "filename", arg: 1, scope: !1049, file: !3, line: 374, type: !78)
!1049 = distinct !DISubprogram(name: "dc_parse_file", scope: !3, file: !3, line: 374, type: !1050, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1052)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!14, !78}
!1052 = !{!1048, !1053, !1054, !1057, !1058, !1060}
!1053 = !DILocalVariable(name: "ok", scope: !1049, file: !3, line: 376, type: !14)
!1054 = !DILocalVariable(name: "__s1_len", scope: !1055, file: !3, line: 378, type: !70)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 378, column: 9)
!1056 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 378, column: 7)
!1057 = !DILocalVariable(name: "__s2_len", scope: !1055, file: !3, line: 378, type: !70)
!1058 = !DILocalVariable(name: "__s2", scope: !1059, file: !3, line: 378, type: !244)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 378, column: 9)
!1060 = !DILocalVariable(name: "__result", scope: !1059, file: !3, line: 378, type: !22)
!1061 = !DILocation(line: 374, column: 28, scope: !1049, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 483, column: 14, scope: !1043)
!1063 = !DILocation(line: 378, column: 9, scope: !1055, inlinedAt: !1062)
!1064 = !DILocation(line: 378, column: 9, scope: !1059, inlinedAt: !1062)
!1065 = !DILocation(line: 378, column: 9, scope: !1066, inlinedAt: !1062)
!1066 = !DILexicalBlockFile(scope: !1059, file: !3, discriminator: 2)
!1067 = !DILocation(line: 378, column: 9, scope: !1068, inlinedAt: !1062)
!1068 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 3)
!1069 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 378, column: 9)
!1070 = !DILocation(line: 378, column: 9, scope: !1071, inlinedAt: !1062)
!1071 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 2)
!1072 = !DILocation(line: 378, column: 9, scope: !1073, inlinedAt: !1062)
!1073 = !DILexicalBlockFile(scope: !1074, file: !3, discriminator: 4)
!1074 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 378, column: 9)
!1075 = !DILocation(line: 378, column: 9, scope: !1076, inlinedAt: !1062)
!1076 = !DILexicalBlockFile(scope: !1055, file: !3, discriminator: 11)
!1077 = !DILocation(line: 378, column: 31, scope: !1078, inlinedAt: !1062)
!1078 = !DILexicalBlockFile(scope: !1056, file: !3, discriminator: 13)
!1079 = !DILocation(line: 378, column: 58, scope: !1080, inlinedAt: !1062)
!1080 = !DILexicalBlockFile(scope: !1056, file: !3, discriminator: 14)
!1081 = !DILocation(line: 378, column: 34, scope: !1080, inlinedAt: !1062)
!1082 = !DILocation(line: 378, column: 65, scope: !1080, inlinedAt: !1062)
!1083 = !DILocation(line: 378, column: 7, scope: !1084, inlinedAt: !1062)
!1084 = !DILexicalBlockFile(scope: !1049, file: !3, discriminator: 14)
!1085 = !DILocation(line: 380, column: 17, scope: !1086, inlinedAt: !1062)
!1086 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 379, column: 5)
!1087 = !DILocation(line: 380, column: 30, scope: !1088, inlinedAt: !1062)
!1088 = !DILexicalBlockFile(scope: !1086, file: !3, discriminator: 1)
!1089 = !DILocation(line: 380, column: 7, scope: !1090, inlinedAt: !1062)
!1090 = !DILexicalBlockFile(scope: !1086, file: !3, discriminator: 2)
!1091 = !DILocation(line: 381, column: 7, scope: !1086, inlinedAt: !1062)
!1092 = !DILocation(line: 384, column: 25, scope: !1049, inlinedAt: !1062)
!1093 = !DILocation(line: 384, column: 8, scope: !1049, inlinedAt: !1062)
!1094 = !DILocation(line: 386, column: 15, scope: !1095, inlinedAt: !1062)
!1095 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 386, column: 7)
!1096 = !DILocation(line: 386, column: 7, scope: !1095, inlinedAt: !1062)
!1097 = !DILocation(line: 386, column: 22, scope: !1095, inlinedAt: !1062)
!1098 = !DILocation(line: 386, column: 7, scope: !1049, inlinedAt: !1062)
!1099 = !DILocation(line: 388, column: 17, scope: !1100, inlinedAt: !1062)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 387, column: 5)
!1101 = !DILocation(line: 388, column: 30, scope: !1102, inlinedAt: !1062)
!1102 = !DILexicalBlockFile(scope: !1100, file: !3, discriminator: 1)
!1103 = !DILocation(line: 388, column: 7, scope: !1104, inlinedAt: !1062)
!1104 = !DILexicalBlockFile(scope: !1100, file: !3, discriminator: 2)
!1105 = !DILocation(line: 389, column: 7, scope: !1100, inlinedAt: !1062)
!1106 = !DILocation(line: 487, column: 24, scope: !886)
!1107 = !{!1108, !825, i64 24}
!1108 = !{!"obstack", !1109, i64 0, !825, i64 8, !825, i64 16, !825, i64 24, !825, i64 32, !826, i64 40, !1109, i64 48, !826, i64 56, !826, i64 64, !825, i64 72, !920, i64 80, !920, i64 80, !920, i64 80}
!1109 = !{!"long", !826, i64 0}
!1110 = !{!1108, !825, i64 16}
!1111 = !DILocation(line: 487, column: 18, scope: !882)
!1112 = !DILocation(line: 488, column: 21, scope: !889)
!1113 = !DILocation(line: 488, column: 21, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !889, file: !3, line: 488, column: 21)
!1115 = !DILocation(line: 488, column: 21, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1114, file: !3, discriminator: 1)
!1117 = !DILocation(line: 488, column: 21, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !889, file: !3, discriminator: 2)
!1119 = !{!1108, !1109, i64 48}
!1120 = !DILocation(line: 488, column: 21, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1122, file: !3, discriminator: 2)
!1122 = distinct !DILexicalBlock(scope: !889, file: !3, line: 488, column: 21)
!1123 = !{!1108, !825, i64 8}
!1124 = !{!1108, !825, i64 32}
!1125 = !DILocation(line: 488, column: 21, scope: !1126)
!1126 = !DILexicalBlockFile(scope: !1122, file: !3, discriminator: 3)
!1127 = !DILocation(line: 488, column: 21, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !889, file: !3, discriminator: 4)
!1129 = !DILocation(line: 488, column: 17, scope: !882)
!1130 = !DILocation(line: 492, column: 22, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !882, file: !3, line: 492, column: 15)
!1132 = !DILocation(line: 492, column: 15, scope: !882)
!1133 = !DILocation(line: 490, column: 23, scope: !882)
!1134 = !DILocation(line: 489, column: 23, scope: !882)
!1135 = !DILocation(line: 502, column: 11, scope: !882)
!1136 = !DILocation(line: 503, column: 11, scope: !882)
!1137 = !DILocation(line: 504, column: 11, scope: !882)
!1138 = !DILocation(line: 505, column: 9, scope: !882)
!1139 = !DILocation(line: 509, column: 1, scope: !867)
!1140 = !DILocation(line: 239, column: 24, scope: !11)
!1141 = !DILocation(line: 239, column: 40, scope: !11)
!1142 = !DILocation(line: 241, column: 10, scope: !11)
!1143 = !DILocation(line: 243, column: 3, scope: !11)
!1144 = !DILocation(line: 243, column: 9, scope: !11)
!1145 = !DILocation(line: 244, column: 3, scope: !11)
!1146 = !DILocation(line: 244, column: 10, scope: !11)
!1147 = !{!1109, !1109, i64 0}
!1148 = !DILocation(line: 247, column: 8, scope: !11)
!1149 = !DILocation(line: 250, column: 58, scope: !11)
!1150 = !DILocation(line: 253, column: 10, scope: !11)
!1151 = !DILocation(line: 246, column: 15, scope: !11)
!1152 = !DILocation(line: 254, column: 12, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !11, file: !3, line: 254, column: 7)
!1154 = !DILocation(line: 254, column: 20, scope: !1153)
!1155 = !DILocation(line: 254, column: 23, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1153, file: !3, discriminator: 1)
!1157 = !DILocation(line: 254, column: 29, scope: !1156)
!1158 = !DILocation(line: 254, column: 7, scope: !1159)
!1159 = !DILexicalBlockFile(scope: !11, file: !3, discriminator: 1)
!1160 = !DILocation(line: 255, column: 5, scope: !1153)
!1161 = !DILocation(line: 242, column: 15, scope: !11)
!1162 = !DILocation(line: 262, column: 7, scope: !92)
!1163 = !DILocation(line: 264, column: 11, scope: !92)
!1164 = !DIExpression(DW_OP_deref)
!1165 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1166, file: !1167, line: 115, type: !870)
!1166 = distinct !DISubprogram(name: "getline", scope: !1167, file: !1167, line: 115, type: !1168, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1171)
!1167 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!1170, !870, !775, !15}
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !49, line: 181, baseType: !50)
!1171 = !{!1165, !1172, !1173}
!1172 = !DILocalVariable(name: "__n", arg: 2, scope: !1166, file: !1167, line: 115, type: !775)
!1173 = !DILocalVariable(name: "__stream", arg: 3, scope: !1166, file: !1167, line: 115, type: !15)
!1174 = !DILocation(line: 115, column: 17, scope: !1166, inlinedAt: !1175)
!1175 = distinct !DILocation(line: 266, column: 15, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 266, column: 15)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 265, column: 9)
!1178 = distinct !DILexicalBlock(scope: !92, file: !3, line: 264, column: 11)
!1179 = !DILocation(line: 115, column: 36, scope: !1166, inlinedAt: !1175)
!1180 = !DILocation(line: 115, column: 47, scope: !1166, inlinedAt: !1175)
!1181 = !DILocation(line: 117, column: 10, scope: !1166, inlinedAt: !1175)
!1182 = !DILocation(line: 266, column: 59, scope: !1176)
!1183 = !DILocation(line: 266, column: 15, scope: !1177)
!1184 = !DILocation(line: 268, column: 15, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 267, column: 13)
!1186 = !DILocation(line: 269, column: 15, scope: !1185)
!1187 = !DILocation(line: 275, column: 27, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !3, line: 275, column: 15)
!1189 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 274, column: 9)
!1190 = !DILocation(line: 275, column: 15, scope: !1189)
!1191 = !DILocation(line: 245, column: 15, scope: !11)
!1192 = !DILocation(line: 278, column: 26, scope: !1189)
!1193 = !DILocation(line: 278, column: 47, scope: !1189)
!1194 = !DILocation(line: 278, column: 23, scope: !1189)
!1195 = !DILocalVariable(name: "line", arg: 1, scope: !1196, file: !3, line: 143, type: !78)
!1196 = distinct !DISubprogram(name: "parse_line", scope: !3, file: !3, line: 143, type: !1197, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1199)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !78, !870, !870}
!1199 = !{!1195, !1200, !1201, !1202, !1203, !1204}
!1200 = !DILocalVariable(name: "keyword", arg: 2, scope: !1196, file: !3, line: 143, type: !870)
!1201 = !DILocalVariable(name: "arg", arg: 3, scope: !1196, file: !3, line: 143, type: !870)
!1202 = !DILocalVariable(name: "p", scope: !1196, file: !3, line: 145, type: !78)
!1203 = !DILocalVariable(name: "keyword_start", scope: !1196, file: !3, line: 146, type: !78)
!1204 = !DILocalVariable(name: "arg_start", scope: !1196, file: !3, line: 147, type: !78)
!1205 = !DILocation(line: 143, column: 25, scope: !1196, inlinedAt: !1206)
!1206 = distinct !DILocation(line: 281, column: 7, scope: !92)
!1207 = !DILocation(line: 145, column: 15, scope: !1196, inlinedAt: !1206)
!1208 = !DILocation(line: 152, column: 18, scope: !1209, inlinedAt: !1206)
!1209 = !DILexicalBlockFile(scope: !1210, file: !3, discriminator: 1)
!1210 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 152, column: 3)
!1211 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 152, column: 3)
!1212 = !DILocation(line: 152, column: 8, scope: !1211, inlinedAt: !1206)
!1213 = !{!1214, !1214, i64 0}
!1214 = !{!"short", !826, i64 0}
!1215 = !DILocation(line: 152, column: 3, scope: !1216, inlinedAt: !1206)
!1216 = !DILexicalBlockFile(scope: !1211, file: !3, discriminator: 1)
!1217 = !DILocation(line: 152, column: 43, scope: !1218, inlinedAt: !1206)
!1218 = !DILexicalBlockFile(scope: !1210, file: !3, discriminator: 2)
!1219 = distinct !{!1219, !1220, !1221}
!1220 = !DILocation(line: 152, column: 3, scope: !1211)
!1221 = !DILocation(line: 153, column: 5, scope: !1211)
!1222 = !DILocation(line: 156, column: 18, scope: !1223, inlinedAt: !1206)
!1223 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 156, column: 7)
!1224 = !DILocation(line: 163, column: 7, scope: !1225, inlinedAt: !1206)
!1225 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 162, column: 5)
!1226 = !DILocation(line: 161, column: 11, scope: !1227, inlinedAt: !1206)
!1227 = !DILexicalBlockFile(scope: !1196, file: !3, discriminator: 1)
!1228 = !DILocation(line: 161, column: 41, scope: !1229, inlinedAt: !1206)
!1229 = !DILexicalBlockFile(scope: !1196, file: !3, discriminator: 2)
!1230 = !DILocation(line: 161, column: 35, scope: !1227, inlinedAt: !1206)
!1231 = distinct !{!1231, !1232, !1233}
!1232 = !DILocation(line: 161, column: 3, scope: !1196)
!1233 = !DILocation(line: 164, column: 5, scope: !1196)
!1234 = !DILocation(line: 166, column: 41, scope: !1196, inlinedAt: !1206)
!1235 = !DILocation(line: 166, column: 14, scope: !1196, inlinedAt: !1206)
!1236 = !DILocation(line: 167, column: 7, scope: !1237, inlinedAt: !1206)
!1237 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 167, column: 7)
!1238 = !DILocation(line: 167, column: 11, scope: !1237, inlinedAt: !1206)
!1239 = !DILocation(line: 167, column: 7, scope: !1196, inlinedAt: !1206)
!1240 = distinct !{!1240, !1241, !1242}
!1241 = !DILocation(line: 170, column: 3, scope: !1196)
!1242 = !DILocation(line: 174, column: 33, scope: !1196)
!1243 = !DILocation(line: 172, column: 7, scope: !1244, inlinedAt: !1206)
!1244 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 171, column: 5)
!1245 = !DILocation(line: 174, column: 10, scope: !1196, inlinedAt: !1206)
!1246 = !DILocation(line: 173, column: 5, scope: !1247, inlinedAt: !1206)
!1247 = !DILexicalBlockFile(scope: !1244, file: !3, discriminator: 1)
!1248 = !DILocation(line: 176, column: 18, scope: !1249, inlinedAt: !1206)
!1249 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 176, column: 7)
!1250 = !DILocation(line: 181, column: 10, scope: !1227, inlinedAt: !1206)
!1251 = !DILocation(line: 181, column: 3, scope: !1252, inlinedAt: !1206)
!1252 = !DILexicalBlockFile(scope: !1196, file: !3, discriminator: 3)
!1253 = !DILocation(line: 182, column: 5, scope: !1196, inlinedAt: !1206)
!1254 = !DILocation(line: 181, column: 3, scope: !1255, inlinedAt: !1206)
!1255 = !DILexicalBlockFile(scope: !1196, file: !3, discriminator: 4)
!1256 = distinct !{!1256, !1257, !1258}
!1257 = !DILocation(line: 181, column: 3, scope: !1196)
!1258 = !DILocation(line: 182, column: 7, scope: !1196)
!1259 = !DILocation(line: 184, column: 13, scope: !1260, inlinedAt: !1206)
!1260 = !DILexicalBlockFile(scope: !1261, file: !3, discriminator: 1)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 184, column: 3)
!1262 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 184, column: 3)
!1263 = !DILocation(line: 184, column: 3, scope: !1264, inlinedAt: !1206)
!1264 = !DILexicalBlockFile(scope: !1262, file: !3, discriminator: 1)
!1265 = distinct !{!1265, !1266, !1267}
!1266 = !DILocation(line: 184, column: 3, scope: !1262)
!1267 = !DILocation(line: 185, column: 5, scope: !1262)
!1268 = !DILocation(line: 188, column: 33, scope: !1196, inlinedAt: !1206)
!1269 = !DILocation(line: 188, column: 10, scope: !1196, inlinedAt: !1206)
!1270 = !DILocation(line: 189, column: 1, scope: !1196, inlinedAt: !1206)
!1271 = !DILocation(line: 259, column: 13, scope: !92)
!1272 = !DILocation(line: 283, column: 17, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !92, file: !3, line: 283, column: 11)
!1274 = !DILocation(line: 283, column: 11, scope: !92)
!1275 = distinct !{!1275, !1276, !1277}
!1276 = !DILocation(line: 257, column: 3, scope: !11)
!1277 = !DILocation(line: 368, column: 5, scope: !11)
!1278 = !DILocation(line: 259, column: 21, scope: !92)
!1279 = !DILocation(line: 286, column: 15, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !92, file: !3, line: 286, column: 11)
!1281 = !DILocation(line: 286, column: 11, scope: !92)
