; ModuleID = 'coreutils-8.27/src/mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.hash_table*, %struct.hash_table* }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.timespec*, i8, i8, i8 }

!11 = !DIEnumerator(name: "numbered_backups", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !13, line: 69, size: 32, elements: !14)
!13 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!16 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!17 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!18 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !13, line: 60, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!22 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2)
!23 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!24 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !13, line: 26, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!28 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!29 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!30 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !13, line: 47, size: 32, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!34 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!35 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !37, line: 32, size: 32, elements: !38)
!37 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!40 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!41 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!42 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!43 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!44 = !DIEnumerator(name: "c_quoting_style", value: 5)
!45 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!46 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!47 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!48 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!49 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !51, line: 23, size: 32, elements: !52)
!51 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "RMI_ALWAYS", value: 3)
!54 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4)
!55 = !DIEnumerator(name: "RMI_NEVER", value: 5)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !51, line: 74, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "RM_OK", value: 2)
!59 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3)
!60 = !DIEnumerator(name: "RM_ERROR", value: 4)
!61 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5)
!62 = !{!63, !65, !66, !69, !71, !74}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 62, baseType: !68)
!67 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!76 = !{!77, !80, !0, !111}
!77 = !DIGlobalVariableExpression(var: !78)
!78 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 53, type: !79, isLocal: true, isDefinition: true)
!79 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!80 = !DIGlobalVariableExpression(var: !81)
!81 = distinct !DIGlobalVariable(name: "infomap", scope: !82, file: !83, line: 632, type: !108, isLocal: true, isDefinition: true)
!82 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !83, file: !83, line: 630, type: !84, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !86)
!83 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!84 = !DISubroutineType(types: !85)
!85 = !{null, !74}
!86 = !{!87, !88, !89, !96, !98, !99, !100, !103, !104, !106}
!87 = !DILocalVariable(name: "program", arg: 1, scope: !82, file: !83, line: 630, type: !74)
!88 = !DILocalVariable(name: "node", scope: !82, file: !83, line: 642, type: !74)
!89 = !DILocalVariable(name: "map_prog", scope: !82, file: !83, line: 643, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !82, file: !83, line: 632, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !92, file: !83, line: 632, baseType: !74, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !92, file: !83, line: 632, baseType: !74, size: 64, offset: 64)
!96 = !DILocalVariable(name: "__s1_len", scope: !97, file: !83, line: 645, type: !66)
!97 = distinct !DILexicalBlock(scope: !82, file: !83, line: 645, column: 33)
!98 = !DILocalVariable(name: "__s2_len", scope: !97, file: !83, line: 645, type: !66)
!99 = !DILocalVariable(name: "lc_messages", scope: !82, file: !83, line: 655, type: !74)
!100 = !DILocalVariable(name: "__s1_len", scope: !101, file: !83, line: 656, type: !66)
!101 = distinct !DILexicalBlock(scope: !102, file: !83, line: 656, column: 22)
!102 = distinct !DILexicalBlock(scope: !82, file: !83, line: 656, column: 7)
!103 = !DILocalVariable(name: "__s2_len", scope: !101, file: !83, line: 656, type: !66)
!104 = !DILocalVariable(name: "__s2", scope: !105, file: !83, line: 656, type: !71)
!105 = distinct !DILexicalBlock(scope: !101, file: !83, line: 656, column: 22)
!106 = !DILocalVariable(name: "__result", scope: !105, file: !83, line: 656, type: !107)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 896, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 7)
!111 = !DIGlobalVariableExpression(var: !112)
!112 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !113, file: !3, line: 95, type: !126, isLocal: true, isDefinition: true)
!113 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 74, type: !114, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !140)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !51, line: 32, size: 256, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !137, !138, !139}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !117, file: !51, line: 35, baseType: !79, size: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !117, file: !51, line: 38, baseType: !50, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !117, file: !51, line: 47, baseType: !79, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !117, file: !51, line: 50, baseType: !79, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !117, file: !51, line: 53, baseType: !79, size: 8, offset: 80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !117, file: !51, line: 57, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !127, line: 7, size: 128, elements: !128)
!127 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !{!129, !134}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !126, file: !127, line: 9, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !131, line: 48, baseType: !132)
!131 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !133, line: 136, baseType: !68)
!133 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !126, file: !127, line: 10, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !131, line: 60, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !133, line: 133, baseType: !68)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !117, file: !51, line: 60, baseType: !79, size: 8, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !117, file: !51, line: 63, baseType: !79, size: 8, offset: 200)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !117, file: !51, line: 71, baseType: !79, size: 8, offset: 208)
!140 = !{!141}
!141 = !DILocalVariable(name: "x", arg: 1, scope: !113, file: !3, line: 74, type: !116)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 3584, elements: !152)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !145, line: 104, size: 256, elements: !146)
!145 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !{!147, !148, !149, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 106, baseType: !74, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !144, file: !145, line: 109, baseType: !107, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !145, line: 110, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !144, file: !145, line: 111, baseType: !107, size: 32, offset: 192)
!152 = !{!153}
!153 = !DISubrange(count: 14)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !156, file: !157, line: 146, type: !74, isLocal: true, isDefinition: true)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !158, retainedTypes: !183, globals: !191)
!157 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = !{!5, !12, !19, !25, !31, !36, !159, !163, !170, !179}
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !160, line: 27, size: 32, elements: !161)
!160 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!161 = !{!162}
!162 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !164, line: 26, size: 32, elements: !165)
!164 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!165 = !{!166, !167, !168, !169}
!166 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!167 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!168 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!169 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !171, line: 45, size: 32, elements: !172)
!171 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !{!173, !174, !175, !176, !177, !178}
!173 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!174 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!175 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!176 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!177 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!178 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !180, line: 73, size: 32, elements: !181)
!180 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!181 = !{!182}
!182 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072)
!183 = !{!184, !65, !186, !63, !66, !69, !71, !74, !68, !73, !187}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !131, line: 70, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !133, line: 138, baseType: !186)
!186 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !188, line: 91, baseType: !189)
!188 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !133, line: 140, baseType: !190)
!190 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!191 = !{!192, !154, !198, !200, !210, !212}
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "mask", scope: !194, file: !157, line: 2992, type: !184, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "cached_umask", scope: !157, file: !157, line: 2990, type: !195, isLocal: false, isDefinition: true, scopeLine: 2991, flags: DIFlagPrototyped, isOptimized: true, unit: !156, variables: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{!184}
!197 = !{}
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !156, file: !157, line: 147, type: !74, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "zeros", scope: !202, file: !157, line: 350, type: !63, isLocal: true, isDefinition: true)
!202 = distinct !DISubprogram(name: "write_zeros", scope: !157, file: !157, line: 348, type: !203, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !156, variables: !205)
!203 = !DISubroutineType(types: !204)
!204 = !{!79, !107, !187}
!205 = !{!206, !207, !208}
!206 = !DILocalVariable(name: "fd", arg: 1, scope: !202, file: !157, line: 348, type: !107)
!207 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !202, file: !157, line: 348, type: !187)
!208 = !DILocalVariable(name: "n", scope: !209, file: !157, line: 369, type: !66)
!209 = distinct !DILexicalBlock(scope: !202, file: !157, line: 368, column: 5)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "nz", scope: !202, file: !157, line: 351, type: !66, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "fallback", scope: !202, file: !157, line: 358, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8192, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 1024)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !219, file: !220, line: 45, type: !226, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !221, globals: !225)
!220 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !{!65, !63, !222}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !223, line: 136, baseType: !224)
!223 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !133, line: 62, baseType: !68)
!225 = !{!217}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !228, line: 69, baseType: !229)
!228 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !228, line: 67, flags: DIFlagFwdDecl)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !232, file: !233, line: 38, type: !242, isLocal: true, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, globals: !241)
!233 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!234 = !{!235, !238}
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !233, line: 39, size: 32, elements: !236)
!236 = !{!237}
!237 = !DIEnumerator(name: "x_suffix_len", value: 6)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !233, line: 44, size: 32, elements: !239)
!239 = !{!240}
!240 = !DIEnumerator(name: "smallsize", value: 256)
!241 = !{!230}
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 72, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 9)
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "Version", scope: !247, file: !248, line: 2, type: !74, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !249)
!248 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!249 = !{!245}
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !252, file: !256, line: 83, type: !74, isLocal: false, isDefinition: true)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !254, retainedTypes: !303, globals: !304)
!253 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!254 = !{!5, !255, !274, !279}
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !257, file: !256, line: 285, size: 32, elements: !272)
!256 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!257 = distinct !DISubprogram(name: "find_backup_file_name", scope: !256, file: !256, line: 264, type: !258, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !252, variables: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!63, !74, !5}
!260 = !{!261, !262, !263, !264, !265, !266, !267, !270, !271}
!261 = !DILocalVariable(name: "file", arg: 1, scope: !257, file: !256, line: 264, type: !74)
!262 = !DILocalVariable(name: "backup_type", arg: 2, scope: !257, file: !256, line: 264, type: !5)
!263 = !DILocalVariable(name: "filelen", scope: !257, file: !256, line: 266, type: !66)
!264 = !DILocalVariable(name: "s", scope: !257, file: !256, line: 267, type: !63)
!265 = !DILocalVariable(name: "ssize", scope: !257, file: !256, line: 268, type: !66)
!266 = !DILocalVariable(name: "simple", scope: !257, file: !256, line: 269, type: !79)
!267 = !DILocalVariable(name: "env_suffix", scope: !268, file: !256, line: 274, type: !74)
!268 = distinct !DILexicalBlock(scope: !269, file: !256, line: 273, column: 5)
!269 = distinct !DILexicalBlock(scope: !257, file: !256, line: 272, column: 7)
!270 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !257, file: !256, line: 283, type: !66)
!271 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !257, file: !256, line: 284, type: !66)
!272 = !{!273}
!273 = !DIEnumerator(name: "GUESS", value: 9)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !256, line: 146, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!277 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!278 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !280, line: 24, size: 32, elements: !281)
!280 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!282 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!283 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!284 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!285 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!286 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!287 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!288 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!289 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!290 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!291 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!292 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!293 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!294 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!295 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!296 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!297 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!298 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!299 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!300 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!301 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!302 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!303 = !{!74, !65, !186, !66}
!304 = !{!250, !305, !311}
!305 = !DIGlobalVariableExpression(var: !306)
!306 = distinct !DIGlobalVariable(name: "backup_types", scope: !252, file: !256, line: 325, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 256, elements: !309)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!309 = !{!310}
!310 = !DISubrange(count: 8)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "backup_args", scope: !252, file: !256, line: 314, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 576, elements: !243)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "file_name", scope: !317, file: !320, line: 37, type: !74, isLocal: true, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !319)
!318 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !{!315}
!320 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!321 = !DIGlobalVariableExpression(var: !322)
!322 = distinct !DIGlobalVariable(name: "file_name", scope: !323, file: !328, line: 36, type: !74, isLocal: true, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !325)
!324 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!325 = !{!321, !326}
!326 = !DIGlobalVariableExpression(var: !327)
!327 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !323, file: !328, line: 46, type: !79, isLocal: true, isDefinition: true)
!328 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "exit_failure", scope: !331, file: !334, line: 24, type: !335, isLocal: false, isDefinition: true)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !333)
!332 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !{!329}
!334 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!335 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!336 = !DIGlobalVariableExpression(var: !337)
!337 = distinct !DIGlobalVariable(name: "default_tuning", scope: !338, file: !342, line: 130, type: !343, isLocal: true, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !340, globals: !341)
!339 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!340 = !{!68, !65, !66}
!341 = !{!336}
!342 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !228, line: 65, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !228, line: 53, size: 160, elements: !346)
!346 = !{!347, !349, !350, !351, !352}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !345, file: !228, line: 58, baseType: !348, size: 32)
!348 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !345, file: !228, line: 59, baseType: !348, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !345, file: !228, line: 60, baseType: !348, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !345, file: !228, line: 61, baseType: !348, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !345, file: !228, line: 62, baseType: !79, size: 8, offset: 128)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "program_name", scope: !355, file: !359, line: 33, type: !74, isLocal: false, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !357, globals: !358)
!356 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!357 = !{!65, !63}
!358 = !{!353}
!359 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!360 = !DIGlobalVariableExpression(var: !361)
!361 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !362, file: !390, line: 77, type: !423, isLocal: false, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !385, globals: !387)
!363 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!364 = !{!36, !365, !370}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !37, line: 242, size: 32, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!368 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!369 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 46, size: 32, elements: !372)
!371 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!373 = !DIEnumerator(name: "_ISupper", value: 256)
!374 = !DIEnumerator(name: "_ISlower", value: 512)
!375 = !DIEnumerator(name: "_ISalpha", value: 1024)
!376 = !DIEnumerator(name: "_ISdigit", value: 2048)
!377 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!378 = !DIEnumerator(name: "_ISspace", value: 8192)
!379 = !DIEnumerator(name: "_ISprint", value: 16384)
!380 = !DIEnumerator(name: "_ISgraph", value: 32768)
!381 = !DIEnumerator(name: "_ISblank", value: 1)
!382 = !DIEnumerator(name: "_IScntrl", value: 2)
!383 = !DIEnumerator(name: "_ISpunct", value: 4)
!384 = !DIEnumerator(name: "_ISalnum", value: 8)
!385 = !{!107, !386, !66, !63}
!386 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!387 = !{!360, !388, !395, !405, !407, !412, !419, !421}
!388 = !DIGlobalVariableExpression(var: !389)
!389 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !362, file: !390, line: 93, type: !391, isLocal: false, isDefinition: true)
!390 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 320, elements: !393)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!393 = !{!394}
!394 = !DISubrange(count: 10)
!395 = !DIGlobalVariableExpression(var: !396)
!396 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !362, file: !390, line: 1043, type: !397, isLocal: false, isDefinition: true)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !390, line: 57, size: 448, elements: !398)
!398 = !{!399, !400, !401, !403, !404}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !397, file: !390, line: 60, baseType: !36, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !390, line: 63, baseType: !107, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !397, file: !390, line: 67, baseType: !402, size: 256, offset: 64)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 256, elements: !309)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !397, file: !390, line: 70, baseType: !74, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !397, file: !390, line: 73, baseType: !74, size: 64, offset: 384)
!405 = !DIGlobalVariableExpression(var: !406)
!406 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !362, file: !390, line: 108, type: !397, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408)
!408 = distinct !DIGlobalVariable(name: "slot0", scope: !362, file: !390, line: 834, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 256)
!412 = !DIGlobalVariableExpression(var: !413)
!413 = distinct !DIGlobalVariable(name: "slotvec", scope: !362, file: !390, line: 837, type: !414, isLocal: true, isDefinition: true)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !390, line: 826, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !390, line: 828, baseType: !66, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !415, file: !390, line: 829, baseType: !63, size: 64, offset: 64)
!419 = !DIGlobalVariableExpression(var: !420)
!420 = distinct !DIGlobalVariable(name: "nslots", scope: !362, file: !390, line: 835, type: !107, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422)
!422 = distinct !DIGlobalVariable(name: "slotvec0", scope: !362, file: !390, line: 836, type: !415, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 11)
!426 = !DIGlobalVariableExpression(var: !427)
!427 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !428, file: !446, line: 74, type: !447, isLocal: true, isDefinition: true)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !430, retainedTypes: !444, globals: !445)
!429 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!430 = !{!163, !431}
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !433, file: !432, line: 192, size: 32, elements: !442)
!432 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = distinct !DISubprogram(name: "x2nrealloc", scope: !432, file: !432, line: 180, type: !434, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !428, variables: !437)
!434 = !DISubroutineType(types: !435)
!435 = !{!65, !65, !436, !66}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!437 = !{!438, !439, !440, !441}
!438 = !DILocalVariable(name: "p", arg: 1, scope: !433, file: !432, line: 180, type: !65)
!439 = !DILocalVariable(name: "pn", arg: 2, scope: !433, file: !432, line: 180, type: !436)
!440 = !DILocalVariable(name: "s", arg: 3, scope: !433, file: !432, line: 180, type: !66)
!441 = !DILocalVariable(name: "n", scope: !433, file: !432, line: 182, type: !66)
!442 = !{!443}
!443 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!444 = !{!65}
!445 = !{!426}
!446 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 192, elements: !453)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !446, line: 72, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!107, !69, !69}
!453 = !{!454}
!454 = !DISubrange(count: 3)
!455 = !DIGlobalVariableExpression(var: !456)
!456 = distinct !DIGlobalVariable(name: "letters", scope: !457, file: !460, line: 185, type: !461, isLocal: true, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !459)
!458 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!459 = !{!455}
!460 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 504, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 63)
!464 = !DIGlobalVariableExpression(var: !465)
!465 = distinct !DIGlobalVariable(name: "ht", scope: !466, file: !467, line: 147, type: !226, isLocal: true, isDefinition: true)
!466 = distinct !DISubprogram(name: "utimecmp", scope: !467, file: !467, line: 116, type: !468, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !503, variables: !518)
!467 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!468 = !DISubroutineType(types: !469)
!469 = !{!107, !74, !470, !470, !107}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !473, line: 46, size: 1152, elements: !474)
!473 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!474 = !{!475, !476, !477, !479, !480, !482, !484, !485, !486, !487, !489, !491, !499, !500, !501}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !472, file: !473, line: 48, baseType: !136, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !472, file: !473, line: 53, baseType: !132, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !472, file: !473, line: 61, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !133, line: 139, baseType: !68)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !472, file: !473, line: 62, baseType: !185, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !472, file: !473, line: 64, baseType: !481, size: 32, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !133, line: 134, baseType: !186)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !472, file: !473, line: 65, baseType: !483, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !133, line: 135, baseType: !186)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !472, file: !473, line: 67, baseType: !107, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !472, file: !473, line: 69, baseType: !136, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !472, file: !473, line: 74, baseType: !189, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !472, file: !473, line: 78, baseType: !488, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !133, line: 162, baseType: !190)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !472, file: !473, line: 80, baseType: !490, size: 64, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !133, line: 167, baseType: !190)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !472, file: !473, line: 91, baseType: !492, size: 128, offset: 576)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !493, line: 8, size: 128, elements: !494)
!493 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!494 = !{!495, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !492, file: !493, line: 10, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !133, line: 148, baseType: !190)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !492, file: !493, line: 11, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !133, line: 184, baseType: !190)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !472, file: !473, line: 92, baseType: !492, size: 128, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !472, file: !473, line: 93, baseType: !492, size: 128, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !472, file: !473, line: 106, baseType: !502, size: 192, offset: 960)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 192, elements: !453)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !505, globals: !509)
!504 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!505 = !{!159, !506}
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 47, size: 32, elements: !507)
!507 = !{!508}
!508 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!509 = !{!464, !510}
!510 = !DIGlobalVariableExpression(var: !511)
!511 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !466, file: !467, line: 150, type: !512, isLocal: true, isDefinition: true)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !467, line: 60, size: 128, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !513, file: !467, line: 63, baseType: !135, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !513, file: !467, line: 70, baseType: !107, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !513, file: !467, line: 74, baseType: !79, size: 8, offset: 96)
!518 = !{!519, !520, !521, !522, !523, !526, !527, !528, !529, !532, !533, !534, !537, !538, !539, !540, !541, !542, !544, !547, !548, !549, !550, !556, !557, !559, !561, !563}
!519 = !DILocalVariable(name: "dst_name", arg: 1, scope: !466, file: !467, line: 116, type: !74)
!520 = !DILocalVariable(name: "dst_stat", arg: 2, scope: !466, file: !467, line: 117, type: !470)
!521 = !DILocalVariable(name: "src_stat", arg: 3, scope: !466, file: !467, line: 118, type: !470)
!522 = !DILocalVariable(name: "options", arg: 4, scope: !466, file: !467, line: 119, type: !107)
!523 = !DILocalVariable(name: "dst_s", scope: !466, file: !467, line: 137, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !525, line: 8, baseType: !496)
!525 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!526 = !DILocalVariable(name: "src_s", scope: !466, file: !467, line: 138, type: !524)
!527 = !DILocalVariable(name: "dst_ns", scope: !466, file: !467, line: 139, type: !107)
!528 = !DILocalVariable(name: "src_ns", scope: !466, file: !467, line: 140, type: !107)
!529 = !DILocalVariable(name: "dst_res", scope: !530, file: !467, line: 151, type: !512)
!530 = distinct !DILexicalBlock(scope: !531, file: !467, line: 143, column: 5)
!531 = distinct !DILexicalBlock(scope: !466, file: !467, line: 142, column: 7)
!532 = !DILocalVariable(name: "tmp_dst_res", scope: !530, file: !467, line: 152, type: !513)
!533 = !DILocalVariable(name: "res", scope: !530, file: !467, line: 155, type: !107)
!534 = !DILocalVariable(name: "dst_a_s", scope: !535, file: !467, line: 229, type: !524)
!535 = distinct !DILexicalBlock(scope: !536, file: !467, line: 225, column: 9)
!536 = distinct !DILexicalBlock(scope: !530, file: !467, line: 224, column: 11)
!537 = !DILocalVariable(name: "dst_c_s", scope: !535, file: !467, line: 230, type: !524)
!538 = !DILocalVariable(name: "dst_m_s", scope: !535, file: !467, line: 231, type: !524)
!539 = !DILocalVariable(name: "dst_a_ns", scope: !535, file: !467, line: 232, type: !107)
!540 = !DILocalVariable(name: "dst_c_ns", scope: !535, file: !467, line: 233, type: !107)
!541 = !DILocalVariable(name: "dst_m_ns", scope: !535, file: !467, line: 234, type: !107)
!542 = !DILocalVariable(name: "odd_second", scope: !543, file: !467, line: 243, type: !79)
!543 = distinct !DILexicalBlock(scope: !535, file: !467, line: 242, column: 11)
!544 = !DILocalVariable(name: "a", scope: !545, file: !467, line: 252, type: !107)
!545 = distinct !DILexicalBlock(scope: !546, file: !467, line: 251, column: 15)
!546 = distinct !DILexicalBlock(scope: !543, file: !467, line: 245, column: 17)
!547 = !DILocalVariable(name: "c", scope: !545, file: !467, line: 253, type: !107)
!548 = !DILocalVariable(name: "m", scope: !545, file: !467, line: 254, type: !107)
!549 = !DILocalVariable(name: "SR10", scope: !545, file: !467, line: 258, type: !107)
!550 = !DILocalVariable(name: "timespec", scope: !551, file: !467, line: 280, type: !553)
!551 = distinct !DILexicalBlock(scope: !552, file: !467, line: 279, column: 13)
!552 = distinct !DILexicalBlock(scope: !535, file: !467, line: 278, column: 15)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 256, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 2)
!556 = !DILocalVariable(name: "dst_status", scope: !551, file: !467, line: 281, type: !472)
!557 = !DILocalVariable(name: "s", scope: !558, file: !467, line: 291, type: !524)
!558 = distinct !DILexicalBlock(scope: !551, file: !467, line: 290, column: 15)
!559 = !DILocalVariable(name: "stat_result", scope: !560, file: !467, line: 320, type: !107)
!560 = distinct !DILexicalBlock(scope: !551, file: !467, line: 319, column: 15)
!561 = !DILocalVariable(name: "old_res", scope: !562, file: !467, line: 345, type: !107)
!562 = distinct !DILexicalBlock(scope: !551, file: !467, line: 344, column: 15)
!563 = !DILocalVariable(name: "a", scope: !562, file: !467, line: 346, type: !107)
!564 = !DIGlobalVariableExpression(var: !565)
!565 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !566, file: !576, line: 73, type: !107, isLocal: true, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !568, globals: !573)
!567 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!568 = !{!569}
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 35, size: 32, elements: !571)
!570 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !{!572}
!572 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!573 = !{!564, !574}
!574 = !DIGlobalVariableExpression(var: !575)
!575 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !566, file: !576, line: 74, type: !107, isLocal: true, isDefinition: true)
!576 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!577 = !DIGlobalVariableExpression(var: !578)
!578 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !579, file: !582, line: 26, type: !583, isLocal: false, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !581)
!580 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!581 = !{!577}
!582 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 47)
!586 = !DIGlobalVariableExpression(var: !587)
!587 = distinct !DIGlobalVariable(name: "can_write", scope: !588, file: !589, line: 35, type: !79, isLocal: true, isDefinition: true)
!588 = distinct !DISubprogram(name: "can_write_any_file", scope: !589, file: !589, line: 32, type: !590, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !592, variables: !597)
!589 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!590 = !DISubroutineType(types: !591)
!591 = !{!79}
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !594)
!593 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!594 = !{!595, !586}
!595 = !DIGlobalVariableExpression(var: !596)
!596 = distinct !DIGlobalVariable(name: "initialized", scope: !588, file: !589, line: 34, type: !79, isLocal: true, isDefinition: true)
!597 = !{!598}
!598 = !DILocalVariable(name: "can", scope: !599, file: !589, line: 39, type: !79)
!599 = distinct !DILexicalBlock(scope: !600, file: !589, line: 38, column: 5)
!600 = distinct !DILexicalBlock(scope: !588, file: !589, line: 37, column: 7)
!601 = !DIGlobalVariableExpression(var: !602)
!602 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !603, file: !604, line: 335, type: !107, isLocal: true, isDefinition: true)
!603 = distinct !DISubprogram(name: "rpl_fcntl", scope: !604, file: !604, line: 272, type: !605, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !607, variables: !610)
!604 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = !DISubroutineType(types: !606)
!606 = !{!107, !107, !107, null}
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, globals: !609)
!608 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!609 = !{!601}
!610 = !{!611, !612, !613, !626, !627, !630, !633, !636}
!611 = !DILocalVariable(name: "fd", arg: 1, scope: !603, file: !604, line: 272, type: !107)
!612 = !DILocalVariable(name: "action", arg: 2, scope: !603, file: !604, line: 272, type: !107)
!613 = !DILocalVariable(name: "arg", scope: !603, file: !604, line: 274, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !615, line: 30, baseType: !616)
!615 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !608, line: 274, baseType: !617)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 192, elements: !624)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !608, line: 274, size: 192, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !618, file: !608, line: 274, baseType: !186, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !618, file: !608, line: 274, baseType: !186, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !618, file: !608, line: 274, baseType: !65, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !618, file: !608, line: 274, baseType: !65, size: 64, offset: 128)
!624 = !{!625}
!625 = !DISubrange(count: 1)
!626 = !DILocalVariable(name: "result", scope: !603, file: !604, line: 275, type: !107)
!627 = !DILocalVariable(name: "target", scope: !628, file: !604, line: 322, type: !107)
!628 = distinct !DILexicalBlock(scope: !629, file: !604, line: 321, column: 7)
!629 = distinct !DILexicalBlock(scope: !603, file: !604, line: 278, column: 5)
!630 = !DILocalVariable(name: "flags", scope: !631, file: !604, line: 359, type: !107)
!631 = distinct !DILexicalBlock(scope: !632, file: !604, line: 358, column: 11)
!632 = distinct !DILexicalBlock(scope: !628, file: !604, line: 357, column: 13)
!633 = !DILocalVariable(name: "saved_errno", scope: !634, file: !604, line: 362, type: !107)
!634 = distinct !DILexicalBlock(scope: !635, file: !604, line: 361, column: 15)
!635 = distinct !DILexicalBlock(scope: !631, file: !604, line: 360, column: 17)
!636 = !DILocalVariable(name: "p", scope: !637, file: !604, line: 404, type: !65)
!637 = distinct !DILexicalBlock(scope: !629, file: !604, line: 402, column: 7)
!638 = !DIGlobalVariableExpression(var: !639)
!639 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !640, file: !645, line: 69, type: !646, isLocal: false, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !642, retainedTypes: !643, globals: !644)
!641 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!642 = !{!36}
!643 = !{!66, !65, !73}
!644 = !{!638}
!645 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !647, line: 55, baseType: !648)
!647 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null}
!651 = !DIGlobalVariableExpression(var: !652)
!652 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !653, file: !997, line: 120, type: !998, isLocal: true, isDefinition: true)
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !655, retainedTypes: !994, globals: !996)
!654 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = !{!656}
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !657, line: 41, size: 32, elements: !658)
!657 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993}
!659 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!660 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!661 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!662 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!663 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!664 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!665 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!666 = !DIEnumerator(name: "DAY_1", value: 131079)
!667 = !DIEnumerator(name: "DAY_2", value: 131080)
!668 = !DIEnumerator(name: "DAY_3", value: 131081)
!669 = !DIEnumerator(name: "DAY_4", value: 131082)
!670 = !DIEnumerator(name: "DAY_5", value: 131083)
!671 = !DIEnumerator(name: "DAY_6", value: 131084)
!672 = !DIEnumerator(name: "DAY_7", value: 131085)
!673 = !DIEnumerator(name: "ABMON_1", value: 131086)
!674 = !DIEnumerator(name: "ABMON_2", value: 131087)
!675 = !DIEnumerator(name: "ABMON_3", value: 131088)
!676 = !DIEnumerator(name: "ABMON_4", value: 131089)
!677 = !DIEnumerator(name: "ABMON_5", value: 131090)
!678 = !DIEnumerator(name: "ABMON_6", value: 131091)
!679 = !DIEnumerator(name: "ABMON_7", value: 131092)
!680 = !DIEnumerator(name: "ABMON_8", value: 131093)
!681 = !DIEnumerator(name: "ABMON_9", value: 131094)
!682 = !DIEnumerator(name: "ABMON_10", value: 131095)
!683 = !DIEnumerator(name: "ABMON_11", value: 131096)
!684 = !DIEnumerator(name: "ABMON_12", value: 131097)
!685 = !DIEnumerator(name: "MON_1", value: 131098)
!686 = !DIEnumerator(name: "MON_2", value: 131099)
!687 = !DIEnumerator(name: "MON_3", value: 131100)
!688 = !DIEnumerator(name: "MON_4", value: 131101)
!689 = !DIEnumerator(name: "MON_5", value: 131102)
!690 = !DIEnumerator(name: "MON_6", value: 131103)
!691 = !DIEnumerator(name: "MON_7", value: 131104)
!692 = !DIEnumerator(name: "MON_8", value: 131105)
!693 = !DIEnumerator(name: "MON_9", value: 131106)
!694 = !DIEnumerator(name: "MON_10", value: 131107)
!695 = !DIEnumerator(name: "MON_11", value: 131108)
!696 = !DIEnumerator(name: "MON_12", value: 131109)
!697 = !DIEnumerator(name: "AM_STR", value: 131110)
!698 = !DIEnumerator(name: "PM_STR", value: 131111)
!699 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!700 = !DIEnumerator(name: "D_FMT", value: 131113)
!701 = !DIEnumerator(name: "T_FMT", value: 131114)
!702 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!703 = !DIEnumerator(name: "ERA", value: 131116)
!704 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!705 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!706 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!707 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!708 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!709 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!710 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!711 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!712 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!713 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!714 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!715 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!716 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!717 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!718 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!719 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!720 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!721 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!722 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!723 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!724 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!725 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!726 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!727 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!728 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!729 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!730 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!731 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!732 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!733 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!734 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!735 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!736 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!737 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!738 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!739 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!740 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!741 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!742 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!743 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!744 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!745 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!746 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!747 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!748 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!749 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!750 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!751 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!752 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!753 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!754 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!755 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!756 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!757 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!758 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!759 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!760 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!761 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!762 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!763 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!764 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!765 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!766 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!767 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!768 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!769 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!770 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!771 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!772 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!773 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!774 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!775 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!776 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!777 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!778 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!779 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!780 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!781 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!782 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!783 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!784 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!785 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!786 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!787 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!788 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!789 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!790 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!791 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!792 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!793 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!794 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!795 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!796 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!797 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!798 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!799 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!800 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!801 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!802 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!803 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!804 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!805 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!806 = !DIEnumerator(name: "CODESET", value: 14)
!807 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!808 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!809 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!810 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!811 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!812 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!813 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!814 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!815 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!816 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!817 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!818 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!819 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!820 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!821 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!822 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!823 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!824 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!825 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!827 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!828 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!829 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!830 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!831 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!833 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!834 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!835 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!836 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!837 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!838 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!839 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!840 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!841 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!842 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!843 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!844 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!845 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!846 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!847 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!848 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!849 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!850 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!851 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!852 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!853 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!854 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!855 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!856 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!857 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!858 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!859 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!860 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!861 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!862 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!863 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!864 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!865 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!866 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!867 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!868 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!869 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!870 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!871 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!872 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!873 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!874 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!875 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!876 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!877 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!878 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!879 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!880 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!881 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!882 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!883 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!884 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!885 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!886 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!887 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!888 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!889 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!890 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!891 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!892 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!893 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!894 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!895 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!896 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!897 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!898 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!899 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!900 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!901 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!902 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!903 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!904 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!905 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!906 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!907 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!908 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!909 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!910 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!911 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!912 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!913 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!914 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!915 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!916 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!917 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!918 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!919 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!920 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!921 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!922 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!923 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!924 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!925 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!926 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!927 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!928 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!929 = !DIEnumerator(name: "THOUSEP", value: 65537)
!930 = !DIEnumerator(name: "__GROUPING", value: 65538)
!931 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!932 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!933 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!934 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!935 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!936 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!937 = !DIEnumerator(name: "__YESSTR", value: 327682)
!938 = !DIEnumerator(name: "__NOSTR", value: 327683)
!939 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!940 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!941 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!942 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!943 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!944 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!945 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!946 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!947 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!948 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!949 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!950 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!951 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!952 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!953 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!954 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!955 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!956 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!957 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!958 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!959 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!960 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!961 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!962 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!963 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!964 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!965 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!966 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!967 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!968 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!969 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!970 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!971 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!972 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!973 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!974 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!975 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!976 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!977 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!978 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!979 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!980 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!981 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!982 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!983 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!984 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!985 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!986 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!987 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!988 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!989 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!990 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!991 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!992 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!993 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!994 = !{!65, !63, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!996 = !{!651}
!997 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!998 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !74)
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, retainedTypes: !1023)
!1000 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1001 = !{!56, !50, !36, !1002, !1007, !1011}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !1000, line: 34, size: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIEnumerator(name: "T_UNKNOWN", value: 2)
!1005 = !DIEnumerator(name: "T_NO", value: 3)
!1006 = !DIEnumerator(name: "T_YES", value: 4)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !1000, line: 45, size: 32, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!1010 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!1011 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1012, line: 97, size: 32, elements: !1013)
!1012 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1014 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!1015 = !DIEnumerator(name: "DT_FIFO", value: 1)
!1016 = !DIEnumerator(name: "DT_CHR", value: 2)
!1017 = !DIEnumerator(name: "DT_DIR", value: 4)
!1018 = !DIEnumerator(name: "DT_BLK", value: 6)
!1019 = !DIEnumerator(name: "DT_REG", value: 8)
!1020 = !DIEnumerator(name: "DT_LNK", value: 10)
!1021 = !DIEnumerator(name: "DT_SOCK", value: 12)
!1022 = !DIEnumerator(name: "DT_WHT", value: 14)
!1023 = !{!65, !66, !69, !71, !74, !107}
!1024 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1025, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1026, retainedTypes: !1104)
!1025 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1026 = !{!1027}
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1028, file: !1025, line: 97, size: 32, elements: !1102)
!1028 = distinct !DISubprogram(name: "extent_scan_read", scope: !1025, file: !1025, line: 87, type: !1029, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !1024, variables: !1049)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!79, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !1033, line: 36, size: 384, elements: !1034)
!1033 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1034 = !{!1035, !1036, !1038, !1039, !1040, !1041, !1042}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1032, file: !1033, line: 39, baseType: !107, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !1032, file: !1033, line: 42, baseType: !1037, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !131, line: 86, baseType: !189)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1032, file: !1033, line: 45, baseType: !186, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !1032, file: !1033, line: 48, baseType: !66, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !1032, file: !1033, line: 52, baseType: !79, size: 8, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !1032, file: !1033, line: 55, baseType: !79, size: 8, offset: 264)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !1032, file: !1033, line: 58, baseType: !1043, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !1033, line: 23, size: 192, elements: !1045)
!1045 = !{!1046, !1047, !1048}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !1044, file: !1033, line: 26, baseType: !1037, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !1044, file: !1033, line: 29, baseType: !1037, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !1044, file: !1033, line: 32, baseType: !186, size: 32, offset: 128)
!1049 = !{!1050, !1051, !1052, !1053, !1087, !1089, !1091, !1093, !1094, !1101}
!1050 = !DILocalVariable(name: "scan", arg: 1, scope: !1028, file: !1025, line: 87, type: !1031)
!1051 = !DILocalVariable(name: "si", scope: !1028, file: !1025, line: 89, type: !186)
!1052 = !DILocalVariable(name: "last_ei", scope: !1028, file: !1025, line: 90, type: !1043)
!1053 = !DILocalVariable(name: "fiemap_buf", scope: !1054, file: !1025, line: 94, type: !1055)
!1054 = distinct !DILexicalBlock(scope: !1028, file: !1025, line: 93, column: 5)
!1055 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !1025, line: 94, size: 32768, elements: !1056)
!1056 = !{!1057, !1083}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1055, file: !1025, line: 94, baseType: !1058, size: 256)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !1059, line: 35, size: 256, elements: !1060)
!1059 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1060 = !{!1061, !1063, !1064, !1066, !1067, !1068, !1069}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !1058, file: !1059, line: 38, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !223, line: 57, baseType: !68)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !1058, file: !1059, line: 41, baseType: !1062, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1058, file: !1059, line: 44, baseType: !1065, size: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !223, line: 53, baseType: !186)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !1058, file: !1059, line: 47, baseType: !1065, size: 32, offset: 160)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !1058, file: !1059, line: 50, baseType: !1065, size: 32, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !1058, file: !1059, line: 52, baseType: !1065, size: 32, offset: 224)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !1058, file: !1059, line: 59, baseType: !1070, offset: 256)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1071, elements: !1081)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !1059, line: 14, size: 448, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1078, !1079}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !1071, file: !1059, line: 18, baseType: !1062, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !1071, file: !1059, line: 22, baseType: !1062, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !1071, file: !1059, line: 25, baseType: !1062, size: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !1071, file: !1059, line: 27, baseType: !1077, size: 128, offset: 192)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 128, elements: !554)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !1071, file: !1059, line: 30, baseType: !1065, size: 32, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !1071, file: !1059, line: 32, baseType: !1080, size: 96, offset: 352)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 96, elements: !453)
!1081 = !{!1082}
!1082 = !DISubrange(count: 0)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1055, file: !1025, line: 94, baseType: !1084, size: 32768)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32768, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 4096)
!1087 = !DILocalVariable(name: "fiemap", scope: !1054, file: !1025, line: 95, type: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1089 = !DILocalVariable(name: "fm_extents", scope: !1054, file: !1025, line: 96, type: !1090)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1091 = !DILocalVariable(name: "prev_idx", scope: !1092, file: !1025, line: 131, type: !66)
!1092 = distinct !DILexicalBlock(scope: !1054, file: !1025, line: 128, column: 7)
!1093 = !DILocalVariable(name: "i", scope: !1054, file: !1025, line: 137, type: !186)
!1094 = !DILocalVariable(name: "new_logical", scope: !1095, file: !1025, line: 163, type: !1062)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !1025, line: 158, column: 13)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !1025, line: 155, column: 20)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !1025, line: 145, column: 15)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !1025, line: 139, column: 9)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !1025, line: 138, column: 7)
!1100 = distinct !DILexicalBlock(scope: !1054, file: !1025, line: 138, column: 7)
!1101 = !DILocalVariable(name: "length_adjust", scope: !1095, file: !1025, line: 164, type: !1062)
!1102 = !{!1103}
!1103 = !DIEnumerator(name: "count", value: 72)
!1104 = !{!1037, !66}
!1105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1106, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1106 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1108, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1108 = !DIFile(filename: "./lib/copy-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1110, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1110 = !DIFile(filename: "./lib/set-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1112, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !444)
!1112 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1114, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1114 = !DIFile(filename: "./lib/buffer-lcm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1116, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1116 = !DIFile(filename: "./lib/opendir-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1118, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1118 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1120, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1120 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1122, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !1123)
!1122 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1123 = !{!63}
!1124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1125, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1125 = !DIFile(filename: "./lib/stripslash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1127, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1128)
!1127 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1128 = !{!170}
!1129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1130, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1130 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1131 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1132, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !357)
!1132 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1134, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1134 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1136, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1136 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1138, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !444)
!1138 = !DIFile(filename: "./lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1140, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !444)
!1140 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1142, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197, retainedTypes: !1143)
!1142 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1143 = !{!74, !66}
!1144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1145, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1145 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1147, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1147 = !DIFile(filename: "./lib/qcopy-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1149, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1149 = !DIFile(filename: "./lib/qset-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1151, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !197)
!1151 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1153, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1154)
!1153 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1154 = !{!1155}
!1155 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1157, file: !1156, line: 62, size: 32, elements: !1170)
!1156 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1157 = distinct !DISubprogram(name: "safe_write", scope: !1156, file: !1156, line: 56, type: !1158, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !1152, variables: !1160)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!66, !107, !69, !66}
!1160 = !{!1161, !1162, !1163, !1164}
!1161 = !DILocalVariable(name: "fd", arg: 1, scope: !1157, file: !1156, line: 56, type: !107)
