; ModuleID = 'coreutils-8.27/src/sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.month = type { i8*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.line = type { i8*, i64, i8*, i8* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.buffer = type { i8*, i64, i64, i64, i64, i64, i8 }
%struct.rlimit = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 169, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !889, globals: !892)
!3 = !DIFile(filename: "src/sort.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !9, !423, !428, !431, !445, !451, !454, !469, !807, !815, !837, !849, !861, !870, !875, !879, !882, !886}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 128, size: 32, elements: !6)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "SORT_OUT_OF_ORDER", value: 1)
!8 = !DIEnumerator(name: "SORT_FAILURE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !10, file: !3, line: 4267, size: 32, elements: !421)
!10 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 4189, type: !11, isLocal: false, isDefinition: true, scopeLine: 4190, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !17)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !13, !14}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18, !19, !20, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !127, !128, !129, !160, !162, !266, !268, !273, !280, !285, !288, !289, !292, !293, !296, !297, !299, !304, !305, !310, !311, !314, !371, !374, !375, !377, !378, !381, !387, !388, !390, !391, !394, !397, !415, !416, !420}
!18 = !DILocalVariable(name: "argc", arg: 1, scope: !10, file: !3, line: 4189, type: !13)
!19 = !DILocalVariable(name: "argv", arg: 2, scope: !10, file: !3, line: 4189, type: !14)
!20 = !DILocalVariable(name: "key", scope: !10, file: !3, line: 4191, type: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !3, line: 208, size: 576, elements: !23)
!23 = !{!24, !28, !29, !30, !31, !35, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !22, file: !3, line: 210, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 62, baseType: !27)
!26 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !22, file: !3, line: 211, baseType: !25, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !22, file: !3, line: 212, baseType: !25, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !22, file: !3, line: 213, baseType: !25, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !22, file: !3, line: 214, baseType: !32, size: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !22, file: !3, line: 215, baseType: !36, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !22, file: !3, line: 216, baseType: !34, size: 8, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !22, file: !3, line: 217, baseType: !34, size: 8, offset: 392)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !22, file: !3, line: 218, baseType: !34, size: 8, offset: 400)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !22, file: !3, line: 221, baseType: !34, size: 8, offset: 408)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !22, file: !3, line: 222, baseType: !34, size: 8, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !22, file: !3, line: 224, baseType: !34, size: 8, offset: 424)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !22, file: !3, line: 226, baseType: !34, size: 8, offset: 432)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !22, file: !3, line: 227, baseType: !34, size: 8, offset: 440)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !22, file: !3, line: 228, baseType: !34, size: 8, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !22, file: !3, line: 229, baseType: !34, size: 8, offset: 456)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !3, line: 230, baseType: !21, size: 64, offset: 512)
!49 = !DILocalVariable(name: "key_buf", scope: !10, file: !3, line: 4192, type: !22)
!50 = !DILocalVariable(name: "gkey", scope: !10, file: !3, line: 4193, type: !22)
!51 = !DILocalVariable(name: "gkey_only", scope: !10, file: !3, line: 4194, type: !34)
!52 = !DILocalVariable(name: "s", scope: !10, file: !3, line: 4195, type: !36)
!53 = !DILocalVariable(name: "c", scope: !10, file: !3, line: 4196, type: !13)
!54 = !DILocalVariable(name: "checkonly", scope: !10, file: !3, line: 4197, type: !16)
!55 = !DILocalVariable(name: "mergeonly", scope: !10, file: !3, line: 4198, type: !34)
!56 = !DILocalVariable(name: "random_source", scope: !10, file: !3, line: 4199, type: !15)
!57 = !DILocalVariable(name: "need_random", scope: !10, file: !3, line: 4200, type: !34)
!58 = !DILocalVariable(name: "nthreads", scope: !10, file: !3, line: 4201, type: !25)
!59 = !DILocalVariable(name: "nfiles", scope: !10, file: !3, line: 4202, type: !25)
!60 = !DILocalVariable(name: "posixly_correct", scope: !10, file: !3, line: 4203, type: !34)
!61 = !DILocalVariable(name: "posix_ver", scope: !10, file: !3, line: 4204, type: !13)
!62 = !DILocalVariable(name: "traditional_usage", scope: !10, file: !3, line: 4205, type: !34)
!63 = !DILocalVariable(name: "files", scope: !10, file: !3, line: 4206, type: !14)
!64 = !DILocalVariable(name: "files_from", scope: !10, file: !3, line: 4207, type: !15)
!65 = !DILocalVariable(name: "tok", scope: !10, file: !3, line: 4208, type: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !67, line: 28, size: 2304, elements: !68)
!67 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!68 = !{!69, !70, !71, !73, !125, !126}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !66, file: !67, line: 30, baseType: !25, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !66, file: !67, line: 31, baseType: !14, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !66, file: !67, line: 32, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !66, file: !67, line: 33, baseType: !74, size: 704, offset: 192)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !75, line: 174, size: 704, elements: !76)
!75 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!76 = !{!77, !78, !88, !89, !90, !91, !97, !98, !109, !120, !121, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !74, file: !75, line: 176, baseType: !25, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !74, file: !75, line: 177, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !75, line: 167, size: 128, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !80, file: !75, line: 169, baseType: !15, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !80, file: !75, line: 170, baseType: !79, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !80, file: !75, line: 171, baseType: !85, offset: 128)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: -1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !74, file: !75, line: 178, baseType: !15, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !74, file: !75, line: 179, baseType: !15, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !74, file: !75, line: 180, baseType: !15, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !74, file: !75, line: 185, baseType: !92, size: 64, offset: 320)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 181, size: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !92, file: !75, line: 183, baseType: !25, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !92, file: !75, line: 184, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !74, file: !75, line: 186, baseType: !25, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !74, file: !75, line: 193, baseType: !99, size: 64, offset: 448)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 189, size: 64, elements: !100)
!100 = !{!101, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !99, file: !75, line: 191, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!96, !25}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !99, file: !75, line: 192, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!96, !96, !25}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !74, file: !75, line: 198, baseType: !110, size: 64, offset: 512)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 194, size: 64, elements: !111)
!111 = !{!112, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !110, file: !75, line: 196, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !96}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !110, file: !75, line: 197, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !96, !96}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !74, file: !75, line: 200, baseType: !96, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !74, file: !75, line: 201, baseType: !122, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!122 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !74, file: !75, line: 202, baseType: !122, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !74, file: !75, line: 206, baseType: !122, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !66, file: !67, line: 34, baseType: !74, size: 704, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !66, file: !67, line: 35, baseType: !74, size: 704, offset: 1600)
!127 = !DILocalVariable(name: "outfile", scope: !10, file: !3, line: 4209, type: !36)
!128 = !DILocalVariable(name: "locale_ok", scope: !10, file: !3, line: 4210, type: !34)
!129 = !DILocalVariable(name: "locale", scope: !130, file: !3, line: 4227, type: !131)
!130 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4226, column: 3)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !134, line: 53, size: 768, elements: !135)
!134 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !133, file: !134, line: 57, baseType: !15, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !133, file: !134, line: 58, baseType: !15, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !133, file: !134, line: 64, baseType: !15, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !133, file: !134, line: 70, baseType: !15, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !133, file: !134, line: 71, baseType: !15, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !133, file: !134, line: 72, baseType: !15, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !133, file: !134, line: 73, baseType: !15, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !133, file: !134, line: 74, baseType: !15, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !133, file: !134, line: 75, baseType: !15, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !133, file: !134, line: 76, baseType: !15, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !133, file: !134, line: 77, baseType: !16, size: 8, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !133, file: !134, line: 78, baseType: !16, size: 8, offset: 648)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !133, file: !134, line: 80, baseType: !16, size: 8, offset: 656)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !133, file: !134, line: 82, baseType: !16, size: 8, offset: 664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !133, file: !134, line: 84, baseType: !16, size: 8, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !133, file: !134, line: 86, baseType: !16, size: 8, offset: 680)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !133, file: !134, line: 93, baseType: !16, size: 8, offset: 688)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !133, file: !134, line: 94, baseType: !16, size: 8, offset: 696)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !133, file: !134, line: 97, baseType: !16, size: 8, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !133, file: !134, line: 99, baseType: !16, size: 8, offset: 712)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !133, file: !134, line: 101, baseType: !16, size: 8, offset: 720)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !133, file: !134, line: 103, baseType: !16, size: 8, offset: 728)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !133, file: !134, line: 110, baseType: !16, size: 8, offset: 736)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !133, file: !134, line: 111, baseType: !16, size: 8, offset: 744)
!160 = !DILocalVariable(name: "i", scope: !161, file: !3, line: 4246, type: !25)
!161 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4245, column: 3)
!162 = !DILocalVariable(name: "act", scope: !161, file: !3, line: 4270, type: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !164, line: 24, size: 1216, elements: !165)
!164 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!165 = !{!166, !252, !261, !262}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !163, file: !164, line: 35, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !164, line: 28, size: 64, elements: !168)
!168 = !{!169, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !167, file: !164, line: 31, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !171, line: 84, baseType: !172)
!171 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !13}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !167, file: !164, line: 33, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !13, !179, !96}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !181, line: 133, baseType: !182)
!181 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 62, size: 1024, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !182, file: !181, line: 64, baseType: !13, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !182, file: !181, line: 65, baseType: !13, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !182, file: !181, line: 67, baseType: !13, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !182, file: !181, line: 132, baseType: !188, size: 896, offset: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !181, line: 69, size: 896, elements: !189)
!189 = !{!190, !194, !202, !213, !219, !230, !241, !246}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !188, file: !181, line: 71, baseType: !191, size: 896)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 896, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 28)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !188, file: !181, line: 78, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 74, size: 64, elements: !196)
!196 = !{!197, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !195, file: !181, line: 76, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !199, line: 142, baseType: !13)
!199 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !195, file: !181, line: 77, baseType: !201, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !199, line: 134, baseType: !122)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !188, file: !181, line: 86, baseType: !203, size: 128)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 81, size: 128, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !203, file: !181, line: 83, baseType: !13, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !203, file: !181, line: 84, baseType: !13, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !203, file: !181, line: 85, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !181, line: 36, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !181, line: 32, size: 64, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !209, file: !181, line: 34, baseType: !13, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !209, file: !181, line: 35, baseType: !96, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !188, file: !181, line: 94, baseType: !214, size: 128)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 89, size: 128, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !214, file: !181, line: 91, baseType: !198, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !214, file: !181, line: 92, baseType: !201, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !214, file: !181, line: 93, baseType: !208, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !188, file: !181, line: 104, baseType: !220, size: 256)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 97, size: 256, elements: !221)
!221 = !{!222, !223, !224, !225, !229}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !220, file: !181, line: 99, baseType: !198, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !220, file: !181, line: 100, baseType: !201, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !220, file: !181, line: 101, baseType: !13, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !220, file: !181, line: 102, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !181, line: 58, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !199, line: 144, baseType: !228)
!228 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !220, file: !181, line: 103, baseType: !226, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !188, file: !181, line: 116, baseType: !231, size: 256)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 107, size: 256, elements: !232)
!232 = !{!233, !234, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !231, file: !181, line: 109, baseType: !96, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !231, file: !181, line: 110, baseType: !235, size: 16, offset: 64)
!235 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !231, file: !181, line: 115, baseType: !237, size: 128, offset: 128)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !181, line: 111, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !237, file: !181, line: 113, baseType: !96, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !237, file: !181, line: 114, baseType: !96, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !188, file: !181, line: 123, baseType: !242, size: 128)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 119, size: 128, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !242, file: !181, line: 121, baseType: !228, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !242, file: !181, line: 122, baseType: !13, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !188, file: !181, line: 131, baseType: !247, size: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !181, line: 126, size: 128, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !247, file: !181, line: 128, baseType: !96, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !247, file: !181, line: 129, baseType: !13, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !247, file: !181, line: 130, baseType: !122, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !163, file: !164, line: 43, baseType: !253, size: 1024, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !254, line: 30, baseType: !255)
!254 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 27, size: 1024, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !255, file: !254, line: 29, baseType: !258, size: 1024)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !163, file: !164, line: 46, baseType: !13, size: 32, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !163, file: !164, line: 49, baseType: !263, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null}
!266 = !DILocalVariable(name: "oi", scope: !267, file: !3, line: 4312, type: !13)
!267 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4307, column: 5)
!268 = !DILocalVariable(name: "minus_pos_usage", scope: !269, file: !3, line: 4335, type: !34)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 4334, column: 13)
!270 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4333, column: 15)
!271 = distinct !DILexicalBlock(scope: !272, file: !3, line: 4330, column: 9)
!272 = distinct !DILexicalBlock(scope: !267, file: !3, line: 4314, column: 11)
!273 = !DILocalVariable(name: "optarg1", scope: !274, file: !3, line: 4354, type: !36)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 4353, column: 25)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 4352, column: 27)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4351, column: 21)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 4348, column: 23)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 4339, column: 17)
!279 = distinct !DILexicalBlock(scope: !269, file: !3, line: 4338, column: 19)
!280 = !DILocalVariable(name: "str", scope: !281, file: !3, line: 4402, type: !282)
!281 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4401, column: 11)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 16, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !DILocalVariable(name: "__s1_len", scope: !286, file: !3, line: 4422, type: !25)
!286 = distinct !DILexicalBlock(scope: !287, file: !3, line: 4422, column: 36)
!287 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4422, column: 15)
!288 = !DILocalVariable(name: "__s2_len", scope: !286, file: !3, line: 4422, type: !25)
!289 = !DILocalVariable(name: "__s1_len", scope: !290, file: !3, line: 4495, type: !25)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 4495, column: 27)
!291 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4495, column: 15)
!292 = !DILocalVariable(name: "__s2_len", scope: !290, file: !3, line: 4495, type: !25)
!293 = !DILocalVariable(name: "__s1_len", scope: !294, file: !3, line: 4501, type: !25)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 4501, column: 33)
!295 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4501, column: 15)
!296 = !DILocalVariable(name: "__s2_len", scope: !294, file: !3, line: 4501, type: !25)
!297 = !DILocalVariable(name: "newtab", scope: !298, file: !3, line: 4516, type: !16)
!298 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4515, column: 11)
!299 = !DILocalVariable(name: "__s1_len", scope: !300, file: !3, line: 4521, type: !25)
!300 = distinct !DILexicalBlock(scope: !301, file: !3, line: 4521, column: 21)
!301 = distinct !DILexicalBlock(scope: !302, file: !3, line: 4521, column: 21)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 4520, column: 15)
!303 = distinct !DILexicalBlock(scope: !298, file: !3, line: 4519, column: 17)
!304 = !DILocalVariable(name: "__s2_len", scope: !300, file: !3, line: 4521, type: !25)
!305 = !DILocalVariable(name: "__s2", scope: !306, file: !3, line: 4521, type: !307)
!306 = distinct !DILexicalBlock(scope: !300, file: !3, line: 4521, column: 21)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!310 = !DILocalVariable(name: "__result", scope: !306, file: !3, line: 4521, type: !13)
!311 = !DILocalVariable(name: "p", scope: !312, file: !3, line: 4564, type: !36)
!312 = distinct !DILexicalBlock(scope: !313, file: !3, line: 4563, column: 13)
!313 = distinct !DILexicalBlock(scope: !271, file: !3, line: 4562, column: 15)
!314 = !DILocalVariable(name: "stream", scope: !315, file: !3, line: 4586, type: !317)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 4585, column: 5)
!316 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4584, column: 7)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !319, line: 49, baseType: !320)
!319 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !321, line: 241, size: 1728, elements: !322)
!321 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !343, !344, !345, !346, !348, !350, !352, !356, !359, !361, !362, !363, !364, !365, !366, !367}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !320, file: !321, line: 242, baseType: !13, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !320, file: !321, line: 247, baseType: !15, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !320, file: !321, line: 248, baseType: !15, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !320, file: !321, line: 249, baseType: !15, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !320, file: !321, line: 250, baseType: !15, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !320, file: !321, line: 251, baseType: !15, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !320, file: !321, line: 252, baseType: !15, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !320, file: !321, line: 253, baseType: !15, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !320, file: !321, line: 254, baseType: !15, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !320, file: !321, line: 256, baseType: !15, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !320, file: !321, line: 257, baseType: !15, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !320, file: !321, line: 258, baseType: !15, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !320, file: !321, line: 260, baseType: !336, size: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !321, line: 156, size: 192, elements: !338)
!338 = !{!339, !340, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !337, file: !321, line: 157, baseType: !336, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !337, file: !321, line: 158, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !337, file: !321, line: 162, baseType: !13, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !320, file: !321, line: 262, baseType: !341, size: 64, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !320, file: !321, line: 264, baseType: !13, size: 32, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !320, file: !321, line: 268, baseType: !13, size: 32, offset: 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !320, file: !321, line: 270, baseType: !347, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !199, line: 140, baseType: !228)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !320, file: !321, line: 274, baseType: !349, size: 16, offset: 1024)
!349 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !320, file: !321, line: 275, baseType: !351, size: 8, offset: 1040)
!351 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !320, file: !321, line: 276, baseType: !353, size: 8, offset: 1048)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 1)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !320, file: !321, line: 280, baseType: !357, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !321, line: 150, baseType: null)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !320, file: !321, line: 289, baseType: !360, size: 64, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !199, line: 141, baseType: !228)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !320, file: !321, line: 297, baseType: !96, size: 64, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !320, file: !321, line: 298, baseType: !96, size: 64, offset: 1280)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !320, file: !321, line: 299, baseType: !96, size: 64, offset: 1344)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !320, file: !321, line: 300, baseType: !96, size: 64, offset: 1408)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !320, file: !321, line: 302, baseType: !25, size: 64, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !320, file: !321, line: 303, baseType: !13, size: 32, offset: 1536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !320, file: !321, line: 305, baseType: !368, size: 160, offset: 1568)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 20)
!371 = !DILocalVariable(name: "__s1_len", scope: !372, file: !3, line: 4598, type: !25)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 4598, column: 11)
!373 = distinct !DILexicalBlock(scope: !315, file: !3, line: 4598, column: 11)
!374 = !DILocalVariable(name: "__s2_len", scope: !372, file: !3, line: 4598, type: !25)
!375 = !DILocalVariable(name: "__s2", scope: !376, file: !3, line: 4598, type: !307)
!376 = distinct !DILexicalBlock(scope: !372, file: !3, line: 4598, column: 11)
!377 = !DILocalVariable(name: "__result", scope: !376, file: !3, line: 4598, type: !13)
!378 = !DILocalVariable(name: "i", scope: !379, file: !3, line: 4616, type: !25)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 4615, column: 9)
!380 = distinct !DILexicalBlock(scope: !315, file: !3, line: 4614, column: 11)
!381 = !DILocalVariable(name: "__s1_len", scope: !382, file: !3, line: 4622, type: !25)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 4622, column: 19)
!383 = distinct !DILexicalBlock(scope: !384, file: !3, line: 4622, column: 19)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 4621, column: 13)
!385 = distinct !DILexicalBlock(scope: !386, file: !3, line: 4620, column: 11)
!386 = distinct !DILexicalBlock(scope: !379, file: !3, line: 4620, column: 11)
!387 = !DILocalVariable(name: "__s2_len", scope: !382, file: !3, line: 4622, type: !25)
!388 = !DILocalVariable(name: "__s2", scope: !389, file: !3, line: 4622, type: !307)
!389 = distinct !DILexicalBlock(scope: !382, file: !3, line: 4622, column: 19)
!390 = !DILocalVariable(name: "__result", scope: !389, file: !3, line: 4622, type: !13)
!391 = !DILocalVariable(name: "file_number", scope: !392, file: !3, line: 4631, type: !27)
!392 = distinct !DILexicalBlock(scope: !393, file: !3, line: 4627, column: 17)
!393 = distinct !DILexicalBlock(scope: !383, file: !3, line: 4626, column: 24)
!394 = !DILocalVariable(name: "tmp_dir", scope: !395, file: !3, line: 4706, type: !36)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 4705, column: 5)
!396 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4704, column: 7)
!397 = !DILocalVariable(name: "sortfiles", scope: !398, file: !3, line: 4749, type: !400)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 4748, column: 5)
!399 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4747, column: 7)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !3, line: 677, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !3, line: 680, baseType: !36, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !401, file: !3, line: 683, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !3, line: 666, size: 128, elements: !407)
!407 = !{!408, !410, !413, !414}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !3, line: 668, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !405)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !406, file: !3, line: 669, baseType: !411, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !412, line: 38, baseType: !198)
!412 = !DIFile(filename: "/usr/include/sched.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!413 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !406, file: !3, line: 670, baseType: !16, size: 8, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !3, line: 671, baseType: !85, offset: 104)
!415 = !DILocalVariable(name: "i", scope: !398, file: !3, line: 4750, type: !25)
!416 = !DILocalVariable(name: "np", scope: !417, file: !3, line: 4762, type: !27)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 4761, column: 9)
!418 = distinct !DILexicalBlock(scope: !419, file: !3, line: 4760, column: 11)
!419 = distinct !DILexicalBlock(scope: !399, file: !3, line: 4759, column: 5)
!420 = !DILocalVariable(name: "nthreads_max", scope: !419, file: !3, line: 4767, type: !25)
!421 = !{!422}
!422 = !DIEnumerator(name: "nsigs", value: 11)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !3, line: 177, size: 32, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIEnumerator(name: "bl_start", value: 0)
!426 = !DIEnumerator(name: "bl_end", value: 1)
!427 = !DIEnumerator(name: "bl_both", value: 2)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 350, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIEnumerator(name: "TAB_DEFAULT", value: 128)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !432, line: 32, size: 32, elements: !433)
!432 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!434 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!435 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!436 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!437 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!438 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!439 = !DIEnumerator(name: "c_quoting_style", value: 5)
!440 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!441 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!442 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!443 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!444 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nproc_query", file: !446, line: 32, size: 32, elements: !447)
!446 = !DIFile(filename: "./lib/nproc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !{!448, !449, !450}
!448 = !DIEnumerator(name: "NPROC_ALL", value: 0)
!449 = !DIEnumerator(name: "NPROC_CURRENT", value: 1)
!450 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 125, size: 32, elements: !452)
!452 = !{!453}
!453 = !DIEnumerator(name: "DEFAULT_MAX_THREADS", value: 8)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 46, size: 32, elements: !456)
!455 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!457 = !DIEnumerator(name: "_ISupper", value: 256)
!458 = !DIEnumerator(name: "_ISlower", value: 512)
!459 = !DIEnumerator(name: "_ISalpha", value: 1024)
!460 = !DIEnumerator(name: "_ISdigit", value: 2048)
!461 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!462 = !DIEnumerator(name: "_ISspace", value: 8192)
!463 = !DIEnumerator(name: "_ISprint", value: 16384)
!464 = !DIEnumerator(name: "_ISgraph", value: 32768)
!465 = !DIEnumerator(name: "_ISblank", value: 1)
!466 = !DIEnumerator(name: "_IScntrl", value: 2)
!467 = !DIEnumerator(name: "_ISpunct", value: 4)
!468 = !DIEnumerator(name: "_ISalnum", value: 8)
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 41, size: 32, elements: !471)
!470 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!472 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!473 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!474 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!475 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!476 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!477 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!478 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!479 = !DIEnumerator(name: "DAY_1", value: 131079)
!480 = !DIEnumerator(name: "DAY_2", value: 131080)
!481 = !DIEnumerator(name: "DAY_3", value: 131081)
!482 = !DIEnumerator(name: "DAY_4", value: 131082)
!483 = !DIEnumerator(name: "DAY_5", value: 131083)
!484 = !DIEnumerator(name: "DAY_6", value: 131084)
!485 = !DIEnumerator(name: "DAY_7", value: 131085)
!486 = !DIEnumerator(name: "ABMON_1", value: 131086)
!487 = !DIEnumerator(name: "ABMON_2", value: 131087)
!488 = !DIEnumerator(name: "ABMON_3", value: 131088)
!489 = !DIEnumerator(name: "ABMON_4", value: 131089)
!490 = !DIEnumerator(name: "ABMON_5", value: 131090)
!491 = !DIEnumerator(name: "ABMON_6", value: 131091)
!492 = !DIEnumerator(name: "ABMON_7", value: 131092)
!493 = !DIEnumerator(name: "ABMON_8", value: 131093)
!494 = !DIEnumerator(name: "ABMON_9", value: 131094)
!495 = !DIEnumerator(name: "ABMON_10", value: 131095)
!496 = !DIEnumerator(name: "ABMON_11", value: 131096)
!497 = !DIEnumerator(name: "ABMON_12", value: 131097)
!498 = !DIEnumerator(name: "MON_1", value: 131098)
!499 = !DIEnumerator(name: "MON_2", value: 131099)
!500 = !DIEnumerator(name: "MON_3", value: 131100)
!501 = !DIEnumerator(name: "MON_4", value: 131101)
!502 = !DIEnumerator(name: "MON_5", value: 131102)
!503 = !DIEnumerator(name: "MON_6", value: 131103)
!504 = !DIEnumerator(name: "MON_7", value: 131104)
!505 = !DIEnumerator(name: "MON_8", value: 131105)
!506 = !DIEnumerator(name: "MON_9", value: 131106)
!507 = !DIEnumerator(name: "MON_10", value: 131107)
!508 = !DIEnumerator(name: "MON_11", value: 131108)
!509 = !DIEnumerator(name: "MON_12", value: 131109)
!510 = !DIEnumerator(name: "AM_STR", value: 131110)
!511 = !DIEnumerator(name: "PM_STR", value: 131111)
!512 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!513 = !DIEnumerator(name: "D_FMT", value: 131113)
!514 = !DIEnumerator(name: "T_FMT", value: 131114)
!515 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!516 = !DIEnumerator(name: "ERA", value: 131116)
!517 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!518 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!519 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!520 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!521 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!522 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!523 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!524 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!525 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!526 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!527 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!528 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!529 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!530 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!531 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!532 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!533 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!534 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!535 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!536 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!537 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!538 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!539 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!540 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!541 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!542 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!543 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!544 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!545 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!546 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!547 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!548 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!549 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!550 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!551 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!552 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!553 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!554 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!555 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!556 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!557 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!558 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!559 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!560 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!561 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!562 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!563 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!564 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!565 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!566 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!567 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!568 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!569 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!570 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!571 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!572 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!573 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!574 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!575 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!576 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!577 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!578 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!579 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!580 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!581 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!582 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!583 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!584 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!585 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!586 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!587 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!588 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!589 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!590 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!591 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!592 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!593 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!594 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!595 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!596 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!597 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!598 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!599 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!600 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!601 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!602 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!603 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!604 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!605 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!606 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!607 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!608 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!609 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!610 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!611 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!612 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!613 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!614 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!615 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!616 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!617 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!618 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!619 = !DIEnumerator(name: "CODESET", value: 14)
!620 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!621 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!622 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!623 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!629 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!630 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!631 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!632 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!633 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!634 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!635 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!636 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!637 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!638 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!639 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!640 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!646 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!647 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!649 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!650 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!651 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!652 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!653 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!654 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!655 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!656 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!657 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!658 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!659 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!660 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!661 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!662 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!666 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!667 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!668 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!669 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!670 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!671 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!672 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!673 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!674 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!675 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!676 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!677 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!678 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!679 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!680 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!681 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!682 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!683 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!684 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!685 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!686 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!687 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!688 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!689 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!690 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!691 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!692 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!693 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!694 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!695 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!696 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!697 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!698 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!699 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!700 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!701 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!702 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!703 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!704 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!705 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!706 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!707 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!708 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!709 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!710 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!711 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!712 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!713 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!714 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!715 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!717 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!718 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!719 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!720 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!721 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!722 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!723 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!724 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!725 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!726 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!727 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!728 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!729 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!730 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!731 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!732 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!734 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!735 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!736 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!737 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!738 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!739 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!740 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!741 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!742 = !DIEnumerator(name: "THOUSEP", value: 65537)
!743 = !DIEnumerator(name: "__GROUPING", value: 65538)
!744 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!745 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!746 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!747 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!748 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!749 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!750 = !DIEnumerator(name: "__YESSTR", value: 327682)
!751 = !DIEnumerator(name: "__NOSTR", value: 327683)
!752 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!753 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!754 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!755 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!756 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!757 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!758 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!759 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!760 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!761 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!762 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!763 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!764 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!765 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!766 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!767 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!768 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!769 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!770 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!771 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!772 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!773 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!774 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!775 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!776 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!777 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!778 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!779 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!780 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!781 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!782 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!783 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!784 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!785 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!786 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!787 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!788 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!789 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!790 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!791 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!792 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!793 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!794 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!795 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!796 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!797 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!798 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!799 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!800 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!801 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!802 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!803 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!804 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!805 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!806 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !808, line: 26, size: 32, elements: !809)
!808 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!811 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!812 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!813 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!814 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !816, line: 31, size: 32, elements: !817)
!816 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836}
!818 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!819 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!820 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!821 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!822 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!823 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!824 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!825 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!826 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!827 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!828 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!829 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!830 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!831 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!832 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!833 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!834 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!835 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!836 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!837 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !839, file: !838, line: 192, size: 32, elements: !847)
!838 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!839 = distinct !DISubprogram(name: "x2nrealloc", scope: !838, file: !838, line: 180, type: !840, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!96, !96, !72, !25}
!842 = !{!843, !844, !845, !846}
!843 = !DILocalVariable(name: "p", arg: 1, scope: !839, file: !838, line: 180, type: !96)
!844 = !DILocalVariable(name: "pn", arg: 2, scope: !839, file: !838, line: 180, type: !72)
!845 = !DILocalVariable(name: "s", arg: 3, scope: !839, file: !838, line: 180, type: !25)
!846 = !DILocalVariable(name: "n", scope: !839, file: !838, line: 182, type: !25)
!847 = !{!848}
!848 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !851, file: !850, line: 187, size: 32, elements: !859)
!850 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!851 = distinct !DISubprogram(name: "select_plural", scope: !850, file: !850, line: 183, type: !852, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !857)
!852 = !DISubroutineType(types: !853)
!853 = !{!27, !854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !855, line: 136, baseType: !856)
!855 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !199, line: 62, baseType: !27)
!857 = !{!858}
!858 = !DILocalVariable(name: "n", arg: 1, scope: !851, file: !850, line: 183, type: !854)
!859 = !{!860}
!860 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 45, size: 32, elements: !863)
!862 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!863 = !{!864, !865, !866, !867, !868, !869}
!864 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!865 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!866 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!867 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!868 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!869 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 663, size: 32, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIEnumerator(name: "UNCOMPRESSED", value: 0)
!873 = !DIEnumerator(name: "UNREAPED", value: 1)
!874 = !DIEnumerator(name: "REAPED", value: 2)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 139, size: 32, elements: !876)
!876 = !{!877, !878}
!877 = !DIEnumerator(name: "MAX_FORK_TRIES_COMPRESS", value: 4)
!878 = !DIEnumerator(name: "MAX_FORK_TRIES_DECOMPRESS", value: 9)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 689, size: 32, elements: !880)
!880 = !{!881}
!881 = !DIEnumerator(name: "INIT_PROCTAB_SIZE", value: 47)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 153, size: 32, elements: !883)
!883 = !{!884, !885}
!884 = !DIEnumerator(name: "MERGE_END", value: 0)
!885 = !DIEnumerator(name: "MERGE_ROOT", value: 1)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 120, size: 32, elements: !887)
!887 = !{!888}
!888 = !DIEnumerator(name: "SUBTHREAD_LINES_HEURISTIC", value: 131072)
!889 = !{!96, !170, !122, !36, !25, !890, !307, !15, !13, !349, !309}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!892 = !{!893, !899, !904, !909, !911, !0, !913, !915, !917, !919, !921, !923, !925, !927, !929, !931, !933, !937, !966, !971, !973, !975, !978, !987, !989, !994, !1006, !1011, !1015, !1018, !1023, !1025, !1027, !1030, !1032, !1049, !1051, !1053, !1056, !1062, !1064, !1067, !1087, !1089, !1155}
!893 = !DIGlobalVariableExpression(var: !894)
!894 = distinct !DIGlobalVariable(name: "sig", scope: !10, file: !3, line: 4247, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 352, elements: !897)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!897 = !{!898}
!898 = !DISubrange(count: 11)
!899 = !DIGlobalVariableExpression(var: !900)
!900 = distinct !DIGlobalVariable(name: "opts", scope: !10, file: !3, line: 4677, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 80, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 10)
!904 = !DIGlobalVariableExpression(var: !905)
!905 = distinct !DIGlobalVariable(name: "opts", scope: !10, file: !3, line: 4731, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 3)
!909 = !DIGlobalVariableExpression(var: !910)
!910 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 163, type: !13, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912)
!912 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !2, file: !3, line: 166, type: !13, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914)
!914 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !2, file: !3, line: 171, type: !34, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916)
!916 = distinct !DIGlobalVariable(name: "sort_size", scope: !2, file: !3, line: 323, type: !25, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918)
!918 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !2, file: !3, line: 336, type: !25, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920)
!920 = distinct !DIGlobalVariable(name: "reverse", scope: !2, file: !3, line: 342, type: !34, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922)
!922 = distinct !DIGlobalVariable(name: "stable", scope: !2, file: !3, line: 347, type: !34, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924)
!924 = distinct !DIGlobalVariable(name: "unique", scope: !2, file: !3, line: 359, type: !34, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926)
!926 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 362, type: !34, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928)
!928 = distinct !DIGlobalVariable(name: "keylist", scope: !2, file: !3, line: 365, type: !21, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930)
!930 = distinct !DIGlobalVariable(name: "compress_program", scope: !2, file: !3, line: 368, type: !36, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932)
!932 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 371, type: !34, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934)
!934 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 631, type: !935, isLocal: true, isDefinition: true)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !936, line: 37, baseType: !253)
!936 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!937 = !DIGlobalVariableExpression(var: !938)
!938 = distinct !DIGlobalVariable(name: "infomap", scope: !939, file: !850, line: 632, type: !963, isLocal: true, isDefinition: true)
!939 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !850, file: !850, line: 630, type: !940, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !942)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !36}
!942 = !{!943, !944, !945, !952, !954, !955, !956, !959, !960, !962}
!943 = !DILocalVariable(name: "program", arg: 1, scope: !939, file: !850, line: 630, type: !36)
!944 = !DILocalVariable(name: "node", scope: !939, file: !850, line: 642, type: !36)
!945 = !DILocalVariable(name: "map_prog", scope: !939, file: !850, line: 643, type: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !939, file: !850, line: 632, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !948, file: !850, line: 632, baseType: !36, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !948, file: !850, line: 632, baseType: !36, size: 64, offset: 64)
!952 = !DILocalVariable(name: "__s1_len", scope: !953, file: !850, line: 645, type: !25)
!953 = distinct !DILexicalBlock(scope: !939, file: !850, line: 645, column: 33)
!954 = !DILocalVariable(name: "__s2_len", scope: !953, file: !850, line: 645, type: !25)
!955 = !DILocalVariable(name: "lc_messages", scope: !939, file: !850, line: 655, type: !36)
!956 = !DILocalVariable(name: "__s1_len", scope: !957, file: !850, line: 656, type: !25)
!957 = distinct !DILexicalBlock(scope: !958, file: !850, line: 656, column: 22)
!958 = distinct !DILexicalBlock(scope: !939, file: !850, line: 656, column: 7)
!959 = !DILocalVariable(name: "__s2_len", scope: !957, file: !850, line: 656, type: !25)
!960 = !DILocalVariable(name: "__s2", scope: !961, file: !850, line: 656, type: !307)
!961 = distinct !DILexicalBlock(scope: !957, file: !850, line: 656, column: 22)
!962 = !DILocalVariable(name: "__result", scope: !961, file: !850, line: 656, type: !13)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 896, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 7)
!966 = !DIGlobalVariableExpression(var: !967)
!967 = distinct !DIGlobalVariable(name: "blanks", scope: !2, file: !3, line: 276, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 256)
!971 = !DIGlobalVariableExpression(var: !972)
!972 = distinct !DIGlobalVariable(name: "nonprinting", scope: !2, file: !3, line: 279, type: !968, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974)
!974 = distinct !DIGlobalVariable(name: "nondictionary", scope: !2, file: !3, line: 282, type: !968, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976)
!976 = distinct !DIGlobalVariable(name: "fold_toupper", scope: !2, file: !3, line: 285, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !969)
!978 = !DIGlobalVariableExpression(var: !979)
!979 = distinct !DIGlobalVariable(name: "monthtab", scope: !2, file: !3, line: 291, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 1536, elements: !985)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "month", file: !3, line: 233, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !3, line: 235, baseType: !36, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !981, file: !3, line: 236, baseType: !13, size: 32, offset: 64)
!985 = !{!986}
!986 = !DISubrange(count: 12)
!987 = !DIGlobalVariableExpression(var: !988)
!988 = distinct !DIGlobalVariable(name: "temphead", scope: !2, file: !3, line: 673, type: !409, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990)
!990 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 554, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 248, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 31)
!994 = !DIGlobalVariableExpression(var: !995)
!995 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 556, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 7936, elements: !992)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !999, line: 104, size: 256, elements: !1000)
!999 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1000 = !{!1001, !1002, !1003, !1005}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !999, line: 106, baseType: !36, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !998, file: !999, line: 109, baseType: !13, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !998, file: !999, line: 110, baseType: !1004, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !998, file: !999, line: 111, baseType: !13, size: 32, offset: 192)
!1006 = !DIGlobalVariableExpression(var: !1007)
!1007 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 623, type: !1008, isLocal: true, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 48, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 6)
!1011 = !DIGlobalVariableExpression(var: !1012)
!1012 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 617, type: !1013, isLocal: true, isDefinition: true)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 448, elements: !964)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!1015 = !DIGlobalVariableExpression(var: !1016)
!1016 = distinct !DIGlobalVariable(name: "check_types", scope: !2, file: !3, line: 602, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, elements: !907)
!1018 = !DIGlobalVariableExpression(var: !1019)
!1019 = distinct !DIGlobalVariable(name: "check_args", scope: !2, file: !3, line: 596, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 256, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 4)
!1023 = !DIGlobalVariableExpression(var: !1024)
!1024 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 355, type: !13, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026)
!1026 = distinct !DIGlobalVariable(name: "temp_dir_alloc", scope: !2, file: !3, line: 339, type: !25, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028)
!1028 = distinct !DIGlobalVariable(name: "temp_dirs", scope: !2, file: !3, line: 333, type: !1029, isLocal: true, isDefinition: true)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!1030 = !DIGlobalVariableExpression(var: !1031)
!1031 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 180, type: !16, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033)
!1033 = distinct !DIGlobalVariable(name: "random_md5_state", scope: !2, file: !3, line: 2077, type: !1034, isLocal: true, isDefinition: true)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !1035, line: 69, size: 1248, elements: !1036)
!1035 = !DIFile(filename: "./lib/md5.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1036 = !{!1037, !1039, !1040, !1041, !1042, !1044, !1045}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !1034, file: !1035, line: 71, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !855, line: 53, baseType: !122)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !1034, file: !1035, line: 72, baseType: !1038, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !1034, file: !1035, line: 73, baseType: !1038, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !1034, file: !1035, line: 74, baseType: !1038, size: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1034, file: !1035, line: 76, baseType: !1043, size: 64, offset: 128)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 64, elements: !283)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1034, file: !1035, line: 77, baseType: !1038, size: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1034, file: !1035, line: 78, baseType: !1046, size: 1024, offset: 224)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 1024, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 32)
!1049 = !DIGlobalVariableExpression(var: !1050)
!1050 = distinct !DIGlobalVariable(name: "nmerge", scope: !2, file: !3, line: 375, type: !122, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052)
!1052 = distinct !DIGlobalVariable(name: "merge_buffer_size", scope: !2, file: !3, line: 319, type: !25, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054)
!1054 = distinct !DIGlobalVariable(name: "unit_order", scope: !2, file: !3, line: 1861, type: !1055, isLocal: true, isDefinition: true)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !969)
!1056 = !DIGlobalVariableExpression(var: !1057)
!1057 = distinct !DIGlobalVariable(name: "proctab", scope: !2, file: !3, line: 687, type: !1058, isLocal: true, isDefinition: true)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1060, line: 69, baseType: !1061)
!1060 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1060, line: 67, flags: DIFlagFwdDecl)
!1062 = !DIGlobalVariableExpression(var: !1063)
!1063 = distinct !DIGlobalVariable(name: "nprocs", scope: !2, file: !3, line: 707, type: !411, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065)
!1065 = distinct !DIGlobalVariable(name: "temptail", scope: !2, file: !3, line: 674, type: !1066, isLocal: true, isDefinition: true)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!1067 = !DIGlobalVariableExpression(var: !1068)
!1068 = distinct !DIGlobalVariable(name: "slashbase", scope: !1069, file: !3, line: 852, type: !1086, isLocal: true, isDefinition: true)
!1069 = distinct !DISubprogram(name: "create_temp_file", scope: !3, file: !3, line: 850, type: !1070, isLocal: true, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1072)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!405, !1004, !34}
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1073 = !DILocalVariable(name: "pfd", arg: 1, scope: !1069, file: !3, line: 850, type: !1004)
!1074 = !DILocalVariable(name: "survive_fd_exhaustion", arg: 2, scope: !1069, file: !3, line: 850, type: !34)
!1075 = !DILocalVariable(name: "fd", scope: !1069, file: !3, line: 854, type: !13)
!1076 = !DILocalVariable(name: "saved_errno", scope: !1069, file: !3, line: 855, type: !13)
!1077 = !DILocalVariable(name: "temp_dir", scope: !1069, file: !3, line: 856, type: !36)
!1078 = !DILocalVariable(name: "len", scope: !1069, file: !3, line: 857, type: !25)
!1079 = !DILocalVariable(name: "node", scope: !1069, file: !3, line: 858, type: !405)
!1080 = !DILocalVariable(name: "file", scope: !1069, file: !3, line: 860, type: !15)
!1081 = !DILocalVariable(name: "cs", scope: !1069, file: !3, line: 861, type: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cs_status", file: !3, line: 634, size: 1088, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1082, file: !3, line: 636, baseType: !34, size: 8)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sigs", scope: !1082, file: !3, line: 637, baseType: !935, size: 1024, offset: 64)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !985)
!1087 = !DIGlobalVariableExpression(var: !1088)
!1088 = distinct !DIGlobalVariable(name: "temp_dir_index", scope: !1069, file: !3, line: 853, type: !25, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090)
!1090 = distinct !DIGlobalVariable(name: "size_bound", scope: !1091, file: !3, line: 1505, type: !25, isLocal: true, isDefinition: true)
!1091 = distinct !DISubprogram(name: "sort_buffer_size", scope: !3, file: !3, line: 1499, type: !1092, isLocal: true, isDefinition: true, scopeLine: 1502, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1098)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!25, !1094, !25, !1096, !25, !25}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1144, !1147, !1148, !1151, !1152, !1154}
!1099 = !DILocalVariable(name: "fps", arg: 1, scope: !1091, file: !3, line: 1499, type: !1094)
!1100 = !DILocalVariable(name: "nfps", arg: 2, scope: !1091, file: !3, line: 1499, type: !25)
!1101 = !DILocalVariable(name: "files", arg: 3, scope: !1091, file: !3, line: 1500, type: !1096)
!1102 = !DILocalVariable(name: "nfiles", arg: 4, scope: !1091, file: !3, line: 1500, type: !25)
!1103 = !DILocalVariable(name: "line_bytes", arg: 5, scope: !1091, file: !3, line: 1501, type: !25)
!1104 = !DILocalVariable(name: "worst_case_per_input_byte", scope: !1091, file: !3, line: 1508, type: !25)
!1105 = !DILocalVariable(name: "size", scope: !1091, file: !3, line: 1512, type: !25)
!1106 = !DILocalVariable(name: "i", scope: !1091, file: !3, line: 1514, type: !25)
!1107 = !DILocalVariable(name: "st", scope: !1108, file: !3, line: 1518, type: !1111)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 1517, column: 5)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 1516, column: 3)
!1110 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 1516, column: 3)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1112, line: 46, size: 1152, elements: !1113)
!1112 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1113 = !{!1114, !1116, !1118, !1120, !1122, !1123, !1125, !1126, !1127, !1128, !1130, !1132, !1140, !1141, !1142}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1111, file: !1112, line: 48, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !199, line: 133, baseType: !27)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1111, file: !1112, line: 53, baseType: !1117, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !199, line: 136, baseType: !27)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1111, file: !1112, line: 61, baseType: !1119, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !199, line: 139, baseType: !27)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1111, file: !1112, line: 62, baseType: !1121, size: 32, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !199, line: 138, baseType: !122)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1111, file: !1112, line: 64, baseType: !201, size: 32, offset: 224)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1111, file: !1112, line: 65, baseType: !1124, size: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !199, line: 135, baseType: !122)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1111, file: !1112, line: 67, baseType: !13, size: 32, offset: 288)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1111, file: !1112, line: 69, baseType: !1115, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1111, file: !1112, line: 74, baseType: !347, size: 64, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1111, file: !1112, line: 78, baseType: !1129, size: 64, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !199, line: 162, baseType: !228)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1111, file: !1112, line: 80, baseType: !1131, size: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !199, line: 167, baseType: !228)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1111, file: !1112, line: 91, baseType: !1133, size: 128, offset: 576)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1134, line: 8, size: 128, elements: !1135)
!1134 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1135 = !{!1136, !1138}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1133, file: !1134, line: 10, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !199, line: 148, baseType: !228)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1133, file: !1134, line: 11, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !199, line: 184, baseType: !228)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1111, file: !1112, line: 92, baseType: !1133, size: 128, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1111, file: !1112, line: 93, baseType: !1133, size: 128, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1111, file: !1112, line: 106, baseType: !1143, size: 192, offset: 960)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 192, elements: !907)
!1144 = !DILocalVariable(name: "file_size", scope: !1108, file: !3, line: 1519, type: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1146, line: 86, baseType: !347)
!1146 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1147 = !DILocalVariable(name: "worst_case", scope: !1108, file: !3, line: 1520, type: !25)
!1148 = !DILocalVariable(name: "__s1_len", scope: !1149, file: !3, line: 1523, type: !25)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 1523, column: 14)
!1150 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 1522, column: 11)
!1151 = !DILocalVariable(name: "__s2_len", scope: !1149, file: !3, line: 1523, type: !25)
!1152 = !DILocalVariable(name: "__s2", scope: !1153, file: !3, line: 1523, type: !307)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 1523, column: 14)
!1154 = !DILocalVariable(name: "__result", scope: !1153, file: !3, line: 1523, type: !13)
!1155 = !DIGlobalVariableExpression(var: !1156)
!1156 = distinct !DIGlobalVariable(name: "saved_line", scope: !2, file: !3, line: 267, type: !1157, isLocal: true, isDefinition: true)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 183, size: 256, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162}
