; ModuleID = 'coreutils-8.27/src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.File_spec = type { i8*, i64, %struct.timespec, i64, i64, i32, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.fd_set = type { [16 x i64] }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.charbuffer = type { [8192 x i8], i64, %struct.charbuffer* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !29, line: 26, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!32 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!33 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!34 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!35 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!36 = !{!37, !40, !42, !45, !48, !49, !50, !55, !56, !60, !63, !54}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 62, baseType: !39)
!38 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!39 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !51, line: 98, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !53, line: 142, baseType: !54)
!53 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !57, line: 91, baseType: !58)
!57 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 140, baseType: !59)
!59 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !61, line: 8, baseType: !62)
!61 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !53, line: 148, baseType: !59)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !64, line: 54, baseType: !59)
!64 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!65 = !{!66, !0, !136, !138, !140, !142, !144, !146, !148, !178, !192, !194, !200, !206, !208, !210, !212, !214}
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !68, file: !3, line: 2290, type: !55, isLocal: true, isDefinition: true)
!68 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2235, type: !69, isLocal: false, isDefinition: true, scopeLine: 2236, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !72)
!69 = !DISubroutineType(types: !70)
!70 = !{!54, !54, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!72 = !{!73, !74, !75, !76, !78, !82, !83, !84, !116, !117, !118, !120, !122, !127, !128, !130, !131}
!73 = !DILocalVariable(name: "argc", arg: 1, scope: !68, file: !3, line: 2235, type: !54)
!74 = !DILocalVariable(name: "argv", arg: 2, scope: !68, file: !3, line: 2235, type: !71)
!75 = !DILocalVariable(name: "header_mode", scope: !68, file: !3, line: 2237, type: !5)
!76 = !DILocalVariable(name: "ok", scope: !68, file: !3, line: 2238, type: !77)
!77 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!78 = !DILocalVariable(name: "n_units", scope: !68, file: !3, line: 2242, type: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !80, line: 136, baseType: !81)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !53, line: 62, baseType: !39)
!82 = !DILocalVariable(name: "n_files", scope: !68, file: !3, line: 2243, type: !37)
!83 = !DILocalVariable(name: "file", scope: !68, file: !3, line: 2244, type: !71)
!84 = !DILocalVariable(name: "F", scope: !68, file: !3, line: 2245, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !3, line: 114, size: 768, elements: !87)
!87 = !{!88, !89, !90, !97, !100, !103, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !3, line: 117, baseType: !55, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !86, file: !3, line: 120, baseType: !56, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !86, file: !3, line: 121, baseType: !91, size: 128, offset: 128)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !92, line: 8, size: 128, elements: !93)
!92 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !91, file: !92, line: 10, baseType: !62, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !91, file: !92, line: 11, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !53, line: 184, baseType: !59)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !86, file: !3, line: 122, baseType: !98, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !51, line: 60, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !53, line: 133, baseType: !39)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !86, file: !3, line: 123, baseType: !101, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !51, line: 48, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !53, line: 136, baseType: !39)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !86, file: !3, line: 124, baseType: !104, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !51, line: 70, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !53, line: 138, baseType: !48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !86, file: !3, line: 129, baseType: !77, size: 8, offset: 416)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !86, file: !3, line: 132, baseType: !77, size: 8, offset: 424)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !86, file: !3, line: 136, baseType: !77, size: 8, offset: 432)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !86, file: !3, line: 139, baseType: !54, size: 32, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !86, file: !3, line: 142, baseType: !54, size: 32, offset: 480)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !86, file: !3, line: 145, baseType: !54, size: 32, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !86, file: !3, line: 149, baseType: !54, size: 32, offset: 544)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !86, file: !3, line: 153, baseType: !54, size: 32, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !86, file: !3, line: 156, baseType: !37, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !86, file: !3, line: 160, baseType: !79, size: 64, offset: 704)
!116 = !DILocalVariable(name: "i", scope: !68, file: !3, line: 2246, type: !37)
!117 = !DILocalVariable(name: "obsolete_option", scope: !68, file: !3, line: 2247, type: !77)
!118 = !DILocalVariable(name: "sleep_interval", scope: !68, file: !3, line: 2252, type: !119)
!119 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!120 = !DILocalVariable(name: "found_hyphen", scope: !121, file: !3, line: 2296, type: !77)
!121 = distinct !DILexicalBlock(scope: !68, file: !3, line: 2295, column: 3)
!122 = !DILocalVariable(name: "__s1_len", scope: !123, file: !3, line: 2299, type: !37)
!123 = distinct !DILexicalBlock(scope: !124, file: !3, line: 2299, column: 11)
!124 = distinct !DILexicalBlock(scope: !125, file: !3, line: 2299, column: 11)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 2298, column: 5)
!126 = distinct !DILexicalBlock(scope: !121, file: !3, line: 2298, column: 5)
!127 = !DILocalVariable(name: "__s2_len", scope: !123, file: !3, line: 2299, type: !37)
!128 = !DILocalVariable(name: "__s2", scope: !129, file: !3, line: 2299, type: !42)
!129 = distinct !DILexicalBlock(scope: !123, file: !3, line: 2299, column: 11)
!130 = !DILocalVariable(name: "__result", scope: !129, file: !3, line: 2299, type: !54)
!131 = !DILocalVariable(name: "wd", scope: !132, file: !3, line: 2384, type: !54)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 2383, column: 9)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 2382, column: 11)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 2332, column: 5)
!135 = distinct !DILexicalBlock(scope: !68, file: !3, line: 2331, column: 7)
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "forever", scope: !2, file: !3, line: 176, type: !77, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139)
!139 = distinct !DIGlobalVariable(name: "from_start", scope: !2, file: !3, line: 179, type: !77, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141)
!141 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 182, type: !77, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143)
!143 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 185, type: !47, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 207, type: !77, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147)
!147 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !2, file: !3, line: 215, type: !77, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "infomap", scope: !150, file: !151, line: 632, type: !175, isLocal: true, isDefinition: true)
!150 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !151, file: !151, line: 630, type: !152, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !154)
!151 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!152 = !DISubroutineType(types: !153)
!153 = !{null, !45}
!154 = !{!155, !156, !157, !164, !166, !167, !168, !171, !172, !174}
!155 = !DILocalVariable(name: "program", arg: 1, scope: !150, file: !151, line: 630, type: !45)
!156 = !DILocalVariable(name: "node", scope: !150, file: !151, line: 642, type: !45)
!157 = !DILocalVariable(name: "map_prog", scope: !150, file: !151, line: 643, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !150, file: !151, line: 632, size: 128, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !160, file: !151, line: 632, baseType: !45, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !160, file: !151, line: 632, baseType: !45, size: 64, offset: 64)
!164 = !DILocalVariable(name: "__s1_len", scope: !165, file: !151, line: 645, type: !37)
!165 = distinct !DILexicalBlock(scope: !150, file: !151, line: 645, column: 33)
!166 = !DILocalVariable(name: "__s2_len", scope: !165, file: !151, line: 645, type: !37)
!167 = !DILocalVariable(name: "lc_messages", scope: !150, file: !151, line: 655, type: !45)
!168 = !DILocalVariable(name: "__s1_len", scope: !169, file: !151, line: 656, type: !37)
!169 = distinct !DILexicalBlock(scope: !170, file: !151, line: 656, column: 22)
!170 = distinct !DILexicalBlock(scope: !150, file: !151, line: 656, column: 7)
!171 = !DILocalVariable(name: "__s2_len", scope: !169, file: !151, line: 656, type: !37)
!172 = !DILocalVariable(name: "__s2", scope: !173, file: !151, line: 656, type: !42)
!173 = distinct !DILexicalBlock(scope: !169, file: !151, line: 656, column: 22)
!174 = !DILocalVariable(name: "__result", scope: !173, file: !151, line: 656, type: !54)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 896, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 7)
!178 = !DIGlobalVariableExpression(var: !179)
!179 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 229, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 4096, elements: !190)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !183, line: 104, size: 256, elements: !184)
!183 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!184 = !{!185, !186, !187, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 106, baseType: !45, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !182, file: !183, line: 109, baseType: !54, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !183, line: 110, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !182, file: !183, line: 111, baseType: !54, size: 32, offset: 192)
!190 = !{!191}
!191 = !DISubrange(count: 16)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !2, file: !3, line: 165, type: !77, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !2, file: !3, line: 109, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !198)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!198 = !{!199}
!199 = !DISubrange(count: 2)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !2, file: !3, line: 104, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 192, elements: !204)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!204 = !{!205}
!205 = !DISubrange(count: 3)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !2, file: !3, line: 199, type: !79, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "pid", scope: !2, file: !3, line: 204, type: !50, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 212, type: !77, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "follow_mode", scope: !2, file: !3, line: 173, type: !10, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "first_file", scope: !216, file: !3, line: 376, type: !77, isLocal: true, isDefinition: true)
!216 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 374, type: !152, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !217)
!217 = !{!218}
!218 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !216, file: !3, line: 374, type: !45)
!219 = !DIGlobalVariableExpression(var: !220)
!220 = distinct !DIGlobalVariable(name: "Version", scope: !221, file: !222, line: 2, type: !45, isLocal: false, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, globals: !224)
!222 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !{}
!224 = !{!219}
!225 = !DIGlobalVariableExpression(var: !226)
!226 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !227, file: !232, line: 69, type: !233, isLocal: false, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !229, retainedTypes: !230, globals: !231)
!228 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!229 = !{!14}
!230 = !{!37, !49, !44}
!231 = !{!225}
!232 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !234, line: 55, baseType: !235)
!234 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null}
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !240, file: !266, line: 51, type: !267, isLocal: true, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !242, globals: !265)
!241 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!242 = !{!55, !243}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !244, line: 42, baseType: !245)
!244 = !DIFile(filename: "/usr/include/xlocale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !244, line: 39, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !244, line: 27, size: 1856, elements: !248)
!248 = !{!249, !255, !259, !262, !263}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !247, file: !244, line: 30, baseType: !250, size: 832)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 832, elements: !253)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !244, line: 30, flags: DIFlagFwdDecl)
!253 = !{!254}
!254 = !DISubrange(count: 13)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !247, file: !244, line: 33, baseType: !256, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !247, file: !244, line: 34, baseType: !260, size: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !247, file: !244, line: 35, baseType: !260, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !247, file: !244, line: 38, baseType: !264, size: 832, offset: 1024)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 832, elements: !253)
!265 = !{!238}
!266 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !243)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "file_name", scope: !270, file: !275, line: 36, type: !45, isLocal: true, isDefinition: true)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, globals: !272)
!271 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!272 = !{!268, !273}
!273 = !DIGlobalVariableExpression(var: !274)
!274 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !270, file: !275, line: 46, type: !77, isLocal: true, isDefinition: true)
!275 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !DIGlobalVariableExpression(var: !277)
!277 = distinct !DIGlobalVariable(name: "exit_failure", scope: !278, file: !281, line: 24, type: !282, isLocal: false, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, globals: !280)
!279 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!280 = !{!276}
!281 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!282 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!283 = !DIGlobalVariableExpression(var: !284)
!284 = distinct !DIGlobalVariable(name: "default_tuning", scope: !285, file: !289, line: 130, type: !290, isLocal: true, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !287, globals: !288)
!286 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!287 = !{!39, !49, !37}
!288 = !{!283}
!289 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !292, line: 65, baseType: !293)
!292 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !292, line: 53, size: 160, elements: !294)
!294 = !{!295, !297, !298, !299, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !293, file: !292, line: 58, baseType: !296, size: 32)
!296 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !293, file: !292, line: 59, baseType: !296, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !293, file: !292, line: 60, baseType: !296, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !293, file: !292, line: 61, baseType: !296, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !293, file: !292, line: 62, baseType: !77, size: 8, offset: 128)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "program_name", scope: !303, file: !307, line: 33, type: !45, isLocal: false, isDefinition: true)
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !305, globals: !306)
!304 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!305 = !{!49, !55}
!306 = !{!301}
!307 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!308 = !DIGlobalVariableExpression(var: !309)
!309 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !310, file: !337, line: 77, type: !372, isLocal: false, isDefinition: true)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !312, retainedTypes: !333, globals: !334)
!311 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!312 = !{!14, !313, !318}
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, size: 32, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!316 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!317 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 46, size: 32, elements: !320)
!319 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!321 = !DIEnumerator(name: "_ISupper", value: 256)
!322 = !DIEnumerator(name: "_ISlower", value: 512)
!323 = !DIEnumerator(name: "_ISalpha", value: 1024)
!324 = !DIEnumerator(name: "_ISdigit", value: 2048)
!325 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!326 = !DIEnumerator(name: "_ISspace", value: 8192)
!327 = !DIEnumerator(name: "_ISprint", value: 16384)
!328 = !DIEnumerator(name: "_ISgraph", value: 32768)
!329 = !DIEnumerator(name: "_ISblank", value: 1)
!330 = !DIEnumerator(name: "_IScntrl", value: 2)
!331 = !DIEnumerator(name: "_ISpunct", value: 4)
!332 = !DIEnumerator(name: "_ISalnum", value: 8)
!333 = !{!54, !258, !37, !55}
!334 = !{!308, !335, !342, !354, !356, !361, !368, !370}
!335 = !DIGlobalVariableExpression(var: !336)
!336 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !310, file: !337, line: 93, type: !338, isLocal: false, isDefinition: true)
!337 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 320, elements: !340)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!340 = !{!341}
!341 = !DISubrange(count: 10)
!342 = !DIGlobalVariableExpression(var: !343)
!343 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !310, file: !337, line: 1043, type: !344, isLocal: false, isDefinition: true)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !337, line: 57, size: 448, elements: !345)
!345 = !{!346, !347, !348, !352, !353}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !344, file: !337, line: 60, baseType: !14, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !337, line: 63, baseType: !54, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !344, file: !337, line: 67, baseType: !349, size: 256, offset: 64)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 8)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !344, file: !337, line: 70, baseType: !45, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !344, file: !337, line: 73, baseType: !45, size: 64, offset: 384)
!354 = !DIGlobalVariableExpression(var: !355)
!355 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !310, file: !337, line: 108, type: !344, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357)
!357 = distinct !DIGlobalVariable(name: "slot0", scope: !310, file: !337, line: 834, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 256)
!361 = !DIGlobalVariableExpression(var: !362)
!362 = distinct !DIGlobalVariable(name: "slotvec", scope: !310, file: !337, line: 837, type: !363, isLocal: true, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !337, line: 826, size: 128, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !364, file: !337, line: 828, baseType: !37, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !364, file: !337, line: 829, baseType: !55, size: 64, offset: 64)
!368 = !DIGlobalVariableExpression(var: !369)
!369 = distinct !DIGlobalVariable(name: "nslots", scope: !310, file: !337, line: 835, type: !54, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "slotvec0", scope: !310, file: !337, line: 836, type: !364, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 704, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 11)
!375 = !DIGlobalVariableExpression(var: !376)
!376 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !377, file: !380, line: 26, type: !381, isLocal: false, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, globals: !379)
!378 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!379 = !{!375}
!380 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 376, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 47)
!384 = !DIGlobalVariableExpression(var: !385)
!385 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !386, file: !387, line: 335, type: !54, isLocal: true, isDefinition: true)
!386 = distinct !DISubprogram(name: "rpl_fcntl", scope: !387, file: !387, line: 272, type: !388, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !390, variables: !393)
!387 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !DISubroutineType(types: !389)
!389 = !{!54, !54, !54, null}
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, globals: !392)
!391 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !{!384}
!393 = !{!394, !395, !396, !409, !410, !413, !416, !419}
!394 = !DILocalVariable(name: "fd", arg: 1, scope: !386, file: !387, line: 272, type: !54)
!395 = !DILocalVariable(name: "action", arg: 2, scope: !386, file: !387, line: 272, type: !54)
!396 = !DILocalVariable(name: "arg", scope: !386, file: !387, line: 274, type: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !398, line: 30, baseType: !399)
!398 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !391, line: 274, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 192, elements: !407)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !391, line: 274, size: 192, elements: !402)
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !401, file: !391, line: 274, baseType: !48, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !401, file: !391, line: 274, baseType: !48, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !401, file: !391, line: 274, baseType: !49, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !401, file: !391, line: 274, baseType: !49, size: 64, offset: 128)
!407 = !{!408}
!408 = !DISubrange(count: 1)
!409 = !DILocalVariable(name: "result", scope: !386, file: !387, line: 275, type: !54)
!410 = !DILocalVariable(name: "target", scope: !411, file: !387, line: 322, type: !54)
!411 = distinct !DILexicalBlock(scope: !412, file: !387, line: 321, column: 7)
!412 = distinct !DILexicalBlock(scope: !386, file: !387, line: 278, column: 5)
!413 = !DILocalVariable(name: "flags", scope: !414, file: !387, line: 359, type: !54)
!414 = distinct !DILexicalBlock(scope: !415, file: !387, line: 358, column: 11)
!415 = distinct !DILexicalBlock(scope: !411, file: !387, line: 357, column: 13)
!416 = !DILocalVariable(name: "saved_errno", scope: !417, file: !387, line: 362, type: !54)
!417 = distinct !DILexicalBlock(scope: !418, file: !387, line: 361, column: 15)
!418 = distinct !DILexicalBlock(scope: !414, file: !387, line: 360, column: 17)
!419 = !DILocalVariable(name: "p", scope: !420, file: !387, line: 404, type: !49)
!420 = distinct !DILexicalBlock(scope: !412, file: !387, line: 402, column: 7)
!421 = !DIGlobalVariableExpression(var: !422)
!422 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !423, file: !767, line: 120, type: !768, isLocal: true, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !425, retainedTypes: !764, globals: !766)
!424 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!425 = !{!426}
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !427, line: 41, size: 32, elements: !428)
!427 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!429 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!430 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!431 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!432 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!433 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!434 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!435 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!436 = !DIEnumerator(name: "DAY_1", value: 131079)
!437 = !DIEnumerator(name: "DAY_2", value: 131080)
!438 = !DIEnumerator(name: "DAY_3", value: 131081)
!439 = !DIEnumerator(name: "DAY_4", value: 131082)
!440 = !DIEnumerator(name: "DAY_5", value: 131083)
!441 = !DIEnumerator(name: "DAY_6", value: 131084)
!442 = !DIEnumerator(name: "DAY_7", value: 131085)
!443 = !DIEnumerator(name: "ABMON_1", value: 131086)
!444 = !DIEnumerator(name: "ABMON_2", value: 131087)
!445 = !DIEnumerator(name: "ABMON_3", value: 131088)
!446 = !DIEnumerator(name: "ABMON_4", value: 131089)
!447 = !DIEnumerator(name: "ABMON_5", value: 131090)
!448 = !DIEnumerator(name: "ABMON_6", value: 131091)
!449 = !DIEnumerator(name: "ABMON_7", value: 131092)
!450 = !DIEnumerator(name: "ABMON_8", value: 131093)
!451 = !DIEnumerator(name: "ABMON_9", value: 131094)
!452 = !DIEnumerator(name: "ABMON_10", value: 131095)
!453 = !DIEnumerator(name: "ABMON_11", value: 131096)
!454 = !DIEnumerator(name: "ABMON_12", value: 131097)
!455 = !DIEnumerator(name: "MON_1", value: 131098)
!456 = !DIEnumerator(name: "MON_2", value: 131099)
!457 = !DIEnumerator(name: "MON_3", value: 131100)
!458 = !DIEnumerator(name: "MON_4", value: 131101)
!459 = !DIEnumerator(name: "MON_5", value: 131102)
!460 = !DIEnumerator(name: "MON_6", value: 131103)
!461 = !DIEnumerator(name: "MON_7", value: 131104)
!462 = !DIEnumerator(name: "MON_8", value: 131105)
!463 = !DIEnumerator(name: "MON_9", value: 131106)
!464 = !DIEnumerator(name: "MON_10", value: 131107)
!465 = !DIEnumerator(name: "MON_11", value: 131108)
!466 = !DIEnumerator(name: "MON_12", value: 131109)
!467 = !DIEnumerator(name: "AM_STR", value: 131110)
!468 = !DIEnumerator(name: "PM_STR", value: 131111)
!469 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!470 = !DIEnumerator(name: "D_FMT", value: 131113)
!471 = !DIEnumerator(name: "T_FMT", value: 131114)
!472 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!473 = !DIEnumerator(name: "ERA", value: 131116)
!474 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!475 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!476 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!477 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!478 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!479 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!480 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!481 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!482 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!483 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!484 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!485 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!486 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!487 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!488 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!489 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!490 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!491 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!492 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!493 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!494 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!495 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!496 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!497 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!498 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!499 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!500 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!501 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!502 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!503 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!504 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!505 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!506 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!507 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!508 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!509 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!510 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!511 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!512 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!513 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!514 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!515 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!516 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!517 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!518 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!519 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!520 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!521 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!522 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!523 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!524 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!525 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!526 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!527 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!528 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!529 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!530 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!531 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!532 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!533 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!534 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!535 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!536 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!537 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!538 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!539 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!540 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!541 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!542 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!543 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!544 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!545 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!546 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!547 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!548 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!549 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!550 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!551 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!552 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!553 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!554 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!555 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!556 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!557 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!558 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!559 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!560 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!561 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!562 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!563 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!564 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!565 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!566 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!567 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!568 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!569 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!570 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!571 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!572 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!573 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!574 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!575 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!576 = !DIEnumerator(name: "CODESET", value: 14)
!577 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!578 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!579 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!580 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!581 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!582 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!583 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!584 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!585 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!586 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!587 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!588 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!589 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!590 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!591 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!592 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!593 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!594 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!595 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!599 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!600 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!601 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!602 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!603 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!604 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!605 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!606 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!607 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!608 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!609 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!610 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!611 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!612 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!613 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!614 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!615 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!616 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!617 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!619 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!620 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!621 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!622 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!623 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!624 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!625 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!626 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!627 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!628 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!629 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!630 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!631 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!632 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!633 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!634 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!635 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!636 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!637 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!638 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!639 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!640 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!641 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!642 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!643 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!644 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!645 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!646 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!647 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!648 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!649 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!650 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!651 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!652 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!653 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!654 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!655 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!656 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!657 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!658 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!659 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!660 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!661 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!662 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!663 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!664 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!665 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!666 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!667 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!668 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!669 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!670 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!671 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!672 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!673 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!674 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!675 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!676 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!677 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!678 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!679 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!680 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!681 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!682 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!683 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!684 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!685 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!687 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!688 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!689 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!690 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!691 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!692 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!693 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!694 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!695 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!696 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!697 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!698 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!699 = !DIEnumerator(name: "THOUSEP", value: 65537)
!700 = !DIEnumerator(name: "__GROUPING", value: 65538)
!701 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!702 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!703 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!704 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!705 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!706 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!707 = !DIEnumerator(name: "__YESSTR", value: 327682)
!708 = !DIEnumerator(name: "__NOSTR", value: 327683)
!709 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!710 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!711 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!712 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!713 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!714 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!715 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!716 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!717 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!718 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!719 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!720 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!721 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!722 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!723 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!724 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!725 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!726 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!727 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!728 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!729 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!730 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!731 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!732 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!733 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!734 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!735 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!736 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!737 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!738 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!739 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!740 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!741 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!742 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!743 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!744 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!745 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!746 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!747 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!748 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!749 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!750 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!751 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!752 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!753 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!754 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!755 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!756 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!757 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!758 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!759 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!760 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!761 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!762 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!763 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!764 = !{!49, !55, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!766 = !{!421}
!767 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!770 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !773)
!772 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!773 = !{!55}
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!775 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !778)
!777 = !DIFile(filename: "./lib/offtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !51, line: 86, baseType: !58)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!781 = !DIFile(filename: "./lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !784)
!783 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!784 = !{!785}
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !787, file: !786, line: 62, size: 32, elements: !800)
!786 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!787 = distinct !DISubprogram(name: "safe_read", scope: !786, file: !786, line: 56, type: !788, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !782, variables: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{!37, !54, !49, !37}
!790 = !{!791, !792, !793, !794}
!791 = !DILocalVariable(name: "fd", arg: 1, scope: !787, file: !786, line: 56, type: !54)
!792 = !DILocalVariable(name: "buf", arg: 2, scope: !787, file: !786, line: 56, type: !49)
!793 = !DILocalVariable(name: "count", arg: 3, scope: !787, file: !786, line: 56, type: !37)
!794 = !DILocalVariable(name: "result", scope: !795, file: !786, line: 66, type: !798)
!795 = distinct !DILexicalBlock(scope: !796, file: !786, line: 65, column: 5)
!796 = distinct !DILexicalBlock(scope: !797, file: !786, line: 64, column: 3)
!797 = distinct !DILexicalBlock(scope: !787, file: !786, line: 64, column: 3)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !51, line: 109, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !53, line: 181, baseType: !59)
!800 = !{!801}
!801 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!803 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !806, retainedTypes: !811)
!805 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!806 = !{!807}
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 41, size: 32, elements: !809)
!808 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!809 = !{!810}
!810 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!811 = !{!49}
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !814, retainedTypes: !828)
!813 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!814 = !{!815}
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !817, file: !816, line: 192, size: 32, elements: !826)
!816 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!817 = distinct !DISubprogram(name: "x2nrealloc", scope: !816, file: !816, line: 180, type: !818, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !812, variables: !821)
!818 = !DISubroutineType(types: !819)
!819 = !{!49, !49, !820, !37}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!821 = !{!822, !823, !824, !825}
!822 = !DILocalVariable(name: "p", arg: 1, scope: !817, file: !816, line: 180, type: !49)
!823 = !DILocalVariable(name: "pn", arg: 2, scope: !817, file: !816, line: 180, type: !820)
!824 = !DILocalVariable(name: "s", arg: 3, scope: !817, file: !816, line: 180, type: !37)
!825 = !DILocalVariable(name: "n", scope: !817, file: !816, line: 182, type: !37)
!826 = !{!827}
!827 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!828 = !{!37, !55, !49}
!829 = distinct !DICompileUnit(language: DW_LANG_C99, file: !830, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!830 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !833)
!832 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!833 = !{!28}
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!835 = !DIFile(filename: "./lib/xnanosleep.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !811)
!837 = !DIFile(filename: "./lib/xstrtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !840, retainedTypes: !841)
!839 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!840 = !{!28, !318}
!841 = !{!54, !258, !55}
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !811)
!843 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !846)
!845 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!846 = !{!37}
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !849)
!848 = !DIFile(filename: "./lib/nanosleep.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!849 = !{!850}
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 41, size: 32, elements: !852)
!851 = !DIFile(filename: "lib/nanosleep.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!852 = !{!853}
!853 = !DIEnumerator(name: "BILLION", value: 1000000000)
!854 = distinct !DICompileUnit(language: DW_LANG_C99, file: !855, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!855 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !858, retainedTypes: !863)
!857 = !DIFile(filename: "./lib/dtotimespec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!858 = !{!859}
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !860, line: 35, size: 32, elements: !861)
!860 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = !{!862}
!862 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!863 = !{!60}
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !866)
!865 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!866 = !{!37, !40, !42, !45}
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!868 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223)
!870 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !811)
!872 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !811)
!874 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!875 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!876 = !{i32 2, !"Dwarf Version", i32 4}
!877 = !{i32 2, !"Debug Info Version", i32 3}
!878 = !{i32 1, !"PIC Level", i32 2}
!879 = !{i32 1, !"PIE Level", i32 2}
!880 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 252, type: !881, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !883)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !54}
!883 = !{!884}
!884 = !DILocalVariable(name: "status", arg: 1, scope: !880, file: !3, line: 252, type: !54)
!885 = !DIExpression()
!886 = !DILocation(line: 252, column: 12, scope: !880)
!887 = !DILocation(line: 254, column: 14, scope: !888)
!888 = distinct !DILexicalBlock(scope: !880, file: !3, line: 254, column: 7)
!889 = !DILocation(line: 254, column: 7, scope: !880)
!890 = !DILocation(line: 255, column: 5, scope: !891)
!891 = !DILexicalBlockFile(scope: !892, file: !3, discriminator: 1)
!892 = distinct !DILexicalBlock(scope: !888, file: !3, line: 255, column: 5)
!893 = !{!894, !894, i64 0}
!894 = !{!"any pointer", !895, i64 0}
!895 = !{!"omnipotent char", !896, i64 0}
!896 = !{!"Simple C/C++ TBAA"}
!897 = !DILocation(line: 255, column: 5, scope: !898)
!898 = !DILexicalBlockFile(scope: !892, file: !3, discriminator: 3)
!899 = !DILocation(line: 255, column: 5, scope: !900)
!900 = !DILexicalBlockFile(scope: !892, file: !3, discriminator: 2)
!901 = !DILocation(line: 258, column: 7, scope: !902)
!902 = distinct !DILexicalBlock(scope: !888, file: !3, line: 257, column: 5)
!903 = !DILocation(line: 258, column: 7, scope: !904)
!904 = !DILexicalBlockFile(scope: !902, file: !3, discriminator: 1)
!905 = !DILocation(line: 262, column: 7, scope: !902)
!906 = !DILocation(line: 262, column: 7, scope: !904)
!907 = !DILocation(line: 580, column: 3, scope: !908, inlinedAt: !909)
!908 = distinct !DISubprogram(name: "emit_stdin_note", scope: !151, file: !151, line: 578, type: !236, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !223)
!909 = distinct !DILocation(line: 267, column: 7, scope: !902)
!910 = !DILocation(line: 580, column: 3, scope: !911, inlinedAt: !909)
!911 = !DILexicalBlockFile(scope: !908, file: !151, discriminator: 1)
!912 = !DILocation(line: 587, column: 3, scope: !913, inlinedAt: !914)
!913 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !151, file: !151, line: 585, type: !236, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !223)
!914 = distinct !DILocation(line: 268, column: 7, scope: !902)
!915 = !DILocation(line: 587, column: 3, scope: !916, inlinedAt: !914)
!916 = !DILexicalBlockFile(scope: !913, file: !151, discriminator: 1)
!917 = !DILocation(line: 270, column: 6, scope: !902)
!918 = !DILocation(line: 270, column: 6, scope: !904)
!919 = !DILocation(line: 274, column: 6, scope: !902)
!920 = !DILocation(line: 274, column: 6, scope: !904)
!921 = !DILocation(line: 280, column: 6, scope: !902)
!922 = !DILocation(line: 280, column: 6, scope: !904)
!923 = !DILocation(line: 293, column: 6, scope: !902)
!924 = !DILocation(line: 293, column: 6, scope: !904)
!925 = !DILocation(line: 298, column: 6, scope: !902)
!926 = !DILocation(line: 298, column: 6, scope: !904)
!927 = !DILocation(line: 305, column: 6, scope: !902)
!928 = !DILocation(line: 305, column: 6, scope: !904)
!929 = !DILocation(line: 308, column: 6, scope: !902)
!930 = !DILocation(line: 308, column: 6, scope: !904)
!931 = !DILocation(line: 309, column: 6, scope: !902)
!932 = !DILocation(line: 309, column: 6, scope: !904)
!933 = !DILocation(line: 310, column: 6, scope: !902)
!934 = !DILocation(line: 310, column: 6, scope: !904)
!935 = !DILocation(line: 317, column: 6, scope: !902)
!936 = !DILocation(line: 317, column: 6, scope: !904)
!937 = !DILocation(line: 642, column: 15, scope: !150, inlinedAt: !938)
!938 = distinct !DILocation(line: 325, column: 7, scope: !902)
!939 = !DILocation(line: 651, column: 3, scope: !150, inlinedAt: !938)
!940 = !DILocation(line: 651, column: 3, scope: !941, inlinedAt: !938)
!941 = !DILexicalBlockFile(scope: !150, file: !151, discriminator: 1)
!942 = !DILocation(line: 655, column: 29, scope: !150, inlinedAt: !938)
!943 = !DILocation(line: 655, column: 15, scope: !150, inlinedAt: !938)
!944 = !DILocation(line: 656, column: 7, scope: !170, inlinedAt: !938)
!945 = !DILocation(line: 656, column: 19, scope: !170, inlinedAt: !938)
!946 = !DILocation(line: 656, column: 22, scope: !947, inlinedAt: !938)
!947 = !DILexicalBlockFile(scope: !170, file: !151, discriminator: 16)
!948 = !DILocation(line: 656, column: 7, scope: !949, inlinedAt: !938)
!949 = !DILexicalBlockFile(scope: !150, file: !151, discriminator: 16)
!950 = !DILocation(line: 662, column: 7, scope: !951, inlinedAt: !938)
!951 = distinct !DILexicalBlock(scope: !170, file: !151, line: 657, column: 5)
!952 = !DILocation(line: 662, column: 7, scope: !953, inlinedAt: !938)
!953 = !DILexicalBlockFile(scope: !951, file: !151, discriminator: 1)
!954 = !DILocation(line: 664, column: 5, scope: !951, inlinedAt: !938)
!955 = !DILocation(line: 665, column: 3, scope: !150, inlinedAt: !938)
!956 = !DILocation(line: 665, column: 3, scope: !941, inlinedAt: !938)
!957 = !DILocation(line: 667, column: 3, scope: !150, inlinedAt: !938)
!958 = !DILocation(line: 667, column: 3, scope: !941, inlinedAt: !938)
!959 = !DILocation(line: 327, column: 3, scope: !880)
!960 = !DILocalVariable(name: "buffer", scope: !961, file: !3, line: 859, type: !974)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 858, column: 5)
!962 = distinct !DISubprogram(name: "start_lines", scope: !3, file: !3, line: 851, type: !963, isLocal: true, isDefinition: true, scopeLine: 853, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !966)
!963 = !DISubroutineType(types: !964)
!964 = !{!54, !45, !54, !79, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!966 = !{!967, !968, !969, !970, !960, !971, !972, !973}
!967 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !962, file: !3, line: 851, type: !45)
!968 = !DILocalVariable(name: "fd", arg: 2, scope: !962, file: !3, line: 851, type: !54)
!969 = !DILocalVariable(name: "n_lines", arg: 3, scope: !962, file: !3, line: 851, type: !79)
!970 = !DILocalVariable(name: "read_pos", arg: 4, scope: !962, file: !3, line: 852, type: !965)
!971 = !DILocalVariable(name: "bytes_read", scope: !961, file: !3, line: 860, type: !37)
!972 = !DILocalVariable(name: "buffer_end", scope: !961, file: !3, line: 869, type: !55)
!973 = !DILocalVariable(name: "p", scope: !961, file: !3, line: 873, type: !55)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 65536, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 8192)
!977 = !DILocation(line: 859, column: 12, scope: !961, inlinedAt: !978)
!978 = distinct !DILocation(line: 1823, column: 15, scope: !979, inlinedAt: !1018)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1822, column: 5)
!980 = distinct !DILexicalBlock(scope: !981, file: !3, line: 1821, column: 7)
!981 = distinct !DISubprogram(name: "tail_lines", scope: !3, file: !3, line: 1810, type: !982, isLocal: true, isDefinition: true, scopeLine: 1812, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{!77, !45, !54, !79, !965}
!984 = !{!985, !986, !987, !988, !989, !1014, !1015, !1017}
!985 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !981, file: !3, line: 1810, type: !45)
!986 = !DILocalVariable(name: "fd", arg: 2, scope: !981, file: !3, line: 1810, type: !54)
!987 = !DILocalVariable(name: "n_lines", arg: 3, scope: !981, file: !3, line: 1810, type: !79)
!988 = !DILocalVariable(name: "read_pos", arg: 4, scope: !981, file: !3, line: 1811, type: !965)
!989 = !DILocalVariable(name: "stats", scope: !981, file: !3, line: 1813, type: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !991, line: 46, size: 1152, elements: !992)
!991 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!992 = !{!993, !994, !995, !997, !998, !1000, !1002, !1003, !1004, !1005, !1007, !1009, !1010, !1011, !1012}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !990, file: !991, line: 48, baseType: !99, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !990, file: !991, line: 53, baseType: !102, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !990, file: !991, line: 61, baseType: !996, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !53, line: 139, baseType: !39)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !990, file: !991, line: 62, baseType: !105, size: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !990, file: !991, line: 64, baseType: !999, size: 32, offset: 224)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !53, line: 134, baseType: !48)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !990, file: !991, line: 65, baseType: !1001, size: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !53, line: 135, baseType: !48)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !990, file: !991, line: 67, baseType: !54, size: 32, offset: 288)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !990, file: !991, line: 69, baseType: !99, size: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !990, file: !991, line: 74, baseType: !58, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !990, file: !991, line: 78, baseType: !1006, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !53, line: 162, baseType: !59)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !990, file: !991, line: 80, baseType: !1008, size: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !53, line: 167, baseType: !59)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !990, file: !991, line: 91, baseType: !91, size: 128, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !990, file: !991, line: 92, baseType: !91, size: 128, offset: 704)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !990, file: !991, line: 93, baseType: !91, size: 128, offset: 832)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !990, file: !991, line: 106, baseType: !1013, size: 192, offset: 960)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 192, elements: !204)
!1014 = !DILocalVariable(name: "t", scope: !979, file: !3, line: 1823, type: !54)
!1015 = !DILocalVariable(name: "start_pos", scope: !1016, file: !3, line: 1830, type: !56)
!1016 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1829, column: 5)
!1017 = !DILocalVariable(name: "end_pos", scope: !1016, file: !3, line: 1831, type: !56)
!1018 = distinct !DILocation(line: 1877, column: 12, scope: !1019, inlinedAt: !1026)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1876, column: 7)
!1020 = distinct !DISubprogram(name: "tail", scope: !3, file: !3, line: 1872, type: !982, isLocal: true, isDefinition: true, scopeLine: 1874, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1021)
!1021 = !{!1022, !1023, !1024, !1025}
!1022 = !DILocalVariable(name: "filename", arg: 1, scope: !1020, file: !3, line: 1872, type: !45)
!1023 = !DILocalVariable(name: "fd", arg: 2, scope: !1020, file: !3, line: 1872, type: !54)
!1024 = !DILocalVariable(name: "n_units", arg: 3, scope: !1020, file: !3, line: 1872, type: !79)
!1025 = !DILocalVariable(name: "read_pos", arg: 4, scope: !1020, file: !3, line: 1873, type: !965)
!1026 = distinct !DILocation(line: 1924, column: 12, scope: !1027, inlinedAt: !1049)
!1027 = !DILexicalBlockFile(scope: !1028, file: !3, discriminator: 1)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 1919, column: 5)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1904, column: 7)
!1030 = distinct !DISubprogram(name: "tail_file", scope: !3, file: !3, line: 1886, type: !1031, isLocal: true, isDefinition: true, scopeLine: 1887, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1033)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!77, !85, !79}
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1041, !1042, !1044, !1045, !1046}
!1034 = !DILocalVariable(name: "f", arg: 1, scope: !1030, file: !3, line: 1886, type: !85)
!1035 = !DILocalVariable(name: "n_units", arg: 2, scope: !1030, file: !3, line: 1886, type: !79)
!1036 = !DILocalVariable(name: "fd", scope: !1030, file: !3, line: 1888, type: !54)
!1037 = !DILocalVariable(name: "ok", scope: !1030, file: !3, line: 1889, type: !77)
!1038 = !DILocalVariable(name: "is_stdin", scope: !1030, file: !3, line: 1891, type: !77)
!1039 = !DILocalVariable(name: "__s1_len", scope: !1040, file: !3, line: 1891, type: !37)
!1040 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1891, column: 20)
!1041 = !DILocalVariable(name: "__s2_len", scope: !1040, file: !3, line: 1891, type: !37)
!1042 = !DILocalVariable(name: "__s2", scope: !1043, file: !3, line: 1891, type: !42)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 1891, column: 20)
!1044 = !DILocalVariable(name: "__result", scope: !1043, file: !3, line: 1891, type: !54)
!1045 = !DILocalVariable(name: "read_pos", scope: !1028, file: !3, line: 1920, type: !79)
!1046 = !DILocalVariable(name: "stats", scope: !1047, file: !3, line: 1927, type: !990)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 1926, column: 9)
!1048 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1925, column: 11)
!1049 = distinct !DILocation(line: 2329, column: 11, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 2328, column: 3)
!1051 = distinct !DILexicalBlock(scope: !68, file: !3, line: 2328, column: 3)
!1052 = !DILocation(line: 2235, column: 11, scope: !68)
!1053 = !DILocation(line: 2235, column: 24, scope: !68)
!1054 = !DILocation(line: 2237, column: 20, scope: !68)
!1055 = !DILocation(line: 2238, column: 8, scope: !68)
!1056 = !DILocation(line: 2242, column: 3, scope: !68)
!1057 = !DILocation(line: 2242, column: 13, scope: !68)
!1058 = !{!1059, !1059, i64 0}
!1059 = !{!"long", !895, i64 0}
!1060 = !DILocation(line: 2252, column: 10, scope: !68)
!1061 = !DILocation(line: 2255, column: 21, scope: !68)
!1062 = !DILocation(line: 2255, column: 3, scope: !68)
!1063 = !DILocation(line: 2256, column: 3, scope: !68)
!1064 = !DILocation(line: 2257, column: 3, scope: !68)
!1065 = !DILocation(line: 2258, column: 3, scope: !68)
!1066 = !DILocation(line: 2260, column: 3, scope: !68)
!1067 = !DILocation(line: 2264, column: 15, scope: !68)
!1068 = !{!1069, !1069, i64 0}
!1069 = !{!"_Bool", !895, i64 0}
!1070 = !DILocation(line: 2265, column: 24, scope: !68)
!1071 = !DILocation(line: 2265, column: 11, scope: !68)
!1072 = !DIExpression(DW_OP_deref)
!1073 = !DILocalVariable(name: "argc", arg: 1, scope: !1074, file: !3, line: 1993, type: !54)
!1074 = distinct !DISubprogram(name: "parse_obsolete_option", scope: !3, file: !3, line: 1993, type: !1075, isLocal: true, isDefinition: true, scopeLine: 1994, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1079)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!77, !54, !1077, !965}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!1079 = !{!1073, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1092, !1093, !1095, !1096, !1097, !1098}
!1080 = !DILocalVariable(name: "argv", arg: 2, scope: !1074, file: !3, line: 1993, type: !1077)
!1081 = !DILocalVariable(name: "n_units", arg: 3, scope: !1074, file: !3, line: 1993, type: !965)
!1082 = !DILocalVariable(name: "p", scope: !1074, file: !3, line: 1995, type: !45)
!1083 = !DILocalVariable(name: "n_string", scope: !1074, file: !3, line: 1996, type: !45)
!1084 = !DILocalVariable(name: "n_string_end", scope: !1074, file: !3, line: 1997, type: !45)
!1085 = !DILocalVariable(name: "default_count", scope: !1074, file: !3, line: 1998, type: !54)
!1086 = !DILocalVariable(name: "t_from_start", scope: !1074, file: !3, line: 1999, type: !77)
!1087 = !DILocalVariable(name: "t_count_lines", scope: !1074, file: !3, line: 2000, type: !77)
!1088 = !DILocalVariable(name: "t_forever", scope: !1074, file: !3, line: 2001, type: !77)
!1089 = !DILocalVariable(name: "__s1_len", scope: !1090, file: !3, line: 2007, type: !37)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 2007, column: 40)
!1091 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 2005, column: 7)
!1092 = !DILocalVariable(name: "__s2_len", scope: !1090, file: !3, line: 2007, type: !37)
!1093 = !DILocalVariable(name: "__s2", scope: !1094, file: !3, line: 2007, type: !42)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 2007, column: 40)
!1095 = !DILocalVariable(name: "__result", scope: !1094, file: !3, line: 2007, type: !54)
!1096 = !DILocalVariable(name: "posix_ver", scope: !1074, file: !3, line: 2010, type: !54)
!1097 = !DILocalVariable(name: "obsolete_usage", scope: !1074, file: !3, line: 2011, type: !77)
!1098 = !DILocalVariable(name: "traditional_usage", scope: !1074, file: !3, line: 2012, type: !77)
!1099 = !DILocation(line: 1993, column: 28, scope: !1074, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 2267, column: 21, scope: !68)
!1101 = !DILocation(line: 1993, column: 48, scope: !1074, inlinedAt: !1100)
!1102 = !DILocation(line: 1993, column: 65, scope: !1074, inlinedAt: !1100)
!1103 = !DILocation(line: 1998, column: 7, scope: !1074, inlinedAt: !1100)
!1104 = !DILocation(line: 2000, column: 8, scope: !1074, inlinedAt: !1100)
!1105 = !DILocation(line: 2001, column: 8, scope: !1074, inlinedAt: !1100)
!1106 = !DILocation(line: 2006, column: 10, scope: !1091, inlinedAt: !1100)
!1107 = !DILocation(line: 2006, column: 30, scope: !1108, inlinedAt: !1100)
!1108 = !DILexicalBlockFile(scope: !1091, file: !3, discriminator: 2)
!1109 = !{!895, !895, i64 0}
!1110 = !DILocation(line: 2006, column: 41, scope: !1108, inlinedAt: !1100)
!1111 = !DILocation(line: 2006, column: 48, scope: !1108, inlinedAt: !1100)
!1112 = !DILocation(line: 2006, column: 51, scope: !1113, inlinedAt: !1100)
!1113 = !DILexicalBlockFile(scope: !1091, file: !3, discriminator: 3)
!1114 = !DILocation(line: 2007, column: 10, scope: !1091, inlinedAt: !1100)
!1115 = !DILocation(line: 2007, column: 24, scope: !1116, inlinedAt: !1100)
!1116 = !DILexicalBlockFile(scope: !1091, file: !3, discriminator: 1)
!1117 = !DILocation(line: 2007, column: 40, scope: !1090, inlinedAt: !1100)
!1118 = !DILocation(line: 2007, column: 40, scope: !1094, inlinedAt: !1100)
!1119 = !DILocation(line: 2007, column: 40, scope: !1120, inlinedAt: !1100)
!1120 = !DILexicalBlockFile(scope: !1121, file: !3, discriminator: 5)
!1121 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 2007, column: 40)
!1122 = !DILocation(line: 2007, column: 40, scope: !1123, inlinedAt: !1100)
!1123 = !DILexicalBlockFile(scope: !1124, file: !3, discriminator: 7)
!1124 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 2007, column: 40)
!1125 = !DILocation(line: 2007, column: 40, scope: !1126, inlinedAt: !1100)
!1126 = !DILexicalBlockFile(scope: !1127, file: !3, discriminator: 8)
!1127 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 2007, column: 40)
!1128 = !DILocation(line: 2007, column: 40, scope: !1129, inlinedAt: !1100)
!1129 = !DILexicalBlockFile(scope: !1127, file: !3, discriminator: 7)
!1130 = !DILocation(line: 2007, column: 40, scope: !1131, inlinedAt: !1100)
!1131 = !DILexicalBlockFile(scope: !1132, file: !3, discriminator: 9)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 2007, column: 40)
!1133 = !DILocation(line: 2007, column: 40, scope: !1134, inlinedAt: !1100)
!1134 = !DILexicalBlockFile(scope: !1090, file: !3, discriminator: 14)
!1135 = !DILocation(line: 2005, column: 7, scope: !1136, inlinedAt: !1100)
!1136 = !DILexicalBlockFile(scope: !1074, file: !3, discriminator: 1)
!1137 = !DILocation(line: 2010, column: 19, scope: !1074, inlinedAt: !1100)
!1138 = !DILocation(line: 2010, column: 7, scope: !1074, inlinedAt: !1100)
!1139 = !DILocation(line: 2013, column: 7, scope: !1074, inlinedAt: !1100)
!1140 = !DILocation(line: 1995, column: 15, scope: !1074, inlinedAt: !1100)
!1141 = !DILocation(line: 2015, column: 11, scope: !1074, inlinedAt: !1100)
!1142 = !DILocation(line: 2015, column: 3, scope: !1074, inlinedAt: !1100)
!1143 = !DILocation(line: 2012, column: 43, scope: !1074, inlinedAt: !1100)
!1144 = !DILocation(line: 2022, column: 11, scope: !1145, inlinedAt: !1100)
!1145 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 2016, column: 5)
!1146 = !DILocation(line: 2011, column: 35, scope: !1074, inlinedAt: !1100)
!1147 = !DILocation(line: 2033, column: 27, scope: !1148, inlinedAt: !1100)
!1148 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 2033, column: 11)
!1149 = !DILocation(line: 2033, column: 33, scope: !1150, inlinedAt: !1100)
!1150 = !DILexicalBlockFile(scope: !1148, file: !3, discriminator: 1)
!1151 = !DILocation(line: 2033, column: 38, scope: !1150, inlinedAt: !1100)
!1152 = !DILocation(line: 2033, column: 31, scope: !1150, inlinedAt: !1100)
!1153 = !DILocation(line: 2033, column: 11, scope: !1154, inlinedAt: !1100)
!1154 = !DILexicalBlockFile(scope: !1145, file: !3, discriminator: 1)
!1155 = !DILocation(line: 1996, column: 15, scope: !1074, inlinedAt: !1100)
!1156 = !DILocation(line: 2041, column: 3, scope: !1074, inlinedAt: !1100)
!1157 = !DILocation(line: 2041, column: 10, scope: !1136, inlinedAt: !1100)
!1158 = !DILocation(line: 2042, column: 6, scope: !1074, inlinedAt: !1100)
!1159 = !DILocation(line: 2041, column: 3, scope: !1136, inlinedAt: !1100)
!1160 = distinct !{!1160, !1161, !1162}
!1161 = !DILocation(line: 2041, column: 3, scope: !1074)
!1162 = !DILocation(line: 2042, column: 6, scope: !1074)
!1163 = !DILocation(line: 1997, column: 15, scope: !1074, inlinedAt: !1100)
!1164 = !DILocation(line: 2045, column: 3, scope: !1074, inlinedAt: !1100)
!1165 = !DILocation(line: 2047, column: 15, scope: !1166, inlinedAt: !1100)
!1166 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 2046, column: 5)
!1167 = !DILocation(line: 2048, column: 15, scope: !1166, inlinedAt: !1100)
!1168 = !DILocation(line: 2049, column: 16, scope: !1166, inlinedAt: !1100)
!1169 = !DILocation(line: 2049, column: 20, scope: !1166, inlinedAt: !1100)
!1170 = !DILocation(line: 2052, column: 7, scope: !1171, inlinedAt: !1100)
!1171 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 2052, column: 7)
!1172 = !DILocation(line: 2052, column: 10, scope: !1171, inlinedAt: !1100)
!1173 = !DILocation(line: 2055, column: 7, scope: !1174, inlinedAt: !1100)
!1174 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 2053, column: 5)
!1175 = !DILocation(line: 2052, column: 7, scope: !1074, inlinedAt: !1100)
!1176 = !DILocation(line: 2058, column: 7, scope: !1177, inlinedAt: !1100)
!1177 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 2058, column: 7)
!1178 = !DILocation(line: 2058, column: 7, scope: !1074, inlinedAt: !1100)
!1179 = !DILocation(line: 2061, column: 16, scope: !1180, inlinedAt: !1100)
!1180 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 2061, column: 7)
!1181 = !DILocation(line: 2061, column: 7, scope: !1074, inlinedAt: !1100)
!1182 = !DILocation(line: 2062, column: 14, scope: !1180, inlinedAt: !1100)
!1183 = !DILocation(line: 2062, column: 5, scope: !1180, inlinedAt: !1100)
!1184 = !DILocation(line: 2063, column: 13, scope: !1185, inlinedAt: !1100)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 2063, column: 12)
!1186 = !DILocation(line: 2064, column: 13, scope: !1185, inlinedAt: !1100)
!1187 = !DILocation(line: 2065, column: 12, scope: !1185, inlinedAt: !1100)
!1188 = !DILocation(line: 2063, column: 12, scope: !1180, inlinedAt: !1100)
!1189 = !DILocation(line: 2067, column: 7, scope: !1190, inlinedAt: !1100)
!1190 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 2066, column: 5)
!1191 = !{!1192, !1192, i64 0}
!1192 = !{!"int", !895, i64 0}
!1193 = !DILocation(line: 2067, column: 7, scope: !1194, inlinedAt: !1100)
!1194 = !DILexicalBlockFile(scope: !1190, file: !3, discriminator: 1)
!1195 = !DILocation(line: 2067, column: 7, scope: !1196, inlinedAt: !1100)
!1196 = !DILexicalBlockFile(scope: !1190, file: !3, discriminator: 2)
!1197 = !DILocation(line: 2067, column: 7, scope: !1198, inlinedAt: !1100)
!1198 = !DILexicalBlockFile(scope: !1190, file: !3, discriminator: 3)
!1199 = !DILocation(line: 2072, column: 14, scope: !1074, inlinedAt: !1100)
!1200 = !DILocation(line: 2073, column: 17, scope: !1074, inlinedAt: !1100)
!1201 = !DILocation(line: 2073, column: 15, scope: !1074, inlinedAt: !1100)
!1202 = !DILocation(line: 2074, column: 11, scope: !1074, inlinedAt: !1100)
!1203 = !DILocation(line: 2076, column: 3, scope: !1074, inlinedAt: !1100)
!1204 = !DILocation(line: 2268, column: 11, scope: !68)
!1205 = !DILocation(line: 2268, column: 8, scope: !68)
!1206 = !DILocation(line: 2269, column: 8, scope: !68)
!1207 = !DILocalVariable(name: "argc", arg: 1, scope: !1208, file: !3, line: 2080, type: !54)
!1208 = distinct !DISubprogram(name: "parse_options", scope: !3, file: !3, line: 2080, type: !1209, isLocal: true, isDefinition: true, scopeLine: 2083, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1213)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !54, !71, !965, !1211, !1212}
