; ModuleID = 'coreutils-8.27/src/uptime.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10)
!10 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !11, file: !39, line: 51, type: !40, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !38)
!12 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !16, line: 42, baseType: !17)
!16 = !DIFile(filename: "/usr/include/xlocale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !16, line: 39, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !16, line: 27, size: 1856, elements: !20)
!20 = !{!21, !27, !31, !35, !36}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !19, file: !16, line: 30, baseType: !22, size: 832)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 832, elements: !25)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !16, line: 30, flags: DIFlagFwdDecl)
!25 = !{!26}
!26 = !DISubrange(count: 13)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !19, file: !16, line: 33, baseType: !28, size: 64, offset: 832)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !19, file: !16, line: 34, baseType: !32, size: 64, offset: 896)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !19, file: !16, line: 35, baseType: !32, size: 64, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !19, file: !16, line: 38, baseType: !37, size: 832, offset: 1024)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !25)
!38 = !{!9}
!39 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!40 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !15)
!41 = !DIGlobalVariableExpression(var: !42)
!42 = distinct !DIGlobalVariable(name: "file_name", scope: !43, file: !48, line: 36, type: !6, isLocal: true, isDefinition: true)
!43 = distinct !DICompileUnit(language: DW_LANG_C99, file: !44, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !45)
!44 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!45 = !{!41, !46}
!46 = !DIGlobalVariableExpression(var: !47)
!47 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !43, file: !48, line: 46, type: !49, isLocal: true, isDefinition: true)
!48 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!49 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!50 = !DIGlobalVariableExpression(var: !51)
!51 = distinct !DIGlobalVariable(name: "exit_failure", scope: !52, file: !55, line: 24, type: !56, isLocal: false, isDefinition: true)
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !54)
!53 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!54 = !{!50}
!55 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!56 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "long_options", scope: !59, file: !62, line: 33, type: !63, isLocal: true, isDefinition: true)
!59 = distinct !DICompileUnit(language: DW_LANG_C99, file: !60, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !61)
!60 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!61 = !{!57}
!62 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 768, elements: !73)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !66, line: 104, size: 256, elements: !67)
!66 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !{!68, !69, !70, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 106, baseType: !6, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !65, file: !66, line: 109, baseType: !34, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !66, line: 110, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !65, file: !66, line: 111, baseType: !34, size: 32, offset: 192)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIGlobalVariableExpression(var: !76)
!76 = distinct !DIGlobalVariable(name: "program_name", scope: !77, file: !82, line: 33, type: !6, isLocal: false, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !79, globals: !81)
!78 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!79 = !{!80, !14}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !{!75}
!82 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !85, file: !129, line: 77, type: !165, isLocal: false, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !87, retainedTypes: !122, globals: !126)
!86 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!87 = !{!88, !102, !107}
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !89, line: 32, size: 32, elements: !90)
!89 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!91 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!92 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!93 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!94 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!95 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!96 = !DIEnumerator(name: "c_quoting_style", value: 5)
!97 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!98 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!99 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!100 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!101 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !89, line: 242, size: 32, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!105 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!106 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !108, line: 46, size: 32, elements: !109)
!108 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!110 = !DIEnumerator(name: "_ISupper", value: 256)
!111 = !DIEnumerator(name: "_ISlower", value: 512)
!112 = !DIEnumerator(name: "_ISalpha", value: 1024)
!113 = !DIEnumerator(name: "_ISdigit", value: 2048)
!114 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!115 = !DIEnumerator(name: "_ISspace", value: 8192)
!116 = !DIEnumerator(name: "_ISprint", value: 16384)
!117 = !DIEnumerator(name: "_ISgraph", value: 32768)
!118 = !DIEnumerator(name: "_ISblank", value: 1)
!119 = !DIEnumerator(name: "_IScntrl", value: 2)
!120 = !DIEnumerator(name: "_ISpunct", value: 4)
!121 = !DIEnumerator(name: "_ISalnum", value: 8)
!122 = !{!34, !30, !123, !14}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !124, line: 62, baseType: !125)
!124 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!126 = !{!83, !127, !134, !147, !149, !154, !161, !163}
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !85, file: !129, line: 93, type: !130, isLocal: false, isDefinition: true)
!129 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 320, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!132 = !{!133}
!133 = !DISubrange(count: 10)
!134 = !DIGlobalVariableExpression(var: !135)
!135 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !85, file: !129, line: 1043, type: !136, isLocal: false, isDefinition: true)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !129, line: 57, size: 448, elements: !137)
!137 = !{!138, !139, !140, !145, !146}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !136, file: !129, line: 60, baseType: !88, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !129, line: 63, baseType: !34, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !136, file: !129, line: 67, baseType: !141, size: 256, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 256, elements: !143)
!142 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!143 = !{!144}
!144 = !DISubrange(count: 8)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !136, file: !129, line: 70, baseType: !6, size: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !136, file: !129, line: 73, baseType: !6, size: 64, offset: 384)
!147 = !DIGlobalVariableExpression(var: !148)
!148 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !85, file: !129, line: 108, type: !136, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150)
!150 = distinct !DIGlobalVariable(name: "slot0", scope: !85, file: !129, line: 834, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 256)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "slotvec", scope: !85, file: !129, line: 837, type: !156, isLocal: true, isDefinition: true)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !129, line: 826, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !129, line: 828, baseType: !123, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !157, file: !129, line: 829, baseType: !14, size: 64, offset: 64)
!161 = !DIGlobalVariableExpression(var: !162)
!162 = distinct !DIGlobalVariable(name: "nslots", scope: !85, file: !129, line: 835, type: !34, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164)
!164 = distinct !DIGlobalVariable(name: "slotvec0", scope: !85, file: !129, line: 836, type: !157, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 704, elements: !167)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!167 = !{!168}
!168 = !DISubrange(count: 11)
!169 = !DIGlobalVariableExpression(var: !170)
!170 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !171, file: !174, line: 26, type: !175, isLocal: false, isDefinition: true)
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !173)
!172 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!173 = !{!169}
!174 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 47)
!178 = !DIGlobalVariableExpression(var: !179)
!179 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !180, file: !525, line: 120, type: !526, isLocal: true, isDefinition: true)
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, retainedTypes: !521, globals: !524)
!181 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!182 = !{!183}
!183 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !184, line: 41, size: 32, elements: !185)
!184 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!186 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!187 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!188 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!189 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!190 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!191 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!192 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!193 = !DIEnumerator(name: "DAY_1", value: 131079)
!194 = !DIEnumerator(name: "DAY_2", value: 131080)
!195 = !DIEnumerator(name: "DAY_3", value: 131081)
!196 = !DIEnumerator(name: "DAY_4", value: 131082)
!197 = !DIEnumerator(name: "DAY_5", value: 131083)
!198 = !DIEnumerator(name: "DAY_6", value: 131084)
!199 = !DIEnumerator(name: "DAY_7", value: 131085)
!200 = !DIEnumerator(name: "ABMON_1", value: 131086)
!201 = !DIEnumerator(name: "ABMON_2", value: 131087)
!202 = !DIEnumerator(name: "ABMON_3", value: 131088)
!203 = !DIEnumerator(name: "ABMON_4", value: 131089)
!204 = !DIEnumerator(name: "ABMON_5", value: 131090)
!205 = !DIEnumerator(name: "ABMON_6", value: 131091)
!206 = !DIEnumerator(name: "ABMON_7", value: 131092)
!207 = !DIEnumerator(name: "ABMON_8", value: 131093)
!208 = !DIEnumerator(name: "ABMON_9", value: 131094)
!209 = !DIEnumerator(name: "ABMON_10", value: 131095)
!210 = !DIEnumerator(name: "ABMON_11", value: 131096)
!211 = !DIEnumerator(name: "ABMON_12", value: 131097)
!212 = !DIEnumerator(name: "MON_1", value: 131098)
!213 = !DIEnumerator(name: "MON_2", value: 131099)
!214 = !DIEnumerator(name: "MON_3", value: 131100)
!215 = !DIEnumerator(name: "MON_4", value: 131101)
!216 = !DIEnumerator(name: "MON_5", value: 131102)
!217 = !DIEnumerator(name: "MON_6", value: 131103)
!218 = !DIEnumerator(name: "MON_7", value: 131104)
!219 = !DIEnumerator(name: "MON_8", value: 131105)
!220 = !DIEnumerator(name: "MON_9", value: 131106)
!221 = !DIEnumerator(name: "MON_10", value: 131107)
!222 = !DIEnumerator(name: "MON_11", value: 131108)
!223 = !DIEnumerator(name: "MON_12", value: 131109)
!224 = !DIEnumerator(name: "AM_STR", value: 131110)
!225 = !DIEnumerator(name: "PM_STR", value: 131111)
!226 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!227 = !DIEnumerator(name: "D_FMT", value: 131113)
!228 = !DIEnumerator(name: "T_FMT", value: 131114)
!229 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!230 = !DIEnumerator(name: "ERA", value: 131116)
!231 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!232 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!233 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!234 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!235 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!236 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!237 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!238 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!239 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!240 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!241 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!242 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!243 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!244 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!245 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!246 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!247 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!248 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!249 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!250 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!251 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!252 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!253 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!254 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!255 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!256 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!257 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!258 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!259 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!260 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!261 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!262 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!263 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!264 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!265 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!266 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!267 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!268 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!269 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!270 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!271 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!272 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!273 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!274 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!275 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!276 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!277 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!278 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!279 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!280 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!281 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!282 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!283 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!284 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!285 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!286 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!287 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!288 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!289 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!290 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!291 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!292 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!293 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!294 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!295 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!296 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!297 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!298 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!299 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!300 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!301 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!302 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!303 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!304 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!305 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!306 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!307 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!308 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!309 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!310 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!311 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!312 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!313 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!314 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!315 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!316 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!317 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!318 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!319 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!320 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!321 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!322 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!323 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!324 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!325 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!326 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!327 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!328 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!329 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!330 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!331 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!332 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!333 = !DIEnumerator(name: "CODESET", value: 14)
!334 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!335 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!336 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!337 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!338 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!339 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!340 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!341 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!342 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!343 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!344 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!345 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!346 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!347 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!348 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!349 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!350 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!351 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!352 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!353 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!354 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!355 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!356 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!357 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!358 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!359 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!360 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!361 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!362 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!363 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!364 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!365 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!366 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!367 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!368 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!369 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!370 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!371 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!372 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!373 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!374 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!375 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!376 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!377 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!378 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!379 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!380 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!381 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!382 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!383 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!384 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!385 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!386 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!387 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!388 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!389 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!390 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!391 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!392 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!393 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!394 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!395 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!396 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!397 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!398 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!399 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!400 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!401 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!402 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!403 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!404 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!405 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!406 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!407 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!408 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!409 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!410 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!411 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!412 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!413 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!414 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!415 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!416 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!417 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!418 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!419 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!420 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!421 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!422 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!423 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!424 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!425 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!426 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!427 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!428 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!429 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!430 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!431 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!432 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!433 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!434 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!435 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!436 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!437 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!438 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!439 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!440 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!441 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!442 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!443 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!444 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!445 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!446 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!447 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!448 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!449 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!450 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!451 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!452 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!453 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!454 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!455 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!456 = !DIEnumerator(name: "THOUSEP", value: 65537)
!457 = !DIEnumerator(name: "__GROUPING", value: 65538)
!458 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!459 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!460 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!461 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!462 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!463 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!464 = !DIEnumerator(name: "__YESSTR", value: 327682)
!465 = !DIEnumerator(name: "__NOSTR", value: 327683)
!466 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!467 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!468 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!469 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!470 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!471 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!472 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!473 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!474 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!475 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!476 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!477 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!478 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!479 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!480 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!481 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!482 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!483 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!484 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!485 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!486 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!487 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!488 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!489 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!490 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!491 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!492 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!493 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!494 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!495 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!496 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!497 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!498 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!499 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!500 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!501 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!502 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!503 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!504 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!505 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!506 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!507 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!508 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!509 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!510 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!511 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!512 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!513 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!514 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!515 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!516 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!517 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!518 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!519 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!520 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!521 = !{!80, !14, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!524 = !{!178}
!525 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!527 = !DIGlobalVariableExpression(var: !528)
!528 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !529, file: !540, line: 124, type: !555, isLocal: true, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !531, globals: !537)
!530 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!531 = !{!142, !34, !532, !523, !533, !30, !534, !125, !535, !536}
!532 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!533 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!534 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!535 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!536 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!537 = !{!538, !544, !547, !527}
!538 = !DIGlobalVariableExpression(var: !539, expr: !543)
!539 = distinct !DIGlobalVariable(name: "mktime_min", scope: !529, file: !540, line: 95, type: !541, isLocal: true, isDefinition: true)
!540 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !540, line: 68, baseType: !534)
!543 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!544 = !DIGlobalVariableExpression(var: !545, expr: !546)
!545 = distinct !DIGlobalVariable(name: "mktime_max", scope: !529, file: !540, line: 98, type: !541, isLocal: true, isDefinition: true)
!546 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!547 = !DIGlobalVariableExpression(var: !548)
!548 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !529, file: !540, line: 462, type: !549, isLocal: true, isDefinition: true)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !550, line: 30, baseType: !551)
!550 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !552, line: 8, baseType: !553)
!552 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !554, line: 148, baseType: !534)
!554 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 416, elements: !556)
!556 = !{!557, !26}
!557 = !DISubrange(count: 2)
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, retainedTypes: !578, globals: !583)
!559 = !DIFile(filename: "src/uptime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!560 = !{!561, !88, !566}
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 208, size: 32, elements: !563)
!562 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!563 = !{!564, !565}
!564 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1)
!565 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2)
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !568, file: !567, line: 187, size: 32, elements: !576)
!567 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!568 = distinct !DISubprogram(name: "select_plural", scope: !567, file: !567, line: 183, type: !569, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !558, variables: !574)
!569 = !DISubroutineType(types: !570)
!570 = !{!125, !571}
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !572, line: 136, baseType: !573)
!572 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !554, line: 62, baseType: !125)
!574 = !{!575}
!575 = !DILocalVariable(name: "n", arg: 1, scope: !568, file: !567, line: 183, type: !571)
!576 = !{!577}
!577 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!578 = !{!6, !80, !123, !579, !581, !551, !125, !523}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!583 = !{!584}
!584 = !DIGlobalVariableExpression(var: !585)
!585 = distinct !DIGlobalVariable(name: "infomap", scope: !586, file: !567, line: 632, type: !610, isLocal: true, isDefinition: true)
!586 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !567, file: !567, line: 630, type: !587, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !558, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !6}
!589 = !{!590, !591, !592, !599, !601, !602, !603, !606, !607, !609}
!590 = !DILocalVariable(name: "program", arg: 1, scope: !586, file: !567, line: 630, type: !6)
!591 = !DILocalVariable(name: "node", scope: !586, file: !567, line: 642, type: !6)
!592 = !DILocalVariable(name: "map_prog", scope: !586, file: !567, line: 643, type: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !586, file: !567, line: 632, size: 128, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !595, file: !567, line: 632, baseType: !6, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !595, file: !567, line: 632, baseType: !6, size: 64, offset: 64)
!599 = !DILocalVariable(name: "__s1_len", scope: !600, file: !567, line: 645, type: !123)
!600 = distinct !DILexicalBlock(scope: !586, file: !567, line: 645, column: 33)
!601 = !DILocalVariable(name: "__s2_len", scope: !600, file: !567, line: 645, type: !123)
!602 = !DILocalVariable(name: "lc_messages", scope: !586, file: !567, line: 655, type: !6)
!603 = !DILocalVariable(name: "__s1_len", scope: !604, file: !567, line: 656, type: !123)
!604 = distinct !DILexicalBlock(scope: !605, file: !567, line: 656, column: 22)
!605 = distinct !DILexicalBlock(scope: !586, file: !567, line: 656, column: 7)
!606 = !DILocalVariable(name: "__s2_len", scope: !604, file: !567, line: 656, type: !123)
!607 = !DILocalVariable(name: "__s2", scope: !608, file: !567, line: 656, type: !581)
!608 = distinct !DILexicalBlock(scope: !604, file: !567, line: 656, column: 22)
!609 = !DILocalVariable(name: "__result", scope: !608, file: !567, line: 656, type: !34)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 896, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 7)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !615)
!614 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!615 = !{!123, !6, !142, !34, !523}
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !618, retainedTypes: !623)
!617 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!618 = !{!619}
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !620, line: 41, size: 32, elements: !621)
!620 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = !{!622}
!622 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!623 = !{!80}
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, retainedTypes: !640)
!625 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!626 = !{!627}
!627 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !629, file: !628, line: 192, size: 32, elements: !638)
!628 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!629 = distinct !DISubprogram(name: "x2nrealloc", scope: !628, file: !628, line: 180, type: !630, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !624, variables: !633)
!630 = !DISubroutineType(types: !631)
!631 = !{!80, !80, !632, !123}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!633 = !{!634, !635, !636, !637}
!634 = !DILocalVariable(name: "p", arg: 1, scope: !629, file: !628, line: 180, type: !80)
!635 = !DILocalVariable(name: "pn", arg: 2, scope: !629, file: !628, line: 180, type: !632)
!636 = !DILocalVariable(name: "s", arg: 3, scope: !629, file: !628, line: 180, type: !123)
!637 = !DILocalVariable(name: "n", scope: !629, file: !628, line: 182, type: !123)
!638 = !{!639}
!639 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!640 = !{!123, !14, !80}
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!642 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !623)
!644 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!646 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !623)
!648 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !623)
!650 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !653)
!652 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!653 = !{!123}
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !656, retainedTypes: !664)
!655 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!656 = !{!561, !657}
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !658, file: !628, line: 192, size: 32, elements: !638)
!658 = distinct !DISubprogram(name: "x2nrealloc", scope: !628, file: !628, line: 180, type: !630, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !654, variables: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(name: "p", arg: 1, scope: !658, file: !628, line: 180, type: !80)
!661 = !DILocalVariable(name: "pn", arg: 2, scope: !658, file: !628, line: 180, type: !632)
!662 = !DILocalVariable(name: "s", arg: 3, scope: !658, file: !628, line: 180, type: !123)
!663 = !DILocalVariable(name: "n", scope: !658, file: !628, line: 182, type: !123)
!664 = !{!14, !80}
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !667, retainedTypes: !672, globals: !673)
!666 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!667 = !{!668}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !669, line: 49, size: 32, elements: !670)
!669 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = !{!671}
!671 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!672 = !{!14}
!673 = !{!674}
!674 = !DIGlobalVariableExpression(var: !675)
!675 = distinct !DIGlobalVariable(name: "local_tz", scope: !665, file: !669, line: 54, type: !676, isLocal: true, isDefinition: true)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !678, line: 594, baseType: !679)
!678 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !681, line: 21, size: 128, elements: !682)
!681 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !681, line: 25, baseType: !679, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !680, file: !681, line: 36, baseType: !8, size: 8, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !680, file: !681, line: 48, baseType: !686, offset: 72)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: -1)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!690 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !693)
!692 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = !{!123, !579, !581, !6}
!694 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!695 = !{i32 2, !"Dwarf Version", i32 4}
!696 = !{i32 2, !"Debug Info Version", i32 3}
!697 = !{i32 1, !"PIC Level", i32 2}
!698 = !{i32 1, !"PIE Level", i32 2}
!699 = distinct !DISubprogram(name: "usage", scope: !559, file: !559, line: 193, type: !700, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !558, variables: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !34}
!702 = !{!703}
!703 = !DILocalVariable(name: "status", arg: 1, scope: !699, file: !559, line: 193, type: !34)
!704 = !DIExpression()
!705 = !DILocation(line: 193, column: 12, scope: !699)
!706 = !DILocation(line: 195, column: 14, scope: !707)
!707 = distinct !DILexicalBlock(scope: !699, file: !559, line: 195, column: 7)
!708 = !DILocation(line: 195, column: 7, scope: !699)
!709 = !DILocation(line: 196, column: 5, scope: !710)
!710 = !DILexicalBlockFile(scope: !711, file: !559, discriminator: 1)
!711 = distinct !DILexicalBlock(scope: !707, file: !559, line: 196, column: 5)
!712 = !{!713, !713, i64 0}
!713 = !{!"any pointer", !714, i64 0}
!714 = !{!"omnipotent char", !715, i64 0}
!715 = !{!"Simple C/C++ TBAA"}
!716 = !DILocation(line: 196, column: 5, scope: !717)
!717 = !DILexicalBlockFile(scope: !711, file: !559, discriminator: 3)
!718 = !DILocation(line: 196, column: 5, scope: !719)
!719 = !DILexicalBlockFile(scope: !711, file: !559, discriminator: 2)
!720 = !DILocation(line: 199, column: 7, scope: !721)
!721 = distinct !DILexicalBlock(scope: !707, file: !559, line: 198, column: 5)
!722 = !DILocation(line: 199, column: 7, scope: !723)
!723 = !DILexicalBlockFile(scope: !721, file: !559, discriminator: 1)
!724 = !DILocation(line: 200, column: 7, scope: !721)
!725 = !DILocation(line: 200, column: 7, scope: !723)
!726 = !DILocation(line: 209, column: 7, scope: !721)
!727 = !DILocation(line: 209, column: 7, scope: !723)
!728 = !DILocation(line: 215, column: 7, scope: !721)
!729 = !DILocation(line: 215, column: 7, scope: !723)
!730 = !DILocation(line: 219, column: 7, scope: !721)
!731 = !DILocation(line: 219, column: 7, scope: !723)
!732 = !DILocation(line: 220, column: 7, scope: !721)
!733 = !DILocation(line: 220, column: 7, scope: !723)
!734 = !DILocation(line: 642, column: 15, scope: !586, inlinedAt: !735)
!735 = distinct !DILocation(line: 221, column: 7, scope: !721)
!736 = !DILocation(line: 651, column: 3, scope: !586, inlinedAt: !735)
!737 = !DILocation(line: 651, column: 3, scope: !738, inlinedAt: !735)
!738 = !DILexicalBlockFile(scope: !586, file: !567, discriminator: 1)
!739 = !DILocation(line: 655, column: 29, scope: !586, inlinedAt: !735)
!740 = !DILocation(line: 655, column: 15, scope: !586, inlinedAt: !735)
!741 = !DILocation(line: 656, column: 7, scope: !605, inlinedAt: !735)
!742 = !DILocation(line: 656, column: 19, scope: !605, inlinedAt: !735)
!743 = !DILocation(line: 656, column: 22, scope: !744, inlinedAt: !735)
!744 = !DILexicalBlockFile(scope: !605, file: !567, discriminator: 16)
!745 = !DILocation(line: 656, column: 7, scope: !746, inlinedAt: !735)
!746 = !DILexicalBlockFile(scope: !586, file: !567, discriminator: 16)
!747 = !DILocation(line: 662, column: 7, scope: !748, inlinedAt: !735)
!748 = distinct !DILexicalBlock(scope: !605, file: !567, line: 657, column: 5)
!749 = !DILocation(line: 662, column: 7, scope: !750, inlinedAt: !735)
!750 = !DILexicalBlockFile(scope: !748, file: !567, discriminator: 1)
!751 = !DILocation(line: 664, column: 5, scope: !748, inlinedAt: !735)
!752 = !DILocation(line: 665, column: 3, scope: !586, inlinedAt: !735)
!753 = !DILocation(line: 665, column: 3, scope: !738, inlinedAt: !735)
!754 = !DILocation(line: 667, column: 3, scope: !586, inlinedAt: !735)
!755 = !DILocation(line: 667, column: 3, scope: !738, inlinedAt: !735)
!756 = !DILocation(line: 223, column: 3, scope: !699)
!757 = distinct !DISubprogram(name: "main", scope: !559, file: !559, line: 227, type: !758, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, unit: !558, variables: !761)
!758 = !DISubroutineType(types: !759)
!759 = !{!34, !34, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!761 = !{!762, !763}
!762 = !DILocalVariable(name: "argc", arg: 1, scope: !757, file: !559, line: 227, type: !34)
!763 = !DILocalVariable(name: "argv", arg: 2, scope: !757, file: !559, line: 227, type: !760)
!764 = !DILocation(line: 227, column: 11, scope: !757)
!765 = !DILocation(line: 227, column: 24, scope: !757)
!766 = !DILocation(line: 230, column: 21, scope: !757)
!767 = !DILocation(line: 230, column: 3, scope: !757)
!768 = !DILocation(line: 231, column: 3, scope: !757)
!769 = !DILocation(line: 232, column: 3, scope: !757)
!770 = !DILocation(line: 233, column: 3, scope: !757)
!771 = !DILocation(line: 235, column: 3, scope: !757)
!772 = !DILocation(line: 237, column: 63, scope: !757)
!773 = !DILocation(line: 237, column: 3, scope: !757)
!774 = !DILocation(line: 239, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !757, file: !559, line: 239, column: 7)
!776 = !DILocation(line: 239, column: 48, scope: !775)
!777 = !DILocation(line: 239, column: 7, scope: !757)
!778 = !DILocation(line: 240, column: 5, scope: !775)
!779 = !DILocation(line: 242, column: 18, scope: !757)
!780 = !{!781, !781, i64 0}
!781 = !{!"int", !714, i64 0}
!782 = !DILocation(line: 242, column: 16, scope: !757)
!783 = !DILocation(line: 242, column: 3, scope: !757)
!784 = !DILocation(line: 245, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !757, file: !559, line: 243, column: 5)
!786 = !DILocation(line: 246, column: 7, scope: !785)
!787 = !DILocation(line: 249, column: 15, scope: !785)
!788 = !DILocation(line: 249, column: 7, scope: !785)
!789 = !DILocation(line: 250, column: 7, scope: !785)
!790 = !DILocation(line: 253, column: 20, scope: !785)
!791 = !DILocation(line: 253, column: 55, scope: !785)
!792 = !DILocation(line: 253, column: 62, scope: !785)
!793 = !DILocation(line: 253, column: 50, scope: !785)
!794 = !DILocation(line: 253, column: 43, scope: !795)
!795 = !DILexicalBlockFile(scope: !785, file: !559, discriminator: 1)
!796 = !DILocation(line: 253, column: 7, scope: !797)
!797 = !DILexicalBlockFile(scope: !785, file: !559, discriminator: 2)
!798 = !DILocation(line: 254, column: 7, scope: !785)
!799 = !DILocation(line: 257, column: 3, scope: !757)
!800 = distinct !DISubprogram(name: "uptime", scope: !559, file: !559, line: 177, type: !801, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, unit: !558, variables: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !6, !34}
!803 = !{!804, !805, !806, !807}
!804 = !DILocalVariable(name: "filename", arg: 1, scope: !800, file: !559, line: 177, type: !6)
!805 = !DILocalVariable(name: "options", arg: 2, scope: !800, file: !559, line: 177, type: !34)
!806 = !DILocalVariable(name: "n_users", scope: !800, file: !559, line: 179, type: !123)
!807 = !DILocalVariable(name: "utmp_buf", scope: !800, file: !559, line: 180, type: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !562, line: 146, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !811, line: 55, size: 3072, elements: !812)
!811 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!812 = !{!813, !814, !816, !820, !824, !825, !826, !831, !833, !838, !840}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !810, file: !811, line: 57, baseType: !533, size: 16)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !810, file: !811, line: 58, baseType: !815, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !554, line: 142, baseType: !34)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !810, file: !811, line: 59, baseType: !817, size: 256, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !810, file: !811, line: 60, baseType: !821, size: 32, offset: 320)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 4)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !810, file: !811, line: 61, baseType: !817, size: 256, offset: 352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !810, file: !811, line: 62, baseType: !151, size: 2048, offset: 608)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !810, file: !811, line: 63, baseType: !827, size: 32, offset: 2656)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !811, line: 42, size: 32, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !827, file: !811, line: 45, baseType: !533, size: 16)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !827, file: !811, line: 46, baseType: !533, size: 16, offset: 16)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !810, file: !811, line: 70, baseType: !832, size: 32, offset: 2688)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !554, line: 40, baseType: !34)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !810, file: !811, line: 75, baseType: !834, size: 64, offset: 2720)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !811, line: 71, size: 64, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !834, file: !811, line: 73, baseType: !832, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !834, file: !811, line: 74, baseType: !832, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !810, file: !811, line: 80, baseType: !839, size: 128, offset: 2784)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 128, elements: !822)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !810, file: !811, line: 81, baseType: !841, size: 160, offset: 2912)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 20)
!844 = !DILocalVariable(name: "avg", scope: !845, file: !559, line: 61, type: !939)
!845 = distinct !DISubprogram(name: "print_uptime", scope: !559, file: !559, line: 51, type: !846, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !558, variables: !850)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !123, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !844, !876, !877, !927, !933, !934, !937}
!851 = !DILocalVariable(name: "n", arg: 1, scope: !845, file: !559, line: 51, type: !123)
!852 = !DILocalVariable(name: "this", arg: 2, scope: !845, file: !559, line: 51, type: !848)
!853 = !DILocalVariable(name: "entries", scope: !845, file: !559, line: 53, type: !123)
!854 = !DILocalVariable(name: "boot_time", scope: !845, file: !559, line: 54, type: !551)
!855 = !DILocalVariable(name: "time_now", scope: !845, file: !559, line: 55, type: !551)
!856 = !DILocalVariable(name: "uptime", scope: !845, file: !559, line: 56, type: !551)
!857 = !DILocalVariable(name: "updays", scope: !845, file: !559, line: 57, type: !534)
!858 = !DILocalVariable(name: "uphours", scope: !845, file: !559, line: 58, type: !34)
!859 = !DILocalVariable(name: "upmins", scope: !845, file: !559, line: 59, type: !34)
!860 = !DILocalVariable(name: "tmn", scope: !845, file: !559, line: 60, type: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !863, line: 8, size: 448, elements: !864)
!863 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !862, file: !863, line: 10, baseType: !34, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !862, file: !863, line: 11, baseType: !34, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !862, file: !863, line: 12, baseType: !34, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !862, file: !863, line: 13, baseType: !34, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !862, file: !863, line: 14, baseType: !34, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !862, file: !863, line: 15, baseType: !34, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !862, file: !863, line: 16, baseType: !34, size: 32, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !862, file: !863, line: 17, baseType: !34, size: 32, offset: 224)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !862, file: !863, line: 18, baseType: !34, size: 32, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !862, file: !863, line: 21, baseType: !534, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !862, file: !863, line: 22, baseType: !6, size: 64, offset: 384)
!876 = !DILocalVariable(name: "loads", scope: !845, file: !559, line: 62, type: !34)
!877 = !DILocalVariable(name: "fp", scope: !845, file: !559, line: 64, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !880, line: 49, baseType: !881)
!880 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !882, line: 241, size: 1728, elements: !883)
!882 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !904, !905, !906, !907, !909, !910, !911, !915, !918, !920, !921, !922, !923, !924, !925, !926}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !881, file: !882, line: 242, baseType: !34, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !881, file: !882, line: 247, baseType: !14, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !881, file: !882, line: 248, baseType: !14, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !881, file: !882, line: 249, baseType: !14, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !881, file: !882, line: 250, baseType: !14, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !881, file: !882, line: 251, baseType: !14, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !881, file: !882, line: 252, baseType: !14, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !881, file: !882, line: 253, baseType: !14, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !881, file: !882, line: 254, baseType: !14, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !881, file: !882, line: 256, baseType: !14, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !881, file: !882, line: 257, baseType: !14, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !881, file: !882, line: 258, baseType: !14, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !881, file: !882, line: 260, baseType: !897, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !882, line: 156, size: 192, elements: !899)
!899 = !{!900, !901, !903}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !898, file: !882, line: 157, baseType: !897, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !898, file: !882, line: 158, baseType: !902, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !898, file: !882, line: 162, baseType: !34, size: 32, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !881, file: !882, line: 262, baseType: !902, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !881, file: !882, line: 264, baseType: !34, size: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !881, file: !882, line: 268, baseType: !34, size: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !881, file: !882, line: 270, baseType: !908, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !554, line: 140, baseType: !534)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !881, file: !882, line: 274, baseType: !30, size: 16, offset: 1024)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !881, file: !882, line: 275, baseType: !532, size: 8, offset: 1040)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !881, file: !882, line: 276, baseType: !912, size: 8, offset: 1048)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 1)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !881, file: !882, line: 280, baseType: !916, size: 64, offset: 1088)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !882, line: 150, baseType: null)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !881, file: !882, line: 289, baseType: !919, size: 64, offset: 1152)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !554, line: 141, baseType: !534)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !881, file: !882, line: 297, baseType: !80, size: 64, offset: 1216)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !881, file: !882, line: 298, baseType: !80, size: 64, offset: 1280)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !881, file: !882, line: 299, baseType: !80, size: 64, offset: 1344)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !881, file: !882, line: 300, baseType: !80, size: 64, offset: 1408)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !881, file: !882, line: 302, baseType: !123, size: 64, offset: 1472)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !881, file: !882, line: 303, baseType: !34, size: 32, offset: 1536)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !881, file: !882, line: 305, baseType: !841, size: 160, offset: 1568)
!927 = !DILocalVariable(name: "buf", scope: !928, file: !559, line: 69, type: !930)
!928 = distinct !DILexicalBlock(scope: !929, file: !559, line: 68, column: 5)
!929 = distinct !DILexicalBlock(scope: !845, file: !559, line: 67, column: 7)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 65536, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 8192)
!933 = !DILocalVariable(name: "b", scope: !928, file: !559, line: 70, type: !14)
!934 = !DILocalVariable(name: "end_ptr", scope: !935, file: !559, line: 73, type: !14)
!935 = distinct !DILexicalBlock(scope: !936, file: !559, line: 72, column: 9)
!936 = distinct !DILexicalBlock(scope: !928, file: !559, line: 71, column: 11)
!937 = !DILocalVariable(name: "upsecs", scope: !935, file: !559, line: 74, type: !938)
!938 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 192, elements: !73)
!940 = !DILocation(line: 61, column: 10, scope: !845, inlinedAt: !941)
!941 = distinct !DILocation(line: 187, column: 3, scope: !800)
!942 = !DILocation(line: 69, column: 12, scope: !928, inlinedAt: !941)
!943 = !DILocation(line: 177, column: 21, scope: !800)
!944 = !DILocation(line: 177, column: 35, scope: !800)
!945 = !DILocation(line: 179, column: 3, scope: !800)
!946 = !DILocation(line: 180, column: 3, scope: !800)
!947 = !DILocation(line: 180, column: 16, scope: !800)
!948 = !DIExpression(DW_OP_deref)
!949 = !DILocation(line: 179, column: 10, scope: !800)
!950 = !DILocation(line: 183, column: 7, scope: !951)
!951 = distinct !DILexicalBlock(scope: !800, file: !559, line: 183, column: 7)
!952 = !DILocation(line: 183, column: 58, scope: !951)
!953 = !DILocation(line: 183, column: 7, scope: !800)
!954 = !DILocation(line: 184, column: 5, scope: !951)
!955 = !DILocation(line: 184, column: 5, scope: !956)
!956 = !DILexicalBlockFile(scope: !951, file: !559, discriminator: 1)
!957 = !DILocation(line: 184, column: 5, scope: !958)
!958 = !DILexicalBlockFile(scope: !951, file: !559, discriminator: 2)
!959 = !DILocation(line: 187, column: 17, scope: !800)
!960 = !{!961, !961, i64 0}
!961 = !{!"long", !714, i64 0}
!962 = !DILocation(line: 187, column: 26, scope: !800)
!963 = !DILocation(line: 51, column: 22, scope: !845, inlinedAt: !941)
!964 = !DILocation(line: 51, column: 44, scope: !845, inlinedAt: !941)
!965 = !DILocation(line: 53, column: 10, scope: !845, inlinedAt: !941)
!966 = !DILocation(line: 54, column: 10, scope: !845, inlinedAt: !941)
!967 = !DILocation(line: 55, column: 3, scope: !845, inlinedAt: !941)
!968 = !DILocation(line: 56, column: 10, scope: !845, inlinedAt: !941)
!969 = !DILocation(line: 61, column: 3, scope: !845, inlinedAt: !941)
!970 = !DILocation(line: 66, column: 8, scope: !845, inlinedAt: !941)
!971 = !DILocation(line: 64, column: 9, scope: !845, inlinedAt: !941)
!972 = !DILocation(line: 67, column: 10, scope: !929, inlinedAt: !941)
!973 = !DILocation(line: 67, column: 7, scope: !845, inlinedAt: !941)
!974 = !DILocation(line: 69, column: 7, scope: !928, inlinedAt: !941)
!975 = !DILocation(line: 70, column: 17, scope: !928, inlinedAt: !941)
!976 = !DILocation(line: 70, column: 13, scope: !928, inlinedAt: !941)
!977 = !DILocation(line: 71, column: 13, scope: !936, inlinedAt: !941)
!978 = !DILocation(line: 71, column: 11, scope: !928, inlinedAt: !941)
!979 = !DILocation(line: 73, column: 11, scope: !935, inlinedAt: !941)
!980 = !DILocation(line: 73, column: 17, scope: !935, inlinedAt: !941)
!981 = !DILocation(line: 74, column: 27, scope: !935, inlinedAt: !941)
!982 = !DILocation(line: 74, column: 18, scope: !935, inlinedAt: !941)
!983 = !DILocation(line: 75, column: 22, scope: !984, inlinedAt: !941)
!984 = distinct !DILexicalBlock(scope: !935, file: !559, line: 75, column: 15)
!985 = !DILocation(line: 75, column: 19, scope: !984, inlinedAt: !941)
!986 = !DILocation(line: 75, column: 15, scope: !935, inlinedAt: !941)
!987 = !DILocation(line: 76, column: 25, scope: !984, inlinedAt: !941)
!988 = !DILocation(line: 76, column: 45, scope: !989, inlinedAt: !941)
!989 = !DILexicalBlockFile(scope: !984, file: !559, discriminator: 1)
!990 = !DILocation(line: 76, column: 35, scope: !984, inlinedAt: !941)
!991 = !DILocation(line: 76, column: 22, scope: !992, inlinedAt: !941)
!992 = !DILexicalBlockFile(scope: !984, file: !559, discriminator: 4)
!993 = !DILocation(line: 76, column: 13, scope: !992, inlinedAt: !941)
!994 = !DILocation(line: 78, column: 9, scope: !936, inlinedAt: !941)
!995 = !DILocation(line: 78, column: 9, scope: !935, inlinedAt: !941)
!996 = !DILocation(line: 80, column: 7, scope: !928, inlinedAt: !941)
!997 = !DILocation(line: 81, column: 5, scope: !929, inlinedAt: !941)
!998 = !DILocation(line: 81, column: 5, scope: !928, inlinedAt: !941)
!999 = !DILocation(line: 108, column: 3, scope: !1000, inlinedAt: !941)
!1000 = !DILexicalBlockFile(scope: !845, file: !559, discriminator: 1)
!1001 = !DILocation(line: 108, column: 11, scope: !1000, inlinedAt: !941)
!1002 = !DILocation(line: 110, column: 18, scope: !1003, inlinedAt: !941)
!1003 = distinct !DILexicalBlock(scope: !845, file: !559, line: 109, column: 5)
!1004 = !{!714, !714, i64 0}
!1005 = !{!1006, !1007, i64 0}
!1006 = !{!"utmpx", !1007, i64 0, !781, i64 4, !714, i64 8, !714, i64 40, !714, i64 44, !714, i64 76, !1008, i64 332, !781, i64 336, !1009, i64 340, !714, i64 348, !714, i64 364}
!1007 = !{!"short", !714, i64 0}
!1008 = !{!"__exit_status", !1007, i64 0, !1007, i64 2}
!1009 = !{!"", !781, i64 0, !781, i64 4}
!1010 = !DILocation(line: 110, column: 18, scope: !1011, inlinedAt: !941)
!1011 = !DILexicalBlockFile(scope: !1003, file: !559, discriminator: 1)
!1012 = !DILocation(line: 111, column: 11, scope: !1013, inlinedAt: !941)
!1013 = distinct !DILexicalBlock(scope: !1003, file: !559, line: 111, column: 11)
!1014 = !DILocation(line: 111, column: 11, scope: !1003, inlinedAt: !941)
!1015 = !DILocation(line: 112, column: 21, scope: !1013, inlinedAt: !941)
!1016 = !{!1006, !781, i64 340}
!1017 = !DILocation(line: 112, column: 9, scope: !1013, inlinedAt: !941)
!1018 = !DILocation(line: 113, column: 7, scope: !1003, inlinedAt: !941)
!1019 = !DILocation(line: 110, column: 15, scope: !1020, inlinedAt: !941)
!1020 = !DILexicalBlockFile(scope: !1003, file: !559, discriminator: 3)
!1021 = !DILocation(line: 120, column: 14, scope: !845, inlinedAt: !941)
!1022 = !DILocation(line: 55, column: 10, scope: !845, inlinedAt: !941)
!1023 = !DILocation(line: 120, column: 12, scope: !845, inlinedAt: !941)
!1024 = !DILocation(line: 122, column: 14, scope: !1025, inlinedAt: !941)
!1025 = distinct !DILexicalBlock(scope: !845, file: !559, line: 122, column: 7)
!1026 = !DILocation(line: 122, column: 7, scope: !845, inlinedAt: !941)
!1027 = !DILocation(line: 125, column: 21, scope: !1028, inlinedAt: !941)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !559, line: 125, column: 11)
!1029 = distinct !DILexicalBlock(scope: !1025, file: !559, line: 124, column: 5)
!1030 = !DILocation(line: 125, column: 11, scope: !1029, inlinedAt: !941)
!1031 = !DILocation(line: 126, column: 9, scope: !1028, inlinedAt: !941)
!1032 = !DILocation(line: 126, column: 9, scope: !1033, inlinedAt: !941)
!1033 = !DILexicalBlockFile(scope: !1028, file: !559, discriminator: 1)
!1034 = !DILocation(line: 126, column: 9, scope: !1035, inlinedAt: !941)
!1035 = !DILexicalBlockFile(scope: !1028, file: !559, discriminator: 2)
!1036 = !DILocation(line: 127, column: 25, scope: !1029, inlinedAt: !941)
!1037 = !DILocation(line: 128, column: 5, scope: !1029, inlinedAt: !941)
!1038 = !DILocation(line: 129, column: 19, scope: !845, inlinedAt: !941)
!1039 = !DILocation(line: 57, column: 12, scope: !845, inlinedAt: !941)
!1040 = !DILocation(line: 130, column: 21, scope: !845, inlinedAt: !941)
!1041 = !DILocation(line: 130, column: 41, scope: !845, inlinedAt: !941)
!1042 = !DILocation(line: 130, column: 13, scope: !845, inlinedAt: !941)
!1043 = !DILocation(line: 58, column: 7, scope: !845, inlinedAt: !941)
!1044 = !DILocation(line: 131, column: 41, scope: !845, inlinedAt: !941)
!1045 = !DILocation(line: 131, column: 39, scope: !845, inlinedAt: !941)
!1046 = !DILocation(line: 131, column: 59, scope: !845, inlinedAt: !941)
!1047 = !DILocation(line: 131, column: 12, scope: !845, inlinedAt: !941)
!1048 = !DILocation(line: 59, column: 7, scope: !845, inlinedAt: !941)
!1049 = !DILocation(line: 132, column: 9, scope: !845, inlinedAt: !941)
!1050 = !DILocation(line: 60, column: 14, scope: !845, inlinedAt: !941)
!1051 = !DILocation(line: 135, column: 7, scope: !1052, inlinedAt: !941)
!1052 = distinct !DILexicalBlock(scope: !845, file: !559, line: 135, column: 7)
!1053 = !DILocation(line: 135, column: 7, scope: !845, inlinedAt: !941)
!1054 = !DILocation(line: 137, column: 18, scope: !1052, inlinedAt: !941)
!1055 = !DILocation(line: 137, column: 26, scope: !1052, inlinedAt: !941)
!1056 = !DILocation(line: 137, column: 5, scope: !1057, inlinedAt: !941)
!1057 = !DILexicalBlockFile(scope: !1052, file: !559, discriminator: 1)
!1058 = !DILocation(line: 137, column: 5, scope: !1052, inlinedAt: !941)
!1059 = !DILocation(line: 139, column: 5, scope: !1052, inlinedAt: !941)
!1060 = !DILocation(line: 139, column: 5, scope: !1057, inlinedAt: !941)
!1061 = !DILocation(line: 140, column: 14, scope: !1062, inlinedAt: !941)
!1062 = distinct !DILexicalBlock(scope: !845, file: !559, line: 140, column: 7)
!1063 = !DILocation(line: 140, column: 7, scope: !845, inlinedAt: !941)
!1064 = !DILocation(line: 141, column: 5, scope: !1062, inlinedAt: !941)
!1065 = !DILocation(line: 141, column: 5, scope: !1066, inlinedAt: !941)
!1066 = !DILexicalBlockFile(scope: !1062, file: !559, discriminator: 1)
!1067 = !DILocation(line: 144, column: 13, scope: !1068, inlinedAt: !941)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !559, line: 144, column: 11)
!1069 = distinct !DILexicalBlock(scope: !1062, file: !559, line: 143, column: 5)
!1070 = !DILocation(line: 144, column: 11, scope: !1069, inlinedAt: !941)
!1071 = !DILocation(line: 145, column: 9, scope: !1072, inlinedAt: !941)
!1072 = !DILexicalBlockFile(scope: !1068, file: !559, discriminator: 1)
!1073 = !DILocation(line: 145, column: 9, scope: !1074, inlinedAt: !941)
!1074 = !DILexicalBlockFile(scope: !1068, file: !559, discriminator: 2)
!1075 = !DILocation(line: 145, column: 9, scope: !1068, inlinedAt: !941)
!1076 = !DILocation(line: 150, column: 9, scope: !1068, inlinedAt: !941)
!1077 = !DILocation(line: 150, column: 9, scope: !1072, inlinedAt: !941)
!1078 = !DILocation(line: 152, column: 3, scope: !1000, inlinedAt: !941)
!1079 = !DILocation(line: 152, column: 3, scope: !1080, inlinedAt: !941)
!1080 = !DILexicalBlockFile(scope: !845, file: !559, discriminator: 2)
!1081 = !DILocation(line: 155, column: 23, scope: !845, inlinedAt: !941)
!1082 = !DILocation(line: 155, column: 11, scope: !845, inlinedAt: !941)
!1083 = !DILocation(line: 62, column: 7, scope: !845, inlinedAt: !941)
!1084 = !DILocation(line: 157, column: 13, scope: !1085, inlinedAt: !941)
!1085 = distinct !DILexicalBlock(scope: !845, file: !559, line: 157, column: 7)
!1086 = !DILocation(line: 157, column: 7, scope: !845, inlinedAt: !941)
!1087 = !DILocalVariable(name: "__c", arg: 1, scope: !1088, file: !1089, line: 105, type: !34)
!1088 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1089, file: !1089, line: 105, type: !1090, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !558, variables: !1092)
!1089 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!34, !34}
!1092 = !{!1087}
!1093 = !DILocation(line: 105, column: 23, scope: !1088, inlinedAt: !1094)
!1094 = distinct !DILocation(line: 158, column: 5, scope: !1085, inlinedAt: !941)
!1095 = !DILocation(line: 107, column: 10, scope: !1088, inlinedAt: !1094)
!1096 = !{!1097, !713, i64 40}
!1097 = !{!"_IO_FILE", !781, i64 0, !713, i64 8, !713, i64 16, !713, i64 24, !713, i64 32, !713, i64 40, !713, i64 48, !713, i64 56, !713, i64 64, !713, i64 72, !713, i64 80, !713, i64 88, !713, i64 96, !713, i64 104, !781, i64 112, !781, i64 116, !961, i64 120, !1007, i64 128, !714, i64 130, !714, i64 131, !713, i64 136, !961, i64 144, !713, i64 152, !713, i64 160, !713, i64 168, !713, i64 176, !961, i64 184, !781, i64 192, !714, i64 196}
!1098 = !{!1097, !713, i64 48}
!1099 = !{!"branch_weights", i32 2000, i32 1}
!1100 = !DILocation(line: 107, column: 10, scope: !1101, inlinedAt: !1094)
!1101 = !DILexicalBlockFile(scope: !1088, file: !1089, discriminator: 1)
!1102 = !DILocation(line: 107, column: 10, scope: !1103, inlinedAt: !1094)
!1103 = !DILexicalBlockFile(scope: !1088, file: !1089, discriminator: 2)
!1104 = !DILocation(line: 161, column: 17, scope: !1105, inlinedAt: !941)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !559, line: 161, column: 11)
!1106 = distinct !DILexicalBlock(scope: !1085, file: !559, line: 160, column: 5)
!1107 = !DILocation(line: 161, column: 11, scope: !1106, inlinedAt: !941)
!1108 = !DILocation(line: 162, column: 9, scope: !1105, inlinedAt: !941)
!1109 = !{!1110, !1110, i64 0}
!1110 = !{!"double", !714, i64 0}
!1111 = !DILocation(line: 162, column: 9, scope: !1112, inlinedAt: !941)
!1112 = !DILexicalBlockFile(scope: !1105, file: !559, discriminator: 1)
!1113 = !DILocation(line: 163, column: 17, scope: !1114, inlinedAt: !941)
!1114 = distinct !DILexicalBlock(scope: !1106, file: !559, line: 163, column: 11)
!1115 = !DILocation(line: 163, column: 11, scope: !1106, inlinedAt: !941)
!1116 = !DILocation(line: 164, column: 9, scope: !1114, inlinedAt: !941)
!1117 = !DILocation(line: 165, column: 17, scope: !1118, inlinedAt: !941)
!1118 = distinct !DILexicalBlock(scope: !1106, file: !559, line: 165, column: 11)
!1119 = !DILocation(line: 165, column: 11, scope: !1106, inlinedAt: !941)
!1120 = !DILocation(line: 166, column: 9, scope: !1118, inlinedAt: !941)
!1121 = !DILocation(line: 105, column: 23, scope: !1088, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 168, column: 9, scope: !1123, inlinedAt: !941)
!1123 = distinct !DILexicalBlock(scope: !1106, file: !559, line: 167, column: 11)
!1124 = !DILocation(line: 107, column: 10, scope: !1088, inlinedAt: !1122)
!1125 = !DILocation(line: 107, column: 10, scope: !1101, inlinedAt: !1122)
!1126 = !DILocation(line: 107, column: 10, scope: !1103, inlinedAt: !1122)
!1127 = !DILocation(line: 170, column: 1, scope: !845, inlinedAt: !941)
!1128 = !DILocation(line: 190, column: 1, scope: !800)
!1129 = distinct !{!1129, !1130, !1131}
!1130 = !DILocation(line: 108, column: 3, scope: !845)
!1131 = !DILocation(line: 114, column: 5, scope: !845)
!1132 = distinct !DISubprogram(name: "c_strtod", scope: !39, file: !39, line: 66, type: !1133, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !11, variables: !1135)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!938, !6, !760}
!1135 = !{!1136, !1137, !1138, !1139}
!1136 = !DILocalVariable(name: "nptr", arg: 1, scope: !1132, file: !39, line: 66, type: !6)
!1137 = !DILocalVariable(name: "endptr", arg: 2, scope: !1132, file: !39, line: 66, type: !760)
!1138 = !DILocalVariable(name: "r", scope: !1132, file: !39, line: 68, type: !938)
!1139 = !DILocalVariable(name: "locale", scope: !1132, file: !39, line: 72, type: !15)
!1140 = !DILocation(line: 66, column: 23, scope: !1132)
!1141 = !DILocation(line: 66, column: 36, scope: !1132)
!1142 = !DILocation(line: 58, column: 8, scope: !1143, inlinedAt: !1147)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !39, line: 58, column: 7)
!1144 = distinct !DISubprogram(name: "c_locale", scope: !39, file: !39, line: 56, type: !1145, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !11, variables: !4)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!15}
!1147 = distinct !DILocation(line: 72, column: 21, scope: !1132)
!1148 = !DILocation(line: 58, column: 7, scope: !1144, inlinedAt: !1147)
!1149 = !DILocation(line: 59, column: 22, scope: !1143, inlinedAt: !1147)
!1150 = !DILocation(line: 59, column: 20, scope: !1143, inlinedAt: !1147)
!1151 = !DILocation(line: 59, column: 5, scope: !1143, inlinedAt: !1147)
!1152 = !DILocation(line: 60, column: 10, scope: !1144, inlinedAt: !1147)
!1153 = !DILocation(line: 72, column: 12, scope: !1132)
!1154 = !DILocation(line: 73, column: 8, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1132, file: !39, line: 73, column: 7)
!1156 = !DILocation(line: 73, column: 7, scope: !1132)
!1157 = !DILocation(line: 75, column: 11, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !39, line: 75, column: 11)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !39, line: 74, column: 5)
!1160 = !DILocation(line: 75, column: 11, scope: !1159)
!1161 = !DILocation(line: 76, column: 17, scope: !1158)
!1162 = !DILocation(line: 76, column: 9, scope: !1158)
!1163 = !DILocation(line: 80, column: 7, scope: !1132)
!1164 = !DILocation(line: 68, column: 10, scope: !1132)
!1165 = !DILocation(line: 111, column: 3, scope: !1132)
!1166 = !DILocation(line: 112, column: 1, scope: !1132)
!1167 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !48, file: !48, line: 41, type: !587, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !43, variables: !1168)
!1168 = !{!1169}
!1169 = !DILocalVariable(name: "file", arg: 1, scope: !1167, file: !48, line: 41, type: !6)
!1170 = !DILocation(line: 41, column: 41, scope: !1167)
!1171 = !DILocation(line: 43, column: 13, scope: !1167)
!1172 = !DILocation(line: 44, column: 1, scope: !1167)
!1173 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !48, file: !48, line: 78, type: !1174, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !43, variables: !1176)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null, !49}
!1176 = !{!1177}
!1177 = !DILocalVariable(name: "ignore", arg: 1, scope: !1173, file: !48, line: 78, type: !49)
!1178 = !DIExpression(DW_OP_LLVM_fragment, 0, 1)
!1179 = !DILocation(line: 78, column: 37, scope: !1173)
!1180 = !DILocation(line: 80, column: 16, scope: !1173)
!1181 = !{!1182, !1182, i64 0}
!1182 = !{!"_Bool", !714, i64 0}
!1183 = !DILocation(line: 81, column: 1, scope: !1173)
!1184 = distinct !DISubprogram(name: "close_stdout", scope: !48, file: !48, line: 107, type: !1185, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !43, variables: !1187)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null}
!1187 = !{!1188}
!1188 = !DILocalVariable(name: "write_error", scope: !1189, file: !48, line: 112, type: !6)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !48, line: 111, column: 5)
!1190 = distinct !DILexicalBlock(scope: !1184, file: !48, line: 109, column: 7)
!1191 = !DILocation(line: 109, column: 21, scope: !1190)
!1192 = !DILocation(line: 109, column: 7, scope: !1190)
!1193 = !DILocation(line: 109, column: 29, scope: !1190)
!1194 = !DILocation(line: 110, column: 7, scope: !1190)
!1195 = !DILocation(line: 110, column: 12, scope: !1196)
!1196 = !DILexicalBlockFile(scope: !1190, file: !48, discriminator: 1)
!1197 = !{i8 0, i8 2}
!1198 = !DILocation(line: 114, column: 19, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1189, file: !48, line: 113, column: 11)
!1200 = !DILocation(line: 110, column: 25, scope: !1196)
!1201 = !DILocation(line: 110, column: 28, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1190, file: !48, discriminator: 2)
!1203 = !DILocation(line: 110, column: 34, scope: !1202)
!1204 = !DILocation(line: 109, column: 7, scope: !1205)
!1205 = !DILexicalBlockFile(scope: !1184, file: !48, discriminator: 1)
!1206 = !DILocation(line: 112, column: 33, scope: !1189)
!1207 = !DILocation(line: 112, column: 19, scope: !1189)
!1208 = !DILocation(line: 113, column: 11, scope: !1199)
!1209 = !DILocation(line: 113, column: 11, scope: !1189)
!1210 = !DILocation(line: 114, column: 36, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1199, file: !48, discriminator: 1)
!1212 = !DILocation(line: 114, column: 9, scope: !1213)
!1213 = !DILexicalBlockFile(scope: !1199, file: !48, discriminator: 2)
!1214 = !DILocation(line: 114, column: 9, scope: !1199)
!1215 = !DILocation(line: 117, column: 9, scope: !1211)
!1216 = !DILocation(line: 119, column: 14, scope: !1189)
!1217 = !DILocation(line: 119, column: 7, scope: !1189)
!1218 = !DILocation(line: 122, column: 22, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1184, file: !48, line: 122, column: 8)
!1220 = !DILocation(line: 122, column: 8, scope: !1219)
!1221 = !DILocation(line: 122, column: 30, scope: !1219)
!1222 = !DILocation(line: 122, column: 8, scope: !1184)
!1223 = !DILocation(line: 123, column: 13, scope: !1219)
!1224 = !DILocation(line: 123, column: 6, scope: !1219)
!1225 = !DILocation(line: 124, column: 1, scope: !1184)
!1226 = distinct !DISubprogram(name: "fprintftime", scope: !1227, file: !1227, line: 422, type: !1228, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, unit: !613, variables: !1292)
!1227 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!123, !1230, !6, !1270, !1285, !34}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !880, line: 49, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !882, line: 241, size: 1728, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1232, file: !882, line: 242, baseType: !34, size: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1232, file: !882, line: 247, baseType: !14, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1232, file: !882, line: 248, baseType: !14, size: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1232, file: !882, line: 249, baseType: !14, size: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1232, file: !882, line: 250, baseType: !14, size: 64, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1232, file: !882, line: 251, baseType: !14, size: 64, offset: 320)
