!llvm.dbg.cu = !{!2, !684, !177, !183, !191, !701, !198, !205, !707, !709, !274, !717, !734, !736, !738, !742, !744, !895, !898, !900, !902, !904, !906, !283, !909, !301, !915, !917, !919, !921, !653, !923, !925}
!llvm.ident = !{!927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927, !927}
!llvm.module.flags = !{!928, !929, !930, !931}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !163, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !33, globals: !54)
!3 = !DIFile(filename: "src/chgrp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, size: 32, elements: !7)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0)
!9 = !DIEnumerator(name: "V_changes_only", value: 1)
!10 = !DIEnumerator(name: "V_off", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !26, line: 26, size: 32, elements: !27)
!26 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!29 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!30 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!31 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!32 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!33 = !{!34, !36, !37, !42, !44, !47, !49, !52}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !38, line: 80, baseType: !39)
!38 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !40, line: 134, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !38, line: 65, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !40, line: 135, baseType: !41)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 62, baseType: !46)
!45 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!46 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!54 = !{!55, !131, !133, !0}
!55 = !DIGlobalVariableExpression(var: !56)
!56 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !57, file: !3, line: 304, type: !77, isLocal: true, isDefinition: true)
!57 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !58, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !62)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !60, !61}
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!62 = !{!63, !64, !65, !67, !68, !69, !70, !90, !91, !92, !129}
!63 = !DILocalVariable(name: "argc", arg: 1, scope: !57, file: !3, line: 173, type: !60)
!64 = !DILocalVariable(name: "argv", arg: 2, scope: !57, file: !3, line: 173, type: !61)
!65 = !DILocalVariable(name: "preserve_root", scope: !57, file: !3, line: 175, type: !66)
!66 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DILocalVariable(name: "gid", scope: !57, file: !3, line: 176, type: !42)
!68 = !DILocalVariable(name: "bit_flags", scope: !57, file: !3, line: 179, type: !60)
!69 = !DILocalVariable(name: "dereference", scope: !57, file: !3, line: 183, type: !60)
!70 = !DILocalVariable(name: "chopt", scope: !57, file: !3, line: 185, type: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !72)
!72 = !{!73, !74, !75, !86, !87, !88, !89}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !71, file: !6, line: 46, baseType: !5, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !71, file: !6, line: 49, baseType: !66, size: 8, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !71, file: !6, line: 53, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !78, line: 7, size: 128, elements: !79)
!78 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!79 = !{!80, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !77, file: !78, line: 9, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !38, line: 48, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !40, line: 136, baseType: !46)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !77, file: !78, line: 10, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !38, line: 60, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !40, line: 133, baseType: !46)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !71, file: !6, line: 56, baseType: !66, size: 8, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !71, file: !6, line: 59, baseType: !66, size: 8, offset: 136)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !71, file: !6, line: 62, baseType: !34, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !71, file: !6, line: 65, baseType: !34, size: 64, offset: 256)
!90 = !DILocalVariable(name: "ok", scope: !57, file: !3, line: 186, type: !66)
!91 = !DILocalVariable(name: "optc", scope: !57, file: !3, line: 187, type: !60)
!92 = !DILocalVariable(name: "ref_stats", scope: !93, file: !3, line: 287, type: !95)
!93 = distinct !DILexicalBlock(scope: !94, file: !3, line: 286, column: 5)
!94 = distinct !DILexicalBlock(scope: !57, file: !3, line: 285, column: 7)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !96, line: 46, size: 1152, elements: !97)
!96 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!97 = !{!98, !99, !100, !102, !104, !105, !106, !107, !108, !111, !113, !115, !123, !124, !125}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !95, file: !96, line: 48, baseType: !85, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !95, file: !96, line: 53, baseType: !82, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !95, file: !96, line: 61, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !40, line: 139, baseType: !46)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !95, file: !96, line: 62, baseType: !103, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 138, baseType: !41)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !95, file: !96, line: 64, baseType: !39, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !95, file: !96, line: 65, baseType: !43, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !95, file: !96, line: 67, baseType: !60, size: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !95, file: !96, line: 69, baseType: !85, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !95, file: !96, line: 74, baseType: !109, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !110)
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !95, file: !96, line: 78, baseType: !112, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !40, line: 162, baseType: !110)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !95, file: !96, line: 80, baseType: !114, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !40, line: 167, baseType: !110)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !95, file: !96, line: 91, baseType: !116, size: 128, offset: 576)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !117, line: 8, size: 128, elements: !118)
!117 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!118 = !{!119, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !116, file: !117, line: 10, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 148, baseType: !110)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !116, file: !117, line: 11, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !40, line: 184, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !95, file: !96, line: 92, baseType: !116, size: 128, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !95, file: !96, line: 93, baseType: !116, size: 128, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !95, file: !96, line: 106, baseType: !126, size: 192, offset: 960)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 192, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DILocalVariable(name: "group_name", scope: !130, file: !3, line: 297, type: !34)
!130 = distinct !DILexicalBlock(scope: !94, file: !3, line: 296, column: 5)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 47, type: !34, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "infomap", scope: !135, file: !136, line: 632, type: !160, isLocal: true, isDefinition: true)
!135 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !136, file: !136, line: 630, type: !137, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !139)
!136 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !52}
!139 = !{!140, !141, !142, !149, !151, !152, !153, !156, !157, !159}
!140 = !DILocalVariable(name: "program", arg: 1, scope: !135, file: !136, line: 630, type: !52)
!141 = !DILocalVariable(name: "node", scope: !135, file: !136, line: 642, type: !52)
!142 = !DILocalVariable(name: "map_prog", scope: !135, file: !136, line: 643, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !135, file: !136, line: 632, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !145, file: !136, line: 632, baseType: !52, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !145, file: !136, line: 632, baseType: !52, size: 64, offset: 64)
!149 = !DILocalVariable(name: "__s1_len", scope: !150, file: !136, line: 645, type: !44)
!150 = distinct !DILexicalBlock(scope: !135, file: !136, line: 645, column: 33)
!151 = !DILocalVariable(name: "__s2_len", scope: !150, file: !136, line: 645, type: !44)
!152 = !DILocalVariable(name: "lc_messages", scope: !135, file: !136, line: 655, type: !52)
!153 = !DILocalVariable(name: "__s1_len", scope: !154, file: !136, line: 656, type: !44)
!154 = distinct !DILexicalBlock(scope: !155, file: !136, line: 656, column: 22)
!155 = distinct !DILexicalBlock(scope: !135, file: !136, line: 656, column: 7)
!156 = !DILocalVariable(name: "__s2_len", scope: !154, file: !136, line: 656, type: !44)
!157 = !DILocalVariable(name: "__s2", scope: !158, file: !136, line: 656, type: !49)
!158 = distinct !DILexicalBlock(scope: !154, file: !136, line: 656, column: 22)
!159 = !DILocalVariable(name: "__result", scope: !158, file: !136, line: 656, type: !60)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 896, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 7)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 3328, elements: !173)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !166, line: 104, size: 256, elements: !167)
!166 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!167 = !{!168, !169, !170, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !166, line: 106, baseType: !52, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !165, file: !166, line: 109, baseType: !60, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !165, file: !166, line: 110, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !165, file: !166, line: 111, baseType: !60, size: 32, offset: 192)
!173 = !{!174}
!174 = !DISubrange(count: 13)
!175 = !DIGlobalVariableExpression(var: !176)
!176 = distinct !DIGlobalVariable(name: "Version", scope: !177, file: !178, line: 2, type: !52, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, globals: !180)
!178 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!179 = !{}
!180 = !{!175}
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "file_name", scope: !183, file: !188, line: 36, type: !52, isLocal: true, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, globals: !185)
!184 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!185 = !{!181, !186}
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !183, file: !188, line: 46, type: !66, isLocal: true, isDefinition: true)
!188 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "exit_failure", scope: !191, file: !194, line: 24, type: !195, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, globals: !193)
!192 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!193 = !{!189}
!194 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!195 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "program_name", scope: !198, file: !202, line: 33, type: !52, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !200, globals: !201)
!199 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{!36, !34}
!201 = !{!196}
!202 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !205, file: !233, line: 77, type: !268, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !207, retainedTypes: !228, globals: !230)
!206 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!207 = !{!11, !208, !213}
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, size: 32, elements: !209)
!209 = !{!210, !211, !212}
!210 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!211 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!212 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !214, line: 46, size: 32, elements: !215)
!214 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!216 = !DIEnumerator(name: "_ISupper", value: 256)
!217 = !DIEnumerator(name: "_ISlower", value: 512)
!218 = !DIEnumerator(name: "_ISalpha", value: 1024)
!219 = !DIEnumerator(name: "_ISdigit", value: 2048)
!220 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!221 = !DIEnumerator(name: "_ISspace", value: 8192)
!222 = !DIEnumerator(name: "_ISprint", value: 16384)
!223 = !DIEnumerator(name: "_ISgraph", value: 32768)
!224 = !DIEnumerator(name: "_ISblank", value: 1)
!225 = !DIEnumerator(name: "_IScntrl", value: 2)
!226 = !DIEnumerator(name: "_ISpunct", value: 4)
!227 = !DIEnumerator(name: "_ISalnum", value: 8)
!228 = !{!60, !229, !44, !34}
!229 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!230 = !{!203, !231, !238, !250, !252, !257, !264, !266}
!231 = !DIGlobalVariableExpression(var: !232)
!232 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !205, file: !233, line: 93, type: !234, isDefinition: true)
!233 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 320, elements: !236)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!236 = !{!237}
!237 = !DISubrange(count: 10)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !205, file: !233, line: 1043, type: !240, isDefinition: true)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !233, line: 57, size: 448, elements: !241)
!241 = !{!242, !243, !244, !248, !249}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !240, file: !233, line: 60, baseType: !11, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !240, file: !233, line: 63, baseType: !60, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !240, file: !233, line: 67, baseType: !245, size: 256, offset: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !240, file: !233, line: 70, baseType: !52, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !240, file: !233, line: 73, baseType: !52, size: 64, offset: 384)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !205, file: !233, line: 108, type: !240, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "slot0", scope: !205, file: !233, line: 834, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 256)
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "slotvec", scope: !205, file: !233, line: 837, type: !259, isLocal: true, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !233, line: 826, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !260, file: !233, line: 828, baseType: !44, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !260, file: !233, line: 829, baseType: !34, size: 64, offset: 64)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "nslots", scope: !205, file: !233, line: 835, type: !60, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "slotvec0", scope: !205, file: !233, line: 836, type: !260, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 704, elements: !270)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!270 = !{!271}
!271 = !DISubrange(count: 11)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !274, file: !277, line: 26, type: !278, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, globals: !276)
!275 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !{!272}
!277 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 376, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 47)
!281 = !DIGlobalVariableExpression(var: !282)
!282 = distinct !DIGlobalVariable(name: "default_tuning", scope: !283, file: !287, line: 130, type: !288, isLocal: true, isDefinition: true)
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !285, globals: !286)
!284 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!285 = !{!46, !36, !44}
!286 = !{!281}
!287 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !290, line: 65, baseType: !291)
!290 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !290, line: 53, size: 160, elements: !292)
!292 = !{!293, !295, !296, !297, !298}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !291, file: !290, line: 58, baseType: !294, size: 32)
!294 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !291, file: !290, line: 59, baseType: !294, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !291, file: !290, line: 60, baseType: !294, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !291, file: !290, line: 61, baseType: !294, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !291, file: !290, line: 62, baseType: !66, size: 8, offset: 128)
!299 = !DIGlobalVariableExpression(var: !300)
!300 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !301, file: !645, line: 120, type: !646, isLocal: true, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !303, retainedTypes: !642, globals: !644)
!302 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!303 = !{!304}
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !305, line: 41, size: 32, elements: !306)
!305 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!307 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!308 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!309 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!310 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!311 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!312 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!313 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!314 = !DIEnumerator(name: "DAY_1", value: 131079)
!315 = !DIEnumerator(name: "DAY_2", value: 131080)
!316 = !DIEnumerator(name: "DAY_3", value: 131081)
!317 = !DIEnumerator(name: "DAY_4", value: 131082)
!318 = !DIEnumerator(name: "DAY_5", value: 131083)
!319 = !DIEnumerator(name: "DAY_6", value: 131084)
!320 = !DIEnumerator(name: "DAY_7", value: 131085)
!321 = !DIEnumerator(name: "ABMON_1", value: 131086)
!322 = !DIEnumerator(name: "ABMON_2", value: 131087)
!323 = !DIEnumerator(name: "ABMON_3", value: 131088)
!324 = !DIEnumerator(name: "ABMON_4", value: 131089)
!325 = !DIEnumerator(name: "ABMON_5", value: 131090)
!326 = !DIEnumerator(name: "ABMON_6", value: 131091)
!327 = !DIEnumerator(name: "ABMON_7", value: 131092)
!328 = !DIEnumerator(name: "ABMON_8", value: 131093)
!329 = !DIEnumerator(name: "ABMON_9", value: 131094)
!330 = !DIEnumerator(name: "ABMON_10", value: 131095)
!331 = !DIEnumerator(name: "ABMON_11", value: 131096)
!332 = !DIEnumerator(name: "ABMON_12", value: 131097)
!333 = !DIEnumerator(name: "MON_1", value: 131098)
!334 = !DIEnumerator(name: "MON_2", value: 131099)
!335 = !DIEnumerator(name: "MON_3", value: 131100)
!336 = !DIEnumerator(name: "MON_4", value: 131101)
!337 = !DIEnumerator(name: "MON_5", value: 131102)
!338 = !DIEnumerator(name: "MON_6", value: 131103)
!339 = !DIEnumerator(name: "MON_7", value: 131104)
!340 = !DIEnumerator(name: "MON_8", value: 131105)
!341 = !DIEnumerator(name: "MON_9", value: 131106)
!342 = !DIEnumerator(name: "MON_10", value: 131107)
!343 = !DIEnumerator(name: "MON_11", value: 131108)
!344 = !DIEnumerator(name: "MON_12", value: 131109)
!345 = !DIEnumerator(name: "AM_STR", value: 131110)
!346 = !DIEnumerator(name: "PM_STR", value: 131111)
!347 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!348 = !DIEnumerator(name: "D_FMT", value: 131113)
!349 = !DIEnumerator(name: "T_FMT", value: 131114)
!350 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!351 = !DIEnumerator(name: "ERA", value: 131116)
!352 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!353 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!354 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!355 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!356 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!357 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!358 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!359 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!360 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!361 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!362 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!363 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!364 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!365 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!366 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!367 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!368 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!369 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!370 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!371 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!372 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!373 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!374 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!375 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!376 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!377 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!378 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!379 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!380 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!381 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!382 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!383 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!384 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!385 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!386 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!387 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!388 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!389 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!390 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!391 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!392 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!393 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!394 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!395 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!396 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!397 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!398 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!399 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!400 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!401 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!402 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!403 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!404 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!405 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!406 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!407 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!408 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!409 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!410 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!411 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!412 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!413 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!414 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!415 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!416 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!417 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!418 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!419 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!420 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!421 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!422 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!423 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!424 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!425 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!426 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!427 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!428 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!429 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!430 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!431 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!432 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!433 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!434 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!435 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!436 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!437 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!438 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!439 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!440 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!441 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!442 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!443 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!444 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!445 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!446 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!447 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!448 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!449 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!450 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!451 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!452 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!453 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!454 = !DIEnumerator(name: "CODESET", value: 14)
!455 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!456 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!457 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!458 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!501 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!502 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!503 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!504 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!505 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!506 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!507 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!508 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!509 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!510 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!511 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!512 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!513 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!514 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!515 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!516 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!519 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!520 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!521 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!524 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!525 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!526 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!527 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!528 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!529 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!530 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!531 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!532 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!533 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!534 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!535 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!536 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!537 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!538 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!539 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!540 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!541 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!542 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!543 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!544 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!545 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!546 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!547 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!548 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!550 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!551 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!558 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!563 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!565 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!566 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!569 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!570 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!571 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!572 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!573 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!574 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!575 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!576 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!577 = !DIEnumerator(name: "THOUSEP", value: 65537)
!578 = !DIEnumerator(name: "__GROUPING", value: 65538)
!579 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!580 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!581 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!582 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!583 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!584 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!585 = !DIEnumerator(name: "__YESSTR", value: 327682)
!586 = !DIEnumerator(name: "__NOSTR", value: 327683)
!587 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!588 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!589 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!590 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!591 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!592 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!593 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!594 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!595 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!596 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!597 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!598 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!599 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!600 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!601 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!602 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!603 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!604 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!605 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!606 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!607 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!608 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!609 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!610 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!611 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!612 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!613 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!614 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!615 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!616 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!617 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!618 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!619 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!620 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!621 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!622 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!623 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!624 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!625 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!626 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!627 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!628 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!633 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!638 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!639 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!640 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!641 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!642 = !{!36, !34, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!644 = !{!299}
!645 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!647 = !DIGlobalVariableExpression(var: !648)
!648 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !649, file: !650, line: 335, type: !60, isLocal: true, isDefinition: true)
!649 = distinct !DISubprogram(name: "rpl_fcntl", scope: !650, file: !650, line: 272, type: !651, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !653, variables: !656)
!650 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = !DISubroutineType(types: !652)
!652 = !{!60, !60, !60, null}
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, globals: !655)
!654 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = !{!647}
!656 = !{!657, !658, !659, !672, !673, !676, !679, !682}
!657 = !DILocalVariable(name: "fd", arg: 1, scope: !649, file: !650, line: 272, type: !60)
!658 = !DILocalVariable(name: "action", arg: 2, scope: !649, file: !650, line: 272, type: !60)
!659 = !DILocalVariable(name: "arg", scope: !649, file: !650, line: 274, type: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !661, line: 30, baseType: !662)
!661 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !654, line: 274, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 192, elements: !670)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !654, line: 274, size: 192, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !664, file: !654, line: 274, baseType: !41, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !664, file: !654, line: 274, baseType: !41, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !664, file: !654, line: 274, baseType: !36, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !664, file: !654, line: 274, baseType: !36, size: 64, offset: 128)
!670 = !{!671}
!671 = !DISubrange(count: 1)
!672 = !DILocalVariable(name: "result", scope: !649, file: !650, line: 275, type: !60)
!673 = !DILocalVariable(name: "target", scope: !674, file: !650, line: 322, type: !60)
!674 = distinct !DILexicalBlock(scope: !675, file: !650, line: 321, column: 7)
!675 = distinct !DILexicalBlock(scope: !649, file: !650, line: 278, column: 5)
!676 = !DILocalVariable(name: "flags", scope: !677, file: !650, line: 359, type: !60)
!677 = distinct !DILexicalBlock(scope: !678, file: !650, line: 358, column: 11)
!678 = distinct !DILexicalBlock(scope: !674, file: !650, line: 357, column: 13)
!679 = !DILocalVariable(name: "saved_errno", scope: !680, file: !650, line: 362, type: !60)
!680 = distinct !DILexicalBlock(scope: !681, file: !650, line: 361, column: 15)
!681 = distinct !DILexicalBlock(scope: !677, file: !650, line: 360, column: 17)
!682 = !DILocalVariable(name: "p", scope: !683, file: !650, line: 404, type: !36)
!683 = distinct !DILexicalBlock(scope: !675, file: !650, line: 402, column: 7)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !686, retainedTypes: !700)
!685 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!686 = !{!5, !11, !687, !694}
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !685, line: 38, size: 32, elements: !688)
!688 = !{!689, !690, !691, !692, !693}
!689 = !DIEnumerator(name: "RC_ok", value: 2)
!690 = !DIEnumerator(name: "RC_excluded", value: 3)
!691 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!692 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!693 = !DIEnumerator(name: "RC_error", value: 6)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!697 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!698 = !DIEnumerator(name: "CH_FAILED", value: 3)
!699 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!700 = !{!37, !42, !36, !44, !47, !49, !52}
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !703)
!702 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !705, line: 136, baseType: !706)
!705 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !40, line: 62, baseType: !46)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!708 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !711, retainedTypes: !716)
!710 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !{!712}
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !713, line: 41, size: 32, elements: !714)
!713 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!714 = !{!715}
!715 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!716 = !{!36}
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !719, retainedTypes: !733)
!718 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!719 = !{!720}
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !722, file: !721, line: 192, size: 32, elements: !731)
!721 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!722 = distinct !DISubprogram(name: "x2nrealloc", scope: !721, file: !721, line: 180, type: !723, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !717, variables: !726)
!723 = !DISubroutineType(types: !724)
!724 = !{!36, !36, !725, !44}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!726 = !{!727, !728, !729, !730}
!727 = !DILocalVariable(name: "p", arg: 1, scope: !722, file: !721, line: 180, type: !36)
!728 = !DILocalVariable(name: "pn", arg: 2, scope: !722, file: !721, line: 180, type: !725)
!729 = !DILocalVariable(name: "s", arg: 3, scope: !722, file: !721, line: 180, type: !44)
!730 = !DILocalVariable(name: "n", scope: !722, file: !721, line: 182, type: !44)
!731 = !{!732}
!732 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!733 = !{!44, !34, !36}
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!735 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !716)
!737 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !740, retainedTypes: !741)
!739 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!740 = !{!25, !213}
!741 = !{!60, !229, !34}
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !716)
!743 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !746, retainedTypes: !887)
!745 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = !{!747, !752, !870, !873, !884}
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !748, line: 160, size: 32, elements: !749)
!748 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!749 = !{!750, !751}
!750 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!751 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !754, file: !753, line: 54, size: 32, elements: !868)
!753 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = distinct !DISubprogram(name: "setup_dir", scope: !753, file: !753, line: 50, type: !755, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !744, variables: !866)
!755 = !DISubroutineType(types: !756)
!756 = !{!66, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !759, line: 199, baseType: !760)
!759 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 80, size: 1024, elements: !761)
!761 = !{!762, !817, !818, !820, !821, !822, !823, !824, !825, !826, !833, !834, !837, !853}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !760, file: !759, line: 81, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !759, line: 201, size: 2112, elements: !765)
!765 = !{!766, !767, !768, !769, !774, !775, !776, !777, !778, !779, !780, !781, !782, !784, !785, !787, !788, !789, !790, !813}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !764, file: !759, line: 202, baseType: !763, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !764, file: !759, line: 203, baseType: !763, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !764, file: !759, line: 204, baseType: !763, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !764, file: !759, line: 205, baseType: !770, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !772, line: 127, baseType: !773)
!772 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !772, line: 127, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !764, file: !759, line: 208, baseType: !110, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !764, file: !759, line: 209, baseType: !36, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !764, file: !759, line: 210, baseType: !34, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !764, file: !759, line: 211, baseType: !34, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !764, file: !759, line: 212, baseType: !60, size: 32, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !764, file: !759, line: 213, baseType: !60, size: 32, offset: 544)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !764, file: !759, line: 214, baseType: !44, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !764, file: !759, line: 216, baseType: !757, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !764, file: !759, line: 220, baseType: !783, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !45, line: 51, baseType: !110)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !764, file: !759, line: 222, baseType: !44, size: 64, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !764, file: !759, line: 223, baseType: !786, size: 64, offset: 832)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !38, line: 75, baseType: !101)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !764, file: !759, line: 239, baseType: !229, size: 16, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !764, file: !759, line: 243, baseType: !229, size: 16, offset: 912)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !764, file: !759, line: 249, baseType: !229, size: 16, offset: 928)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !764, file: !759, line: 251, baseType: !791, size: 1152, offset: 960)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 1152, elements: !670)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !96, line: 46, size: 1152, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !810, !811, !812}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !792, file: !96, line: 48, baseType: !85, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !792, file: !96, line: 53, baseType: !82, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !792, file: !96, line: 61, baseType: !101, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !792, file: !96, line: 62, baseType: !103, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !792, file: !96, line: 64, baseType: !39, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !792, file: !96, line: 65, baseType: !43, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !792, file: !96, line: 67, baseType: !60, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !792, file: !96, line: 69, baseType: !85, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !792, file: !96, line: 74, baseType: !109, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !792, file: !96, line: 78, baseType: !112, size: 64, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !792, file: !96, line: 80, baseType: !114, size: 64, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !792, file: !96, line: 91, baseType: !806, size: 128, offset: 576)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !117, line: 8, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !806, file: !117, line: 10, baseType: !120, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !806, file: !117, line: 11, baseType: !122, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !792, file: !96, line: 92, baseType: !806, size: 128, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !792, file: !96, line: 93, baseType: !806, size: 128, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !792, file: !96, line: 106, baseType: !126, size: 192, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !764, file: !759, line: 252, baseType: !814, offset: 2112)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: -1)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !760, file: !759, line: 82, baseType: !763, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !760, file: !759, line: 83, baseType: !819, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !760, file: !759, line: 84, baseType: !84, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !760, file: !759, line: 85, baseType: !34, size: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !760, file: !759, line: 86, baseType: !60, size: 32, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !760, file: !759, line: 87, baseType: !60, size: 32, offset: 352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !760, file: !759, line: 89, baseType: !44, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !760, file: !759, line: 90, baseType: !44, size: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !760, file: !759, line: 91, baseType: !827, size: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!60, !830, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !760, file: !759, line: 162, baseType: !60, size: 32, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !760, file: !759, line: 171, baseType: !835, size: 64, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !759, line: 171, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !760, file: !759, line: 193, baseType: !838, size: 64, offset: 704)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !760, file: !759, line: 173, size: 64, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !838, file: !759, line: 186, baseType: !835, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !838, file: !759, line: 192, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !844, line: 28, size: 256, elements: !845)
!844 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!845 = !{!846, !851, !852}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !843, file: !844, line: 30, baseType: !847, size: 128)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !78, line: 7, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !847, file: !78, line: 9, baseType: !81, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !847, file: !78, line: 10, baseType: !84, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !843, file: !844, line: 31, baseType: !704, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !843, file: !844, line: 32, baseType: !60, size: 32, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !760, file: !759, line: 198, baseType: !854, size: 256, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !855, line: 39, baseType: !856)
!855 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !855, line: 31, size: 256, elements: !857)
!857 = !{!858, !862, !863, !864, !865}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !856, file: !855, line: 33, baseType: !859, size: 128)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 4)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !856, file: !855, line: 34, baseType: !60, size: 32, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !856, file: !855, line: 35, baseType: !41, size: 32, offset: 160)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !856, file: !855, line: 36, baseType: !41, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !856, file: !855, line: 37, baseType: !66, size: 8, offset: 224)
!866 = !{!867}
!867 = !DILocalVariable(name: "fts", arg: 1, scope: !754, file: !753, line: 50, type: !757)
!868 = !{!869}
!869 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !748, line: 763, size: 32, elements: !871)
!871 = !{!872}
!872 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !772, line: 97, size: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883}
!875 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!876 = !DIEnumerator(name: "DT_FIFO", value: 1)
!877 = !DIEnumerator(name: "DT_CHR", value: 2)
!878 = !DIEnumerator(name: "DT_DIR", value: 4)
!879 = !DIEnumerator(name: "DT_BLK", value: 6)
!880 = !DIEnumerator(name: "DT_REG", value: 8)
!881 = !DIEnumerator(name: "DT_LNK", value: 10)
!882 = !DIEnumerator(name: "DT_SOCK", value: 12)
!883 = !DIEnumerator(name: "DT_WHT", value: 14)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !748, line: 155, size: 32, elements: !885)
!885 = !{!886}
!886 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!887 = !{!36, !704, !34, !110, !888, !891, !44, !47, !49, !52}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!60, !47, !47}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !759, line: 253, baseType: !764)
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !897)
!896 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!897 = !{!44}
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!899 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!901 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!903 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!905 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !908)
!907 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!908 = !{!44, !47, !49, !52}
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !911)
!910 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = !{!912}
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !855, line: 20, size: 32, elements: !913)
!913 = !{!914}
!914 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!916 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!918 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!920 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179)
!922 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !716)
!924 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !179, retainedTypes: !716)
!926 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!927 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!928 = !{i32 2, !"Dwarf Version", i32 4}
!929 = !{i32 2, !"Debug Info Version", i32 3}
!930 = !{i32 1, !"PIC Level", i32 2}
!931 = !{i32 1, !"PIE Level", i32 2}
!932 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 104, type: !933, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !60}
!935 = !{!936}
!936 = !DILocalVariable(name: "status", arg: 1, scope: !932, file: !3, line: 104, type: !60)
!937 = !DIExpression()
!938 = !DILocation(line: 104, column: 12, scope: !932)
!939 = !DILocation(line: 106, column: 14, scope: !940)
!940 = distinct !DILexicalBlock(scope: !932, file: !3, line: 106, column: 7)
!941 = !DILocation(line: 106, column: 7, scope: !932)
!942 = !DILocation(line: 107, column: 5, scope: !943)
!943 = !DILexicalBlockFile(scope: !944, file: !3, discriminator: 1)
!944 = distinct !DILexicalBlock(scope: !940, file: !3, line: 107, column: 5)
!945 = !{!946, !946, i64 0}
!946 = !{!"any pointer", !947, i64 0}
!947 = !{!"omnipotent char", !948, i64 0}
!948 = !{!"Simple C/C++ TBAA"}
!949 = !DILocation(line: 107, column: 5, scope: !950)
!950 = !DILexicalBlockFile(scope: !944, file: !3, discriminator: 3)
!951 = !DILocation(line: 107, column: 5, scope: !952)
!952 = !DILexicalBlockFile(scope: !944, file: !3, discriminator: 2)
!953 = !DILocation(line: 110, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !940, file: !3, line: 109, column: 5)
!955 = !DILocation(line: 110, column: 7, scope: !956)
!956 = !DILexicalBlockFile(scope: !954, file: !3, discriminator: 1)
!957 = !DILocation(line: 115, column: 7, scope: !954)
!958 = !DILocation(line: 115, column: 7, scope: !956)
!959 = !DILocation(line: 120, column: 7, scope: !954)
!960 = !DILocation(line: 120, column: 7, scope: !956)
!961 = !DILocation(line: 125, column: 7, scope: !954)
!962 = !DILocation(line: 125, column: 7, scope: !956)
!963 = !DILocation(line: 130, column: 7, scope: !954)
!964 = !DILocation(line: 130, column: 7, scope: !956)
!965 = !DILocation(line: 134, column: 7, scope: !954)
!966 = !DILocation(line: 134, column: 7, scope: !956)
!967 = !DILocation(line: 138, column: 7, scope: !954)
!968 = !DILocation(line: 138, column: 7, scope: !956)
!969 = !DILocation(line: 142, column: 7, scope: !954)
!970 = !DILocation(line: 142, column: 7, scope: !956)
!971 = !DILocation(line: 145, column: 7, scope: !954)
!972 = !DILocation(line: 145, column: 7, scope: !956)
!973 = !DILocation(line: 158, column: 7, scope: !954)
!974 = !DILocation(line: 158, column: 7, scope: !956)
!975 = !DILocation(line: 159, column: 7, scope: !954)
!976 = !DILocation(line: 159, column: 7, scope: !956)
!977 = !DILocation(line: 160, column: 7, scope: !954)
!978 = !DILocation(line: 160, column: 7, scope: !956)
!979 = !DILocation(line: 642, column: 15, scope: !135, inlinedAt: !980)
!980 = distinct !DILocation(line: 167, column: 7, scope: !954)
!981 = !DILocation(line: 651, column: 3, scope: !135, inlinedAt: !980)
!982 = !DILocation(line: 651, column: 3, scope: !983, inlinedAt: !980)
!983 = !DILexicalBlockFile(scope: !135, file: !136, discriminator: 1)
!984 = !DILocation(line: 655, column: 29, scope: !135, inlinedAt: !980)
!985 = !DILocation(line: 655, column: 15, scope: !135, inlinedAt: !980)
!986 = !DILocation(line: 656, column: 7, scope: !155, inlinedAt: !980)
!987 = !DILocation(line: 656, column: 19, scope: !155, inlinedAt: !980)
!988 = !DILocation(line: 656, column: 22, scope: !989, inlinedAt: !980)
!989 = !DILexicalBlockFile(scope: !155, file: !136, discriminator: 16)
!990 = !DILocation(line: 656, column: 7, scope: !991, inlinedAt: !980)
!991 = !DILexicalBlockFile(scope: !135, file: !136, discriminator: 16)
!992 = !DILocation(line: 662, column: 7, scope: !993, inlinedAt: !980)
!993 = distinct !DILexicalBlock(scope: !155, file: !136, line: 657, column: 5)
!994 = !DILocation(line: 662, column: 7, scope: !995, inlinedAt: !980)
!995 = !DILexicalBlockFile(scope: !993, file: !136, discriminator: 1)
!996 = !DILocation(line: 664, column: 5, scope: !993, inlinedAt: !980)
!997 = !DILocation(line: 665, column: 3, scope: !135, inlinedAt: !980)
!998 = !DILocation(line: 665, column: 3, scope: !983, inlinedAt: !980)
!999 = !DILocation(line: 667, column: 3, scope: !135, inlinedAt: !980)
!1000 = !DILocation(line: 667, column: 3, scope: !983, inlinedAt: !980)
!1001 = !DILocation(line: 169, column: 3, scope: !932)
!1002 = !DILocation(line: 173, column: 11, scope: !57)
!1003 = !DILocation(line: 173, column: 24, scope: !57)
!1004 = !DILocation(line: 175, column: 8, scope: !57)
!1005 = !DILocation(line: 179, column: 7, scope: !57)
!1006 = !DILocation(line: 183, column: 7, scope: !57)
!1007 = !DILocation(line: 185, column: 3, scope: !57)
!1008 = !DILocation(line: 190, column: 21, scope: !57)
!1009 = !DILocation(line: 190, column: 3, scope: !57)
!1010 = !DILocation(line: 191, column: 3, scope: !57)
!1011 = !DILocation(line: 192, column: 3, scope: !57)
!1012 = !DILocation(line: 193, column: 3, scope: !57)
!1013 = !DILocation(line: 195, column: 3, scope: !57)
!1014 = !DIExpression(DW_OP_deref)
!1015 = !DILocation(line: 185, column: 23, scope: !57)
!1016 = !DILocation(line: 197, column: 3, scope: !57)
!1017 = !DILocation(line: 199, column: 3, scope: !57)
!1018 = !DILocation(line: 199, column: 18, scope: !1019)
!1019 = !DILexicalBlockFile(scope: !57, file: !3, discriminator: 1)
!1020 = !DILocation(line: 187, column: 7, scope: !57)
!1021 = !DILocation(line: 199, column: 3, scope: !1019)
!1022 = !DILocation(line: 210, column: 11, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 203, column: 9)
!1024 = distinct !DILexicalBlock(scope: !57, file: !3, line: 201, column: 5)
!1025 = !DILocation(line: 214, column: 11, scope: !1023)
!1026 = !DILocation(line: 218, column: 11, scope: !1023)
!1027 = !DILocation(line: 223, column: 11, scope: !1023)
!1028 = !DILocation(line: 227, column: 11, scope: !1023)
!1029 = !DILocation(line: 231, column: 11, scope: !1023)
!1030 = !DILocation(line: 234, column: 28, scope: !1023)
!1031 = !DILocation(line: 234, column: 26, scope: !1023)
!1032 = !DILocation(line: 235, column: 11, scope: !1023)
!1033 = !DILocation(line: 238, column: 25, scope: !1023)
!1034 = !{!1035, !1036, i64 4}
!1035 = !{!"Chown_option", !947, i64 0, !1036, i64 4, !946, i64 8, !1036, i64 16, !1036, i64 17, !946, i64 24, !946, i64 32}
!1036 = !{!"_Bool", !947, i64 0}
!1037 = !DILocation(line: 239, column: 11, scope: !1023)
!1038 = !DILocation(line: 242, column: 27, scope: !1023)
!1039 = !{!1035, !947, i64 0}
!1040 = !DILocation(line: 243, column: 11, scope: !1023)
!1041 = !DILocation(line: 246, column: 30, scope: !1023)
!1042 = !{!1035, !1036, i64 17}
!1043 = !DILocation(line: 247, column: 11, scope: !1023)
!1044 = !DILocation(line: 250, column: 27, scope: !1023)
!1045 = !DILocation(line: 251, column: 11, scope: !1023)
!1046 = distinct !{!1046, !1017, !1047}
!1047 = !DILocation(line: 258, column: 5, scope: !57)
!1048 = !DILocation(line: 253, column: 9, scope: !1023)
!1049 = !DILocation(line: 254, column: 9, scope: !1023)
!1050 = !DILocation(line: 254, column: 9, scope: !1051)
!1051 = !DILexicalBlockFile(scope: !1023, file: !3, discriminator: 1)
!1052 = !DILocation(line: 256, column: 11, scope: !1023)
!1053 = !DILocation(line: 260, column: 13, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !57, file: !3, line: 260, column: 7)
!1055 = !{i8 0, i8 2}
!1056 = !DILocation(line: 260, column: 7, scope: !57)
!1057 = !DILocation(line: 262, column: 21, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 262, column: 11)
!1059 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 261, column: 5)
!1060 = !DILocation(line: 262, column: 11, scope: !1059)
!1061 = !DILocation(line: 264, column: 27, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 264, column: 15)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 263, column: 9)
!1064 = !DILocation(line: 264, column: 15, scope: !1063)
!1065 = !DILocation(line: 265, column: 13, scope: !1062)
!1066 = !DILocation(line: 265, column: 13, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1062, file: !3, discriminator: 1)
!1068 = !DILocation(line: 274, column: 48, scope: !57)
!1069 = !DILocation(line: 274, column: 9, scope: !57)
!1070 = !DILocation(line: 274, column: 33, scope: !57)
!1071 = !{!1035, !1036, i64 16}
!1072 = !DILocation(line: 276, column: 14, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !57, file: !3, line: 276, column: 7)
!1074 = !{!1075, !1075, i64 0}
!1075 = !{!"int", !947, i64 0}
!1076 = !DILocation(line: 276, column: 12, scope: !1073)
!1077 = !DILocation(line: 276, column: 24, scope: !1073)
!1078 = !DILocation(line: 276, column: 21, scope: !1073)
!1079 = !DILocation(line: 276, column: 7, scope: !57)
!1080 = !DILocation(line: 278, column: 16, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 278, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 277, column: 5)
!1083 = !DILocation(line: 278, column: 11, scope: !1082)
!1084 = !DILocation(line: 279, column: 22, scope: !1081)
!1085 = !DILocation(line: 279, column: 9, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1081, file: !3, discriminator: 1)
!1087 = !DILocation(line: 279, column: 9, scope: !1081)
!1088 = !DILocation(line: 281, column: 22, scope: !1081)
!1089 = !DILocation(line: 281, column: 70, scope: !1081)
!1090 = !DILocation(line: 281, column: 60, scope: !1081)
!1091 = !DILocation(line: 281, column: 53, scope: !1086)
!1092 = !DILocation(line: 281, column: 9, scope: !1093)
!1093 = !DILexicalBlockFile(scope: !1081, file: !3, discriminator: 2)
!1094 = !DILocation(line: 282, column: 7, scope: !1082)
!1095 = !DILocation(line: 285, column: 7, scope: !57)
!1096 = !DILocation(line: 287, column: 7, scope: !93)
!1097 = !DILocation(line: 287, column: 19, scope: !93)
!1098 = !DILocalVariable(name: "__path", arg: 1, scope: !1099, file: !1100, line: 449, type: !52)
!1099 = distinct !DISubprogram(name: "stat", scope: !1100, file: !1100, line: 449, type: !1101, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1104)
!1100 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!60, !52, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!1104 = !{!1098, !1105}
!1105 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1099, file: !1100, line: 449, type: !1103)
!1106 = !DILocation(line: 449, column: 1, scope: !1099, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 288, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !93, file: !3, line: 288, column: 11)
!1109 = !DILocation(line: 451, column: 10, scope: !1099, inlinedAt: !1107)
!1110 = !DILocation(line: 288, column: 11, scope: !1108)
!1111 = !DILocation(line: 288, column: 11, scope: !93)
!1112 = !DILocation(line: 289, column: 9, scope: !1108)
!1113 = !DILocation(line: 289, column: 9, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1108, file: !3, discriminator: 1)
!1115 = !DILocation(line: 289, column: 9, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1108, file: !3, discriminator: 2)
!1117 = !DILocation(line: 289, column: 9, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1108, file: !3, discriminator: 3)
!1119 = !DILocation(line: 292, column: 23, scope: !93)
!1120 = !{!1121, !1075, i64 32}
!1121 = !{!"stat", !1122, i64 0, !1122, i64 8, !1122, i64 16, !1075, i64 24, !1075, i64 28, !1075, i64 32, !1075, i64 36, !1122, i64 40, !1122, i64 48, !1122, i64 56, !1122, i64 64, !1123, i64 72, !1123, i64 88, !1123, i64 104, !947, i64 120}
!1122 = !{!"long", !947, i64 0}
!1123 = !{!"timespec", !1122, i64 0, !1122, i64 8}
!1124 = !DILocation(line: 176, column: 9, scope: !57)
!1125 = !DILocation(line: 293, column: 26, scope: !93)
!1126 = !DILocation(line: 293, column: 13, scope: !93)
!1127 = !DILocation(line: 293, column: 24, scope: !93)
!1128 = !{!1035, !946, i64 32}
!1129 = !DILocation(line: 294, column: 5, scope: !94)
!1130 = !DILocation(line: 294, column: 5, scope: !93)
!1131 = !DILocation(line: 297, column: 37, scope: !130)
!1132 = !DILocation(line: 297, column: 26, scope: !130)
!1133 = !DILocation(line: 297, column: 13, scope: !130)
!1134 = !DILocation(line: 298, column: 27, scope: !130)
!1135 = !{!947, !947, i64 0}
!1136 = !DILocation(line: 298, column: 13, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !130, file: !3, discriminator: 3)
!1138 = !DILocation(line: 298, column: 24, scope: !1137)
!1139 = !DILocalVariable(name: "name", arg: 1, scope: !1140, file: !3, line: 79, type: !52)
!1140 = distinct !DISubprogram(name: "parse_group", scope: !3, file: !3, line: 79, type: !1141, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1143)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!42, !52}
!1143 = !{!1139, !1144, !1145, !1156}
!1144 = !DILocalVariable(name: "gid", scope: !1140, file: !3, line: 81, type: !42)
!1145 = !DILocalVariable(name: "grp", scope: !1146, file: !3, line: 85, type: !1148)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 84, column: 5)
!1147 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 83, column: 7)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !1150, line: 42, size: 256, elements: !1151)
!1150 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1151 = !{!1152, !1153, !1154, !1155}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1149, file: !1150, line: 44, baseType: !34, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1149, file: !1150, line: 45, baseType: !34, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1149, file: !1150, line: 46, baseType: !43, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1149, file: !1150, line: 47, baseType: !61, size: 64, offset: 192)
!1156 = !DILocalVariable(name: "tmp", scope: !1157, file: !3, line: 90, type: !46)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 89, column: 9)
!1158 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 86, column: 11)
!1159 = !DILocation(line: 79, column: 26, scope: !1140, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 299, column: 13, scope: !130)
!1161 = !DILocation(line: 81, column: 9, scope: !1140, inlinedAt: !1160)
!1162 = !DILocation(line: 83, column: 7, scope: !1147, inlinedAt: !1160)
!1163 = !DILocation(line: 83, column: 7, scope: !1140, inlinedAt: !1160)
!1164 = !DILocation(line: 85, column: 27, scope: !1146, inlinedAt: !1160)
!1165 = !DILocation(line: 85, column: 21, scope: !1146, inlinedAt: !1160)
!1166 = !DILocation(line: 86, column: 11, scope: !1158, inlinedAt: !1160)
!1167 = !DILocation(line: 86, column: 11, scope: !1146, inlinedAt: !1160)
!1168 = !DILocation(line: 87, column: 20, scope: !1158, inlinedAt: !1160)
!1169 = !{!1170, !1075, i64 16}
!1170 = !{!"group", !946, i64 0, !946, i64 8, !1075, i64 16, !946, i64 24}
!1171 = !DILocation(line: 87, column: 9, scope: !1158, inlinedAt: !1160)
!1172 = !DILocation(line: 90, column: 11, scope: !1157, inlinedAt: !1160)
!1173 = !DILocation(line: 90, column: 29, scope: !1157, inlinedAt: !1160)
!1174 = !DILocation(line: 91, column: 18, scope: !1175, inlinedAt: !1160)
!1175 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 91, column: 15)
!1176 = !DILocation(line: 91, column: 54, scope: !1175, inlinedAt: !1160)
!1177 = !DILocation(line: 92, column: 21, scope: !1178, inlinedAt: !1160)
!1178 = !DILexicalBlockFile(scope: !1175, file: !3, discriminator: 1)
!1179 = !DILocation(line: 92, column: 25, scope: !1178, inlinedAt: !1160)
!1180 = !DILocation(line: 92, column: 18, scope: !1175, inlinedAt: !1160)
!1181 = !DILocation(line: 93, column: 13, scope: !1175, inlinedAt: !1160)
!1182 = !DILocation(line: 93, column: 13, scope: !1178, inlinedAt: !1160)
!1183 = !DILocation(line: 93, column: 13, scope: !1184, inlinedAt: !1160)
!1184 = !DILexicalBlockFile(scope: !1175, file: !3, discriminator: 2)
!1185 = !DILocation(line: 95, column: 17, scope: !1157, inlinedAt: !1160)
!1186 = !DILocation(line: 96, column: 9, scope: !1158, inlinedAt: !1160)
!1187 = !DILocation(line: 97, column: 7, scope: !1146, inlinedAt: !1160)
!1188 = !DILocation(line: 98, column: 5, scope: !1146, inlinedAt: !1160)
!1189 = !DILocation(line: 302, column: 13, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !57, file: !3, line: 302, column: 7)
!1191 = !DILocation(line: 302, column: 24, scope: !1192)
!1192 = !DILexicalBlockFile(scope: !1190, file: !3, discriminator: 1)
!1193 = !DILocation(line: 302, column: 21, scope: !1190)
!1194 = !DILocation(line: 305, column: 28, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 303, column: 5)
!1196 = !DILocation(line: 305, column: 13, scope: !1195)
!1197 = !DILocation(line: 305, column: 26, scope: !1195)
!1198 = !{!1035, !946, i64 8}
!1199 = !DILocation(line: 306, column: 30, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 306, column: 11)
!1201 = !DILocation(line: 306, column: 11, scope: !1195)
!1202 = !DILocation(line: 307, column: 9, scope: !1200)
!1203 = !DILocation(line: 307, column: 9, scope: !1204)
!1204 = !DILexicalBlockFile(scope: !1200, file: !3, discriminator: 1)
!1205 = !DILocation(line: 307, column: 9, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1200, file: !3, discriminator: 2)
!1207 = !DILocation(line: 307, column: 9, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1200, file: !3, discriminator: 3)
!1209 = !DILocation(line: 311, column: 13, scope: !57)
!1210 = !DILocation(line: 312, column: 28, scope: !57)
!1211 = !DILocation(line: 312, column: 26, scope: !57)
!1212 = !DILocation(line: 312, column: 8, scope: !57)
!1213 = !DILocation(line: 318, column: 10, scope: !57)
!1214 = !DILocation(line: 319, column: 1, scope: !57)
!1215 = distinct !DISubprogram(name: "chopt_init", scope: !685, file: !685, line: 58, type: !1216, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, unit: !684, variables: !1233)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1229, !1230, !1231, !1232}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !1219, file: !6, line: 46, baseType: !5, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !1219, file: !6, line: 49, baseType: !66, size: 8, offset: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !1219, file: !6, line: 53, baseType: !1224, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !78, line: 7, size: 128, elements: !1226)
!1226 = !{!1227, !1228}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1225, file: !78, line: 9, baseType: !81, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1225, file: !78, line: 10, baseType: !84, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !1219, file: !6, line: 56, baseType: !66, size: 8, offset: 128)
