!llvm.dbg.cu = !{!2, !146, !152, !160, !651, !653, !167, !174, !664, !666, !241, !674, !691, !693, !695, !697, !865, !867, !869, !871, !873, !875, !250, !878, !268, !884, !886, !888, !890, !620, !892, !894}
!llvm.ident = !{!896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896, !896}
!llvm.module.flags = !{!897, !898, !899, !900}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 95, type: !132, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !44)
!3 = !DIFile(filename: "src/chmod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !10, !24}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !3, line: 50, size: 32, elements: !6)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "V_high", value: 0)
!8 = !DIEnumerator(name: "V_changes_only", value: 1)
!9 = !DIEnumerator(name: "V_off", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !11, line: 32, size: 32, elements: !12)
!11 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!13 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!14 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!15 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!16 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!17 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!18 = !DIEnumerator(name: "c_quoting_style", value: 5)
!19 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!20 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!21 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!22 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!23 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !3, line: 42, size: 32, elements: !25)
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 0)
!27 = !DIEnumerator(name: "CH_SUCCEEDED", value: 1)
!28 = !DIEnumerator(name: "CH_FAILED", value: 2)
!29 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!30 = !{!31, !33, !34, !37, !39, !42, !36}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 62, baseType: !36)
!35 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!44 = !{!45, !81, !86, !91, !93, !95, !97, !100, !0, !130}
!45 = !DIGlobalVariableExpression(var: !46)
!46 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !47, file: !3, line: 555, type: !70, isLocal: true, isDefinition: true)
!47 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 415, type: !48, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !52)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50, !51}
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!52 = !{!53, !54, !55, !56, !57, !58, !60, !61, !62, !63, !67, !68, !69}
!53 = !DILocalVariable(name: "argc", arg: 1, scope: !47, file: !3, line: 415, type: !50)
!54 = !DILocalVariable(name: "argv", arg: 2, scope: !47, file: !3, line: 415, type: !51)
!55 = !DILocalVariable(name: "mode", scope: !47, file: !3, line: 417, type: !31)
!56 = !DILocalVariable(name: "mode_len", scope: !47, file: !3, line: 418, type: !34)
!57 = !DILocalVariable(name: "mode_alloc", scope: !47, file: !3, line: 419, type: !34)
!58 = !DILocalVariable(name: "ok", scope: !47, file: !3, line: 420, type: !59)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DILocalVariable(name: "preserve_root", scope: !47, file: !3, line: 421, type: !59)
!61 = !DILocalVariable(name: "reference_file", scope: !47, file: !3, line: 422, type: !42)
!62 = !DILocalVariable(name: "c", scope: !47, file: !3, line: 423, type: !50)
!63 = !DILocalVariable(name: "arg", scope: !64, file: !3, line: 468, type: !42)
!64 = distinct !DILexicalBlock(scope: !65, file: !3, line: 462, column: 11)
!65 = distinct !DILexicalBlock(scope: !66, file: !3, line: 442, column: 9)
!66 = distinct !DILexicalBlock(scope: !47, file: !3, line: 440, column: 5)
!67 = !DILocalVariable(name: "arg_len", scope: !64, file: !3, line: 469, type: !34)
!68 = !DILocalVariable(name: "mode_comma_len", scope: !64, file: !3, line: 470, type: !34)
!69 = !DILocalVariable(name: "new_mode_len", scope: !64, file: !3, line: 471, type: !34)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !71, line: 7, size: 128, elements: !72)
!71 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !{!73, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !70, file: !71, line: 9, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !75, line: 48, baseType: !76)
!75 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !77, line: 136, baseType: !36)
!77 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !70, file: !71, line: 10, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !75, line: 60, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !77, line: 133, baseType: !36)
!81 = !DIGlobalVariableExpression(var: !82)
!82 = distinct !DIGlobalVariable(name: "change", scope: !2, file: !3, line: 63, type: !83, isLocal: true, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !85, line: 25, flags: DIFlagFwdDecl)
!85 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "umask_value", scope: !2, file: !3, line: 66, type: !88, isLocal: true, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !75, line: 70, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !77, line: 138, baseType: !90)
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 69, type: !59, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "force_silent", scope: !2, file: !3, line: 72, type: !59, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !2, file: !3, line: 77, type: !59, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98)
!98 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 84, type: !99, isLocal: true, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "infomap", scope: !102, file: !103, line: 632, type: !127, isLocal: true, isDefinition: true)
!102 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !103, file: !103, line: 630, type: !104, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !106)
!103 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!104 = !DISubroutineType(types: !105)
!105 = !{null, !42}
!106 = !{!107, !108, !109, !116, !118, !119, !120, !123, !124, !126}
!107 = !DILocalVariable(name: "program", arg: 1, scope: !102, file: !103, line: 630, type: !42)
!108 = !DILocalVariable(name: "node", scope: !102, file: !103, line: 642, type: !42)
!109 = !DILocalVariable(name: "map_prog", scope: !102, file: !103, line: 643, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !102, file: !103, line: 632, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !112, file: !103, line: 632, baseType: !42, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !112, file: !103, line: 632, baseType: !42, size: 64, offset: 64)
!116 = !DILocalVariable(name: "__s1_len", scope: !117, file: !103, line: 645, type: !34)
!117 = distinct !DILexicalBlock(scope: !102, file: !103, line: 645, column: 33)
!118 = !DILocalVariable(name: "__s2_len", scope: !117, file: !103, line: 645, type: !34)
!119 = !DILocalVariable(name: "lc_messages", scope: !102, file: !103, line: 655, type: !42)
!120 = !DILocalVariable(name: "__s1_len", scope: !121, file: !103, line: 656, type: !34)
!121 = distinct !DILexicalBlock(scope: !122, file: !103, line: 656, column: 22)
!122 = distinct !DILexicalBlock(scope: !102, file: !103, line: 656, column: 7)
!123 = !DILocalVariable(name: "__s2_len", scope: !121, file: !103, line: 656, type: !34)
!124 = !DILocalVariable(name: "__s2", scope: !125, file: !103, line: 656, type: !39)
!125 = distinct !DILexicalBlock(scope: !121, file: !103, line: 656, column: 22)
!126 = !DILocalVariable(name: "__result", scope: !125, file: !103, line: 656, type: !50)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 896, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 7)
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !3, line: 80, type: !5, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 2816, elements: !142)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !135, line: 104, size: 256, elements: !136)
!135 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !{!137, !138, !139, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !135, line: 106, baseType: !42, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !134, file: !135, line: 109, baseType: !50, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !135, line: 110, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !135, line: 111, baseType: !50, size: 32, offset: 192)
!142 = !{!143}
!143 = !DISubrange(count: 11)
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "Version", scope: !146, file: !147, line: 2, type: !42, isDefinition: true)
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, globals: !149)
!147 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !{}
!149 = !{!144}
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "file_name", scope: !152, file: !157, line: 36, type: !42, isLocal: true, isDefinition: true)
!152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !153, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, globals: !154)
!153 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!154 = !{!150, !155}
!155 = !DIGlobalVariableExpression(var: !156)
!156 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !152, file: !157, line: 46, type: !59, isLocal: true, isDefinition: true)
!157 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "exit_failure", scope: !160, file: !163, line: 24, type: !164, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, globals: !162)
!161 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !{!158}
!163 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!164 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "program_name", scope: !167, file: !171, line: 33, type: !42, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !169, globals: !170)
!168 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!169 = !{!33, !31}
!170 = !{!165}
!171 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !174, file: !202, line: 77, type: !237, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !176, retainedTypes: !197, globals: !199)
!175 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !{!10, !177, !182}
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !11, line: 242, size: 32, elements: !178)
!178 = !{!179, !180, !181}
!179 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!180 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!181 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 46, size: 32, elements: !184)
!183 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!185 = !DIEnumerator(name: "_ISupper", value: 256)
!186 = !DIEnumerator(name: "_ISlower", value: 512)
!187 = !DIEnumerator(name: "_ISalpha", value: 1024)
!188 = !DIEnumerator(name: "_ISdigit", value: 2048)
!189 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!190 = !DIEnumerator(name: "_ISspace", value: 8192)
!191 = !DIEnumerator(name: "_ISprint", value: 16384)
!192 = !DIEnumerator(name: "_ISgraph", value: 32768)
!193 = !DIEnumerator(name: "_ISblank", value: 1)
!194 = !DIEnumerator(name: "_IScntrl", value: 2)
!195 = !DIEnumerator(name: "_ISpunct", value: 4)
!196 = !DIEnumerator(name: "_ISalnum", value: 8)
!197 = !{!50, !198, !34, !31}
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!172, !200, !207, !219, !221, !226, !233, !235}
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !174, file: !202, line: 93, type: !203, isDefinition: true)
!202 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 320, elements: !205)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!205 = !{!206}
!206 = !DISubrange(count: 10)
!207 = !DIGlobalVariableExpression(var: !208)
!208 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !174, file: !202, line: 1043, type: !209, isDefinition: true)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !202, line: 57, size: 448, elements: !210)
!210 = !{!211, !212, !213, !217, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !209, file: !202, line: 60, baseType: !10, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !209, file: !202, line: 63, baseType: !50, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !209, file: !202, line: 67, baseType: !214, size: 256, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !209, file: !202, line: 70, baseType: !42, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !209, file: !202, line: 73, baseType: !42, size: 64, offset: 384)
!219 = !DIGlobalVariableExpression(var: !220)
!220 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !174, file: !202, line: 108, type: !209, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "slot0", scope: !174, file: !202, line: 834, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 256)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "slotvec", scope: !174, file: !202, line: 837, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !202, line: 826, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !202, line: 828, baseType: !34, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !229, file: !202, line: 829, baseType: !31, size: 64, offset: 64)
!233 = !DIGlobalVariableExpression(var: !234)
!234 = distinct !DIGlobalVariable(name: "nslots", scope: !174, file: !202, line: 835, type: !50, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "slotvec0", scope: !174, file: !202, line: 836, type: !229, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 704, elements: !142)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !241, file: !244, line: 26, type: !245, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, globals: !243)
!242 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = !{!239}
!244 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 376, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 47)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "default_tuning", scope: !250, file: !254, line: 130, type: !255, isLocal: true, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !252, globals: !253)
!251 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!252 = !{!36, !33, !34}
!253 = !{!248}
!254 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !257, line: 65, baseType: !258)
!257 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !257, line: 53, size: 160, elements: !259)
!259 = !{!260, !262, !263, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !258, file: !257, line: 58, baseType: !261, size: 32)
!261 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !258, file: !257, line: 59, baseType: !261, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !258, file: !257, line: 60, baseType: !261, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !258, file: !257, line: 61, baseType: !261, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !258, file: !257, line: 62, baseType: !59, size: 8, offset: 128)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !268, file: !612, line: 120, type: !613, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !270, retainedTypes: !609, globals: !611)
!269 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !{!271}
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 41, size: 32, elements: !273)
!272 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!274 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!275 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!276 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!277 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!278 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!279 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!280 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!281 = !DIEnumerator(name: "DAY_1", value: 131079)
!282 = !DIEnumerator(name: "DAY_2", value: 131080)
!283 = !DIEnumerator(name: "DAY_3", value: 131081)
!284 = !DIEnumerator(name: "DAY_4", value: 131082)
!285 = !DIEnumerator(name: "DAY_5", value: 131083)
!286 = !DIEnumerator(name: "DAY_6", value: 131084)
!287 = !DIEnumerator(name: "DAY_7", value: 131085)
!288 = !DIEnumerator(name: "ABMON_1", value: 131086)
!289 = !DIEnumerator(name: "ABMON_2", value: 131087)
!290 = !DIEnumerator(name: "ABMON_3", value: 131088)
!291 = !DIEnumerator(name: "ABMON_4", value: 131089)
!292 = !DIEnumerator(name: "ABMON_5", value: 131090)
!293 = !DIEnumerator(name: "ABMON_6", value: 131091)
!294 = !DIEnumerator(name: "ABMON_7", value: 131092)
!295 = !DIEnumerator(name: "ABMON_8", value: 131093)
!296 = !DIEnumerator(name: "ABMON_9", value: 131094)
!297 = !DIEnumerator(name: "ABMON_10", value: 131095)
!298 = !DIEnumerator(name: "ABMON_11", value: 131096)
!299 = !DIEnumerator(name: "ABMON_12", value: 131097)
!300 = !DIEnumerator(name: "MON_1", value: 131098)
!301 = !DIEnumerator(name: "MON_2", value: 131099)
!302 = !DIEnumerator(name: "MON_3", value: 131100)
!303 = !DIEnumerator(name: "MON_4", value: 131101)
!304 = !DIEnumerator(name: "MON_5", value: 131102)
!305 = !DIEnumerator(name: "MON_6", value: 131103)
!306 = !DIEnumerator(name: "MON_7", value: 131104)
!307 = !DIEnumerator(name: "MON_8", value: 131105)
!308 = !DIEnumerator(name: "MON_9", value: 131106)
!309 = !DIEnumerator(name: "MON_10", value: 131107)
!310 = !DIEnumerator(name: "MON_11", value: 131108)
!311 = !DIEnumerator(name: "MON_12", value: 131109)
!312 = !DIEnumerator(name: "AM_STR", value: 131110)
!313 = !DIEnumerator(name: "PM_STR", value: 131111)
!314 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!315 = !DIEnumerator(name: "D_FMT", value: 131113)
!316 = !DIEnumerator(name: "T_FMT", value: 131114)
!317 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!318 = !DIEnumerator(name: "ERA", value: 131116)
!319 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!320 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!321 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!322 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!323 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!324 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!325 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!326 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!327 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!328 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!329 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!330 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!331 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!332 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!333 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!334 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!335 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!336 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!337 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!338 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!339 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!340 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!341 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!342 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!343 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!344 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!345 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!346 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!347 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!348 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!349 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!350 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!351 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!352 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!353 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!354 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!355 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!356 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!357 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!358 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!359 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!360 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!361 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!362 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!363 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!364 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!365 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!366 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!367 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!368 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!369 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!370 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!371 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!372 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!373 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!374 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!375 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!376 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!377 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!378 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!379 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!380 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!381 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!382 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!383 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!384 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!385 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!386 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!387 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!388 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!389 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!390 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!391 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!392 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!393 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!394 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!395 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!396 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!397 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!398 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!399 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!400 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!401 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!402 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!403 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!404 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!405 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!406 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!407 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!408 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!409 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!410 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!411 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!412 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!413 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!414 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!415 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!416 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!417 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!418 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!419 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!420 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!421 = !DIEnumerator(name: "CODESET", value: 14)
!422 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!423 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!424 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!425 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!468 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!469 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!470 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!471 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!472 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!473 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!474 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!475 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!476 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!477 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!478 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!479 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!480 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!481 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!490 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!491 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!492 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!493 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!494 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!495 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!496 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!497 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!498 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!499 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!500 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!501 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!502 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!503 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!504 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!505 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!506 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!507 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!508 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!509 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!510 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!511 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!512 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!513 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!514 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!515 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!529 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!532 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!533 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!535 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!536 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!537 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!538 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!539 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!540 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!541 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!542 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!543 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!544 = !DIEnumerator(name: "THOUSEP", value: 65537)
!545 = !DIEnumerator(name: "__GROUPING", value: 65538)
!546 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!547 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!548 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!549 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!550 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!551 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!552 = !DIEnumerator(name: "__YESSTR", value: 327682)
!553 = !DIEnumerator(name: "__NOSTR", value: 327683)
!554 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!555 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!556 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!557 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!558 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!559 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!560 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!561 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!562 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!563 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!564 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!565 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!566 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!567 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!568 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!569 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!570 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!571 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!572 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!573 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!574 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!575 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!576 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!577 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!578 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!579 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!580 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!581 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!582 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!583 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!584 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!585 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!586 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!587 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!588 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!589 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!590 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!604 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!605 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!607 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!608 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!609 = !{!33, !31, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!611 = !{!266}
!612 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!613 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!614 = !DIGlobalVariableExpression(var: !615)
!615 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !616, file: !617, line: 335, type: !50, isLocal: true, isDefinition: true)
!616 = distinct !DISubprogram(name: "rpl_fcntl", scope: !617, file: !617, line: 272, type: !618, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !620, variables: !623)
!617 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!618 = !DISubroutineType(types: !619)
!619 = !{!50, !50, !50, null}
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, globals: !622)
!621 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!622 = !{!614}
!623 = !{!624, !625, !626, !639, !640, !643, !646, !649}
!624 = !DILocalVariable(name: "fd", arg: 1, scope: !616, file: !617, line: 272, type: !50)
!625 = !DILocalVariable(name: "action", arg: 2, scope: !616, file: !617, line: 272, type: !50)
!626 = !DILocalVariable(name: "arg", scope: !616, file: !617, line: 274, type: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !628, line: 30, baseType: !629)
!628 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !621, line: 274, baseType: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 192, elements: !637)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !621, line: 274, size: 192, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !631, file: !621, line: 274, baseType: !90, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !631, file: !621, line: 274, baseType: !90, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !631, file: !621, line: 274, baseType: !33, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !631, file: !621, line: 274, baseType: !33, size: 64, offset: 128)
!637 = !{!638}
!638 = !DISubrange(count: 1)
!639 = !DILocalVariable(name: "result", scope: !616, file: !617, line: 275, type: !50)
!640 = !DILocalVariable(name: "target", scope: !641, file: !617, line: 322, type: !50)
!641 = distinct !DILexicalBlock(scope: !642, file: !617, line: 321, column: 7)
!642 = distinct !DILexicalBlock(scope: !616, file: !617, line: 278, column: 5)
!643 = !DILocalVariable(name: "flags", scope: !644, file: !617, line: 359, type: !50)
!644 = distinct !DILexicalBlock(scope: !645, file: !617, line: 358, column: 11)
!645 = distinct !DILexicalBlock(scope: !641, file: !617, line: 357, column: 13)
!646 = !DILocalVariable(name: "saved_errno", scope: !647, file: !617, line: 362, type: !50)
!647 = distinct !DILexicalBlock(scope: !648, file: !617, line: 361, column: 15)
!648 = distinct !DILexicalBlock(scope: !644, file: !617, line: 360, column: 17)
!649 = !DILocalVariable(name: "p", scope: !650, file: !617, line: 404, type: !33)
!650 = distinct !DILexicalBlock(scope: !642, file: !617, line: 402, column: 7)
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!652 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !655, retainedTypes: !663)
!654 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = !{!656}
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !657, line: 78, size: 32, elements: !658)
!657 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!658 = !{!659, !660, !661, !662}
!659 = !DIEnumerator(name: "MODE_DONE", value: 0)
!660 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!661 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!662 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!663 = !{!34}
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!665 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !668, retainedTypes: !673)
!667 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!668 = !{!669}
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 41, size: 32, elements: !671)
!670 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!671 = !{!672}
!672 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!673 = !{!33}
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !676, retainedTypes: !690)
!675 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = !{!677}
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !679, file: !678, line: 192, size: 32, elements: !688)
!678 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = distinct !DISubprogram(name: "x2nrealloc", scope: !678, file: !678, line: 180, type: !680, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !674, variables: !683)
!680 = !DISubroutineType(types: !681)
!681 = !{!33, !33, !682, !34}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!683 = !{!684, !685, !686, !687}
!684 = !DILocalVariable(name: "p", arg: 1, scope: !679, file: !678, line: 180, type: !33)
!685 = !DILocalVariable(name: "pn", arg: 2, scope: !679, file: !678, line: 180, type: !682)
!686 = !DILocalVariable(name: "s", arg: 3, scope: !679, file: !678, line: 180, type: !34)
!687 = !DILocalVariable(name: "n", scope: !679, file: !678, line: 182, type: !34)
!688 = !{!689}
!689 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!690 = !{!34, !31, !33}
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!692 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !673)
!694 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !673)
!696 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !699, retainedTypes: !857)
!698 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = !{!700, !705, !840, !843, !854}
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !701, line: 160, size: 32, elements: !702)
!701 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = !{!703, !704}
!703 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!704 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !707, file: !706, line: 54, size: 32, elements: !838)
!706 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = distinct !DISubprogram(name: "setup_dir", scope: !706, file: !706, line: 50, type: !708, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !697, variables: !836)
!708 = !DISubroutineType(types: !709)
!709 = !{!59, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !712, line: 199, baseType: !713)
!712 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !712, line: 80, size: 1024, elements: !714)
!714 = !{!715, !784, !785, !787, !788, !789, !790, !791, !792, !793, !800, !801, !804, !823}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !713, file: !712, line: 81, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !712, line: 201, size: 2112, elements: !718)
!718 = !{!719, !720, !721, !722, !727, !729, !730, !731, !732, !733, !734, !735, !736, !738, !739, !742, !743, !744, !745, !780}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !717, file: !712, line: 202, baseType: !716, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !717, file: !712, line: 203, baseType: !716, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !717, file: !712, line: 204, baseType: !716, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !717, file: !712, line: 205, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !725, line: 127, baseType: !726)
!725 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !725, line: 127, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !717, file: !712, line: 208, baseType: !728, size: 64, offset: 256)
!728 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !717, file: !712, line: 209, baseType: !33, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !717, file: !712, line: 210, baseType: !31, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !717, file: !712, line: 211, baseType: !31, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !717, file: !712, line: 212, baseType: !50, size: 32, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !717, file: !712, line: 213, baseType: !50, size: 32, offset: 544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !717, file: !712, line: 214, baseType: !34, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !717, file: !712, line: 216, baseType: !710, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !717, file: !712, line: 220, baseType: !737, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !35, line: 51, baseType: !728)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !717, file: !712, line: 222, baseType: !34, size: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !717, file: !712, line: 223, baseType: !740, size: 64, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !75, line: 75, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !77, line: 139, baseType: !36)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !717, file: !712, line: 239, baseType: !198, size: 16, offset: 896)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !717, file: !712, line: 243, baseType: !198, size: 16, offset: 912)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !717, file: !712, line: 249, baseType: !198, size: 16, offset: 928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !717, file: !712, line: 251, baseType: !746, size: 1152, offset: 960)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 1152, elements: !637)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !748, line: 46, size: 1152, elements: !749)
!748 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!749 = !{!750, !751, !752, !753, !754, !756, !758, !759, !760, !762, !764, !766, !774, !775, !776}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !747, file: !748, line: 48, baseType: !80, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !747, file: !748, line: 53, baseType: !76, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !747, file: !748, line: 61, baseType: !741, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !747, file: !748, line: 62, baseType: !89, size: 32, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !747, file: !748, line: 64, baseType: !755, size: 32, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !77, line: 134, baseType: !90)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !747, file: !748, line: 65, baseType: !757, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !77, line: 135, baseType: !90)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !747, file: !748, line: 67, baseType: !50, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !747, file: !748, line: 69, baseType: !80, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !747, file: !748, line: 74, baseType: !761, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !77, line: 140, baseType: !728)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !747, file: !748, line: 78, baseType: !763, size: 64, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !77, line: 162, baseType: !728)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !747, file: !748, line: 80, baseType: !765, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !77, line: 167, baseType: !728)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !747, file: !748, line: 91, baseType: !767, size: 128, offset: 576)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !768, line: 8, size: 128, elements: !769)
!768 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!769 = !{!770, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !767, file: !768, line: 10, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !77, line: 148, baseType: !728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !767, file: !768, line: 11, baseType: !773, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !77, line: 184, baseType: !728)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !747, file: !748, line: 92, baseType: !767, size: 128, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !747, file: !748, line: 93, baseType: !767, size: 128, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !747, file: !748, line: 106, baseType: !777, size: 192, offset: 960)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 192, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 3)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !717, file: !712, line: 252, baseType: !781, offset: 2112)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: -1)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !713, file: !712, line: 82, baseType: !716, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !713, file: !712, line: 83, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !713, file: !712, line: 84, baseType: !79, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !713, file: !712, line: 85, baseType: !31, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !713, file: !712, line: 86, baseType: !50, size: 32, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !713, file: !712, line: 87, baseType: !50, size: 32, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !713, file: !712, line: 89, baseType: !34, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !713, file: !712, line: 90, baseType: !34, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !713, file: !712, line: 91, baseType: !794, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!50, !797, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !713, file: !712, line: 162, baseType: !50, size: 32, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !713, file: !712, line: 171, baseType: !802, size: 64, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !712, line: 171, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !713, file: !712, line: 193, baseType: !805, size: 64, offset: 704)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !713, file: !712, line: 173, size: 64, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !805, file: !712, line: 186, baseType: !802, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !805, file: !712, line: 192, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !811, line: 28, size: 256, elements: !812)
!811 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!812 = !{!813, !818, !822}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !810, file: !811, line: 30, baseType: !814, size: 128)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !71, line: 7, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !814, file: !71, line: 9, baseType: !74, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !814, file: !71, line: 10, baseType: !79, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !810, file: !811, line: 31, baseType: !819, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !820, line: 136, baseType: !821)
!820 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !77, line: 62, baseType: !36)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !810, file: !811, line: 32, baseType: !50, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !713, file: !712, line: 198, baseType: !824, size: 256, offset: 768)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !825, line: 39, baseType: !826)
!825 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !825, line: 31, size: 256, elements: !827)
!827 = !{!828, !832, !833, !834, !835}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !826, file: !825, line: 33, baseType: !829, size: 128)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 4)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !826, file: !825, line: 34, baseType: !50, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !826, file: !825, line: 35, baseType: !90, size: 32, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !826, file: !825, line: 36, baseType: !90, size: 32, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !826, file: !825, line: 37, baseType: !59, size: 8, offset: 224)
!836 = !{!837}
!837 = !DILocalVariable(name: "fts", arg: 1, scope: !707, file: !706, line: 50, type: !710)
!838 = !{!839}
!839 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !701, line: 763, size: 32, elements: !841)
!841 = !{!842}
!842 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 97, size: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853}
!845 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!846 = !DIEnumerator(name: "DT_FIFO", value: 1)
!847 = !DIEnumerator(name: "DT_CHR", value: 2)
!848 = !DIEnumerator(name: "DT_DIR", value: 4)
!849 = !DIEnumerator(name: "DT_BLK", value: 6)
!850 = !DIEnumerator(name: "DT_REG", value: 8)
!851 = !DIEnumerator(name: "DT_LNK", value: 10)
!852 = !DIEnumerator(name: "DT_SOCK", value: 12)
!853 = !DIEnumerator(name: "DT_WHT", value: 14)
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !701, line: 155, size: 32, elements: !855)
!855 = !{!856}
!856 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!857 = !{!33, !819, !31, !728, !858, !861, !34, !37, !39, !42}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!50, !37, !37}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !712, line: 253, baseType: !717)
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !663)
!866 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!868 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!870 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!872 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!874 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !877)
!876 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!877 = !{!34, !37, !39, !42}
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !880)
!879 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!880 = !{!881}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 20, size: 32, elements: !882)
!882 = !{!883}
!883 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!885 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!887 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!889 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148)
!891 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !673)
!893 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !148, retainedTypes: !673)
!895 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!896 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!897 = !{i32 2, !"Dwarf Version", i32 4}
!898 = !{i32 2, !"Debug Info Version", i32 3}
!899 = !{i32 1, !"PIC Level", i32 2}
!900 = !{i32 1, !"PIE Level", i32 2}
!901 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 368, type: !902, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !50}
!904 = !{!905}
!905 = !DILocalVariable(name: "status", arg: 1, scope: !901, file: !3, line: 368, type: !50)
!906 = !DIExpression()
!907 = !DILocation(line: 368, column: 12, scope: !901)
!908 = !DILocation(line: 370, column: 14, scope: !909)
!909 = distinct !DILexicalBlock(scope: !901, file: !3, line: 370, column: 7)
!910 = !DILocation(line: 370, column: 7, scope: !901)
!911 = !DILocation(line: 371, column: 5, scope: !912)
!912 = !DILexicalBlockFile(scope: !913, file: !3, discriminator: 1)
!913 = distinct !DILexicalBlock(scope: !909, file: !3, line: 371, column: 5)
!914 = !{!915, !915, i64 0}
!915 = !{!"any pointer", !916, i64 0}
!916 = !{!"omnipotent char", !917, i64 0}
!917 = !{!"Simple C/C++ TBAA"}
!918 = !DILocation(line: 371, column: 5, scope: !919)
!919 = !DILexicalBlockFile(scope: !913, file: !3, discriminator: 3)
!920 = !DILocation(line: 371, column: 5, scope: !921)
!921 = !DILexicalBlockFile(scope: !913, file: !3, discriminator: 2)
!922 = !DILocation(line: 374, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !909, file: !3, line: 373, column: 5)
!924 = !DILocation(line: 374, column: 7, scope: !925)
!925 = !DILexicalBlockFile(scope: !923, file: !3, discriminator: 1)
!926 = !DILocation(line: 380, column: 7, scope: !923)
!927 = !DILocation(line: 380, column: 7, scope: !925)
!928 = !DILocation(line: 385, column: 7, scope: !923)
!929 = !DILocation(line: 385, column: 7, scope: !925)
!930 = !DILocation(line: 390, column: 7, scope: !923)
!931 = !DILocation(line: 390, column: 7, scope: !925)
!932 = !DILocation(line: 394, column: 7, scope: !923)
!933 = !DILocation(line: 394, column: 7, scope: !925)
!934 = !DILocation(line: 397, column: 7, scope: !923)
!935 = !DILocation(line: 397, column: 7, scope: !925)
!936 = !DILocation(line: 400, column: 7, scope: !923)
!937 = !DILocation(line: 400, column: 7, scope: !925)
!938 = !DILocation(line: 401, column: 7, scope: !923)
!939 = !DILocation(line: 401, column: 7, scope: !925)
!940 = !DILocation(line: 402, column: 7, scope: !923)
!941 = !DILocation(line: 402, column: 7, scope: !925)
!942 = !DILocation(line: 642, column: 15, scope: !102, inlinedAt: !943)
!943 = distinct !DILocation(line: 406, column: 7, scope: !923)
!944 = !DILocation(line: 651, column: 3, scope: !102, inlinedAt: !943)
!945 = !DILocation(line: 651, column: 3, scope: !946, inlinedAt: !943)
!946 = !DILexicalBlockFile(scope: !102, file: !103, discriminator: 1)
!947 = !DILocation(line: 655, column: 29, scope: !102, inlinedAt: !943)
!948 = !DILocation(line: 655, column: 15, scope: !102, inlinedAt: !943)
!949 = !DILocation(line: 656, column: 7, scope: !122, inlinedAt: !943)
!950 = !DILocation(line: 656, column: 19, scope: !122, inlinedAt: !943)
!951 = !DILocation(line: 656, column: 22, scope: !952, inlinedAt: !943)
!952 = !DILexicalBlockFile(scope: !122, file: !103, discriminator: 16)
!953 = !DILocation(line: 656, column: 7, scope: !954, inlinedAt: !943)
!954 = !DILexicalBlockFile(scope: !102, file: !103, discriminator: 16)
!955 = !DILocation(line: 662, column: 7, scope: !956, inlinedAt: !943)
!956 = distinct !DILexicalBlock(scope: !122, file: !103, line: 657, column: 5)
!957 = !DILocation(line: 662, column: 7, scope: !958, inlinedAt: !943)
!958 = !DILexicalBlockFile(scope: !956, file: !103, discriminator: 1)
!959 = !DILocation(line: 664, column: 5, scope: !956, inlinedAt: !943)
!960 = !DILocation(line: 665, column: 3, scope: !102, inlinedAt: !943)
!961 = !DILocation(line: 665, column: 3, scope: !946, inlinedAt: !943)
!962 = !DILocation(line: 667, column: 3, scope: !102, inlinedAt: !943)
!963 = !DILocation(line: 667, column: 3, scope: !946, inlinedAt: !943)
!964 = !DILocation(line: 408, column: 3, scope: !901)
!965 = !DILocalVariable(name: "perms", scope: !966, file: !3, line: 145, type: !975)
!966 = distinct !DISubprogram(name: "describe_change", scope: !3, file: !3, line: 142, type: !967, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !969)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !42, !88, !88, !24}
!969 = !{!970, !971, !972, !973, !965, !974, !978}
!970 = !DILocalVariable(name: "file", arg: 1, scope: !966, file: !3, line: 142, type: !42)
!971 = !DILocalVariable(name: "old_mode", arg: 2, scope: !966, file: !3, line: 142, type: !88)
!972 = !DILocalVariable(name: "mode", arg: 3, scope: !966, file: !3, line: 142, type: !88)
!973 = !DILocalVariable(name: "changed", arg: 4, scope: !966, file: !3, line: 143, type: !24)
!974 = !DILocalVariable(name: "old_perms", scope: !966, file: !3, line: 146, type: !975)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 12)
!978 = !DILocalVariable(name: "fmt", scope: !966, file: !3, line: 147, type: !42)
!979 = !DILocation(line: 145, column: 8, scope: !966, inlinedAt: !980)
!980 = distinct !DILocation(line: 298, column: 11, scope: !981, inlinedAt: !1107)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 292, column: 9)
!982 = distinct !DILexicalBlock(scope: !983, file: !3, line: 291, column: 11)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 286, column: 5)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 285, column: 7)
!985 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 188, type: !986, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1074)
!986 = !DISubroutineType(types: !987)
!987 = !{!59, !988, !1072}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !712, line: 199, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !712, line: 80, size: 1024, elements: !991)
!991 = !{!992, !1038, !1039, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1054, !1055, !1056, !1063}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !990, file: !712, line: 81, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !712, line: 201, size: 2112, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1037}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !994, file: !712, line: 202, baseType: !993, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !994, file: !712, line: 203, baseType: !993, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !994, file: !712, line: 204, baseType: !993, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !994, file: !712, line: 205, baseType: !723, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !994, file: !712, line: 208, baseType: !728, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !994, file: !712, line: 209, baseType: !33, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !994, file: !712, line: 210, baseType: !31, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !994, file: !712, line: 211, baseType: !31, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !994, file: !712, line: 212, baseType: !50, size: 32, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !994, file: !712, line: 213, baseType: !50, size: 32, offset: 544)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !994, file: !712, line: 214, baseType: !34, size: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !994, file: !712, line: 216, baseType: !988, size: 64, offset: 640)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !994, file: !712, line: 220, baseType: !737, size: 64, offset: 704)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !994, file: !712, line: 222, baseType: !34, size: 64, offset: 768)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !994, file: !712, line: 223, baseType: !740, size: 64, offset: 832)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !994, file: !712, line: 239, baseType: !198, size: 16, offset: 896)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !994, file: !712, line: 243, baseType: !198, size: 16, offset: 912)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !994, file: !712, line: 249, baseType: !198, size: 16, offset: 928)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !994, file: !712, line: 251, baseType: !1015, size: 1152, offset: 960)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 1152, elements: !637)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !748, line: 46, size: 1152, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1034, !1035, !1036}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1016, file: !748, line: 48, baseType: !80, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1016, file: !748, line: 53, baseType: !76, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1016, file: !748, line: 61, baseType: !741, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1016, file: !748, line: 62, baseType: !89, size: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1016, file: !748, line: 64, baseType: !755, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1016, file: !748, line: 65, baseType: !757, size: 32, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1016, file: !748, line: 67, baseType: !50, size: 32, offset: 288)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1016, file: !748, line: 69, baseType: !80, size: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1016, file: !748, line: 74, baseType: !761, size: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1016, file: !748, line: 78, baseType: !763, size: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1016, file: !748, line: 80, baseType: !765, size: 64, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1016, file: !748, line: 91, baseType: !1030, size: 128, offset: 576)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !768, line: 8, size: 128, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1030, file: !768, line: 10, baseType: !771, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1030, file: !768, line: 11, baseType: !773, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1016, file: !748, line: 92, baseType: !1030, size: 128, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1016, file: !748, line: 93, baseType: !1030, size: 128, offset: 832)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1016, file: !748, line: 106, baseType: !777, size: 192, offset: 960)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !994, file: !712, line: 252, baseType: !781, offset: 2112)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !990, file: !712, line: 82, baseType: !993, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !990, file: !712, line: 83, baseType: !1040, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !990, file: !712, line: 84, baseType: !79, size: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !990, file: !712, line: 85, baseType: !31, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !990, file: !712, line: 86, baseType: !50, size: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !990, file: !712, line: 87, baseType: !50, size: 32, offset: 352)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !990, file: !712, line: 89, baseType: !34, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !990, file: !712, line: 90, baseType: !34, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !990, file: !712, line: 91, baseType: !1048, size: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!50, !1051, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !990, file: !712, line: 162, baseType: !50, size: 32, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !990, file: !712, line: 171, baseType: !802, size: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !990, file: !712, line: 193, baseType: !1057, size: 64, offset: 704)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !990, file: !712, line: 173, size: 64, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1057, file: !712, line: 186, baseType: !802, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1057, file: !712, line: 192, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !712, line: 192, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !990, file: !712, line: 198, baseType: !1064, size: 256, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !825, line: 39, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !825, line: 31, size: 256, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !1065, file: !825, line: 33, baseType: !829, size: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !1065, file: !825, line: 34, baseType: !50, size: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !1065, file: !825, line: 35, baseType: !90, size: 32, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !1065, file: !825, line: 36, baseType: !90, size: 32, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !1065, file: !825, line: 37, baseType: !59, size: 8, offset: 224)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !712, line: 253, baseType: !994)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1082, !1083, !1084, !1085, !1086, !1092, !1093, !1095, !1096, !1098, !1099, !1100, !1103, !1106}
!1075 = !DILocalVariable(name: "fts", arg: 1, scope: !985, file: !3, line: 188, type: !988)
!1076 = !DILocalVariable(name: "ent", arg: 2, scope: !985, file: !3, line: 188, type: !1072)
!1077 = !DILocalVariable(name: "file_full_name", scope: !985, file: !3, line: 190, type: !42)
!1078 = !DILocalVariable(name: "file", scope: !985, file: !3, line: 191, type: !42)
!1079 = !DILocalVariable(name: "file_stats", scope: !985, file: !3, line: 192, type: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1082 = !DILocalVariable(name: "old_mode", scope: !985, file: !3, line: 193, type: !88)
!1083 = !DILocalVariable(name: "new_mode", scope: !985, file: !3, line: 194, type: !88)
!1084 = !DILocalVariable(name: "ok", scope: !985, file: !3, line: 195, type: !59)
!1085 = !DILocalVariable(name: "chmod_succeeded", scope: !985, file: !3, line: 196, type: !59)
!1086 = !DILocalVariable(name: "__s1_len", scope: !1087, file: !3, line: 257, type: !34)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 257, column: 7)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 257, column: 7)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 257, column: 7)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 256, column: 5)
!1091 = distinct !DILexicalBlock(scope: !985, file: !3, line: 255, column: 7)
!1092 = !DILocalVariable(name: "__s2_len", scope: !1087, file: !3, line: 257, type: !34)
!1093 = !DILocalVariable(name: "__s2", scope: !1094, file: !3, line: 257, type: !39)
!1094 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 257, column: 7)
!1095 = !DILocalVariable(name: "__result", scope: !1094, file: !3, line: 257, type: !50)
!1096 = !DILocalVariable(name: "__x", scope: !1097, file: !3, line: 261, type: !1072)
!1097 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 261, column: 7)
!1098 = !DILocalVariable(name: "changed", scope: !983, file: !3, line: 287, type: !59)
!1099 = !DILocalVariable(name: "ch_status", scope: !981, file: !3, line: 293, type: !24)
!1100 = !DILocalVariable(name: "naively_expected_mode", scope: !1101, file: !3, line: 304, type: !88)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 303, column: 5)
!1102 = distinct !DILexicalBlock(scope: !985, file: !3, line: 302, column: 7)
!1103 = !DILocalVariable(name: "new_perms", scope: !1104, file: !3, line: 308, type: !975)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 307, column: 9)
!1105 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 306, column: 11)
!1106 = !DILocalVariable(name: "naively_expected_perms", scope: !1104, file: !3, line: 309, type: !975)
!1107 = distinct !DILocation(line: 355, column: 13, scope: !1108, inlinedAt: !1118)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 339, column: 5)
!1109 = distinct !DISubprogram(name: "process_files", scope: !3, file: !3, line: 332, type: !1110, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1112)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!59, !51, !50}
!1112 = !{!1113, !1114, !1115, !1116, !1117}
!1113 = !DILocalVariable(name: "files", arg: 1, scope: !1109, file: !3, line: 332, type: !51)
!1114 = !DILocalVariable(name: "bit_flags", arg: 2, scope: !1109, file: !3, line: 332, type: !50)
!1115 = !DILocalVariable(name: "ok", scope: !1109, file: !3, line: 334, type: !59)
!1116 = !DILocalVariable(name: "fts", scope: !1109, file: !3, line: 336, type: !988)
!1117 = !DILocalVariable(name: "ent", scope: !1108, file: !3, line: 340, type: !1072)
!1118 = distinct !DILocation(line: 566, column: 8, scope: !47)
!1119 = !DILocation(line: 146, column: 8, scope: !966, inlinedAt: !980)
!1120 = !DILocation(line: 308, column: 16, scope: !1104, inlinedAt: !1107)
!1121 = !DILocation(line: 309, column: 16, scope: !1104, inlinedAt: !1107)
!1122 = !DILocation(line: 415, column: 11, scope: !47)
!1123 = !DILocation(line: 415, column: 24, scope: !47)
!1124 = !DILocation(line: 417, column: 9, scope: !47)
!1125 = !DILocation(line: 418, column: 10, scope: !47)
!1126 = !DILocation(line: 419, column: 3, scope: !47)
!1127 = !DILocation(line: 419, column: 10, scope: !47)
!1128 = !{!1129, !1129, i64 0}
!1129 = !{!"long", !916, i64 0}
!1130 = !DILocation(line: 421, column: 8, scope: !47)
!1131 = !DILocation(line: 422, column: 15, scope: !47)
!1132 = !DILocation(line: 426, column: 21, scope: !47)
!1133 = !DILocation(line: 426, column: 3, scope: !47)
!1134 = !DILocation(line: 427, column: 3, scope: !47)
!1135 = !DILocation(line: 428, column: 3, scope: !47)
!1136 = !DILocation(line: 429, column: 3, scope: !47)
!1137 = !DILocation(line: 431, column: 3, scope: !47)
!1138 = !DILocation(line: 435, column: 3, scope: !47)
!1139 = !DILocation(line: 435, column: 15, scope: !1140)
!1140 = !DILexicalBlockFile(scope: !47, file: !3, discriminator: 1)
!1141 = !DILocation(line: 423, column: 7, scope: !47)
!1142 = !DILocation(line: 435, column: 3, scope: !1140)
!1143 = !DILocation(line: 468, column: 36, scope: !64)
!1144 = !{!1145, !1145, i64 0}
!1145 = !{!"int", !916, i64 0}
!1146 = !DILocation(line: 468, column: 43, scope: !64)
!1147 = !DILocation(line: 468, column: 31, scope: !64)
!1148 = !DILocation(line: 468, column: 25, scope: !64)
!1149 = !DILocation(line: 469, column: 30, scope: !64)
!1150 = !DILocation(line: 469, column: 20, scope: !64)
!1151 = !DILocation(line: 470, column: 49, scope: !64)
!1152 = !DILocation(line: 470, column: 48, scope: !64)
!1153 = !DILocation(line: 470, column: 46, scope: !64)
!1154 = !DILocation(line: 470, column: 20, scope: !64)
!1155 = !DILocation(line: 471, column: 50, scope: !64)
!1156 = !DILocation(line: 471, column: 20, scope: !64)
!1157 = !DILocation(line: 472, column: 17, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !64, file: !3, line: 472, column: 17)
!1159 = !DILocation(line: 472, column: 28, scope: !1158)
!1160 = !DILocation(line: 472, column: 17, scope: !64)
!1161 = !DILocation(line: 474, column: 43, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 473, column: 15)
!1163 = !DILocation(line: 474, column: 28, scope: !1162)
!1164 = !DIExpression(DW_OP_deref)
!1165 = !DILocation(line: 475, column: 24, scope: !1162)
!1166 = !DILocation(line: 476, column: 15, scope: !1162)
!1167 = !DILocation(line: 477, column: 13, scope: !64)
!1168 = !DILocation(line: 477, column: 28, scope: !64)
!1169 = !{!916, !916, i64 0}
!1170 = !DILocation(line: 478, column: 26, scope: !64)
!1171 = !DILocation(line: 478, column: 57, scope: !64)
!1172 = !DILocation(line: 478, column: 13, scope: !64)
!1173 = !DILocation(line: 483, column: 11, scope: !65)
!1174 = !DILocation(line: 489, column: 11, scope: !65)
!1175 = !DILocation(line: 491, column: 28, scope: !65)
!1176 = !DILocation(line: 492, column: 11, scope: !65)
