!llvm.dbg.cu = !{!2, !85, !91, !99, !554, !557, !106, !124, !132, !563, !199, !571, !588, !590, !592, !594, !596, !598, !601, !603, !208}
!llvm.ident = !{!606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606, !606}
!llvm.module.flags = !{!607, !608, !609, !610}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "crctab", scope: !2, file: !3, line: 118, type: !77, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !42)
!3 = !DIFile(filename: "src/cksum.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !{!29, !32, !33, !36, !38, !41}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 62, baseType: !35)
!34 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !{!43, !46, !0}
!43 = !DIGlobalVariableExpression(var: !44)
!44 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 175, type: !45, isLocal: true, isDefinition: true)
!45 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!46 = !DIGlobalVariableExpression(var: !47)
!47 = distinct !DIGlobalVariable(name: "infomap", scope: !48, file: !49, line: 632, type: !74, isLocal: true, isDefinition: true)
!48 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !49, file: !49, line: 630, type: !50, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !52)
!49 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DISubroutineType(types: !51)
!51 = !{null, !29}
!52 = !{!53, !54, !55, !62, !64, !65, !66, !69, !70, !72}
!53 = !DILocalVariable(name: "program", arg: 1, scope: !48, file: !49, line: 630, type: !29)
!54 = !DILocalVariable(name: "node", scope: !48, file: !49, line: 642, type: !29)
!55 = !DILocalVariable(name: "map_prog", scope: !48, file: !49, line: 643, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !48, file: !49, line: 632, size: 128, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !58, file: !49, line: 632, baseType: !29, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !58, file: !49, line: 632, baseType: !29, size: 64, offset: 64)
!62 = !DILocalVariable(name: "__s1_len", scope: !63, file: !49, line: 645, type: !33)
!63 = distinct !DILexicalBlock(scope: !48, file: !49, line: 645, column: 33)
!64 = !DILocalVariable(name: "__s2_len", scope: !63, file: !49, line: 645, type: !33)
!65 = !DILocalVariable(name: "lc_messages", scope: !48, file: !49, line: 655, type: !29)
!66 = !DILocalVariable(name: "__s1_len", scope: !67, file: !49, line: 656, type: !33)
!67 = distinct !DILexicalBlock(scope: !68, file: !49, line: 656, column: 22)
!68 = distinct !DILexicalBlock(scope: !48, file: !49, line: 656, column: 7)
!69 = !DILocalVariable(name: "__s2_len", scope: !67, file: !49, line: 656, type: !33)
!70 = !DILocalVariable(name: "__s2", scope: !71, file: !49, line: 656, type: !38)
!71 = distinct !DILexicalBlock(scope: !67, file: !49, line: 656, column: 22)
!72 = !DILocalVariable(name: "__result", scope: !71, file: !49, line: 656, type: !73)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 896, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 7)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 16384, elements: !81)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !80, line: 108, baseType: !35)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!81 = !{!82}
!82 = !DISubrange(count: 256)
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "Version", scope: !85, file: !86, line: 2, type: !29, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !88)
!86 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!87 = !{}
!88 = !{!83}
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "file_name", scope: !91, file: !96, line: 36, type: !29, isLocal: true, isDefinition: true)
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !93)
!92 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!93 = !{!89, !94}
!94 = !DIGlobalVariableExpression(var: !95)
!95 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !91, file: !96, line: 46, type: !45, isLocal: true, isDefinition: true)
!96 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!97 = !DIGlobalVariableExpression(var: !98)
!98 = distinct !DIGlobalVariable(name: "exit_failure", scope: !99, file: !102, line: 24, type: !103, isDefinition: true)
!99 = distinct !DICompileUnit(language: DW_LANG_C99, file: !100, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !101)
!100 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!101 = !{!97}
!102 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !73)
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "long_options", scope: !106, file: !109, line: 33, type: !110, isLocal: true, isDefinition: true)
!106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !107, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !108)
!107 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!108 = !{!104}
!109 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 768, elements: !120)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !113, line: 104, size: 256, elements: !114)
!113 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!114 = !{!115, !116, !117, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !113, line: 106, baseType: !29, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !112, file: !113, line: 109, baseType: !73, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !113, line: 110, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !112, file: !113, line: 111, baseType: !73, size: 32, offset: 192)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "program_name", scope: !124, file: !129, line: 33, type: !29, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !126, globals: !128)
!125 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!126 = !{!32, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!128 = !{!122}
!129 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !132, file: !160, line: 77, type: !193, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !134, retainedTypes: !155, globals: !157)
!133 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!134 = !{!5, !135, !140}
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!138 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!139 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 46, size: 32, elements: !142)
!141 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!143 = !DIEnumerator(name: "_ISupper", value: 256)
!144 = !DIEnumerator(name: "_ISlower", value: 512)
!145 = !DIEnumerator(name: "_ISalpha", value: 1024)
!146 = !DIEnumerator(name: "_ISdigit", value: 2048)
!147 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!148 = !DIEnumerator(name: "_ISspace", value: 8192)
!149 = !DIEnumerator(name: "_ISprint", value: 16384)
!150 = !DIEnumerator(name: "_ISgraph", value: 32768)
!151 = !DIEnumerator(name: "_ISblank", value: 1)
!152 = !DIEnumerator(name: "_IScntrl", value: 2)
!153 = !DIEnumerator(name: "_ISpunct", value: 4)
!154 = !DIEnumerator(name: "_ISalnum", value: 8)
!155 = !{!73, !156, !33, !127}
!156 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!157 = !{!130, !158, !165, !177, !179, !182, !189, !191}
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !132, file: !160, line: 93, type: !161, isDefinition: true)
!160 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 320, elements: !163)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!163 = !{!164}
!164 = !DISubrange(count: 10)
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !132, file: !160, line: 1043, type: !167, isDefinition: true)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !160, line: 57, size: 448, elements: !168)
!168 = !{!169, !170, !171, !175, !176}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !167, file: !160, line: 60, baseType: !5, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !160, line: 63, baseType: !73, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !167, file: !160, line: 67, baseType: !172, size: 256, offset: 64)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !167, file: !160, line: 70, baseType: !29, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !167, file: !160, line: 73, baseType: !29, size: 64, offset: 384)
!177 = !DIGlobalVariableExpression(var: !178)
!178 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !132, file: !160, line: 108, type: !167, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "slot0", scope: !132, file: !160, line: 834, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2048, elements: !81)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "slotvec", scope: !132, file: !160, line: 837, type: !184, isLocal: true, isDefinition: true)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !160, line: 826, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !185, file: !160, line: 828, baseType: !33, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !185, file: !160, line: 829, baseType: !127, size: 64, offset: 64)
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "nslots", scope: !132, file: !160, line: 835, type: !73, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "slotvec0", scope: !132, file: !160, line: 836, type: !185, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 704, elements: !195)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!195 = !{!196}
!196 = !DISubrange(count: 11)
!197 = !DIGlobalVariableExpression(var: !198)
!198 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !199, file: !202, line: 26, type: !203, isDefinition: true)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, globals: !201)
!200 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!201 = !{!197}
!202 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 47)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !208, file: !552, line: 120, type: !553, isLocal: true, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !210, retainedTypes: !549, globals: !551)
!209 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!210 = !{!211}
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 41, size: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!214 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!215 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!216 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!217 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!218 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!219 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!220 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!221 = !DIEnumerator(name: "DAY_1", value: 131079)
!222 = !DIEnumerator(name: "DAY_2", value: 131080)
!223 = !DIEnumerator(name: "DAY_3", value: 131081)
!224 = !DIEnumerator(name: "DAY_4", value: 131082)
!225 = !DIEnumerator(name: "DAY_5", value: 131083)
!226 = !DIEnumerator(name: "DAY_6", value: 131084)
!227 = !DIEnumerator(name: "DAY_7", value: 131085)
!228 = !DIEnumerator(name: "ABMON_1", value: 131086)
!229 = !DIEnumerator(name: "ABMON_2", value: 131087)
!230 = !DIEnumerator(name: "ABMON_3", value: 131088)
!231 = !DIEnumerator(name: "ABMON_4", value: 131089)
!232 = !DIEnumerator(name: "ABMON_5", value: 131090)
!233 = !DIEnumerator(name: "ABMON_6", value: 131091)
!234 = !DIEnumerator(name: "ABMON_7", value: 131092)
!235 = !DIEnumerator(name: "ABMON_8", value: 131093)
!236 = !DIEnumerator(name: "ABMON_9", value: 131094)
!237 = !DIEnumerator(name: "ABMON_10", value: 131095)
!238 = !DIEnumerator(name: "ABMON_11", value: 131096)
!239 = !DIEnumerator(name: "ABMON_12", value: 131097)
!240 = !DIEnumerator(name: "MON_1", value: 131098)
!241 = !DIEnumerator(name: "MON_2", value: 131099)
!242 = !DIEnumerator(name: "MON_3", value: 131100)
!243 = !DIEnumerator(name: "MON_4", value: 131101)
!244 = !DIEnumerator(name: "MON_5", value: 131102)
!245 = !DIEnumerator(name: "MON_6", value: 131103)
!246 = !DIEnumerator(name: "MON_7", value: 131104)
!247 = !DIEnumerator(name: "MON_8", value: 131105)
!248 = !DIEnumerator(name: "MON_9", value: 131106)
!249 = !DIEnumerator(name: "MON_10", value: 131107)
!250 = !DIEnumerator(name: "MON_11", value: 131108)
!251 = !DIEnumerator(name: "MON_12", value: 131109)
!252 = !DIEnumerator(name: "AM_STR", value: 131110)
!253 = !DIEnumerator(name: "PM_STR", value: 131111)
!254 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!255 = !DIEnumerator(name: "D_FMT", value: 131113)
!256 = !DIEnumerator(name: "T_FMT", value: 131114)
!257 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!258 = !DIEnumerator(name: "ERA", value: 131116)
!259 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!260 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!261 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!262 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!263 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!264 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!265 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!266 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!267 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!268 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!269 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!270 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!271 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!272 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!273 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!274 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!275 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!276 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!277 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!278 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!279 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!280 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!281 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!282 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!283 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!284 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!285 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!286 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!287 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!288 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!289 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!290 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!291 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!292 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!293 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!294 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!295 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!296 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!297 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!298 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!299 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!300 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!301 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!302 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!303 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!304 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!305 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!306 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!307 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!308 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!309 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!310 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!311 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!312 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!313 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!314 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!315 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!316 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!317 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!318 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!319 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!320 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!321 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!322 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!323 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!324 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!325 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!326 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!327 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!328 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!329 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!330 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!331 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!332 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!333 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!334 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!335 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!336 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!337 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!338 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!339 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!340 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!341 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!342 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!343 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!344 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!345 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!346 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!347 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!348 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!349 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!350 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!351 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!352 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!353 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!354 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!355 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!356 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!357 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!358 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!359 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!360 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!361 = !DIEnumerator(name: "CODESET", value: 14)
!362 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!363 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!364 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!365 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!366 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!367 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!368 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!369 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!370 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!371 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!372 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!373 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!374 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!375 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!376 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!377 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!378 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!379 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!380 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!381 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!382 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!383 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!384 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!385 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!386 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!387 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!388 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!389 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!390 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!391 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!392 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!393 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!394 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!395 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!396 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!397 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!398 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!399 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!400 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!401 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!402 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!403 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!404 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!405 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!406 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!407 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!408 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!409 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!410 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!411 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!412 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!413 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!414 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!415 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!416 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!417 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!418 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!419 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!420 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!421 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!422 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!423 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!424 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!425 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!426 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!427 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!428 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!429 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!430 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!431 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!432 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!433 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!434 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!435 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!436 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!437 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!438 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!439 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!440 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!441 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!442 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!443 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!444 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!445 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!446 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!447 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!448 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!449 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!450 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!451 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!452 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!453 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!454 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!455 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!456 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!457 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!458 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!459 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!460 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!461 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!462 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!463 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!464 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!465 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!466 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!467 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!468 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!469 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!470 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!471 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!472 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!473 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!474 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!475 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!476 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!477 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!478 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!479 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!480 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!481 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!482 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!483 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!484 = !DIEnumerator(name: "THOUSEP", value: 65537)
!485 = !DIEnumerator(name: "__GROUPING", value: 65538)
!486 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!487 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!488 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!489 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!490 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!491 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!492 = !DIEnumerator(name: "__YESSTR", value: 327682)
!493 = !DIEnumerator(name: "__NOSTR", value: 327683)
!494 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!495 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!496 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!497 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!498 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!499 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!500 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!501 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!502 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!503 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!504 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!505 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!506 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!507 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!508 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!509 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!510 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!511 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!512 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!513 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!514 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!515 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!516 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!517 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!518 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!519 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!520 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!521 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!522 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!523 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!524 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!525 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!526 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!527 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!528 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!529 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!530 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!531 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!532 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!533 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!534 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!535 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!536 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!537 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!538 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!539 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!540 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!541 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!542 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!543 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!544 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!545 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!546 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!547 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!548 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!549 = !{!32, !127, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!551 = !{!206}
!552 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!553 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !556)
!555 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!556 = !{!19}
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !559)
!558 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !80, line: 136, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !562, line: 62, baseType: !35)
!562 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !565, retainedTypes: !570)
!564 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!565 = !{!566}
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !567, line: 41, size: 32, elements: !568)
!567 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!568 = !{!569}
!569 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!570 = !{!32}
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !573, retainedTypes: !587)
!572 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!573 = !{!574}
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !576, file: !575, line: 192, size: 32, elements: !585)
!575 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!576 = distinct !DISubprogram(name: "x2nrealloc", scope: !575, file: !575, line: 180, type: !577, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !571, variables: !580)
!577 = !DISubroutineType(types: !578)
!578 = !{!32, !32, !579, !33}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!580 = !{!581, !582, !583, !584}
!581 = !DILocalVariable(name: "p", arg: 1, scope: !576, file: !575, line: 180, type: !32)
!582 = !DILocalVariable(name: "pn", arg: 2, scope: !576, file: !575, line: 180, type: !579)
!583 = !DILocalVariable(name: "s", arg: 3, scope: !576, file: !575, line: 180, type: !33)
!584 = !DILocalVariable(name: "n", scope: !576, file: !575, line: 182, type: !33)
!585 = !{!586}
!586 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!587 = !{!33, !127, !32}
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!589 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !570)
!591 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!593 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !570)
!595 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !570)
!597 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !600)
!599 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!600 = !{!33}
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87)
!602 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !87, retainedTypes: !605)
!604 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = !{!33, !36, !38, !29}
!606 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!607 = !{i32 2, !"Dwarf Version", i32 4}
!608 = !{i32 2, !"Debug Info Version", i32 3}
!609 = !{i32 1, !"PIC Level", i32 2}
!610 = !{i32 1, !"PIE Level", i32 2}
!611 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 257, type: !612, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !614)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !73}
!614 = !{!615}
!615 = !DILocalVariable(name: "status", arg: 1, scope: !611, file: !3, line: 257, type: !73)
!616 = !DIExpression()
!617 = !DILocation(line: 257, column: 12, scope: !611)
!618 = !DILocation(line: 259, column: 14, scope: !619)
!619 = distinct !DILexicalBlock(scope: !611, file: !3, line: 259, column: 7)
!620 = !DILocation(line: 259, column: 7, scope: !611)
!621 = !DILocation(line: 260, column: 5, scope: !622)
!622 = !DILexicalBlockFile(scope: !623, file: !3, discriminator: 1)
!623 = distinct !DILexicalBlock(scope: !619, file: !3, line: 260, column: 5)
!624 = !{!625, !625, i64 0}
!625 = !{!"any pointer", !626, i64 0}
!626 = !{!"omnipotent char", !627, i64 0}
!627 = !{!"Simple C/C++ TBAA"}
!628 = !DILocation(line: 260, column: 5, scope: !629)
!629 = !DILexicalBlockFile(scope: !623, file: !3, discriminator: 3)
!630 = !DILocation(line: 260, column: 5, scope: !631)
!631 = !DILexicalBlockFile(scope: !623, file: !3, discriminator: 2)
!632 = !DILocation(line: 263, column: 7, scope: !633)
!633 = distinct !DILexicalBlock(scope: !619, file: !3, line: 262, column: 5)
!634 = !DILocation(line: 263, column: 7, scope: !635)
!635 = !DILexicalBlockFile(scope: !633, file: !3, discriminator: 1)
!636 = !DILocation(line: 268, column: 7, scope: !633)
!637 = !DILocation(line: 268, column: 7, scope: !635)
!638 = !DILocation(line: 272, column: 7, scope: !633)
!639 = !DILocation(line: 272, column: 7, scope: !635)
!640 = !DILocation(line: 273, column: 7, scope: !633)
!641 = !DILocation(line: 273, column: 7, scope: !635)
!642 = !DILocation(line: 642, column: 15, scope: !48, inlinedAt: !643)
!643 = distinct !DILocation(line: 274, column: 7, scope: !633)
!644 = !DILocation(line: 651, column: 3, scope: !48, inlinedAt: !643)
!645 = !DILocation(line: 651, column: 3, scope: !646, inlinedAt: !643)
!646 = !DILexicalBlockFile(scope: !48, file: !49, discriminator: 1)
!647 = !DILocation(line: 655, column: 29, scope: !48, inlinedAt: !643)
!648 = !DILocation(line: 655, column: 15, scope: !48, inlinedAt: !643)
!649 = !DILocation(line: 656, column: 7, scope: !68, inlinedAt: !643)
!650 = !DILocation(line: 656, column: 19, scope: !68, inlinedAt: !643)
!651 = !DILocation(line: 656, column: 22, scope: !652, inlinedAt: !643)
!652 = !DILexicalBlockFile(scope: !68, file: !49, discriminator: 16)
!653 = !DILocation(line: 656, column: 7, scope: !654, inlinedAt: !643)
!654 = !DILexicalBlockFile(scope: !48, file: !49, discriminator: 16)
!655 = !DILocation(line: 662, column: 7, scope: !656, inlinedAt: !643)
!656 = distinct !DILexicalBlock(scope: !68, file: !49, line: 657, column: 5)
!657 = !DILocation(line: 662, column: 7, scope: !658, inlinedAt: !643)
!658 = !DILexicalBlockFile(scope: !656, file: !49, discriminator: 1)
!659 = !DILocation(line: 664, column: 5, scope: !656, inlinedAt: !643)
!660 = !DILocation(line: 665, column: 3, scope: !48, inlinedAt: !643)
!661 = !DILocation(line: 665, column: 3, scope: !646, inlinedAt: !643)
!662 = !DILocation(line: 667, column: 3, scope: !48, inlinedAt: !643)
!663 = !DILocation(line: 667, column: 3, scope: !646, inlinedAt: !643)
!664 = !DILocation(line: 276, column: 3, scope: !611)
!665 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 280, type: !666, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !669)
!666 = !DISubroutineType(types: !667)
!667 = !{!73, !73, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!669 = !{!670, !671, !672, !673}
!670 = !DILocalVariable(name: "argc", arg: 1, scope: !665, file: !3, line: 280, type: !73)
!671 = !DILocalVariable(name: "argv", arg: 2, scope: !665, file: !3, line: 280, type: !668)
!672 = !DILocalVariable(name: "i", scope: !665, file: !3, line: 282, type: !73)
!673 = !DILocalVariable(name: "ok", scope: !665, file: !3, line: 283, type: !45)
!674 = !DILocation(line: 280, column: 11, scope: !665)
!675 = !DILocation(line: 280, column: 24, scope: !665)
!676 = !DILocation(line: 286, column: 21, scope: !665)
!677 = !DILocation(line: 286, column: 3, scope: !665)
!678 = !DILocation(line: 287, column: 3, scope: !665)
!679 = !DILocation(line: 288, column: 3, scope: !665)
!680 = !DILocation(line: 289, column: 3, scope: !665)
!681 = !DILocation(line: 291, column: 3, scope: !665)
!682 = !DILocation(line: 295, column: 12, scope: !665)
!683 = !DILocation(line: 295, column: 3, scope: !665)
!684 = !DILocation(line: 297, column: 58, scope: !665)
!685 = !DILocation(line: 297, column: 3, scope: !665)
!686 = !DILocation(line: 299, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !665, file: !3, line: 299, column: 7)
!688 = !DILocation(line: 299, column: 48, scope: !687)
!689 = !DILocation(line: 299, column: 7, scope: !665)
!690 = !DILocation(line: 300, column: 5, scope: !687)
!691 = !DILocation(line: 304, column: 7, scope: !692)
!692 = distinct !DILexicalBlock(scope: !665, file: !3, line: 304, column: 7)
!693 = !{!694, !694, i64 0}
!694 = !{!"int", !626, i64 0}
!695 = !DILocation(line: 304, column: 14, scope: !692)
!696 = !DILocation(line: 304, column: 7, scope: !665)
!697 = !DILocation(line: 283, column: 8, scope: !665)
!698 = !DILocation(line: 282, column: 7, scope: !665)
!699 = !DILocation(line: 309, column: 26, scope: !700)
!700 = !DILexicalBlockFile(scope: !701, file: !3, discriminator: 1)
!701 = distinct !DILexicalBlock(scope: !702, file: !3, line: 309, column: 7)
!702 = distinct !DILexicalBlock(scope: !703, file: !3, line: 309, column: 7)
!703 = distinct !DILexicalBlock(scope: !692, file: !3, line: 307, column: 5)
!704 = !DILocation(line: 309, column: 7, scope: !705)
!705 = !DILexicalBlockFile(scope: !702, file: !3, discriminator: 1)
!706 = !DILocation(line: 310, column: 22, scope: !701)
!707 = !DILocation(line: 305, column: 10, scope: !692)
!708 = !DILocation(line: 305, column: 8, scope: !692)
!709 = !DILocation(line: 305, column: 5, scope: !692)
!710 = !DILocation(line: 310, column: 15, scope: !701)
!711 = !DILocation(line: 310, column: 12, scope: !701)
!712 = !DILocation(line: 309, column: 35, scope: !713)
!713 = !DILexicalBlockFile(scope: !701, file: !3, discriminator: 2)
!714 = distinct !{!714, !715, !716}
!715 = !DILocation(line: 309, column: 7, scope: !702)
!716 = !DILocation(line: 310, column: 35, scope: !702)
!717 = !DILocation(line: 313, column: 23, scope: !718)
!718 = distinct !DILexicalBlock(scope: !665, file: !3, line: 313, column: 7)
!719 = !DILocation(line: 313, column: 34, scope: !720)
!720 = !DILexicalBlockFile(scope: !718, file: !3, discriminator: 1)
!721 = !DILocation(line: 313, column: 26, scope: !720)
!722 = !DILocation(line: 313, column: 41, scope: !720)
!723 = !DILocation(line: 313, column: 7, scope: !724)
!724 = !DILexicalBlockFile(scope: !665, file: !3, discriminator: 1)
!725 = !DILocation(line: 314, column: 5, scope: !718)
!726 = !DILocation(line: 314, column: 5, scope: !720)
!727 = !DILocation(line: 315, column: 10, scope: !665)
!728 = !DILocation(line: 315, column: 3, scope: !665)
!729 = distinct !DISubprogram(name: "cksum", scope: !3, file: !3, line: 183, type: !730, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!45, !29, !45}
!732 = !{!733, !734, !735, !739, !740, !741, !742, !797, !801, !802, !805, !806, !808, !809, !811, !816, !817, !819, !820, !823, !824, !826}
!733 = !DILocalVariable(name: "file", arg: 1, scope: !729, file: !3, line: 183, type: !29)
!734 = !DILocalVariable(name: "print_name", arg: 2, scope: !729, file: !3, line: 183, type: !45)
!735 = !DILocalVariable(name: "buf", scope: !729, file: !3, line: 185, type: !736)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 524288, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 65536)
!739 = !DILocalVariable(name: "crc", scope: !729, file: !3, line: 186, type: !79)
!740 = !DILocalVariable(name: "length", scope: !729, file: !3, line: 187, type: !560)
!741 = !DILocalVariable(name: "bytes_read", scope: !729, file: !3, line: 188, type: !33)
!742 = !DILocalVariable(name: "fp", scope: !729, file: !3, line: 189, type: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !745, line: 49, baseType: !746)
!745 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !747, line: 241, size: 1728, elements: !748)
!747 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !769, !770, !771, !772, !775, !776, !778, !782, !785, !787, !788, !789, !790, !791, !792, !793}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !746, file: !747, line: 242, baseType: !73, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !746, file: !747, line: 247, baseType: !127, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !746, file: !747, line: 248, baseType: !127, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !746, file: !747, line: 249, baseType: !127, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !746, file: !747, line: 250, baseType: !127, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !746, file: !747, line: 251, baseType: !127, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !746, file: !747, line: 252, baseType: !127, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !746, file: !747, line: 253, baseType: !127, size: 64, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !746, file: !747, line: 254, baseType: !127, size: 64, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !746, file: !747, line: 256, baseType: !127, size: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !746, file: !747, line: 257, baseType: !127, size: 64, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !746, file: !747, line: 258, baseType: !127, size: 64, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !746, file: !747, line: 260, baseType: !762, size: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !747, line: 156, size: 192, elements: !764)
!764 = !{!765, !766, !768}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !763, file: !747, line: 157, baseType: !762, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !763, file: !747, line: 158, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !763, file: !747, line: 162, baseType: !73, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !746, file: !747, line: 262, baseType: !767, size: 64, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !746, file: !747, line: 264, baseType: !73, size: 32, offset: 896)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !746, file: !747, line: 268, baseType: !73, size: 32, offset: 928)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !746, file: !747, line: 270, baseType: !773, size: 64, offset: 960)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !562, line: 140, baseType: !774)
!774 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !746, file: !747, line: 274, baseType: !156, size: 16, offset: 1024)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !746, file: !747, line: 275, baseType: !777, size: 8, offset: 1040)
!777 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !746, file: !747, line: 276, baseType: !779, size: 8, offset: 1048)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 1)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !746, file: !747, line: 280, baseType: !783, size: 64, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !747, line: 150, baseType: null)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !746, file: !747, line: 289, baseType: !786, size: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !562, line: 141, baseType: !774)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !746, file: !747, line: 297, baseType: !32, size: 64, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !746, file: !747, line: 298, baseType: !32, size: 64, offset: 1280)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !746, file: !747, line: 299, baseType: !32, size: 64, offset: 1344)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !746, file: !747, line: 300, baseType: !32, size: 64, offset: 1408)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !746, file: !747, line: 302, baseType: !33, size: 64, offset: 1472)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !746, file: !747, line: 303, baseType: !73, size: 32, offset: 1536)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !746, file: !747, line: 305, baseType: !794, size: 160, offset: 1568)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 20)
!797 = !DILocalVariable(name: "length_buf", scope: !729, file: !3, line: 190, type: !798)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 168, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 21)
!801 = !DILocalVariable(name: "hp", scope: !729, file: !3, line: 191, type: !29)
!802 = !DILocalVariable(name: "__s1_len", scope: !803, file: !3, line: 193, type: !33)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 193, column: 7)
!804 = distinct !DILexicalBlock(scope: !729, file: !3, line: 193, column: 7)
!805 = !DILocalVariable(name: "__s2_len", scope: !803, file: !3, line: 193, type: !33)
!806 = !DILocalVariable(name: "__s2", scope: !807, file: !3, line: 193, type: !38)
!807 = distinct !DILexicalBlock(scope: !803, file: !3, line: 193, column: 7)
!808 = !DILocalVariable(name: "__result", scope: !807, file: !3, line: 193, type: !73)
!809 = !DILocalVariable(name: "cp", scope: !810, file: !3, line: 213, type: !550)
!810 = distinct !DILexicalBlock(scope: !729, file: !3, line: 212, column: 5)
!811 = !DILocalVariable(name: "__s1_len", scope: !812, file: !3, line: 227, type: !33)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 227, column: 12)
!813 = distinct !DILexicalBlock(scope: !814, file: !3, line: 227, column: 11)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 225, column: 5)
!815 = distinct !DILexicalBlock(scope: !729, file: !3, line: 224, column: 7)
!816 = !DILocalVariable(name: "__s2_len", scope: !812, file: !3, line: 227, type: !33)
!817 = !DILocalVariable(name: "__s2", scope: !818, file: !3, line: 227, type: !38)
!818 = distinct !DILexicalBlock(scope: !812, file: !3, line: 227, column: 12)
!819 = !DILocalVariable(name: "__result", scope: !818, file: !3, line: 227, type: !73)
!820 = !DILocalVariable(name: "__s1_len", scope: !821, file: !3, line: 232, type: !33)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 232, column: 8)
!822 = distinct !DILexicalBlock(scope: !729, file: !3, line: 232, column: 7)
!823 = !DILocalVariable(name: "__s2_len", scope: !821, file: !3, line: 232, type: !33)
!824 = !DILocalVariable(name: "__s2", scope: !825, file: !3, line: 232, type: !38)
!825 = distinct !DILexicalBlock(scope: !821, file: !3, line: 232, column: 8)
!826 = !DILocalVariable(name: "__result", scope: !825, file: !3, line: 232, type: !73)
!827 = !DILocation(line: 183, column: 20, scope: !729)
!828 = !DIExpression(DW_OP_LLVM_fragment, 0, 1)
!829 = !DILocation(line: 183, column: 31, scope: !729)
!830 = !DILocation(line: 185, column: 3, scope: !729)
!831 = !DILocation(line: 185, column: 17, scope: !729)
!832 = !DILocation(line: 186, column: 17, scope: !729)
!833 = !DILocation(line: 187, column: 13, scope: !729)
!834 = !DILocation(line: 190, column: 3, scope: !729)
!835 = !DILocation(line: 190, column: 8, scope: !729)
!836 = !DILocation(line: 193, column: 7, scope: !803)
!837 = !DILocation(line: 193, column: 7, scope: !807)
!838 = !DILocation(line: 193, column: 7, scope: !839)
!839 = !DILexicalBlockFile(scope: !807, file: !3, discriminator: 2)
!840 = !{!626, !626, i64 0}
!841 = !DILocation(line: 193, column: 7, scope: !842)
!842 = !DILexicalBlockFile(scope: !843, file: !3, discriminator: 3)
!843 = distinct !DILexicalBlock(scope: !807, file: !3, line: 193, column: 7)
!844 = !DILocation(line: 193, column: 7, scope: !845)
!845 = !DILexicalBlockFile(scope: !843, file: !3, discriminator: 2)
!846 = !DILocation(line: 193, column: 7, scope: !847)
!847 = !DILexicalBlockFile(scope: !848, file: !3, discriminator: 4)
!848 = distinct !DILexicalBlock(scope: !843, file: !3, line: 193, column: 7)
!849 = !DILocation(line: 193, column: 7, scope: !850)
!850 = !DILexicalBlockFile(scope: !804, file: !3, discriminator: 13)
!851 = !DILocation(line: 193, column: 7, scope: !852)
!852 = !DILexicalBlockFile(scope: !729, file: !3, discriminator: 13)
!853 = !DILocation(line: 195, column: 12, scope: !854)
!854 = distinct !DILexicalBlock(scope: !804, file: !3, line: 194, column: 5)
!855 = !DILocation(line: 189, column: 9, scope: !729)
!856 = !DILocation(line: 198, column: 5, scope: !854)
!857 = !DILocation(line: 201, column: 12, scope: !858)
!858 = distinct !DILexicalBlock(scope: !804, file: !3, line: 200, column: 5)
!859 = !DILocation(line: 202, column: 14, scope: !860)
!860 = distinct !DILexicalBlock(scope: !858, file: !3, line: 202, column: 11)
!861 = !DILocation(line: 202, column: 11, scope: !858)
!862 = !DILocation(line: 204, column: 21, scope: !863)
!863 = distinct !DILexicalBlock(scope: !860, file: !3, line: 203, column: 9)
!864 = !DILocation(line: 204, column: 34, scope: !865)
!865 = !DILexicalBlockFile(scope: !863, file: !3, discriminator: 1)
!866 = !DILocation(line: 204, column: 11, scope: !867)
!867 = !DILexicalBlockFile(scope: !863, file: !3, discriminator: 2)
!868 = !DILocation(line: 205, column: 11, scope: !863)
!869 = !DILocation(line: 209, column: 3, scope: !729)
!870 = !DILocation(line: 211, column: 3, scope: !729)
!871 = !DILocation(line: 211, column: 24, scope: !872)
!872 = !DILexicalBlockFile(scope: !729, file: !3, discriminator: 1)
!873 = !DILocation(line: 188, column: 10, scope: !729)
!874 = !DILocation(line: 211, column: 52, scope: !872)
!875 = !DILocation(line: 211, column: 3, scope: !872)
!876 = !{!877, !694, i64 0}
!877 = !{!"_IO_FILE", !694, i64 0, !625, i64 8, !625, i64 16, !625, i64 24, !625, i64 32, !625, i64 40, !625, i64 48, !625, i64 56, !625, i64 64, !625, i64 72, !625, i64 80, !625, i64 88, !625, i64 96, !625, i64 104, !694, i64 112, !694, i64 116, !878, i64 120, !879, i64 128, !626, i64 130, !626, i64 131, !625, i64 136, !878, i64 144, !625, i64 152, !625, i64 160, !625, i64 168, !625, i64 176, !878, i64 184, !694, i64 192, !626, i64 196}
!878 = !{!"long", !626, i64 0}
!879 = !{!"short", !626, i64 0}
!880 = !DILocation(line: 213, column: 22, scope: !810)
!881 = !DILocation(line: 215, column: 18, scope: !882)
!882 = distinct !DILexicalBlock(scope: !810, file: !3, line: 215, column: 11)
!883 = !DILocation(line: 215, column: 31, scope: !882)
!884 = !DILocation(line: 215, column: 11, scope: !810)
!885 = !DILocation(line: 218, column: 24, scope: !886)
!886 = !DILexicalBlockFile(scope: !810, file: !3, discriminator: 1)
!887 = !DILocation(line: 219, column: 20, scope: !810)
!888 = !DILocation(line: 219, column: 41, scope: !810)
!889 = !DILocation(line: 219, column: 50, scope: !810)
!890 = !DILocation(line: 219, column: 57, scope: !810)
!891 = !DILocation(line: 219, column: 28, scope: !810)
!892 = !{!878, !878, i64 0}
!893 = !DILocation(line: 219, column: 26, scope: !810)
!894 = !DILocation(line: 218, column: 7, scope: !886)
!895 = !DILocation(line: 216, column: 9, scope: !882)
!896 = !DILocation(line: 216, column: 9, scope: !897)
!897 = !DILexicalBlockFile(scope: !882, file: !3, discriminator: 1)
!898 = !DILocation(line: 216, column: 9, scope: !899)
!899 = !DILexicalBlockFile(scope: !882, file: !3, discriminator: 2)
!900 = !DILocation(line: 219, column: 53, scope: !810)
!901 = distinct !{!901, !902, !903}
!902 = !DILocation(line: 218, column: 7, scope: !810)
!903 = !DILocation(line: 219, column: 63, scope: !810)
!904 = !DILocation(line: 125, column: 1, scope: !905, inlinedAt: !911)
!905 = distinct !DISubprogram(name: "feof_unlocked", scope: !906, file: !906, line: 125, type: !907, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !909)
!906 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!907 = !DISubroutineType(types: !908)
!908 = !{!73, !743}
!909 = !{!910}
!910 = !DILocalVariable(name: "__stream", arg: 1, scope: !905, file: !906, line: 125, type: !743)
!911 = distinct !DILocation(line: 220, column: 11, scope: !912)
!912 = distinct !DILexicalBlock(scope: !810, file: !3, line: 220, column: 11)
!913 = !DILocation(line: 127, column: 10, scope: !905, inlinedAt: !911)
!914 = !DILocation(line: 220, column: 11, scope: !912)
!915 = distinct !{!915, !870, !916}
!916 = !DILocation(line: 222, column: 5, scope: !729)
!917 = !DILocation(line: 134, column: 10, scope: !918, inlinedAt: !921)
!918 = distinct !DISubprogram(name: "ferror_unlocked", scope: !906, file: !906, line: 132, type: !907, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !919)
!919 = !{!920}
!920 = !DILocalVariable(name: "__stream", arg: 1, scope: !918, file: !906, line: 132, type: !743)
!921 = distinct !DILocation(line: 224, column: 7, scope: !815)
!922 = !DILocation(line: 132, column: 1, scope: !918, inlinedAt: !921)
!923 = !DILocation(line: 224, column: 7, scope: !815)
!924 = !DILocation(line: 224, column: 7, scope: !729)
!925 = !DILocation(line: 226, column: 17, scope: !814)
!926 = !DILocation(line: 226, column: 30, scope: !927)
!927 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 1)
!928 = !DILocation(line: 226, column: 7, scope: !929)
!929 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 2)
!930 = !DILocation(line: 227, column: 12, scope: !812)
!931 = !DILocation(line: 227, column: 12, scope: !818)
!932 = !DILocation(line: 227, column: 12, scope: !933)
!933 = !DILexicalBlockFile(scope: !818, file: !3, discriminator: 2)
!934 = !DILocation(line: 227, column: 12, scope: !935)
!935 = !DILexicalBlockFile(scope: !936, file: !3, discriminator: 3)
!936 = distinct !DILexicalBlock(scope: !818, file: !3, line: 227, column: 12)
!937 = !DILocation(line: 227, column: 12, scope: !938)
!938 = !DILexicalBlockFile(scope: !936, file: !3, discriminator: 2)
!939 = !DILocation(line: 227, column: 12, scope: !940)
!940 = !DILexicalBlockFile(scope: !941, file: !3, discriminator: 4)
!941 = distinct !DILexicalBlock(scope: !936, file: !3, line: 227, column: 12)
!942 = !DILocation(line: 227, column: 12, scope: !943)
!943 = !DILexicalBlockFile(scope: !812, file: !3, discriminator: 11)
!944 = !DILocation(line: 227, column: 11, scope: !945)
!945 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 13)
!946 = !DILocation(line: 228, column: 9, scope: !813)
!947 = !DILocation(line: 232, column: 8, scope: !821)
!948 = !DILocation(line: 232, column: 8, scope: !825)
!949 = !DILocation(line: 232, column: 8, scope: !950)
!950 = !DILexicalBlockFile(scope: !825, file: !3, discriminator: 2)
!951 = !DILocation(line: 232, column: 8, scope: !952)
!952 = !DILexicalBlockFile(scope: !953, file: !3, discriminator: 3)
!953 = distinct !DILexicalBlock(scope: !825, file: !3, line: 232, column: 8)
!954 = !DILocation(line: 232, column: 8, scope: !955)
!955 = !DILexicalBlockFile(scope: !953, file: !3, discriminator: 2)
!956 = !DILocation(line: 232, column: 8, scope: !957)
!957 = !DILexicalBlockFile(scope: !958, file: !3, discriminator: 4)
!958 = distinct !DILexicalBlock(scope: !953, file: !3, line: 232, column: 8)
!959 = !DILocation(line: 232, column: 8, scope: !960)
!960 = !DILexicalBlockFile(scope: !821, file: !3, discriminator: 11)
!961 = !DILocation(line: 232, column: 26, scope: !962)
!962 = !DILexicalBlockFile(scope: !822, file: !3, discriminator: 13)
!963 = !DILocation(line: 232, column: 29, scope: !964)
!964 = !DILexicalBlockFile(scope: !822, file: !3, discriminator: 14)
!965 = !DILocation(line: 232, column: 41, scope: !964)
!966 = !DILocation(line: 232, column: 7, scope: !967)
!967 = !DILexicalBlockFile(scope: !729, file: !3, discriminator: 14)
!968 = !DILocation(line: 234, column: 17, scope: !969)
!969 = distinct !DILexicalBlock(scope: !822, file: !3, line: 233, column: 5)
!970 = !DILocation(line: 234, column: 30, scope: !971)
!971 = !DILexicalBlockFile(scope: !969, file: !3, discriminator: 1)
!972 = !DILocation(line: 234, column: 7, scope: !973)
!973 = !DILexicalBlockFile(scope: !969, file: !3, discriminator: 2)
!974 = !DILocation(line: 235, column: 7, scope: !969)
!975 = !DILocation(line: 238, column: 8, scope: !729)
!976 = !DILocation(line: 191, column: 15, scope: !729)
!977 = !DILocation(line: 240, column: 3, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 1)
!979 = distinct !DILexicalBlock(scope: !729, file: !3, line: 240, column: 3)
!980 = !DILocation(line: 241, column: 16, scope: !981)
!981 = distinct !DILexicalBlock(scope: !979, file: !3, line: 240, column: 3)
!982 = !DILocation(line: 241, column: 37, scope: !981)
!983 = !DILocation(line: 241, column: 44, scope: !981)
!984 = !DILocation(line: 241, column: 54, scope: !981)
!985 = !DILocation(line: 241, column: 24, scope: !981)
!986 = !DILocation(line: 241, column: 22, scope: !981)
!987 = !DILocation(line: 240, column: 25, scope: !988)
!988 = !DILexicalBlockFile(scope: !981, file: !3, discriminator: 2)
!989 = distinct !{!989, !990, !991}
!990 = !DILocation(line: 240, column: 3, scope: !979)
!991 = !DILocation(line: 241, column: 60, scope: !979)
!992 = !DILocation(line: 245, column: 7, scope: !729)
!993 = !DILocation(line: 246, column: 5, scope: !994)
!994 = distinct !DILexicalBlock(scope: !729, file: !3, line: 245, column: 7)
!995 = !DILocation(line: 248, column: 5, scope: !994)
!996 = !DILocation(line: 250, column: 7, scope: !997)
!997 = distinct !DILexicalBlock(scope: !729, file: !3, line: 250, column: 7)
!998 = !DILocation(line: 132, column: 1, scope: !918, inlinedAt: !999)
!999 = distinct !DILocation(line: 250, column: 7, scope: !997)
!1000 = !DILocation(line: 134, column: 10, scope: !918, inlinedAt: !999)
!1001 = !DILocation(line: 250, column: 7, scope: !729)
!1002 = !DILocation(line: 251, column: 5, scope: !997)
!1003 = !DILocation(line: 251, column: 5, scope: !1004)
!1004 = !DILexicalBlockFile(scope: !997, file: !3, discriminator: 1)
!1005 = !DILocation(line: 251, column: 5, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !997, file: !3, discriminator: 2)
!1007 = !DILocation(line: 254, column: 1, scope: !729)
!1008 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !96, file: !96, line: 41, type: !50, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !91, variables: !1009)
!1009 = !{!1010}
!1010 = !DILocalVariable(name: "file", arg: 1, scope: !1008, file: !96, line: 41, type: !29)
!1011 = !DILocation(line: 41, column: 41, scope: !1008)
!1012 = !DILocation(line: 43, column: 13, scope: !1008)
!1013 = !DILocation(line: 44, column: 1, scope: !1008)
!1014 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !96, file: !96, line: 78, type: !1015, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !91, variables: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !45}
!1017 = !{!1018}
!1018 = !DILocalVariable(name: "ignore", arg: 1, scope: !1014, file: !96, line: 78, type: !45)
!1019 = !DILocation(line: 78, column: 37, scope: !1014)
!1020 = !DILocation(line: 80, column: 16, scope: !1014)
!1021 = !{!1022, !1022, i64 0}
!1022 = !{!"_Bool", !626, i64 0}
!1023 = !DILocation(line: 81, column: 1, scope: !1014)
!1024 = distinct !DISubprogram(name: "close_stdout", scope: !96, file: !96, line: 107, type: !1025, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !91, variables: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null}
!1027 = !{!1028}
!1028 = !DILocalVariable(name: "write_error", scope: !1029, file: !96, line: 112, type: !29)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !96, line: 111, column: 5)
!1030 = distinct !DILexicalBlock(scope: !1024, file: !96, line: 109, column: 7)
!1031 = !DILocation(line: 109, column: 21, scope: !1030)
!1032 = !DILocation(line: 109, column: 7, scope: !1030)
!1033 = !DILocation(line: 109, column: 29, scope: !1030)
!1034 = !DILocation(line: 110, column: 7, scope: !1030)
!1035 = !DILocation(line: 110, column: 12, scope: !1036)
!1036 = !DILexicalBlockFile(scope: !1030, file: !96, discriminator: 1)
!1037 = !{i8 0, i8 2}
!1038 = !DILocation(line: 114, column: 19, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1029, file: !96, line: 113, column: 11)
!1040 = !DILocation(line: 110, column: 25, scope: !1036)
!1041 = !DILocation(line: 110, column: 28, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1030, file: !96, discriminator: 2)
!1043 = !DILocation(line: 110, column: 34, scope: !1042)
!1044 = !DILocation(line: 109, column: 7, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1024, file: !96, discriminator: 1)
!1046 = !DILocation(line: 112, column: 33, scope: !1029)
!1047 = !DILocation(line: 112, column: 19, scope: !1029)
!1048 = !DILocation(line: 113, column: 11, scope: !1039)
!1049 = !DILocation(line: 113, column: 11, scope: !1029)
!1050 = !DILocation(line: 114, column: 36, scope: !1051)
!1051 = !DILexicalBlockFile(scope: !1039, file: !96, discriminator: 1)
!1052 = !DILocation(line: 114, column: 9, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !1039, file: !96, discriminator: 2)
!1054 = !DILocation(line: 114, column: 9, scope: !1039)
!1055 = !DILocation(line: 117, column: 9, scope: !1051)
!1056 = !DILocation(line: 119, column: 14, scope: !1029)
!1057 = !DILocation(line: 119, column: 7, scope: !1029)
!1058 = !DILocation(line: 122, column: 22, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1024, file: !96, line: 122, column: 8)
!1060 = !DILocation(line: 122, column: 8, scope: !1059)
!1061 = !DILocation(line: 122, column: 30, scope: !1059)
!1062 = !DILocation(line: 122, column: 8, scope: !1024)
!1063 = !DILocation(line: 123, column: 13, scope: !1059)
!1064 = !DILocation(line: 123, column: 6, scope: !1059)
!1065 = !DILocation(line: 124, column: 1, scope: !1024)
!1066 = distinct !DISubprogram(name: "fdadvise", scope: !1067, file: !1067, line: 31, type: !1068, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !554, variables: !1072)
!1067 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !73, !1070, !1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !745, line: 91, baseType: !773)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !20, line: 52, baseType: !19)
!1072 = !{!1073, !1074, !1075, !1076, !1077}
!1073 = !DILocalVariable(name: "fd", arg: 1, scope: !1066, file: !1067, line: 31, type: !73)
!1074 = !DILocalVariable(name: "offset", arg: 2, scope: !1066, file: !1067, line: 31, type: !1070)
!1075 = !DILocalVariable(name: "len", arg: 3, scope: !1066, file: !1067, line: 31, type: !1070)
!1076 = !DILocalVariable(name: "advice", arg: 4, scope: !1066, file: !1067, line: 31, type: !1071)
!1077 = !DILocalVariable(name: "__x", scope: !1078, file: !1067, line: 34, type: !73)
!1078 = distinct !DILexicalBlock(scope: !1066, file: !1067, line: 34, column: 3)
!1079 = !DILocation(line: 31, column: 15, scope: !1066)
!1080 = !DILocation(line: 31, column: 25, scope: !1066)
!1081 = !DILocation(line: 31, column: 39, scope: !1066)
!1082 = !DILocation(line: 31, column: 54, scope: !1066)
!1083 = !DILocation(line: 34, column: 3, scope: !1078)
!1084 = !DILocation(line: 36, column: 1, scope: !1066)
!1085 = distinct !DISubprogram(name: "fadvise", scope: !1067, file: !1067, line: 39, type: !1086, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !554, variables: !1128)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !1088, !1071}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !745, line: 49, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !747, line: 241, size: 1728, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1090, file: !747, line: 242, baseType: !73, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1090, file: !747, line: 247, baseType: !127, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1090, file: !747, line: 248, baseType: !127, size: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1090, file: !747, line: 249, baseType: !127, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1090, file: !747, line: 250, baseType: !127, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1090, file: !747, line: 251, baseType: !127, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1090, file: !747, line: 252, baseType: !127, size: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1090, file: !747, line: 253, baseType: !127, size: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1090, file: !747, line: 254, baseType: !127, size: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1090, file: !747, line: 256, baseType: !127, size: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1090, file: !747, line: 257, baseType: !127, size: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1090, file: !747, line: 258, baseType: !127, size: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1090, file: !747, line: 260, baseType: !1105, size: 64, offset: 768)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !747, line: 156, size: 192, elements: !1107)
!1107 = !{!1108, !1109, !1111}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1106, file: !747, line: 157, baseType: !1105, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1106, file: !747, line: 158, baseType: !1110, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1106, file: !747, line: 162, baseType: !73, size: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1090, file: !747, line: 262, baseType: !1110, size: 64, offset: 832)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1090, file: !747, line: 264, baseType: !73, size: 32, offset: 896)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1090, file: !747, line: 268, baseType: !73, size: 32, offset: 928)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1090, file: !747, line: 270, baseType: !773, size: 64, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1090, file: !747, line: 274, baseType: !156, size: 16, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1090, file: !747, line: 275, baseType: !777, size: 8, offset: 1040)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1090, file: !747, line: 276, baseType: !779, size: 8, offset: 1048)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1090, file: !747, line: 280, baseType: !783, size: 64, offset: 1088)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1090, file: !747, line: 289, baseType: !786, size: 64, offset: 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1090, file: !747, line: 297, baseType: !32, size: 64, offset: 1216)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1090, file: !747, line: 298, baseType: !32, size: 64, offset: 1280)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1090, file: !747, line: 299, baseType: !32, size: 64, offset: 1344)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1090, file: !747, line: 300, baseType: !32, size: 64, offset: 1408)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1090, file: !747, line: 302, baseType: !33, size: 64, offset: 1472)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1090, file: !747, line: 303, baseType: !73, size: 32, offset: 1536)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1090, file: !747, line: 305, baseType: !794, size: 160, offset: 1568)
!1128 = !{!1129, !1130}
!1129 = !DILocalVariable(name: "fp", arg: 1, scope: !1085, file: !1067, line: 39, type: !1088)
!1130 = !DILocalVariable(name: "advice", arg: 2, scope: !1085, file: !1067, line: 39, type: !1071)
!1131 = !DILocation(line: 39, column: 16, scope: !1085)
!1132 = !DILocation(line: 39, column: 30, scope: !1085)
!1133 = !DILocation(line: 41, column: 7, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1085, file: !1067, line: 41, column: 7)
!1135 = !DILocation(line: 41, column: 7, scope: !1085)
!1136 = !DILocation(line: 42, column: 15, scope: !1134)
!1137 = !DILocation(line: 31, column: 15, scope: !1066, inlinedAt: !1138)
!1138 = distinct !DILocation(line: 42, column: 5, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1134, file: !1067, discriminator: 1)
!1140 = !DILocation(line: 31, column: 25, scope: !1066, inlinedAt: !1138)
!1141 = !DILocation(line: 31, column: 39, scope: !1066, inlinedAt: !1138)
!1142 = !DILocation(line: 31, column: 54, scope: !1066, inlinedAt: !1138)
!1143 = !DILocation(line: 34, column: 3, scope: !1078, inlinedAt: !1138)
!1144 = !DILocation(line: 42, column: 5, scope: !1134)
!1145 = !DILocation(line: 43, column: 1, scope: !1085)
!1146 = distinct !DISubprogram(name: "umaxtostr", scope: !1147, file: !1147, line: 36, type: !1148, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !557, variables: !1150)
!1147 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!127, !560, !127}
!1150 = !{!1151, !1152, !1153}
!1151 = !DILocalVariable(name: "i", arg: 1, scope: !1146, file: !1147, line: 36, type: !560)
!1152 = !DILocalVariable(name: "buf", arg: 2, scope: !1146, file: !1147, line: 36, type: !127)
!1153 = !DILocalVariable(name: "p", scope: !1146, file: !1147, line: 38, type: !127)
!1154 = !DILocation(line: 36, column: 19, scope: !1146)
!1155 = !DILocation(line: 36, column: 28, scope: !1146)
!1156 = !DILocation(line: 38, column: 17, scope: !1146)
!1157 = !DILocation(line: 38, column: 9, scope: !1146)
!1158 = !DILocation(line: 39, column: 6, scope: !1146)
!1159 = !DILocation(line: 41, column: 7, scope: !1146)
!1160 = !DILocation(line: 52, column: 24, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !1147, line: 50, column: 5)
!1162 = distinct !DILexicalBlock(scope: !1146, file: !1147, line: 41, column: 7)
!1163 = !DILocation(line: 52, column: 16, scope: !1161)
!1164 = !DILocation(line: 52, column: 10, scope: !1161)
!1165 = !DILocation(line: 52, column: 14, scope: !1161)
!1166 = !DILocation(line: 53, column: 17, scope: !1161)
!1167 = !DILocation(line: 53, column: 24, scope: !1161)
!1168 = !DILocation(line: 52, column: 9, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1161, file: !1147, discriminator: 1)
!1170 = distinct !{!1170, !1171, !1172}
!1171 = !DILocation(line: 51, column: 7, scope: !1161)
!1172 = !DILocation(line: 53, column: 28, scope: !1161)
!1173 = !DILocation(line: 56, column: 3, scope: !1146)
!1174 = distinct !DISubprogram(name: "parse_long_options", scope: !109, file: !109, line: 44, type: !1175, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !106, variables: !1178)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{null, !73, !668, !29, !29, !29, !1177, null}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!1179 = !DILocalVariable(name: "argc", arg: 1, scope: !1174, file: !109, line: 44, type: !73)
!1180 = !DILocalVariable(name: "argv", arg: 2, scope: !1174, file: !109, line: 45, type: !668)
!1181 = !DILocalVariable(name: "command_name", arg: 3, scope: !1174, file: !109, line: 46, type: !29)
!1182 = !DILocalVariable(name: "package", arg: 4, scope: !1174, file: !109, line: 47, type: !29)
!1183 = !DILocalVariable(name: "version", arg: 5, scope: !1174, file: !109, line: 48, type: !29)
!1184 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1174, file: !109, line: 49, type: !1177)
!1185 = !DILocalVariable(name: "c", scope: !1174, file: !109, line: 52, type: !73)
!1186 = !DILocalVariable(name: "saved_opterr", scope: !1174, file: !109, line: 53, type: !73)
!1187 = !DILocalVariable(name: "authors", scope: !1188, file: !109, line: 71, type: !1192)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !109, line: 70, column: 11)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !109, line: 64, column: 9)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !109, line: 62, column: 5)
!1191 = distinct !DILexicalBlock(scope: !1174, file: !109, line: 60, column: 7)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !745, line: 80, baseType: !1193)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1194, line: 50, baseType: !1195)
!1194 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !107, line: 71, baseType: !1196)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 192, elements: !780)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !107, line: 71, size: 192, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1197, file: !107, line: 71, baseType: !41, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1197, file: !107, line: 71, baseType: !41, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1197, file: !107, line: 71, baseType: !32, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1197, file: !107, line: 71, baseType: !32, size: 64, offset: 128)
!1203 = !DILocation(line: 44, column: 25, scope: !1174)
!1204 = !DILocation(line: 45, column: 28, scope: !1174)
!1205 = !DILocation(line: 46, column: 33, scope: !1174)
!1206 = !DILocation(line: 47, column: 33, scope: !1174)
!1207 = !DILocation(line: 48, column: 33, scope: !1174)
!1208 = !DILocation(line: 49, column: 28, scope: !1174)
!1209 = !DILocation(line: 55, column: 18, scope: !1174)
!1210 = !DILocation(line: 53, column: 7, scope: !1174)
!1211 = !DILocation(line: 58, column: 10, scope: !1174)
!1212 = !DILocation(line: 60, column: 12, scope: !1191)
!1213 = !DILocation(line: 61, column: 7, scope: !1191)
!1214 = !DILocation(line: 61, column: 15, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1191, file: !109, discriminator: 1)
!1216 = !DILocation(line: 52, column: 7, scope: !1174)
!1217 = !DILocation(line: 60, column: 7, scope: !1218)
!1218 = !DILexicalBlockFile(scope: !1174, file: !109, discriminator: 1)
!1219 = !DILocation(line: 66, column: 11, scope: !1189)
!1220 = !DILocation(line: 67, column: 11, scope: !1189)
!1221 = !DILocation(line: 71, column: 13, scope: !1188)
!1222 = !DILocation(line: 71, column: 21, scope: !1188)
!1223 = !DILocation(line: 72, column: 13, scope: !1188)
!1224 = !DILocation(line: 73, column: 29, scope: !1188)
!1225 = !DILocation(line: 73, column: 13, scope: !1188)
!1226 = !DILocation(line: 74, column: 13, scope: !1188)
!1227 = !DILocation(line: 84, column: 10, scope: !1174)
!1228 = !DILocation(line: 88, column: 10, scope: !1174)
!1229 = !DILocation(line: 89, column: 1, scope: !1174)
!1230 = distinct !DISubprogram(name: "set_program_name", scope: !129, file: !129, line: 39, type: !50, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !124, variables: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DILocalVariable(name: "argv0", arg: 1, scope: !1230, file: !129, line: 39, type: !29)
!1233 = !DILocalVariable(name: "slash", scope: !1230, file: !129, line: 46, type: !29)
!1234 = !DILocalVariable(name: "base", scope: !1230, file: !129, line: 47, type: !29)
!1235 = !DILocation(line: 39, column: 31, scope: !1230)
!1236 = !DILocation(line: 51, column: 13, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1230, file: !129, line: 51, column: 7)
!1238 = !DILocation(line: 51, column: 7, scope: !1230)
!1239 = !DILocation(line: 55, column: 14, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1237, file: !129, line: 52, column: 5)
!1241 = !DILocation(line: 54, column: 7, scope: !1240)
!1242 = !DILocation(line: 56, column: 7, scope: !1240)
!1243 = !DILocation(line: 59, column: 11, scope: !1230)
!1244 = !DILocation(line: 46, column: 15, scope: !1230)
!1245 = !DILocation(line: 60, column: 17, scope: !1230)
!1246 = !DILocation(line: 60, column: 33, scope: !1247)
!1247 = !DILexicalBlockFile(scope: !1230, file: !129, discriminator: 1)
!1248 = !DILocation(line: 60, column: 11, scope: !1230)
!1249 = !DILocation(line: 47, column: 15, scope: !1230)
!1250 = !DILocation(line: 61, column: 12, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1230, file: !129, line: 61, column: 7)
!1252 = !DILocation(line: 61, column: 20, scope: !1251)
!1253 = !DILocation(line: 61, column: 25, scope: !1251)
!1254 = !DILocation(line: 61, column: 28, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1251, file: !129, discriminator: 1)
!1256 = !DILocation(line: 61, column: 61, scope: !1255)
!1257 = !DILocation(line: 61, column: 7, scope: !1247)
!1258 = !DILocation(line: 64, column: 11, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1260, file: !129, line: 64, column: 11)
!1260 = distinct !DILexicalBlock(scope: !1251, file: !129, line: 62, column: 5)
!1261 = !DILocation(line: 64, column: 36, scope: !1259)
!1262 = !DILocation(line: 64, column: 11, scope: !1260)
!1263 = !DILocation(line: 66, column: 24, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1259, file: !129, line: 65, column: 9)
!1265 = !DILocation(line: 70, column: 41, scope: !1264)
!1266 = !DILocation(line: 72, column: 9, scope: !1264)
!1267 = !DILocation(line: 84, column: 16, scope: !1230)
!1268 = !DILocation(line: 90, column: 27, scope: !1230)
!1269 = !DILocation(line: 92, column: 1, scope: !1230)
!1270 = distinct !DISubprogram(name: "clone_quoting_options", scope: !160, file: !160, line: 114, type: !1271, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !132, variables: !1274)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!1273, !1273}
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!1274 = !{!1275, !1276, !1277}
!1275 = !DILocalVariable(name: "o", arg: 1, scope: !1270, file: !160, line: 114, type: !1273)
!1276 = !DILocalVariable(name: "e", scope: !1270, file: !160, line: 116, type: !73)
!1277 = !DILocalVariable(name: "p", scope: !1270, file: !160, line: 117, type: !1273)
!1278 = !DILocation(line: 114, column: 48, scope: !1270)
!1279 = !DILocation(line: 116, column: 11, scope: !1270)
!1280 = !DILocation(line: 116, column: 7, scope: !1270)
!1281 = !DILocation(line: 117, column: 40, scope: !1270)
!1282 = !DILocation(line: 117, column: 40, scope: !1283)
!1283 = !DILexicalBlockFile(scope: !1270, file: !160, discriminator: 3)
!1284 = !DILocation(line: 117, column: 31, scope: !1283)
!1285 = !DILocation(line: 117, column: 27, scope: !1270)
!1286 = !DILocation(line: 119, column: 9, scope: !1270)
!1287 = !DILocation(line: 120, column: 3, scope: !1270)
!1288 = distinct !DISubprogram(name: "get_quoting_style", scope: !160, file: !160, line: 125, type: !1289, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !132, variables: !1293)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!5, !1291}
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!1293 = !{!1294}
!1294 = !DILocalVariable(name: "o", arg: 1, scope: !1288, file: !160, line: 125, type: !1291)
!1295 = !DILocation(line: 125, column: 50, scope: !1288)
!1296 = !DILocation(line: 127, column: 11, scope: !1288)
!1297 = !DILocation(line: 127, column: 46, scope: !1298)
!1298 = !DILexicalBlockFile(scope: !1288, file: !160, discriminator: 3)
!1299 = !{!1300, !626, i64 0}
!1300 = !{!"quoting_options", !626, i64 0, !694, i64 4, !626, i64 8, !625, i64 40, !625, i64 48}
!1301 = !DILocation(line: 127, column: 3, scope: !1298)
!1302 = distinct !DISubprogram(name: "set_quoting_style", scope: !160, file: !160, line: 133, type: !1303, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !132, variables: !1305)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !1273, !5}
!1305 = !{!1306, !1307}
!1306 = !DILocalVariable(name: "o", arg: 1, scope: !1302, file: !160, line: 133, type: !1273)
!1307 = !DILocalVariable(name: "s", arg: 2, scope: !1302, file: !160, line: 133, type: !5)
!1308 = !DILocation(line: 133, column: 44, scope: !1302)
!1309 = !DILocation(line: 133, column: 66, scope: !1302)
!1310 = !DILocation(line: 135, column: 4, scope: !1302)
!1311 = !DILocation(line: 135, column: 39, scope: !1312)
!1312 = !DILexicalBlockFile(scope: !1302, file: !160, discriminator: 3)
!1313 = !DILocation(line: 135, column: 45, scope: !1312)
!1314 = !DILocation(line: 136, column: 1, scope: !1302)
