!llvm.dbg.cu = !{!2, !219, !225, !233, !691, !694, !696, !699, !702, !240, !247, !705, !707, !299, !715, !726, !728, !731, !735, !737, !312, !739, !741, !743, !746, !345, !748}
!llvm.ident = !{!750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750, !750}
!llvm.module.flags = !{!751, !752, !753, !754}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 105, type: !99, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !79, globals: !91)
!3 = !DIFile(filename: "src/join.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11, !16, !24, !38, !47, !64}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "operand_status", file: !3, line: 942, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "MUST_BE_OPERAND", value: 0)
!8 = !DIEnumerator(name: "MIGHT_BE_J1_ARG", value: 1)
!9 = !DIEnumerator(name: "MIGHT_BE_J2_ARG", value: 2)
!10 = !DIEnumerator(name: "MIGHT_BE_O_ARG", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 145, size: 32, elements: !12)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "CHECK_ORDER_DEFAULT", value: 0)

!57 = !{!58, !59, !60, !61}
!58 = !DILocalVariable(name: "p", arg: 1, scope: !49, file: !48, line: 180, type: !52)
!59 = !DILocalVariable(name: "pn", arg: 2, scope: !49, file: !48, line: 180, type: !53)
!60 = !DILocalVariable(name: "s", arg: 3, scope: !49, file: !48, line: 180, type: !54)
!61 = !DILocalVariable(name: "n", scope: !49, file: !48, line: 182, type: !54)
!62 = !{!63}
!63 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 46, size: 32, elements: !66)
!65 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!67 = !DIEnumerator(name: "_ISupper", value: 256)
!68 = !DIEnumerator(name: "_ISlower", value: 512)
!69 = !DIEnumerator(name: "_ISalpha", value: 1024)
!70 = !DIEnumerator(name: "_ISdigit", value: 2048)
!71 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!72 = !DIEnumerator(name: "_ISspace", value: 8192)
!73 = !DIEnumerator(name: "_ISprint", value: 16384)
!74 = !DIEnumerator(name: "_ISgraph", value: 32768)
!75 = !DIEnumerator(name: "_ISblank", value: 1)
!76 = !DIEnumerator(name: "_IScntrl", value: 2)
!77 = !DIEnumerator(name: "_ISpunct", value: 4)
!78 = !DIEnumerator(name: "_ISalnum", value: 8)
!79 = !{!54, !80, !82, !85, !88, !52, !84, !89, !90}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !{!92, !0, !97, !100, !102, !104, !106, !109, !111, !113, !115, !117, !119, !149, !170, !184, !186, !188, !196, !198, !200, !202, !204, !206, !208, !210}
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "g_names", scope: !2, file: !3, line: 97, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 2)
!97 = !DIGlobalVariableExpression(var: !98)
!98 = distinct !DIGlobalVariable(name: "print_unpairables_1", scope: !2, file: !3, line: 108, type: !99, isLocal: true, isDefinition: true)
!99 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "print_unpairables_2", scope: !2, file: !3, line: 108, type: !99, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103)
!103 = distinct !DIGlobalVariable(name: "print_pairables", scope: !2, file: !3, line: 111, type: !99, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "seen_unpairable", scope: !2, file: !3, line: 114, type: !99, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107)
!107 = distinct !DIGlobalVariable(name: "issued_disorder_warning", scope: !2, file: !3, line: 117, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 16, elements: !95)
!109 = !DIGlobalVariableExpression(var: !110)
!110 = distinct !DIGlobalVariable(name: "empty_filler", scope: !2, file: !3, line: 120, type: !85, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112)
!112 = distinct !DIGlobalVariable(name: "autoformat", scope: !2, file: !3, line: 123, type: !99, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114)
!114 = distinct !DIGlobalVariable(name: "check_input_order", scope: !2, file: !3, line: 150, type: !11, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "ignore_case", scope: !2, file: !3, line: 176, type: !99, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "join_header_lines", scope: !2, file: !3, line: 180, type: !99, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120)
!120 = distinct !DIGlobalVariable(name: "infomap", scope: !121, file: !122, line: 632, type: !146, isLocal: true, isDefinition: true)
!121 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !122, file: !122, line: 630, type: !123, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !125)
!122 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!123 = !DISubroutineType(types: !124)
!124 = !{null, !85}
!125 = !{!126, !127, !128, !135, !137, !138, !139, !142, !143, !145}
!126 = !DILocalVariable(name: "program", arg: 1, scope: !121, file: !122, line: 630, type: !85)
!127 = !DILocalVariable(name: "node", scope: !121, file: !122, line: 642, type: !85)
!128 = !DILocalVariable(name: "map_prog", scope: !121, file: !122, line: 643, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !121, file: !122, line: 632, size: 128, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !131, file: !122, line: 632, baseType: !85, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !131, file: !122, line: 632, baseType: !85, size: 64, offset: 64)
!135 = !DILocalVariable(name: "__s1_len", scope: !136, file: !122, line: 645, type: !54)
!136 = distinct !DILexicalBlock(scope: !121, file: !122, line: 645, column: 33)
!137 = !DILocalVariable(name: "__s2_len", scope: !136, file: !122, line: 645, type: !54)
!138 = !DILocalVariable(name: "lc_messages", scope: !121, file: !122, line: 655, type: !85)
!139 = !DILocalVariable(name: "__s1_len", scope: !140, file: !122, line: 656, type: !54)
!140 = distinct !DILexicalBlock(scope: !141, file: !122, line: 656, column: 22)
!141 = distinct !DILexicalBlock(scope: !121, file: !122, line: 656, column: 7)
!142 = !DILocalVariable(name: "__s2_len", scope: !140, file: !122, line: 656, type: !54)
!143 = !DILocalVariable(name: "__s2", scope: !144, file: !122, line: 656, type: !82)
!144 = distinct !DILexicalBlock(scope: !140, file: !122, line: 656, column: 22)
!145 = !DILocalVariable(name: "__result", scope: !144, file: !122, line: 656, type: !89)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 896, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 7)
!149 = !DIGlobalVariableExpression(var: !150)
!150 = distinct !DIGlobalVariable(name: "spareline", scope: !2, file: !3, line: 102, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !95)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 73, size: 384, elements: !154)
!154 = !{!155, !162, !163, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !153, file: !3, line: 75, baseType: !156, size: 192)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !157, line: 26, size: 192, elements: !158)
!157 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !157, line: 28, baseType: !54, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !156, file: !157, line: 29, baseType: !54, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !156, file: !157, line: 30, baseType: !88, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !153, file: !3, line: 76, baseType: !54, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nfields_allocated", scope: !153, file: !3, line: 77, baseType: !54, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !153, file: !3, line: 78, baseType: !165, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field", file: !3, line: 66, size: 128, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "beg", scope: !166, file: !3, line: 68, baseType: !88, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !3, line: 69, baseType: !54, size: 64, offset: 64)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 160, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 2048, elements: !182)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !175, line: 104, size: 256, elements: !176)
!175 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !{!177, !178, !179, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !175, line: 106, baseType: !85, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !174, file: !175, line: 109, baseType: !89, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !174, file: !175, line: 110, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !174, file: !175, line: 111, baseType: !89, size: 32, offset: 192)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "join_field_1", scope: !2, file: !3, line: 130, type: !54, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "join_field_2", scope: !2, file: !3, line: 131, type: !54, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "outlist_end", scope: !2, file: !3, line: 137, type: !190, isLocal: true, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outlist", file: !3, line: 53, size: 192, elements: !192)
!192 = !{!193, !194, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !191, file: !3, line: 57, baseType: !89, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !191, file: !3, line: 60, baseType: !54, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !3, line: 62, baseType: !190, size: 64, offset: 128)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "outlist_head", scope: !2, file: !3, line: 134, type: !191, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 142, type: !89, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 183, type: !87, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "autocount_1", scope: !2, file: !3, line: 126, type: !54, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "autocount_2", scope: !2, file: !3, line: 127, type: !54, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "uni_blank", scope: !2, file: !3, line: 173, type: !153, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "prevline", scope: !2, file: !3, line: 91, type: !151, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 94, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !95)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !214, line: 136, baseType: !215)
!214 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !216, line: 62, baseType: !56)
!216 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "Version", scope: !219, file: !220, line: 2, type: !85, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, globals: !222)
!220 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !{}
!222 = !{!217}
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "file_name", scope: !225, file: !230, line: 36, type: !85, isLocal: true, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, globals: !227)
!226 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!227 = !{!223, !228}
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !225, file: !230, line: 46, type: !99, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!231 = !DIGlobalVariableExpression(var: !232)
!232 = distinct !DIGlobalVariable(name: "exit_failure", scope: !233, file: !236, line: 24, type: !237, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, globals: !235)
!234 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !{!231}
!236 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!237 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !89)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "program_name", scope: !240, file: !244, line: 33, type: !85, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !242, globals: !243)
!241 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!242 = !{!52, !88}
!243 = !{!238}
!244 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !247, file: !259, line: 77, type: !293, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !249, retainedTypes: !255, globals: !256)
!248 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!249 = !{!24, !250, !64}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !25, line: 242, size: 32, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!253 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!254 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!255 = !{!89, !90, !54, !88}
!256 = !{!245, !257, !264, !275, !277, !282, !289, !291}
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !247, file: !259, line: 93, type: !260, isDefinition: true)
!259 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 320, elements: !262)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!262 = !{!263}
!263 = !DISubrange(count: 10)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !247, file: !259, line: 1043, type: !266, isDefinition: true)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !259, line: 57, size: 448, elements: !267)
!267 = !{!268, !269, !270, !273, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !266, file: !259, line: 60, baseType: !24, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !259, line: 63, baseType: !89, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !266, file: !259, line: 67, baseType: !271, size: 256, offset: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 256, elements: !182)
!272 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !266, file: !259, line: 70, baseType: !85, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !266, file: !259, line: 73, baseType: !85, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276)
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !247, file: !259, line: 108, type: !266, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278)
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !247, file: !259, line: 834, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283)
!283 = distinct !DIGlobalVariable(name: "slotvec", scope: !247, file: !259, line: 837, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !259, line: 826, size: 128, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !285, file: !259, line: 828, baseType: !54, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !285, file: !259, line: 829, baseType: !88, size: 64, offset: 64)
!289 = !DIGlobalVariableExpression(var: !290)
!290 = distinct !DIGlobalVariable(name: "nslots", scope: !247, file: !259, line: 835, type: !89, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292)
!292 = distinct !DIGlobalVariable(name: "slotvec0", scope: !247, file: !259, line: 836, type: !285, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 704, elements: !295)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!295 = !{!296}
!296 = !DISubrange(count: 11)
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !299, file: !302, line: 26, type: !303, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, globals: !301)
!300 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!301 = !{!297}
!302 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 376, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 47)
!306 = !DIGlobalVariableExpression(var: !307)
!307 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !308, file: !309, line: 335, type: !89, isLocal: true, isDefinition: true)
!308 = distinct !DISubprogram(name: "rpl_fcntl", scope: !309, file: !309, line: 272, type: !310, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !312, variables: !315)
!309 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!310 = !DISubroutineType(types: !311)
!311 = !{!89, !89, !89, null}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, globals: !314)
!313 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!314 = !{!306}
!315 = !{!316, !317, !318, !331, !332, !335, !338, !341}
!316 = !DILocalVariable(name: "fd", arg: 1, scope: !308, file: !309, line: 272, type: !89)
!317 = !DILocalVariable(name: "action", arg: 2, scope: !308, file: !309, line: 272, type: !89)
!318 = !DILocalVariable(name: "arg", scope: !308, file: !309, line: 274, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !320, line: 30, baseType: !321)
!320 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !313, line: 274, baseType: !322)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 192, elements: !329)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !313, line: 274, size: 192, elements: !324)
!324 = !{!325, !326, !327, !328}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !323, file: !313, line: 274, baseType: !272, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !323, file: !313, line: 274, baseType: !272, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !323, file: !313, line: 274, baseType: !52, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !323, file: !313, line: 274, baseType: !52, size: 64, offset: 128)
!329 = !{!330}
!330 = !DISubrange(count: 1)
!331 = !DILocalVariable(name: "result", scope: !308, file: !309, line: 275, type: !89)
!332 = !DILocalVariable(name: "target", scope: !333, file: !309, line: 322, type: !89)
!333 = distinct !DILexicalBlock(scope: !334, file: !309, line: 321, column: 7)
!334 = distinct !DILexicalBlock(scope: !308, file: !309, line: 278, column: 5)
!335 = !DILocalVariable(name: "flags", scope: !336, file: !309, line: 359, type: !89)
!336 = distinct !DILexicalBlock(scope: !337, file: !309, line: 358, column: 11)
!337 = distinct !DILexicalBlock(scope: !333, file: !309, line: 357, column: 13)
!338 = !DILocalVariable(name: "saved_errno", scope: !339, file: !309, line: 362, type: !89)
!339 = distinct !DILexicalBlock(scope: !340, file: !309, line: 361, column: 15)
!340 = distinct !DILexicalBlock(scope: !336, file: !309, line: 360, column: 17)
!341 = !DILocalVariable(name: "p", scope: !342, file: !309, line: 404, type: !52)
!342 = distinct !DILexicalBlock(scope: !334, file: !309, line: 402, column: 7)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !345, file: !689, line: 120, type: !690, isLocal: true, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !347, retainedTypes: !686, globals: !688)
!346 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!347 = !{!348}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 41, size: 32, elements: !350)
!349 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!351 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!352 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!353 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!354 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!355 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!356 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!357 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!358 = !DIEnumerator(name: "DAY_1", value: 131079)
!359 = !DIEnumerator(name: "DAY_2", value: 131080)
!360 = !DIEnumerator(name: "DAY_3", value: 131081)
!361 = !DIEnumerator(name: "DAY_4", value: 131082)
!362 = !DIEnumerator(name: "DAY_5", value: 131083)
!363 = !DIEnumerator(name: "DAY_6", value: 131084)
!364 = !DIEnumerator(name: "DAY_7", value: 131085)
!365 = !DIEnumerator(name: "ABMON_1", value: 131086)
!366 = !DIEnumerator(name: "ABMON_2", value: 131087)
!367 = !DIEnumerator(name: "ABMON_3", value: 131088)
!368 = !DIEnumerator(name: "ABMON_4", value: 131089)
!369 = !DIEnumerator(name: "ABMON_5", value: 131090)
!370 = !DIEnumerator(name: "ABMON_6", value: 131091)
!371 = !DIEnumerator(name: "ABMON_7", value: 131092)
!372 = !DIEnumerator(name: "ABMON_8", value: 131093)
!373 = !DIEnumerator(name: "ABMON_9", value: 131094)
!374 = !DIEnumerator(name: "ABMON_10", value: 131095)
!375 = !DIEnumerator(name: "ABMON_11", value: 131096)
!376 = !DIEnumerator(name: "ABMON_12", value: 131097)
!377 = !DIEnumerator(name: "MON_1", value: 131098)
!378 = !DIEnumerator(name: "MON_2", value: 131099)
!379 = !DIEnumerator(name: "MON_3", value: 131100)
!380 = !DIEnumerator(name: "MON_4", value: 131101)
!381 = !DIEnumerator(name: "MON_5", value: 131102)
!382 = !DIEnumerator(name: "MON_6", value: 131103)
!383 = !DIEnumerator(name: "MON_7", value: 131104)
!384 = !DIEnumerator(name: "MON_8", value: 131105)
!385 = !DIEnumerator(name: "MON_9", value: 131106)
!386 = !DIEnumerator(name: "MON_10", value: 131107)
!387 = !DIEnumerator(name: "MON_11", value: 131108)
!388 = !DIEnumerator(name: "MON_12", value: 131109)
!389 = !DIEnumerator(name: "AM_STR", value: 131110)
!390 = !DIEnumerator(name: "PM_STR", value: 131111)
!391 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!392 = !DIEnumerator(name: "D_FMT", value: 131113)
!393 = !DIEnumerator(name: "T_FMT", value: 131114)
!394 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!395 = !DIEnumerator(name: "ERA", value: 131116)
!396 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!397 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!398 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!399 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!400 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!401 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!402 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!403 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!404 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!405 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!406 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!407 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!408 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!409 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!410 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!411 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!412 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!413 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!414 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!415 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!416 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!417 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!418 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!419 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!420 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!421 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!422 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!423 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!424 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!425 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!426 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!427 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!428 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!429 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!430 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!431 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!432 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!433 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!434 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!435 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!436 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!437 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!438 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!439 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!440 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!441 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!442 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!443 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!444 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!445 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!446 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!447 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!448 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!449 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!450 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!451 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!452 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!453 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!454 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!455 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!456 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!457 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!458 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!459 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!460 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!461 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!462 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!463 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!464 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!465 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!466 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!467 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!468 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!469 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!470 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!471 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!472 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!473 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!474 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!475 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!476 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!477 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!478 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!479 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!480 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!481 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!482 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!483 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!484 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!485 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!488 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!489 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!490 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!491 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!492 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!493 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!494 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!495 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!496 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!497 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!498 = !DIEnumerator(name: "CODESET", value: 14)
!499 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!500 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!501 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!502 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!545 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!551 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!552 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!553 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!554 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!555 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!556 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!567 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!568 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!570 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!571 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!572 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!573 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!574 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!575 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!576 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!577 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!578 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!579 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!580 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!581 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!582 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!583 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!584 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!585 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!586 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!587 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!588 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!589 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!590 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!591 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!592 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!609 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!610 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!611 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!613 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!614 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!615 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!616 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!617 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!618 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!619 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!620 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!621 = !DIEnumerator(name: "THOUSEP", value: 65537)
!622 = !DIEnumerator(name: "__GROUPING", value: 65538)
!623 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!624 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!625 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!626 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!627 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!628 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!629 = !DIEnumerator(name: "__YESSTR", value: 327682)
!630 = !DIEnumerator(name: "__NOSTR", value: 327683)
!631 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!632 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!633 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!634 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!635 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!636 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!637 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!638 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!640 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!641 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!642 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!643 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!644 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!645 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!646 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!650 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!651 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!652 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!653 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!654 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!655 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!656 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!657 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!658 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!659 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!660 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!661 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!662 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!663 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!664 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!665 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!666 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!667 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!684 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!685 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!686 = !{!52, !88, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!688 = !{!343}
!689 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !693)
!692 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = !{!38}
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221)
!695 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !698)
!697 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!698 = !{!54, !80, !82, !85}
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !701)
!700 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!701 = !{!687}
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !704)
!703 = !DIFile(filename: "./lib/memcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!704 = !{!89}
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221)
!706 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !709, retainedTypes: !714)
!708 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = !{!710}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 41, size: 32, elements: !712)
!711 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!712 = !{!713}
!713 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!714 = !{!52}
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !717, retainedTypes: !725)
!716 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!717 = !{!718}
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !719, file: !48, line: 192, size: 32, elements: !62)
!719 = distinct !DISubprogram(name: "x2nrealloc", scope: !48, file: !48, line: 180, type: !50, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !715, variables: !720)
!720 = !{!721, !722, !723, !724}
!721 = !DILocalVariable(name: "p", arg: 1, scope: !719, file: !48, line: 180, type: !52)
!722 = !DILocalVariable(name: "pn", arg: 2, scope: !719, file: !48, line: 180, type: !53)
!723 = !DILocalVariable(name: "s", arg: 3, scope: !719, file: !48, line: 180, type: !54)
!724 = !DILocalVariable(name: "n", scope: !719, file: !48, line: 182, type: !54)
!725 = !{!54, !88, !52}
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221)
!727 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !730)
!729 = !DIFile(filename: "./lib/xmemcoll.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = !{!24}
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !733, retainedTypes: !734)
!732 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!733 = !{!16, !64}
!734 = !{!89, !90, !88}
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !714)
!736 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221)
!738 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !714)
!740 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !714)
!742 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !745)
!744 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!745 = !{!54}
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221)
!747 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!748 = distinct !DICompileUnit(language: DW_LANG_C99, file: !749, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !221)
!749 = !DIFile(filename: "./lib/memcoll.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!750 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!751 = !{i32 2, !"Dwarf Version", i32 4}
!752 = !{i32 2, !"Debug Info Version", i32 3}
!753 = !{i32 1, !"PIC Level", i32 2}
!754 = !{i32 1, !"PIE Level", i32 2}
!755 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 186, type: !756, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !89}
!758 = !{!759}
!759 = !DILocalVariable(name: "status", arg: 1, scope: !755, file: !3, line: 186, type: !89)
!760 = !DIExpression()
!761 = !DILocation(line: 186, column: 12, scope: !755)
!762 = !DILocation(line: 188, column: 14, scope: !763)
!763 = distinct !DILexicalBlock(scope: !755, file: !3, line: 188, column: 7)
!764 = !DILocation(line: 188, column: 7, scope: !755)
!765 = !DILocation(line: 189, column: 5, scope: !766)
!766 = !DILexicalBlockFile(scope: !767, file: !3, discriminator: 1)
!767 = distinct !DILexicalBlock(scope: !763, file: !3, line: 189, column: 5)
!768 = !{!769, !769, i64 0}
!769 = !{!"any pointer", !770, i64 0}
!770 = !{!"omnipotent char", !771, i64 0}
!771 = !{!"Simple C/C++ TBAA"}
!772 = !DILocation(line: 189, column: 5, scope: !773)
!773 = !DILexicalBlockFile(scope: !767, file: !3, discriminator: 3)
!774 = !DILocation(line: 189, column: 5, scope: !775)
!775 = !DILexicalBlockFile(scope: !767, file: !3, discriminator: 2)
!776 = !DILocation(line: 192, column: 7, scope: !777)
!777 = distinct !DILexicalBlock(scope: !763, file: !3, line: 191, column: 5)
!778 = !DILocation(line: 192, column: 7, scope: !779)
!779 = !DILexicalBlockFile(scope: !777, file: !3, discriminator: 1)
!780 = !DILocation(line: 196, column: 7, scope: !777)
!781 = !DILocation(line: 196, column: 7, scope: !779)
!782 = !DILocation(line: 201, column: 7, scope: !777)
!783 = !DILocation(line: 201, column: 7, scope: !779)
!784 = !DILocation(line: 205, column: 7, scope: !777)
!785 = !DILocation(line: 205, column: 7, scope: !779)
!786 = !DILocation(line: 211, column: 7, scope: !777)
!787 = !DILocation(line: 211, column: 7, scope: !779)
!788 = !DILocation(line: 217, column: 7, scope: !777)
!789 = !DILocation(line: 217, column: 7, scope: !779)
!790 = !DILocation(line: 227, column: 7, scope: !777)
!791 = !DILocation(line: 227, column: 7, scope: !779)
!792 = !DILocation(line: 230, column: 7, scope: !777)
!793 = !DILocation(line: 230, column: 7, scope: !779)
!794 = !DILocation(line: 231, column: 7, scope: !777)
!795 = !DILocation(line: 231, column: 7, scope: !779)
!796 = !DILocation(line: 232, column: 7, scope: !777)
!797 = !DILocation(line: 232, column: 7, scope: !779)
!798 = !DILocation(line: 642, column: 15, scope: !121, inlinedAt: !799)
!799 = distinct !DILocation(line: 249, column: 7, scope: !777)
!800 = !DILocation(line: 651, column: 3, scope: !121, inlinedAt: !799)
!801 = !DILocation(line: 651, column: 3, scope: !802, inlinedAt: !799)
!802 = !DILexicalBlockFile(scope: !121, file: !122, discriminator: 1)
!803 = !DILocation(line: 655, column: 29, scope: !121, inlinedAt: !799)
!804 = !DILocation(line: 655, column: 15, scope: !121, inlinedAt: !799)
!805 = !DILocation(line: 656, column: 7, scope: !141, inlinedAt: !799)
!806 = !DILocation(line: 656, column: 19, scope: !141, inlinedAt: !799)
!807 = !DILocation(line: 656, column: 22, scope: !808, inlinedAt: !799)
!808 = !DILexicalBlockFile(scope: !141, file: !122, discriminator: 16)
!809 = !DILocation(line: 656, column: 7, scope: !810, inlinedAt: !799)
!810 = !DILexicalBlockFile(scope: !121, file: !122, discriminator: 16)
!811 = !DILocation(line: 662, column: 7, scope: !812, inlinedAt: !799)
!812 = distinct !DILexicalBlock(scope: !141, file: !122, line: 657, column: 5)
!813 = !DILocation(line: 662, column: 7, scope: !814, inlinedAt: !799)
!814 = !DILexicalBlockFile(scope: !812, file: !122, discriminator: 1)
!815 = !DILocation(line: 664, column: 5, scope: !812, inlinedAt: !799)
!816 = !DILocation(line: 665, column: 3, scope: !121, inlinedAt: !799)
!817 = !DILocation(line: 665, column: 3, scope: !802, inlinedAt: !799)
!818 = !DILocation(line: 667, column: 3, scope: !121, inlinedAt: !799)
!819 = !DILocation(line: 667, column: 3, scope: !802, inlinedAt: !799)
!820 = !DILocation(line: 251, column: 3, scope: !755)
!821 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1008, type: !822, isDefinition: true, scopeLine: 1009, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !825)
!822 = !DISubroutineType(types: !823)
!823 = !{!89, !89, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!825 = !{!826, !827, !828, !829, !830, !832, !833, !886, !887, !888, !889, !890, !894, !897, !898, !901, !904, !905, !907, !908, !910, !916, !917, !919, !920, !922, !923, !925, !926, !928, !929, !931}
!826 = !DILocalVariable(name: "argc", arg: 1, scope: !821, file: !3, line: 1008, type: !89)
!827 = !DILocalVariable(name: "argv", arg: 2, scope: !821, file: !3, line: 1008, type: !824)
!828 = !DILocalVariable(name: "optc_status", scope: !821, file: !3, line: 1010, type: !89)
!829 = !DILocalVariable(name: "prev_optc_status", scope: !821, file: !3, line: 1011, type: !89)
!830 = !DILocalVariable(name: "operand_status", scope: !821, file: !3, line: 1012, type: !831)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, elements: !95)
!832 = !DILocalVariable(name: "joption_count", scope: !821, file: !3, line: 1013, type: !831)
!833 = !DILocalVariable(name: "fp1", scope: !821, file: !3, line: 1014, type: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !836, line: 49, baseType: !837)
!836 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !838, line: 241, size: 1728, elements: !839)
!838 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !860, !861, !862, !863, !866, !867, !869, !871, !874, !876, !877, !878, !879, !880, !881, !882}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !837, file: !838, line: 242, baseType: !89, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !837, file: !838, line: 247, baseType: !88, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !837, file: !838, line: 248, baseType: !88, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !837, file: !838, line: 249, baseType: !88, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !837, file: !838, line: 250, baseType: !88, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !837, file: !838, line: 251, baseType: !88, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !837, file: !838, line: 252, baseType: !88, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !837, file: !838, line: 253, baseType: !88, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !837, file: !838, line: 254, baseType: !88, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !837, file: !838, line: 256, baseType: !88, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !837, file: !838, line: 257, baseType: !88, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !837, file: !838, line: 258, baseType: !88, size: 64, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !837, file: !838, line: 260, baseType: !853, size: 64, offset: 768)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !838, line: 156, size: 192, elements: !855)
!855 = !{!856, !857, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !854, file: !838, line: 157, baseType: !853, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !854, file: !838, line: 158, baseType: !858, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !854, file: !838, line: 162, baseType: !89, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !837, file: !838, line: 262, baseType: !858, size: 64, offset: 832)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !837, file: !838, line: 264, baseType: !89, size: 32, offset: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !837, file: !838, line: 268, baseType: !89, size: 32, offset: 928)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !837, file: !838, line: 270, baseType: !864, size: 64, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !216, line: 140, baseType: !865)
!865 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !837, file: !838, line: 274, baseType: !90, size: 16, offset: 1024)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !837, file: !838, line: 275, baseType: !868, size: 8, offset: 1040)
!868 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !837, file: !838, line: 276, baseType: !870, size: 8, offset: 1048)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, elements: !329)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !837, file: !838, line: 280, baseType: !872, size: 64, offset: 1088)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !838, line: 150, baseType: null)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !837, file: !838, line: 289, baseType: !875, size: 64, offset: 1152)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !216, line: 141, baseType: !865)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !837, file: !838, line: 297, baseType: !52, size: 64, offset: 1216)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !837, file: !838, line: 298, baseType: !52, size: 64, offset: 1280)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !837, file: !838, line: 299, baseType: !52, size: 64, offset: 1344)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !837, file: !838, line: 300, baseType: !52, size: 64, offset: 1408)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !837, file: !838, line: 302, baseType: !54, size: 64, offset: 1472)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !837, file: !838, line: 303, baseType: !89, size: 32, offset: 1536)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !837, file: !838, line: 305, baseType: !883, size: 160, offset: 1568)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 160, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 20)
!886 = !DILocalVariable(name: "fp2", scope: !821, file: !3, line: 1014, type: !834)
!887 = !DILocalVariable(name: "optc", scope: !821, file: !3, line: 1015, type: !89)
!888 = !DILocalVariable(name: "nfiles", scope: !821, file: !3, line: 1016, type: !89)
!889 = !DILocalVariable(name: "i", scope: !821, file: !3, line: 1017, type: !89)
!890 = !DILocalVariable(name: "val", scope: !891, file: !3, line: 1048, type: !56)
!891 = distinct !DILexicalBlock(scope: !892, file: !3, line: 1047, column: 11)
!892 = distinct !DILexicalBlock(scope: !893, file: !3, line: 1041, column: 9)
!893 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1037, column: 5)
!894 = !DILocalVariable(name: "__s1_len", scope: !895, file: !3, line: 1061, type: !54)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1061, column: 33)
!896 = distinct !DILexicalBlock(scope: !892, file: !3, line: 1061, column: 15)
!897 = !DILocalVariable(name: "__s2_len", scope: !895, file: !3, line: 1061, type: !54)
!898 = !DILocalVariable(name: "is_j2", scope: !899, file: !3, line: 1084, type: !99)
!899 = distinct !DILexicalBlock(scope: !900, file: !3, line: 1082, column: 13)
!900 = distinct !DILexicalBlock(scope: !892, file: !3, line: 1080, column: 15)
!901 = !DILocalVariable(name: "__s1_len", scope: !902, file: !3, line: 1096, type: !54)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1096, column: 15)
!903 = distinct !DILexicalBlock(scope: !892, file: !3, line: 1096, column: 15)
!904 = !DILocalVariable(name: "__s2_len", scope: !902, file: !3, line: 1096, type: !54)
!905 = !DILocalVariable(name: "__s2", scope: !906, file: !3, line: 1096, type: !82)
!906 = distinct !DILexicalBlock(scope: !902, file: !3, line: 1096, column: 15)
!907 = !DILocalVariable(name: "__result", scope: !906, file: !3, line: 1096, type: !89)
!908 = !DILocalVariable(name: "newtab", scope: !909, file: !3, line: 1107, type: !84)
!909 = distinct !DILexicalBlock(scope: !892, file: !3, line: 1106, column: 11)
!910 = !DILocalVariable(name: "__s1_len", scope: !911, file: !3, line: 1112, type: !54)
!911 = distinct !DILexicalBlock(scope: !912, file: !3, line: 1112, column: 21)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 1112, column: 21)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 1111, column: 15)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 1110, column: 22)
!915 = distinct !DILexicalBlock(scope: !909, file: !3, line: 1108, column: 17)
!916 = !DILocalVariable(name: "__s2_len", scope: !911, file: !3, line: 1112, type: !54)
!917 = !DILocalVariable(name: "__s2", scope: !918, file: !3, line: 1112, type: !82)
!918 = distinct !DILexicalBlock(scope: !911, file: !3, line: 1112, column: 21)
!919 = !DILocalVariable(name: "__result", scope: !918, file: !3, line: 1112, type: !89)
!920 = !DILocalVariable(name: "__s1_len", scope: !921, file: !3, line: 1185, type: !54)
!921 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1185, column: 9)
!922 = !DILocalVariable(name: "__s2_len", scope: !921, file: !3, line: 1185, type: !54)
!923 = !DILocalVariable(name: "__s2", scope: !924, file: !3, line: 1185, type: !82)
!924 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1185, column: 9)
!925 = !DILocalVariable(name: "__result", scope: !924, file: !3, line: 1185, type: !89)
!926 = !DILocalVariable(name: "__s1_len", scope: !927, file: !3, line: 1188, type: !54)
!927 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1188, column: 9)
!928 = !DILocalVariable(name: "__s2_len", scope: !927, file: !3, line: 1188, type: !54)
!929 = !DILocalVariable(name: "__s2", scope: !930, file: !3, line: 1188, type: !82)
!930 = distinct !DILexicalBlock(scope: !927, file: !3, line: 1188, column: 9)
!931 = !DILocalVariable(name: "__result", scope: !930, file: !3, line: 1188, type: !89)
!932 = !DILocation(line: 1008, column: 11, scope: !821)
!933 = !DILocation(line: 1008, column: 24, scope: !821)
!934 = !DILocation(line: 1010, column: 3, scope: !821)
!935 = !DILocation(line: 1011, column: 3, scope: !821)
!936 = !DILocation(line: 1011, column: 7, scope: !821)
!937 = !{!938, !938, i64 0}
!938 = !{!"int", !770, i64 0}
!939 = !DILocation(line: 1012, column: 3, scope: !821)
!940 = !DILocation(line: 1012, column: 7, scope: !821)
!941 = !DILocation(line: 1013, column: 3, scope: !821)
!942 = !DILocation(line: 1013, column: 7, scope: !821)
!943 = !DILocation(line: 1016, column: 3, scope: !821)
!944 = !DILocation(line: 1016, column: 7, scope: !821)
!945 = !DILocation(line: 1020, column: 21, scope: !821)
!946 = !DILocation(line: 1020, column: 3, scope: !821)
!947 = !DILocation(line: 1021, column: 3, scope: !821)
!948 = !DILocation(line: 1022, column: 3, scope: !821)
!949 = !DILocation(line: 1023, column: 3, scope: !821)
!950 = !DILocation(line: 1024, column: 21, scope: !821)
!951 = !DILocation(line: 1024, column: 19, scope: !821)
!952 = !{!953, !953, i64 0}
!953 = !{!"_Bool", !770, i64 0}
!954 = !DILocation(line: 1026, column: 3, scope: !821)
!955 = !DILocation(line: 1027, column: 3, scope: !821)
!956 = !DILocation(line: 1031, column: 59, scope: !821)
!957 = !DILocation(line: 1031, column: 30, scope: !821)
!958 = !DILocation(line: 1032, column: 21, scope: !821)
!959 = !{!770, !770, i64 0}
!960 = !DILocation(line: 1034, column: 18, scope: !961)
!961 = !DILexicalBlockFile(scope: !821, file: !3, discriminator: 1)
!962 = !DILocation(line: 1015, column: 7, scope: !821)
!963 = !DILocation(line: 1036, column: 10, scope: !821)
!964 = !DILocation(line: 1034, column: 3, scope: !961)
!965 = !DILocation(line: 1010, column: 7, scope: !821)
!966 = !DILocation(line: 1038, column: 19, scope: !893)
!967 = !DILocation(line: 1040, column: 7, scope: !893)
!968 = !DILocation(line: 1043, column: 13, scope: !892)
!969 = !DILocation(line: 1048, column: 13, scope: !891)
!970 = !DILocation(line: 1049, column: 27, scope: !971)
!971 = distinct !DILexicalBlock(scope: !891, file: !3, line: 1049, column: 17)
!972 = !DIExpression(DW_OP_deref)
!973 = !DILocation(line: 1048, column: 31, scope: !891)
!974 = !DILocation(line: 1049, column: 17, scope: !971)
!975 = !DILocation(line: 1049, column: 55, scope: !971)
!976 = !DILocation(line: 1050, column: 17, scope: !971)
!977 = !DILocation(line: 1050, column: 21, scope: !978)
!978 = !DILexicalBlockFile(scope: !971, file: !3, discriminator: 1)
!979 = !{!980, !980, i64 0}
!980 = !{!"long", !770, i64 0}
!981 = !DILocation(line: 1050, column: 30, scope: !978)
!982 = !DILocation(line: 1051, column: 15, scope: !971)
!983 = !DILocation(line: 1051, column: 15, scope: !978)
!984 = !DILocation(line: 1051, column: 15, scope: !985)
!985 = !DILexicalBlockFile(scope: !971, file: !3, discriminator: 2)
!986 = !DILocation(line: 1053, column: 21, scope: !987)
!987 = distinct !DILexicalBlock(scope: !891, file: !3, line: 1053, column: 17)
!988 = !DILocation(line: 1053, column: 17, scope: !891)
!989 = !DILocation(line: 1057, column: 11, scope: !892)
!990 = !DILocation(line: 1058, column: 11, scope: !892)
!991 = !DILocation(line: 1061, column: 15, scope: !896)
!992 = !DILocation(line: 1061, column: 28, scope: !896)
!993 = !DILocation(line: 1061, column: 33, scope: !994)
!994 = !DILexicalBlockFile(scope: !895, file: !3, discriminator: 1)
!995 = !DILocation(line: 1061, column: 33, scope: !996)
!996 = !DILexicalBlockFile(scope: !896, file: !3, discriminator: 1)
!997 = !DILocation(line: 1061, column: 15, scope: !998)
!998 = !DILexicalBlockFile(scope: !892, file: !3, discriminator: 1)
!999 = !DILocation(line: 1062, column: 13, scope: !896)
!1000 = !DILocation(line: 1062, column: 13, scope: !996)
!1001 = !DILocation(line: 1064, column: 26, scope: !892)
!1002 = !DILocation(line: 1064, column: 24, scope: !892)
!1003 = !DILocation(line: 1065, column: 11, scope: !892)
!1004 = !DILocation(line: 1069, column: 11, scope: !892)
!1005 = !DILocation(line: 1072, column: 64, scope: !892)
!1006 = !DILocalVariable(name: "str", arg: 1, scope: !1007, file: !3, line: 844, type: !85)
!1007 = distinct !DISubprogram(name: "string_to_join_field", scope: !3, file: !3, line: 844, type: !1008, isLocal: true, isDefinition: true, scopeLine: 845, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1010)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!54, !85}
!1010 = !{!1006, !1011, !1012, !1013}
!1011 = !DILocalVariable(name: "result", scope: !1007, file: !3, line: 846, type: !54)
!1012 = !DILocalVariable(name: "val", scope: !1007, file: !3, line: 847, type: !56)
!1013 = !DILocalVariable(name: "s_err", scope: !1007, file: !3, line: 850, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !17, line: 39, baseType: !16)
!1015 = !DILocation(line: 844, column: 35, scope: !1007, inlinedAt: !1016)
!1016 = distinct !DILocation(line: 1072, column: 42, scope: !892)
!1017 = !DILocation(line: 847, column: 3, scope: !1007, inlinedAt: !1016)
!1018 = !DILocation(line: 847, column: 21, scope: !1007, inlinedAt: !1016)
!1019 = !DILocation(line: 850, column: 24, scope: !1007, inlinedAt: !1016)
!1020 = !DILocation(line: 850, column: 16, scope: !1007, inlinedAt: !1016)
!1021 = !DILocation(line: 851, column: 13, scope: !1022, inlinedAt: !1016)
!1022 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 851, column: 7)
!1023 = !DILocation(line: 851, column: 33, scope: !1022, inlinedAt: !1016)
!1024 = !DILocation(line: 852, column: 9, scope: !1022, inlinedAt: !1016)
!1025 = !DILocation(line: 852, column: 5, scope: !1022, inlinedAt: !1016)
!1026 = !DILocation(line: 851, column: 71, scope: !1027, inlinedAt: !1016)
!1027 = !DILexicalBlockFile(scope: !1022, file: !3, discriminator: 2)
!1028 = !DILocation(line: 853, column: 18, scope: !1029, inlinedAt: !1016)
!1029 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 853, column: 12)
!1030 = !DILocation(line: 853, column: 39, scope: !1031, inlinedAt: !1016)
!1031 = !DILexicalBlockFile(scope: !1029, file: !3, discriminator: 1)
!1032 = !DILocation(line: 853, column: 32, scope: !1029, inlinedAt: !1016)
!1033 = !DILocation(line: 854, column: 5, scope: !1029, inlinedAt: !1016)
!1034 = !DILocation(line: 854, column: 5, scope: !1031, inlinedAt: !1016)
!1035 = !DILocation(line: 854, column: 5, scope: !1036, inlinedAt: !1016)
!1036 = !DILexicalBlockFile(scope: !1029, file: !3, discriminator: 2)
!1037 = !DILocation(line: 856, column: 12, scope: !1007, inlinedAt: !1016)
!1038 = !DILocation(line: 856, column: 16, scope: !1007, inlinedAt: !1016)
!1039 = !DILocation(line: 846, column: 10, scope: !1007, inlinedAt: !1016)
!1040 = !DILocation(line: 859, column: 1, scope: !1007, inlinedAt: !1016)
!1041 = !DILocalVariable(name: "var", arg: 1, scope: !1042, file: !3, line: 928, type: !53)
!1042 = distinct !DISubprogram(name: "set_join_field", scope: !3, file: !3, line: 928, type: !1043, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1045)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !53, !54}
!1045 = !{!1041, !1046, !1047, !1050}
!1046 = !DILocalVariable(name: "val", arg: 2, scope: !1042, file: !3, line: 928, type: !54)
!1047 = !DILocalVariable(name: "var1", scope: !1048, file: !3, line: 932, type: !56)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 931, column: 5)
!1049 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 930, column: 7)
!1050 = !DILocalVariable(name: "val1", scope: !1048, file: !3, line: 933, type: !56)
!1051 = !DILocation(line: 928, column: 25, scope: !1042, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 1072, column: 11, scope: !998)
!1053 = !DILocation(line: 928, column: 37, scope: !1042, inlinedAt: !1052)
!1054 = !DILocation(line: 930, column: 7, scope: !1049, inlinedAt: !1052)
!1055 = !DILocation(line: 930, column: 12, scope: !1049, inlinedAt: !1052)
!1056 = !DILocation(line: 930, column: 32, scope: !1057, inlinedAt: !1052)
!1057 = !DILexicalBlockFile(scope: !1049, file: !3, discriminator: 1)
!1058 = !DILocation(line: 930, column: 24, scope: !1049, inlinedAt: !1052)
!1059 = !DILocation(line: 932, column: 37, scope: !1048, inlinedAt: !1052)
!1060 = !DILocation(line: 932, column: 25, scope: !1048, inlinedAt: !1052)
!1061 = !DILocation(line: 933, column: 25, scope: !1048, inlinedAt: !1052)
!1062 = !DILocation(line: 934, column: 7, scope: !1048, inlinedAt: !1052)
!1063 = !DILocation(line: 934, column: 7, scope: !1064, inlinedAt: !1052)
!1064 = !DILexicalBlockFile(scope: !1048, file: !3, discriminator: 1)
!1065 = !DILocation(line: 937, column: 8, scope: !1042, inlinedAt: !1052)
!1066 = !DILocation(line: 1073, column: 11, scope: !892)
!1067 = !DILocation(line: 1076, column: 64, scope: !892)
!1068 = !DILocation(line: 844, column: 35, scope: !1007, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 1076, column: 42, scope: !892)
!1070 = !DILocation(line: 847, column: 3, scope: !1007, inlinedAt: !1069)
!1071 = !DILocation(line: 847, column: 21, scope: !1007, inlinedAt: !1069)
!1072 = !DILocation(line: 850, column: 24, scope: !1007, inlinedAt: !1069)
!1073 = !DILocation(line: 850, column: 16, scope: !1007, inlinedAt: !1069)
!1074 = !DILocation(line: 851, column: 13, scope: !1022, inlinedAt: !1069)
!1075 = !DILocation(line: 851, column: 33, scope: !1022, inlinedAt: !1069)
!1076 = !DILocation(line: 852, column: 9, scope: !1022, inlinedAt: !1069)
!1077 = !DILocation(line: 852, column: 5, scope: !1022, inlinedAt: !1069)
!1078 = !DILocation(line: 851, column: 71, scope: !1027, inlinedAt: !1069)
!1079 = !DILocation(line: 853, column: 18, scope: !1029, inlinedAt: !1069)
!1080 = !DILocation(line: 853, column: 39, scope: !1031, inlinedAt: !1069)
!1081 = !DILocation(line: 853, column: 32, scope: !1029, inlinedAt: !1069)
!1082 = !DILocation(line: 854, column: 5, scope: !1029, inlinedAt: !1069)
!1083 = !DILocation(line: 854, column: 5, scope: !1031, inlinedAt: !1069)
!1084 = !DILocation(line: 854, column: 5, scope: !1036, inlinedAt: !1069)
!1085 = !DILocation(line: 856, column: 12, scope: !1007, inlinedAt: !1069)
!1086 = !DILocation(line: 856, column: 16, scope: !1007, inlinedAt: !1069)
!1087 = !DILocation(line: 846, column: 10, scope: !1007, inlinedAt: !1069)
!1088 = !DILocation(line: 859, column: 1, scope: !1007, inlinedAt: !1069)
!1089 = !DILocation(line: 928, column: 25, scope: !1042, inlinedAt: !1090)
!1090 = distinct !DILocation(line: 1076, column: 11, scope: !998)
!1091 = !DILocation(line: 928, column: 37, scope: !1042, inlinedAt: !1090)
!1092 = !DILocation(line: 930, column: 7, scope: !1049, inlinedAt: !1090)
!1093 = !DILocation(line: 930, column: 12, scope: !1049, inlinedAt: !1090)
!1094 = !DILocation(line: 930, column: 32, scope: !1057, inlinedAt: !1090)
!1095 = !DILocation(line: 930, column: 24, scope: !1049, inlinedAt: !1090)
!1096 = !DILocation(line: 932, column: 37, scope: !1048, inlinedAt: !1090)
!1097 = !DILocation(line: 932, column: 25, scope: !1048, inlinedAt: !1090)
!1098 = !DILocation(line: 933, column: 25, scope: !1048, inlinedAt: !1090)
!1099 = !DILocation(line: 934, column: 7, scope: !1048, inlinedAt: !1090)
!1100 = !DILocation(line: 934, column: 7, scope: !1064, inlinedAt: !1090)
!1101 = !DILocation(line: 937, column: 8, scope: !1042, inlinedAt: !1090)
!1102 = !DILocation(line: 1077, column: 11, scope: !892)
!1103 = !DILocation(line: 1080, column: 16, scope: !900)
!1104 = !DILocation(line: 1080, column: 33, scope: !900)
!1105 = !DILocation(line: 1080, column: 58, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !900, file: !3, discriminator: 2)
!1107 = !DILocation(line: 1081, column: 15, scope: !900)
!1108 = !DILocation(line: 1081, column: 33, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !900, file: !3, discriminator: 1)
!1110 = !DILocation(line: 1081, column: 40, scope: !1109)
!1111 = !DILocation(line: 1081, column: 28, scope: !1109)
!1112 = !DILocation(line: 1081, column: 45, scope: !1109)
!1113 = !DILocation(line: 1081, column: 25, scope: !1109)
!1114 = !DILocation(line: 1080, column: 15, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !892, file: !3, discriminator: 3)
!1116 = !DILocation(line: 1084, column: 39, scope: !899)
!1117 = !DILocation(line: 1085, column: 15, scope: !899)
!1118 = !DILocation(line: 1085, column: 35, scope: !899)
!1119 = !DILocation(line: 1086, column: 45, scope: !899)
!1120 = !DILocation(line: 1086, column: 27, scope: !899)
!1121 = !DILocation(line: 1087, column: 13, scope: !899)
!1122 = !DILocation(line: 844, column: 35, scope: !1007, inlinedAt: !1123)
!1123 = distinct !DILocation(line: 1090, column: 46, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !900, file: !3, line: 1089, column: 13)
!1125 = !DILocation(line: 847, column: 3, scope: !1007, inlinedAt: !1123)
!1126 = !DILocation(line: 847, column: 21, scope: !1007, inlinedAt: !1123)
!1127 = !DILocation(line: 850, column: 24, scope: !1007, inlinedAt: !1123)
!1128 = !DILocation(line: 850, column: 16, scope: !1007, inlinedAt: !1123)
!1129 = !DILocation(line: 851, column: 13, scope: !1022, inlinedAt: !1123)
!1130 = !DILocation(line: 851, column: 33, scope: !1022, inlinedAt: !1123)
!1131 = !DILocation(line: 852, column: 9, scope: !1022, inlinedAt: !1123)
!1132 = !DILocation(line: 852, column: 5, scope: !1022, inlinedAt: !1123)
!1133 = !DILocation(line: 851, column: 71, scope: !1027, inlinedAt: !1123)
!1134 = !DILocation(line: 853, column: 18, scope: !1029, inlinedAt: !1123)
!1135 = !DILocation(line: 853, column: 39, scope: !1031, inlinedAt: !1123)
!1136 = !DILocation(line: 853, column: 32, scope: !1029, inlinedAt: !1123)
!1137 = !DILocation(line: 854, column: 5, scope: !1029, inlinedAt: !1123)
!1138 = !DILocation(line: 854, column: 5, scope: !1031, inlinedAt: !1123)
!1139 = !DILocation(line: 854, column: 5, scope: !1036, inlinedAt: !1123)
!1140 = !DILocation(line: 856, column: 12, scope: !1007, inlinedAt: !1123)
!1141 = !DILocation(line: 856, column: 16, scope: !1007, inlinedAt: !1123)
!1142 = !DILocation(line: 846, column: 10, scope: !1007, inlinedAt: !1123)
!1143 = !DILocation(line: 859, column: 1, scope: !1007, inlinedAt: !1123)
!1144 = !DILocation(line: 928, column: 25, scope: !1042, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 1090, column: 15, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1124, file: !3, discriminator: 1)
!1147 = !DILocation(line: 928, column: 37, scope: !1042, inlinedAt: !1145)
!1148 = !DILocation(line: 930, column: 7, scope: !1049, inlinedAt: !1145)
!1149 = !DILocation(line: 930, column: 12, scope: !1049, inlinedAt: !1145)
!1150 = !DILocation(line: 930, column: 32, scope: !1057, inlinedAt: !1145)
!1151 = !DILocation(line: 930, column: 24, scope: !1049, inlinedAt: !1145)
!1152 = !DILocation(line: 932, column: 37, scope: !1048, inlinedAt: !1145)
!1153 = !DILocation(line: 932, column: 25, scope: !1048, inlinedAt: !1145)
!1154 = !DILocation(line: 933, column: 25, scope: !1048, inlinedAt: !1145)
!1155 = !DILocation(line: 934, column: 7, scope: !1048, inlinedAt: !1145)
!1156 = !DILocation(line: 934, column: 7, scope: !1064, inlinedAt: !1145)
!1157 = !DILocation(line: 937, column: 8, scope: !1042, inlinedAt: !1145)
!1158 = !DILocation(line: 928, column: 25, scope: !1042, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 1091, column: 15, scope: !1124)
!1160 = !DILocation(line: 928, column: 37, scope: !1042, inlinedAt: !1159)
!1161 = !DILocation(line: 930, column: 7, scope: !1049, inlinedAt: !1159)
!1162 = !DILocation(line: 930, column: 12, scope: !1049, inlinedAt: !1159)
!1163 = !DILocation(line: 930, column: 32, scope: !1057, inlinedAt: !1159)
!1164 = !DILocation(line: 930, column: 24, scope: !1049, inlinedAt: !1159)
!1165 = !DILocation(line: 932, column: 37, scope: !1048, inlinedAt: !1159)
!1166 = !DILocation(line: 932, column: 25, scope: !1048, inlinedAt: !1159)
!1167 = !DILocation(line: 933, column: 25, scope: !1048, inlinedAt: !1159)
!1168 = !DILocation(line: 934, column: 7, scope: !1048, inlinedAt: !1159)
!1169 = !DILocation(line: 934, column: 7, scope: !1064, inlinedAt: !1159)
!1170 = !DILocation(line: 937, column: 8, scope: !1042, inlinedAt: !1159)
!1171 = !DILocation(line: 1096, column: 15, scope: !902)
!1172 = !DILocation(line: 1096, column: 15, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !902, file: !3, discriminator: 12)
!1174 = !DILocation(line: 1096, column: 15, scope: !1175)
!1175 = !DILexicalBlockFile(scope: !903, file: !3, discriminator: 13)
!1176 = !DILocation(line: 1096, column: 15, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !892, file: !3, discriminator: 13)
!1178 = !DILocation(line: 1097, column: 13, scope: !903)
!1179 = !DILocation(line: 1100, column: 15, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1099, column: 13)
!1181 = !DILocation(line: 1101, column: 27, scope: !1180)
!1182 = !DILocation(line: 1107, column: 36, scope: !909)
!1183 = !DILocation(line: 1107, column: 27, scope: !909)
!1184 = !DILocation(line: 1108, column: 19, scope: !915)
!1185 = !DILocation(line: 1108, column: 17, scope: !909)
!1186 = !DILocation(line: 1110, column: 22, scope: !914)
!1187 = !DILocation(line: 1110, column: 22, scope: !915)
!1188 = !DILocation(line: 1112, column: 21, scope: !911)
!1189 = !DILocation(line: 1112, column: 21, scope: !918)
!1190 = !DILocation(line: 1112, column: 21, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1192, file: !3, discriminator: 3)
!1192 = distinct !DILexicalBlock(scope: !918, file: !3, line: 1112, column: 21)
!1193 = !DILocation(line: 1112, column: 21, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1195, file: !3, discriminator: 5)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 1112, column: 21)
!1196 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 1112, column: 21)
!1197 = !DILocation(line: 1112, column: 21, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1192, file: !3, discriminator: 2)
!1199 = !DILocation(line: 1112, column: 21, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1201, file: !3, discriminator: 6)
!1201 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 1112, column: 21)
!1202 = !DILocation(line: 1112, column: 21, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !912, file: !3, discriminator: 13)
!1204 = !DILocation(line: 1112, column: 21, scope: !1205)
!1205 = !DILexicalBlockFile(scope: !913, file: !3, discriminator: 13)
!1206 = !DILocation(line: 1115, column: 19, scope: !912)
!1207 = !DILocation(line: 1115, column: 19, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !912, file: !3, discriminator: 1)
!1209 = !DILocation(line: 1115, column: 19, scope: !1210)
!1210 = !DILexicalBlockFile(scope: !912, file: !3, discriminator: 2)
!1211 = !DILocation(line: 1118, column: 22, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !909, file: !3, line: 1118, column: 17)
!1213 = !DILocation(line: 1118, column: 19, scope: !1212)
!1214 = !DILocation(line: 1118, column: 36, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1212, file: !3, discriminator: 1)
!1216 = !DILocation(line: 1118, column: 33, scope: !1215)
!1217 = !DILocation(line: 1118, column: 26, scope: !1212)
!1218 = !DILocation(line: 1119, column: 15, scope: !1212)
!1219 = !DILocation(line: 1119, column: 15, scope: !1215)
!1220 = !DILocation(line: 1120, column: 17, scope: !909)
!1221 = !DILocation(line: 1122, column: 11, scope: !892)
!1222 = !DILocation(line: 1126, column: 11, scope: !892)
!1223 = !DILocation(line: 1129, column: 29, scope: !892)
!1224 = !DILocation(line: 1130, column: 11, scope: !892)
!1225 = !DILocation(line: 1133, column: 29, scope: !892)
!1226 = !DILocation(line: 1134, column: 11, scope: !892)
!1227 = !DILocation(line: 1137, column: 26, scope: !892)
!1228 = !DILocation(line: 1137, column: 11, scope: !892)
!1229 = !DILocation(line: 1139, column: 11, scope: !892)
!1230 = !DILocation(line: 1143, column: 11, scope: !892)
!1231 = !DILocation(line: 1145, column: 9, scope: !892)
!1232 = !DILocation(line: 1147, column: 9, scope: !892)
!1233 = !DILocation(line: 1147, column: 9, scope: !998)
!1234 = !DILocation(line: 1150, column: 11, scope: !892)
!1235 = !DILocation(line: 1153, column: 26, scope: !893)
!1236 = !DILocation(line: 1153, column: 24, scope: !893)
!1237 = distinct !{!1237, !1238, !1239}
!1238 = !DILocation(line: 1034, column: 3, scope: !821)
!1239 = !DILocation(line: 1154, column: 5, scope: !821)
!1240 = !DILocation(line: 1157, column: 20, scope: !821)
!1241 = !DILocation(line: 1158, column: 10, scope: !961)
!1242 = !DILocation(line: 1158, column: 17, scope: !961)
!1243 = !DILocation(line: 1158, column: 3, scope: !961)
!1244 = !DILocation(line: 1159, column: 31, scope: !821)
!1245 = !DILocation(line: 1159, column: 20, scope: !821)
!1246 = !DILocation(line: 1159, column: 5, scope: !821)
!1247 = distinct !{!1247, !1248, !1249}
!1248 = !DILocation(line: 1158, column: 3, scope: !821)
!1249 = !DILocation(line: 1160, column: 60, scope: !821)
!1250 = !DILocation(line: 1162, column: 7, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1162, column: 7)
!1252 = !DILocation(line: 1162, column: 7, scope: !821)
!1253 = !DILocation(line: 1174, column: 9, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 1174, column: 9)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 1173, column: 3)
!1256 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1173, column: 3)
!1257 = !DILocation(line: 1174, column: 26, scope: !1254)
!1258 = !DILocation(line: 1174, column: 9, scope: !1255)
!1259 = !DILocation(line: 1165, column: 22, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 1164, column: 11)
!1261 = distinct !DILexicalBlock(scope: !1251, file: !3, line: 1163, column: 5)
!1262 = !DILocation(line: 1165, column: 9, scope: !1263)
!1263 = !DILexicalBlockFile(scope: !1260, file: !3, discriminator: 1)
!1264 = !DILocation(line: 1165, column: 9, scope: !1260)
!1265 = !DILocation(line: 1167, column: 22, scope: !1260)
!1266 = !DILocation(line: 1167, column: 70, scope: !1260)
!1267 = !DILocation(line: 1167, column: 60, scope: !1260)
!1268 = !DILocation(line: 1167, column: 53, scope: !1263)
!1269 = !DILocation(line: 1167, column: 9, scope: !1270)
!1270 = !DILexicalBlockFile(scope: !1260, file: !3, discriminator: 2)
!1271 = !DILocation(line: 1168, column: 7, scope: !1261)
!1272 = !DILocation(line: 928, column: 25, scope: !1042, inlinedAt: !1273)
!1273 = distinct !DILocation(line: 1176, column: 9, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1254, file: !3, line: 1175, column: 7)
!1275 = !DILocation(line: 928, column: 37, scope: !1042, inlinedAt: !1273)
!1276 = !DILocation(line: 930, column: 7, scope: !1049, inlinedAt: !1273)
!1277 = !DILocation(line: 930, column: 24, scope: !1049, inlinedAt: !1273)
!1278 = !DILocation(line: 932, column: 37, scope: !1048, inlinedAt: !1273)
!1279 = !DILocation(line: 932, column: 25, scope: !1048, inlinedAt: !1273)
!1280 = !DILocation(line: 933, column: 25, scope: !1048, inlinedAt: !1273)
!1281 = !DILocation(line: 934, column: 7, scope: !1048, inlinedAt: !1273)
!1282 = !DILocation(line: 934, column: 7, scope: !1064, inlinedAt: !1273)
!1283 = !DILocation(line: 937, column: 8, scope: !1042, inlinedAt: !1273)
!1284 = !DILocation(line: 928, column: 25, scope: !1042, inlinedAt: !1285)
!1285 = distinct !DILocation(line: 1177, column: 9, scope: !1274)
!1286 = !DILocation(line: 928, column: 37, scope: !1042, inlinedAt: !1285)
!1287 = !DILocation(line: 930, column: 7, scope: !1049, inlinedAt: !1285)
!1288 = !DILocation(line: 930, column: 24, scope: !1049, inlinedAt: !1285)
!1289 = !DILocation(line: 932, column: 37, scope: !1048, inlinedAt: !1285)
!1290 = !DILocation(line: 932, column: 25, scope: !1048, inlinedAt: !1285)
!1291 = !DILocation(line: 933, column: 25, scope: !1048, inlinedAt: !1285)
!1292 = !DILocation(line: 934, column: 7, scope: !1048, inlinedAt: !1285)
!1293 = !DILocation(line: 934, column: 7, scope: !1064, inlinedAt: !1285)
!1294 = !DILocation(line: 937, column: 8, scope: !1042, inlinedAt: !1285)
!1295 = !DILocation(line: 1178, column: 7, scope: !1274)
!1296 = !DILocation(line: 1181, column: 18, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1180, column: 7)
!1298 = !DILocation(line: 1181, column: 5, scope: !1297)
!1299 = !DILocation(line: 1182, column: 7, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1182, column: 7)
!1301 = !DILocation(line: 1182, column: 20, scope: !1300)
!1302 = !DILocation(line: 1182, column: 7, scope: !821)
!1303 = !DILocation(line: 1185, column: 9, scope: !921)
!1304 = !DILocation(line: 1185, column: 9, scope: !1305)
!1305 = !DILexicalBlockFile(scope: !924, file: !3, discriminator: 2)
!1306 = !DILocation(line: 1185, column: 9, scope: !924)
!1307 = !DILocation(line: 1185, column: 9, scope: !1308)
!1308 = !DILexicalBlockFile(scope: !1309, file: !3, discriminator: 3)
!1309 = distinct !DILexicalBlock(scope: !924, file: !3, line: 1185, column: 9)
!1310 = !DILocation(line: 1185, column: 9, scope: !1311)
!1311 = !DILexicalBlockFile(scope: !1309, file: !3, discriminator: 2)
!1312 = !DILocation(line: 1185, column: 9, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1314, file: !3, discriminator: 4)
!1314 = distinct !DILexicalBlock(scope: !1309, file: !3, line: 1185, column: 9)
!1315 = !DILocation(line: 1185, column: 9, scope: !1316)
!1316 = !DILexicalBlockFile(scope: !921, file: !3, discriminator: 11)
!1317 = !DILocation(line: 1185, column: 9, scope: !1318)
!1318 = !DILexicalBlockFile(scope: !821, file: !3, discriminator: 13)
!1319 = !DILocation(line: 1185, column: 35, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !821, file: !3, discriminator: 14)
!1321 = !DILocation(line: 1185, column: 9, scope: !1320)
!1322 = !DILocation(line: 1185, column: 43, scope: !1323)
!1323 = !DILexicalBlockFile(scope: !821, file: !3, discriminator: 15)
!1324 = !DILocation(line: 1185, column: 9, scope: !1323)
!1325 = !DILocation(line: 1185, column: 9, scope: !1326)
!1326 = !DILexicalBlockFile(scope: !821, file: !3, discriminator: 16)
!1327 = !DILocation(line: 1014, column: 9, scope: !821)
!1328 = !DILocation(line: 1186, column: 8, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1186, column: 7)
!1330 = !DILocation(line: 1186, column: 7, scope: !821)
!1331 = !DILocation(line: 1187, column: 5, scope: !1329)
!1332 = !DILocation(line: 1187, column: 5, scope: !1333)
!1333 = !DILexicalBlockFile(scope: !1329, file: !3, discriminator: 1)
!1334 = !DILocation(line: 1187, column: 5, scope: !1335)
!1335 = !DILexicalBlockFile(scope: !1329, file: !3, discriminator: 2)
!1336 = !DILocation(line: 1188, column: 9, scope: !927)
