!llvm.dbg.cu = !{!2, !594, !597, !104, !110, !119, !599, !617, !126, !133, !628, !641, !202, !649, !666, !668, !670, !672, !674, !676, !211, !679, !692, !697, !699, !701, !703, !705, !563}
!llvm.ident = !{!707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707, !707}
!llvm.module.flags = !{!708, !709, !710, !711}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !92, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !61)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !20, line: 39, size: 32, elements: !35)
!20 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !21, file: !20, line: 66, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !21, file: !20, line: 74, baseType: !25, size: 32, offset: 32)
!25 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !20, line: 69, size: 32, elements: !26)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !25, file: !20, line: 71, baseType: !28, size: 32)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !25, file: !20, line: 72, baseType: !28, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !25, file: !20, line: 73, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !32, line: 98, baseType: !33)
!32 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !34, line: 142, baseType: !28)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!37 = !DIEnumerator(name: "FD_STATE", value: 1)
!38 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!39 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!40 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!41 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!42 = !{!43, !45, !46, !49, !51, !54, !56, !59}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 62, baseType: !48)
!47 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !32, line: 80, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !34, line: 134, baseType: !58)
!58 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !32, line: 65, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !34, line: 135, baseType: !58)
!61 = !{!62, !0}
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "infomap", scope: !64, file: !65, line: 632, type: !89, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !65, file: !65, line: 630, type: !66, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !68)
!65 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !54}
!68 = !{!69, !70, !71, !78, !80, !81, !82, !85, !86, !88}
!69 = !DILocalVariable(name: "program", arg: 1, scope: !64, file: !65, line: 630, type: !54)
!70 = !DILocalVariable(name: "node", scope: !64, file: !65, line: 642, type: !54)
!71 = !DILocalVariable(name: "map_prog", scope: !64, file: !65, line: 643, type: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !64, file: !65, line: 632, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !74, file: !65, line: 632, baseType: !54, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !74, file: !65, line: 632, baseType: !54, size: 64, offset: 64)
!78 = !DILocalVariable(name: "__s1_len", scope: !79, file: !65, line: 645, type: !46)
!79 = distinct !DILexicalBlock(scope: !64, file: !65, line: 645, column: 33)
!80 = !DILocalVariable(name: "__s2_len", scope: !79, file: !65, line: 645, type: !46)
!81 = !DILocalVariable(name: "lc_messages", scope: !64, file: !65, line: 655, type: !54)
!82 = !DILocalVariable(name: "__s1_len", scope: !83, file: !65, line: 656, type: !46)
!83 = distinct !DILexicalBlock(scope: !84, file: !65, line: 656, column: 22)
!84 = distinct !DILexicalBlock(scope: !64, file: !65, line: 656, column: 7)
!85 = !DILocalVariable(name: "__s2_len", scope: !83, file: !65, line: 656, type: !46)
!86 = !DILocalVariable(name: "__s2", scope: !87, file: !65, line: 656, type: !51)
!87 = distinct !DILexicalBlock(scope: !83, file: !65, line: 656, column: 22)
!88 = !DILocalVariable(name: "__result", scope: !87, file: !65, line: 656, type: !28)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 896, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 7)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 1792, elements: !90)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !95, line: 104, size: 256, elements: !96)
!95 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!96 = !{!97, !98, !99, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !95, line: 106, baseType: !54, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !94, file: !95, line: 109, baseType: !28, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !95, line: 110, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !94, file: !95, line: 111, baseType: !28, size: 32, offset: 192)
!102 = !DIGlobalVariableExpression(var: !103)
!103 = distinct !DIGlobalVariable(name: "Version", scope: !104, file: !105, line: 2, type: !54, isDefinition: true)
!104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !105, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !107)
!105 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !{}
!107 = !{!102}
!108 = !DIGlobalVariableExpression(var: !109)
!109 = distinct !DIGlobalVariable(name: "file_name", scope: !110, file: !115, line: 36, type: !54, isLocal: true, isDefinition: true)
!110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !111, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !112)
!111 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!112 = !{!108, !113}
!113 = !DIGlobalVariableExpression(var: !114)
!114 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !110, file: !115, line: 46, type: !116, isLocal: true, isDefinition: true)
!115 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!116 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "exit_failure", scope: !119, file: !122, line: 24, type: !123, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !121)
!120 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{!117}
!122 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "program_name", scope: !126, file: !130, line: 33, type: !54, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !128, globals: !129)
!127 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !{!45, !43}
!129 = !{!124}
!130 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !133, file: !161, line: 77, type: !196, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !135, retainedTypes: !156, globals: !158)
!134 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!5, !136, !141}
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!139 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!140 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !142, line: 46, size: 32, elements: !143)
!142 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!144 = !DIEnumerator(name: "_ISupper", value: 256)
!145 = !DIEnumerator(name: "_ISlower", value: 512)
!146 = !DIEnumerator(name: "_ISalpha", value: 1024)
!147 = !DIEnumerator(name: "_ISdigit", value: 2048)
!148 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!149 = !DIEnumerator(name: "_ISspace", value: 8192)
!150 = !DIEnumerator(name: "_ISprint", value: 16384)
!151 = !DIEnumerator(name: "_ISgraph", value: 32768)
!152 = !DIEnumerator(name: "_ISblank", value: 1)
!153 = !DIEnumerator(name: "_IScntrl", value: 2)
!154 = !DIEnumerator(name: "_ISpunct", value: 4)
!155 = !DIEnumerator(name: "_ISalnum", value: 8)
!156 = !{!28, !157, !46, !43}
!157 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!158 = !{!131, !159, !166, !178, !180, !185, !192, !194}
!159 = !DIGlobalVariableExpression(var: !160)
!160 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !133, file: !161, line: 93, type: !162, isDefinition: true)
!161 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 320, elements: !164)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!164 = !{!165}
!165 = !DISubrange(count: 10)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !133, file: !161, line: 1043, type: !168, isDefinition: true)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !161, line: 57, size: 448, elements: !169)
!169 = !{!170, !171, !172, !176, !177}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !168, file: !161, line: 60, baseType: !5, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !161, line: 63, baseType: !28, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !168, file: !161, line: 67, baseType: !173, size: 256, offset: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 256, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !168, file: !161, line: 70, baseType: !54, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !168, file: !161, line: 73, baseType: !54, size: 64, offset: 384)
!178 = !DIGlobalVariableExpression(var: !179)
!179 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !133, file: !161, line: 108, type: !168, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181)
!181 = distinct !DIGlobalVariable(name: "slot0", scope: !133, file: !161, line: 834, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 256)
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "slotvec", scope: !133, file: !161, line: 837, type: !187, isLocal: true, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !161, line: 826, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !188, file: !161, line: 828, baseType: !46, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !188, file: !161, line: 829, baseType: !43, size: 64, offset: 64)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "nslots", scope: !133, file: !161, line: 835, type: !28, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "slotvec0", scope: !133, file: !161, line: 836, type: !188, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 704, elements: !198)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!198 = !{!199}
!199 = !DISubrange(count: 11)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !202, file: !205, line: 26, type: !206, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !204)
!203 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!204 = !{!200}
!205 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 376, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 47)
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !211, file: !555, line: 120, type: !556, isLocal: true, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !213, retainedTypes: !552, globals: !554)
!212 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !{!214}
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !215, line: 41, size: 32, elements: !216)
!215 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!217 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!218 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!219 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!220 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!221 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!222 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!223 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!224 = !DIEnumerator(name: "DAY_1", value: 131079)
!225 = !DIEnumerator(name: "DAY_2", value: 131080)
!226 = !DIEnumerator(name: "DAY_3", value: 131081)
!227 = !DIEnumerator(name: "DAY_4", value: 131082)
!228 = !DIEnumerator(name: "DAY_5", value: 131083)
!229 = !DIEnumerator(name: "DAY_6", value: 131084)
!230 = !DIEnumerator(name: "DAY_7", value: 131085)
!231 = !DIEnumerator(name: "ABMON_1", value: 131086)
!232 = !DIEnumerator(name: "ABMON_2", value: 131087)
!233 = !DIEnumerator(name: "ABMON_3", value: 131088)
!234 = !DIEnumerator(name: "ABMON_4", value: 131089)
!235 = !DIEnumerator(name: "ABMON_5", value: 131090)
!236 = !DIEnumerator(name: "ABMON_6", value: 131091)
!237 = !DIEnumerator(name: "ABMON_7", value: 131092)
!238 = !DIEnumerator(name: "ABMON_8", value: 131093)
!239 = !DIEnumerator(name: "ABMON_9", value: 131094)
!240 = !DIEnumerator(name: "ABMON_10", value: 131095)
!241 = !DIEnumerator(name: "ABMON_11", value: 131096)
!242 = !DIEnumerator(name: "ABMON_12", value: 131097)
!243 = !DIEnumerator(name: "MON_1", value: 131098)
!244 = !DIEnumerator(name: "MON_2", value: 131099)
!245 = !DIEnumerator(name: "MON_3", value: 131100)
!246 = !DIEnumerator(name: "MON_4", value: 131101)
!247 = !DIEnumerator(name: "MON_5", value: 131102)
!248 = !DIEnumerator(name: "MON_6", value: 131103)
!249 = !DIEnumerator(name: "MON_7", value: 131104)
!250 = !DIEnumerator(name: "MON_8", value: 131105)
!251 = !DIEnumerator(name: "MON_9", value: 131106)
!252 = !DIEnumerator(name: "MON_10", value: 131107)
!253 = !DIEnumerator(name: "MON_11", value: 131108)
!254 = !DIEnumerator(name: "MON_12", value: 131109)
!255 = !DIEnumerator(name: "AM_STR", value: 131110)
!256 = !DIEnumerator(name: "PM_STR", value: 131111)
!257 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!258 = !DIEnumerator(name: "D_FMT", value: 131113)
!259 = !DIEnumerator(name: "T_FMT", value: 131114)
!260 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!261 = !DIEnumerator(name: "ERA", value: 131116)
!262 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!263 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!264 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!265 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!266 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!267 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!268 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!269 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!270 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!271 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!272 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!273 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!274 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!275 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!276 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!277 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!278 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!279 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!280 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!281 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!282 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!283 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!284 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!285 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!286 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!287 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!288 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!289 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!290 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!291 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!292 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!293 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!294 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!295 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!296 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!297 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!298 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!299 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!300 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!301 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!302 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!303 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!304 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!305 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!306 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!307 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!308 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!309 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!310 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!311 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!312 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!313 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!314 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!315 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!316 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!317 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!318 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!319 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!320 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!321 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!322 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!323 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!324 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!325 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!326 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!327 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!328 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!329 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!330 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!331 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!332 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!333 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!334 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!335 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!336 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!337 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!338 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!339 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!340 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!341 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!342 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!343 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!344 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!345 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!346 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!347 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!348 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!349 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!350 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!351 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!352 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!353 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!354 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!355 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!356 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!357 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!358 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!359 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!360 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!361 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!362 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!363 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!364 = !DIEnumerator(name: "CODESET", value: 14)
!365 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!366 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!367 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!368 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!369 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!370 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!371 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!372 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!373 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!374 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!375 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!376 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!377 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!378 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!379 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!380 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!381 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!382 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!383 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!384 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!385 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!386 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!387 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!388 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!389 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!390 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!391 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!392 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!393 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!394 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!395 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!396 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!397 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!398 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!399 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!400 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!401 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!402 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!403 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!404 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!405 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!406 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!407 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!408 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!409 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!410 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!411 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!412 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!413 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!414 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!415 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!416 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!417 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!418 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!419 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!420 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!421 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!422 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!423 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!424 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!425 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!426 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!427 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!428 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!429 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!430 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!431 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!432 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!433 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!434 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!435 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!436 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!437 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!438 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!439 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!440 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!441 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!442 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!443 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!444 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!445 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!446 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!447 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!448 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!449 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!450 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!451 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!452 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!453 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!454 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!455 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!456 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!457 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!458 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!459 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!460 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!461 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!462 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!463 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!464 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!465 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!466 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!467 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!468 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!469 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!470 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!471 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!472 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!473 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!474 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!475 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!476 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!477 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!478 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!479 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!480 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!481 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!482 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!483 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!484 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!485 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!486 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!487 = !DIEnumerator(name: "THOUSEP", value: 65537)
!488 = !DIEnumerator(name: "__GROUPING", value: 65538)
!489 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!490 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!491 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!492 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!493 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!494 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!495 = !DIEnumerator(name: "__YESSTR", value: 327682)
!496 = !DIEnumerator(name: "__NOSTR", value: 327683)
!497 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!498 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!499 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!500 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!501 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!502 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!503 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!504 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!505 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!506 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!507 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!508 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!509 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!510 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!511 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!512 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!513 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!514 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!515 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!516 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!517 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!518 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!519 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!520 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!521 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!522 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!523 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!524 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!525 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!526 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!527 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!528 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!529 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!530 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!531 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!532 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!533 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!534 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!535 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!536 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!537 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!538 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!539 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!540 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!541 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!542 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!543 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!544 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!545 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!546 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!547 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!548 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!549 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!550 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!551 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!552 = !{!45, !43, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!554 = !{!209}
!555 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!556 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!557 = !DIGlobalVariableExpression(var: !558)
!558 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !559, file: !560, line: 335, type: !28, isLocal: true, isDefinition: true)
!559 = distinct !DISubprogram(name: "rpl_fcntl", scope: !560, file: !560, line: 272, type: !561, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !563, variables: !566)
!560 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!561 = !DISubroutineType(types: !562)
!562 = !{!28, !28, !28, null}
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !565)
!564 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!565 = !{!557}
!566 = !{!567, !568, !569, !582, !583, !586, !589, !592}
!567 = !DILocalVariable(name: "fd", arg: 1, scope: !559, file: !560, line: 272, type: !28)
!568 = !DILocalVariable(name: "action", arg: 2, scope: !559, file: !560, line: 272, type: !28)
!569 = !DILocalVariable(name: "arg", scope: !559, file: !560, line: 274, type: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !571, line: 30, baseType: !572)
!571 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !564, line: 274, baseType: !573)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 192, elements: !580)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !564, line: 274, size: 192, elements: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !574, file: !564, line: 274, baseType: !58, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !574, file: !564, line: 274, baseType: !58, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !574, file: !564, line: 274, baseType: !45, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !574, file: !564, line: 274, baseType: !45, size: 64, offset: 128)
!580 = !{!581}
!581 = !DISubrange(count: 1)
!582 = !DILocalVariable(name: "result", scope: !559, file: !560, line: 275, type: !28)
!583 = !DILocalVariable(name: "target", scope: !584, file: !560, line: 322, type: !28)
!584 = distinct !DILexicalBlock(scope: !585, file: !560, line: 321, column: 7)
!585 = distinct !DILexicalBlock(scope: !559, file: !560, line: 278, column: 5)
!586 = !DILocalVariable(name: "flags", scope: !587, file: !560, line: 359, type: !28)
!587 = distinct !DILexicalBlock(scope: !588, file: !560, line: 358, column: 11)
!588 = distinct !DILexicalBlock(scope: !584, file: !560, line: 357, column: 13)
!589 = !DILocalVariable(name: "saved_errno", scope: !590, file: !560, line: 362, type: !28)
!590 = distinct !DILexicalBlock(scope: !591, file: !560, line: 361, column: 15)
!591 = distinct !DILexicalBlock(scope: !587, file: !560, line: 360, column: 17)
!592 = !DILocalVariable(name: "p", scope: !593, file: !560, line: 404, type: !45)
!593 = distinct !DILexicalBlock(scope: !585, file: !560, line: 402, column: 7)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !596)
!595 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!596 = !{!53}
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!598 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !601, retainedTypes: !616)
!600 = !DIFile(filename: "./lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!601 = !{!602, !612}
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !603, file: !20, line: 39, size: 32, elements: !35)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !603, file: !20, line: 66, baseType: !602, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !603, file: !20, line: 74, baseType: !607, size: 32, offset: 32)
!607 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !603, file: !20, line: 69, size: 32, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !607, file: !20, line: 71, baseType: !28, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !607, file: !20, line: 72, baseType: !28, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !607, file: !20, line: 73, baseType: !31, size: 32)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 86, size: 32, elements: !613)
!613 = !{!614, !615}
!614 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1)
!615 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2)
!616 = !{!56, !59}
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !619, retainedTypes: !627)
!618 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!619 = !{!620}
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !621, line: 78, size: 32, elements: !622)
!621 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!622 = !{!623, !624, !625, !626}
!623 = !DIEnumerator(name: "MODE_DONE", value: 0)
!624 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!625 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!626 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!627 = !{!46}
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !630)
!629 = !DIFile(filename: "./lib/savewd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!630 = !{!631, !612}
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !632, file: !20, line: 39, size: 32, elements: !35)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !632, file: !20, line: 66, baseType: !631, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !632, file: !20, line: 74, baseType: !636, size: 32, offset: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !20, line: 69, size: 32, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !636, file: !20, line: 71, baseType: !28, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !636, file: !20, line: 72, baseType: !28, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !636, file: !20, line: 73, baseType: !31, size: 32)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !643, retainedTypes: !648)
!642 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = !{!644}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !645, line: 41, size: 32, elements: !646)
!645 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!646 = !{!647}
!647 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!648 = !{!45}
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !651, retainedTypes: !665)
!650 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = !{!652}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !654, file: !653, line: 192, size: 32, elements: !663)
!653 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = distinct !DISubprogram(name: "x2nrealloc", scope: !653, file: !653, line: 180, type: !655, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !649, variables: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{!45, !45, !657, !46}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(name: "p", arg: 1, scope: !654, file: !653, line: 180, type: !45)
!660 = !DILocalVariable(name: "pn", arg: 2, scope: !654, file: !653, line: 180, type: !657)
!661 = !DILocalVariable(name: "s", arg: 3, scope: !654, file: !653, line: 180, type: !46)
!662 = !DILocalVariable(name: "n", scope: !654, file: !653, line: 182, type: !46)
!663 = !{!664}
!664 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!665 = !{!46, !43, !45}
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!667 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !648)
!669 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !627)
!671 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!673 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!675 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !678)
!677 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = !{!46, !49, !51, !54}
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !681)
!680 = !DIFile(filename: "./lib/mkancesdirs.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !{!682, !612}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !683, file: !20, line: 39, size: 32, elements: !35)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !683, file: !20, line: 66, baseType: !682, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !683, file: !20, line: 74, baseType: !687, size: 32, offset: 32)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !683, file: !20, line: 69, size: 32, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !687, file: !20, line: 71, baseType: !28, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !687, file: !20, line: 72, baseType: !28, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !687, file: !20, line: 73, baseType: !31, size: 32)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !694)
!693 = !DIFile(filename: "./lib/dirchownmod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!694 = !{!56, !59, !695}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !32, line: 70, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !34, line: 138, baseType: !58)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!698 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!700 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !648)
!702 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !648)
!704 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !106)
!706 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!708 = !{i32 2, !"Dwarf Version", i32 4}
!709 = !{i32 2, !"Debug Info Version", i32 3}
!710 = !{i32 1, !"PIC Level", i32 2}
!711 = !{i32 1, !"PIE Level", i32 2}
!712 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !713, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !715)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !28}
!715 = !{!716}
!716 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !3, line: 53, type: !28)
!717 = !DIExpression()
!718 = !DILocation(line: 53, column: 12, scope: !712)
!719 = !DILocation(line: 55, column: 14, scope: !720)
!720 = distinct !DILexicalBlock(scope: !712, file: !3, line: 55, column: 7)
!721 = !DILocation(line: 55, column: 7, scope: !712)
!722 = !DILocation(line: 56, column: 5, scope: !723)
!723 = !DILexicalBlockFile(scope: !724, file: !3, discriminator: 1)
!724 = distinct !DILexicalBlock(scope: !720, file: !3, line: 56, column: 5)
!725 = !{!726, !726, i64 0}
!726 = !{!"any pointer", !727, i64 0}
!727 = !{!"omnipotent char", !728, i64 0}
!728 = !{!"Simple C/C++ TBAA"}
!729 = !DILocation(line: 56, column: 5, scope: !730)
!730 = !DILexicalBlockFile(scope: !724, file: !3, discriminator: 3)
!731 = !DILocation(line: 56, column: 5, scope: !732)
!732 = !DILexicalBlockFile(scope: !724, file: !3, discriminator: 2)
!733 = !DILocation(line: 59, column: 7, scope: !734)
!734 = distinct !DILexicalBlock(scope: !720, file: !3, line: 58, column: 5)
!735 = !DILocation(line: 59, column: 7, scope: !736)
!736 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 1)
!737 = !DILocation(line: 60, column: 7, scope: !734)
!738 = !DILocation(line: 60, column: 7, scope: !736)
!739 = !DILocation(line: 587, column: 3, scope: !740, inlinedAt: !743)
!740 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !65, file: !65, line: 585, type: !741, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !106)
!741 = !DISubroutineType(types: !742)
!742 = !{null}
!743 = distinct !DILocation(line: 64, column: 7, scope: !734)
!744 = !DILocation(line: 587, column: 3, scope: !745, inlinedAt: !743)
!745 = !DILexicalBlockFile(scope: !740, file: !65, discriminator: 1)
!746 = !DILocation(line: 66, column: 7, scope: !734)
!747 = !DILocation(line: 66, column: 7, scope: !736)
!748 = !DILocation(line: 71, column: 7, scope: !734)
!749 = !DILocation(line: 71, column: 7, scope: !736)
!750 = !DILocation(line: 77, column: 7, scope: !734)
!751 = !DILocation(line: 77, column: 7, scope: !736)
!752 = !DILocation(line: 78, column: 7, scope: !734)
!753 = !DILocation(line: 78, column: 7, scope: !736)
!754 = !DILocation(line: 642, column: 15, scope: !64, inlinedAt: !755)
!755 = distinct !DILocation(line: 79, column: 7, scope: !734)
!756 = !DILocation(line: 651, column: 3, scope: !64, inlinedAt: !755)
!757 = !DILocation(line: 651, column: 3, scope: !758, inlinedAt: !755)
!758 = !DILexicalBlockFile(scope: !64, file: !65, discriminator: 1)
!759 = !DILocation(line: 655, column: 29, scope: !64, inlinedAt: !755)
!760 = !DILocation(line: 655, column: 15, scope: !64, inlinedAt: !755)
!761 = !DILocation(line: 656, column: 7, scope: !84, inlinedAt: !755)
!762 = !DILocation(line: 656, column: 19, scope: !84, inlinedAt: !755)
!763 = !DILocation(line: 656, column: 22, scope: !764, inlinedAt: !755)
!764 = !DILexicalBlockFile(scope: !84, file: !65, discriminator: 16)
!765 = !DILocation(line: 656, column: 7, scope: !766, inlinedAt: !755)
!766 = !DILexicalBlockFile(scope: !64, file: !65, discriminator: 16)
!767 = !DILocation(line: 662, column: 7, scope: !768, inlinedAt: !755)
!768 = distinct !DILexicalBlock(scope: !84, file: !65, line: 657, column: 5)
!769 = !DILocation(line: 662, column: 7, scope: !770, inlinedAt: !755)
!770 = !DILexicalBlockFile(scope: !768, file: !65, discriminator: 1)
!771 = !DILocation(line: 664, column: 5, scope: !768, inlinedAt: !755)
!772 = !DILocation(line: 665, column: 3, scope: !64, inlinedAt: !755)
!773 = !DILocation(line: 665, column: 3, scope: !758, inlinedAt: !755)
!774 = !DILocation(line: 667, column: 3, scope: !64, inlinedAt: !755)
!775 = !DILocation(line: 667, column: 3, scope: !758, inlinedAt: !755)
!776 = !DILocation(line: 81, column: 3, scope: !712)
!777 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 189, type: !778, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !781)
!778 = !DISubroutineType(types: !779)
!779 = !{!28, !28, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!781 = !{!782, !783, !784, !785, !786, !787, !799, !802, !805}
!782 = !DILocalVariable(name: "argc", arg: 1, scope: !777, file: !3, line: 189, type: !28)
!783 = !DILocalVariable(name: "argv", arg: 2, scope: !777, file: !3, line: 189, type: !780)
!784 = !DILocalVariable(name: "specified_mode", scope: !777, file: !3, line: 191, type: !54)
!785 = !DILocalVariable(name: "optc", scope: !777, file: !3, line: 192, type: !28)
!786 = !DILocalVariable(name: "scontext", scope: !777, file: !3, line: 193, type: !54)
!787 = !DILocalVariable(name: "options", scope: !777, file: !3, line: 194, type: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !3, line: 85, size: 256, elements: !789)
!789 = !{!790, !794, !795, !796, !797, !798}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !788, file: !3, line: 89, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!28, !54, !54, !45}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "umask_value", scope: !788, file: !3, line: 92, baseType: !695, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !788, file: !3, line: 95, baseType: !695, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !788, file: !3, line: 98, baseType: !695, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !788, file: !3, line: 101, baseType: !116, size: 8, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !788, file: !3, line: 104, baseType: !54, size: 64, offset: 192)
!799 = !DILocalVariable(name: "ret", scope: !800, file: !3, line: 261, type: !28)
!800 = distinct !DILexicalBlock(scope: !801, file: !3, line: 260, column: 5)
!801 = distinct !DILexicalBlock(scope: !777, file: !3, line: 259, column: 7)
!802 = !DILocalVariable(name: "umask_value", scope: !803, file: !3, line: 276, type: !695)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 275, column: 5)
!804 = distinct !DILexicalBlock(scope: !777, file: !3, line: 274, column: 7)
!805 = !DILocalVariable(name: "change", scope: !806, file: !3, line: 282, type: !808)
!806 = distinct !DILexicalBlock(scope: !807, file: !3, line: 281, column: 9)
!807 = distinct !DILexicalBlock(scope: !803, file: !3, line: 280, column: 11)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !810, line: 25, flags: DIFlagFwdDecl)
!810 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!811 = !DILocation(line: 189, column: 11, scope: !777)
!812 = !DILocation(line: 189, column: 24, scope: !777)
!813 = !DILocation(line: 191, column: 15, scope: !777)
!814 = !DILocation(line: 193, column: 15, scope: !777)
!815 = !DILocation(line: 194, column: 3, scope: !777)
!816 = !DILocation(line: 196, column: 11, scope: !777)
!817 = !DILocation(line: 196, column: 34, scope: !777)
!818 = !{!819, !726, i64 0}
!819 = !{!"mkdir_options", !726, i64 0, !820, i64 8, !820, i64 12, !820, i64 16, !821, i64 20, !726, i64 24}
!820 = !{!"int", !727, i64 0}
!821 = !{!"_Bool", !727, i64 0}
!822 = !DILocation(line: 197, column: 11, scope: !777)
!823 = !DILocation(line: 197, column: 16, scope: !777)
!824 = !{!819, !820, i64 12}
!825 = !DILocation(line: 198, column: 11, scope: !777)
!826 = !DILocation(line: 198, column: 21, scope: !777)
!827 = !{!819, !820, i64 16}
!828 = !DILocation(line: 199, column: 11, scope: !777)
!829 = !DILocation(line: 199, column: 36, scope: !777)
!830 = !{!819, !726, i64 24}
!831 = !DILocation(line: 200, column: 11, scope: !777)
!832 = !DILocation(line: 200, column: 32, scope: !777)
!833 = !{!819, !821, i64 20}
!834 = !DILocation(line: 203, column: 21, scope: !777)
!835 = !DILocation(line: 203, column: 3, scope: !777)
!836 = !DILocation(line: 204, column: 3, scope: !777)
!837 = !DILocation(line: 205, column: 3, scope: !777)
!838 = !DILocation(line: 206, column: 3, scope: !777)
!839 = !DILocation(line: 208, column: 3, scope: !777)
!840 = !DILocation(line: 210, column: 3, scope: !777)
!841 = !DILocation(line: 210, column: 18, scope: !842)
!842 = !DILexicalBlockFile(scope: !777, file: !3, discriminator: 1)
!843 = !DILocation(line: 192, column: 7, scope: !777)
!844 = !DILocation(line: 210, column: 3, scope: !842)
!845 = !DILocation(line: 215, column: 42, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 213, column: 9)
!847 = distinct !DILexicalBlock(scope: !777, file: !3, line: 211, column: 5)
!848 = !DILocation(line: 216, column: 11, scope: !846)
!849 = distinct !{!849, !840, !850}
!850 = !DILocation(line: 248, column: 5, scope: !777)
!851 = !DILocation(line: 218, column: 28, scope: !846)
!852 = !DILocation(line: 219, column: 11, scope: !846)
!853 = !DILocation(line: 221, column: 46, scope: !846)
!854 = !DILocation(line: 221, column: 44, scope: !846)
!855 = !DILocation(line: 222, column: 11, scope: !846)
!856 = !DILocation(line: 236, column: 20, scope: !857)
!857 = distinct !DILexicalBlock(scope: !858, file: !3, line: 236, column: 20)
!858 = distinct !DILexicalBlock(scope: !859, file: !3, line: 229, column: 20)
!859 = distinct !DILexicalBlock(scope: !846, file: !3, line: 224, column: 15)
!860 = !DILocation(line: 236, column: 20, scope: !858)
!861 = !DILocation(line: 239, column: 22, scope: !862)
!862 = distinct !DILexicalBlock(scope: !857, file: !3, line: 237, column: 13)
!863 = !DILocation(line: 238, column: 15, scope: !862)
!864 = !DILocation(line: 241, column: 13, scope: !862)
!865 = !DILocation(line: 243, column: 9, scope: !846)
!866 = !DILocation(line: 244, column: 9, scope: !846)
!867 = !DILocation(line: 244, column: 9, scope: !868)
!868 = !DILexicalBlockFile(scope: !846, file: !3, discriminator: 1)
!869 = !DILocation(line: 246, column: 11, scope: !846)
!870 = !DILocation(line: 250, column: 7, scope: !871)
!871 = distinct !DILexicalBlock(scope: !777, file: !3, line: 250, column: 7)
!872 = !{!820, !820, i64 0}
!873 = !DILocation(line: 250, column: 14, scope: !871)
!874 = !DILocation(line: 250, column: 7, scope: !777)
!875 = !DILocation(line: 252, column: 20, scope: !876)
!876 = distinct !DILexicalBlock(scope: !871, file: !3, line: 251, column: 5)
!877 = !DILocation(line: 252, column: 7, scope: !878)
!878 = !DILexicalBlockFile(scope: !876, file: !3, discriminator: 1)
!879 = !DILocation(line: 253, column: 7, scope: !876)
!880 = !DILocation(line: 274, column: 7, scope: !804)
!881 = !DILocation(line: 274, column: 41, scope: !882)
!882 = !DILexicalBlockFile(scope: !804, file: !3, discriminator: 1)
!883 = !DILocation(line: 274, column: 38, scope: !804)
!884 = !DILocation(line: 276, column: 28, scope: !803)
!885 = !DILocation(line: 276, column: 14, scope: !803)
!886 = !DILocation(line: 277, column: 7, scope: !803)
!887 = !DILocation(line: 278, column: 15, scope: !803)
!888 = !DILocation(line: 278, column: 27, scope: !803)
!889 = !{!819, !820, i64 8}
!890 = !DILocation(line: 280, column: 11, scope: !803)
!891 = !DILocation(line: 282, column: 40, scope: !806)
!892 = !DILocation(line: 282, column: 31, scope: !806)
!893 = !DILocation(line: 283, column: 16, scope: !894)
!894 = distinct !DILexicalBlock(scope: !806, file: !3, line: 283, column: 15)
!895 = !DILocation(line: 283, column: 15, scope: !806)
!896 = !DILocation(line: 284, column: 13, scope: !894)
!897 = !DILocation(line: 284, column: 13, scope: !898)
!898 = !DILexicalBlockFile(scope: !894, file: !3, discriminator: 1)
!899 = !DILocation(line: 284, column: 13, scope: !900)
!900 = !DILexicalBlockFile(scope: !894, file: !3, discriminator: 2)
!901 = !DILocation(line: 286, column: 26, scope: !806)
!902 = !DILocation(line: 286, column: 24, scope: !806)
!903 = !DILocation(line: 288, column: 17, scope: !806)
!904 = !DILocation(line: 288, column: 11, scope: !806)
!905 = !DILocation(line: 289, column: 9, scope: !806)
!906 = !DILocation(line: 291, column: 22, scope: !807)
!907 = !DILocation(line: 294, column: 39, scope: !777)
!908 = !DILocation(line: 294, column: 37, scope: !777)
!909 = !DILocation(line: 294, column: 52, scope: !777)
!910 = !DILocation(line: 294, column: 10, scope: !777)
!911 = !DILocation(line: 296, column: 1, scope: !777)
!912 = !DILocation(line: 294, column: 3, scope: !777)
!913 = distinct !DISubprogram(name: "make_ancestor", scope: !3, file: !3, line: 122, type: !792, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !914)
!914 = !{!915, !916, !917, !918, !921, !922, !923, !924}
!915 = !DILocalVariable(name: "dir", arg: 1, scope: !913, file: !3, line: 122, type: !54)
!916 = !DILocalVariable(name: "component", arg: 2, scope: !913, file: !3, line: 122, type: !54)
!917 = !DILocalVariable(name: "options", arg: 3, scope: !913, file: !3, line: 122, type: !45)
!918 = !DILocalVariable(name: "o", scope: !913, file: !3, line: 124, type: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!921 = !DILocalVariable(name: "user_wx", scope: !913, file: !3, line: 131, type: !695)
!922 = !DILocalVariable(name: "self_denying_umask", scope: !913, file: !3, line: 132, type: !116)
!923 = !DILocalVariable(name: "r", scope: !913, file: !3, line: 135, type: !28)
!924 = !DILocalVariable(name: "mkdir_errno", scope: !925, file: !3, line: 138, type: !28)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 137, column: 5)
!926 = distinct !DILexicalBlock(scope: !913, file: !3, line: 136, column: 7)
!927 = !DILocation(line: 122, column: 28, scope: !913)
!928 = !DILocation(line: 122, column: 45, scope: !913)
!929 = !DILocation(line: 122, column: 62, scope: !913)
!930 = !DILocation(line: 126, column: 10, scope: !931)
!931 = distinct !DILexicalBlock(scope: !913, file: !3, line: 126, column: 7)
!932 = !{i8 0, i8 2}
!933 = !DILocation(line: 126, column: 31, scope: !931)
!934 = !DILocalVariable(name: "path", arg: 1, scope: !935, file: !936, line: 44, type: !54)
!935 = distinct !DISubprogram(name: "defaultcon", scope: !936, file: !936, line: 44, type: !937, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !939)
!936 = !DIFile(filename: "src/selinux.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!937 = !DISubroutineType(types: !938)
!938 = !{!28, !54, !695}
!939 = !{!934, !940}
!940 = !DILocalVariable(name: "mode", arg: 2, scope: !935, file: !936, line: 44, type: !695)
!941 = !DILocation(line: 44, column: 25, scope: !935, inlinedAt: !942)
!942 = distinct !DILocation(line: 126, column: 34, scope: !943)
!943 = !DILexicalBlockFile(scope: !931, file: !3, discriminator: 1)
!944 = !DILocation(line: 44, column: 38, scope: !935, inlinedAt: !942)
!945 = !DILocation(line: 45, column: 3, scope: !935, inlinedAt: !942)
!946 = !DILocation(line: 45, column: 9, scope: !935, inlinedAt: !942)
!947 = !DILocation(line: 126, column: 7, scope: !948)
!948 = !DILexicalBlockFile(scope: !913, file: !3, discriminator: 2)
!949 = !DILocation(line: 131, column: 10, scope: !913)
!950 = !DILocation(line: 132, column: 33, scope: !913)
!951 = !DILocation(line: 132, column: 45, scope: !913)
!952 = !DILocation(line: 132, column: 56, scope: !913)
!953 = !DILocation(line: 133, column: 7, scope: !913)
!954 = !DILocation(line: 135, column: 11, scope: !913)
!955 = !DILocation(line: 135, column: 7, scope: !913)
!956 = !DILocation(line: 134, column: 27, scope: !957)
!957 = distinct !DILexicalBlock(scope: !913, file: !3, line: 133, column: 7)
!958 = !DILocation(line: 134, column: 5, scope: !957)
!959 = !DILocation(line: 138, column: 25, scope: !925)
!960 = !DILocation(line: 138, column: 11, scope: !925)
!961 = !DILocation(line: 139, column: 17, scope: !925)
!962 = !DILocation(line: 139, column: 7, scope: !925)
!963 = !DILocation(line: 140, column: 13, scope: !925)
!964 = !DILocation(line: 141, column: 5, scope: !925)
!965 = !DILocation(line: 142, column: 9, scope: !966)
!966 = distinct !DILexicalBlock(scope: !913, file: !3, line: 142, column: 7)
!967 = !DILocation(line: 142, column: 7, scope: !913)
!968 = !DILocation(line: 144, column: 15, scope: !969)
!969 = distinct !DILexicalBlock(scope: !966, file: !3, line: 143, column: 5)
!970 = !DILocation(line: 144, column: 38, scope: !969)
!971 = !DILocalVariable(name: "dir", arg: 1, scope: !972, file: !3, line: 109, type: !54)
!972 = distinct !DISubprogram(name: "announce_mkdir", scope: !3, file: !3, line: 109, type: !973, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !54, !45}
!975 = !{!971, !976, !977}
!976 = !DILocalVariable(name: "options", arg: 2, scope: !972, file: !3, line: 109, type: !45)
!977 = !DILocalVariable(name: "o", scope: !972, file: !3, line: 111, type: !919)
!978 = !DILocation(line: 109, column: 29, scope: !972, inlinedAt: !979)
!979 = distinct !DILocation(line: 145, column: 7, scope: !969)
!980 = !DILocation(line: 109, column: 40, scope: !972, inlinedAt: !979)
!981 = !DILocation(line: 112, column: 10, scope: !982, inlinedAt: !979)
!982 = distinct !DILexicalBlock(scope: !972, file: !3, line: 112, column: 7)
!983 = !DILocation(line: 112, column: 7, scope: !982, inlinedAt: !979)
!984 = !DILocation(line: 112, column: 7, scope: !972, inlinedAt: !979)
!985 = !DILocation(line: 113, column: 19, scope: !982, inlinedAt: !979)
!986 = !DILocation(line: 113, column: 56, scope: !982, inlinedAt: !979)
!987 = !DILocation(line: 113, column: 5, scope: !988, inlinedAt: !979)
!988 = !DILexicalBlockFile(scope: !982, file: !3, discriminator: 1)
!989 = !DILocation(line: 113, column: 5, scope: !982, inlinedAt: !979)
!990 = !DILocation(line: 147, column: 3, scope: !913)
!991 = distinct !DISubprogram(name: "process_dir", scope: !3, file: !3, line: 152, type: !992, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !995)
!992 = !DISubroutineType(types: !993)
!993 = !{!28, !43, !994, !45}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!995 = !{!996, !997, !998, !999, !1000}
!996 = !DILocalVariable(name: "dir", arg: 1, scope: !991, file: !3, line: 152, type: !43)
!997 = !DILocalVariable(name: "wd", arg: 2, scope: !991, file: !3, line: 152, type: !994)
!998 = !DILocalVariable(name: "options", arg: 3, scope: !991, file: !3, line: 152, type: !45)
!999 = !DILocalVariable(name: "o", scope: !991, file: !3, line: 154, type: !919)
!1000 = !DILocalVariable(name: "ret", scope: !991, file: !3, line: 165, type: !28)
!1001 = !DILocation(line: 152, column: 20, scope: !991)
!1002 = !DILocation(line: 152, column: 40, scope: !991)
!1003 = !DILocation(line: 152, column: 50, scope: !991)
!1004 = !DILocation(line: 157, column: 10, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !991, file: !3, line: 157, column: 7)
!1006 = !DILocation(line: 159, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 159, column: 11)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 158, column: 5)
!1009 = !DILocation(line: 157, column: 7, scope: !991)
!1010 = !DILocation(line: 44, column: 25, scope: !935, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 159, column: 42, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !1007, file: !3, discriminator: 1)
!1013 = !DILocation(line: 44, column: 38, scope: !935, inlinedAt: !1011)
!1014 = !DILocation(line: 45, column: 3, scope: !935, inlinedAt: !1011)
!1015 = !DILocation(line: 45, column: 9, scope: !935, inlinedAt: !1011)
!1016 = !DILocation(line: 159, column: 11, scope: !1017)
!1017 = !DILexicalBlockFile(scope: !1008, file: !3, discriminator: 2)
!1018 = !DILocation(line: 165, column: 44, scope: !991)
!1019 = !DILocation(line: 166, column: 35, scope: !991)
!1020 = !DILocation(line: 167, column: 35, scope: !991)
!1021 = !DILocation(line: 165, column: 14, scope: !991)
!1022 = !DILocation(line: 165, column: 7, scope: !991)
!1023 = !DILocation(line: 176, column: 27, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !991, file: !3, line: 176, column: 7)
!1025 = !DILocation(line: 176, column: 33, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1024, file: !3, discriminator: 1)
!1027 = !DILocation(line: 177, column: 7, scope: !1024)
!1028 = !DILocation(line: 177, column: 13, scope: !1026)
!1029 = !DILocation(line: 177, column: 10, scope: !1026)
!1030 = !DILocation(line: 176, column: 7, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !991, file: !3, discriminator: 2)
!1032 = !DILocalVariable(name: "path", arg: 1, scope: !1033, file: !936, line: 40, type: !54)
!1033 = distinct !DISubprogram(name: "restorecon", scope: !936, file: !936, line: 40, type: !1034, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1036)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!116, !54, !116, !116}
!1036 = !{!1032, !1037, !1038}
!1037 = !DILocalVariable(name: "recurse", arg: 2, scope: !1033, file: !936, line: 40, type: !116)
!1038 = !DILocalVariable(name: "preserve", arg: 3, scope: !1033, file: !936, line: 40, type: !116)
!1039 = !DILocation(line: 40, column: 25, scope: !1033, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 179, column: 13, scope: !1041)
!1041 = !DILexicalBlockFile(scope: !1042, file: !3, discriminator: 2)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 179, column: 11)
!1043 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 178, column: 5)
!1044 = !DIExpression(DW_OP_LLVM_fragment, 0, 1)
!1045 = !DILocation(line: 40, column: 36, scope: !1033, inlinedAt: !1040)
!1046 = !DILocation(line: 40, column: 50, scope: !1033, inlinedAt: !1040)
!1047 = !DILocation(line: 41, column: 3, scope: !1033, inlinedAt: !1040)
!1048 = !DILocation(line: 41, column: 9, scope: !1033, inlinedAt: !1040)
!1049 = !DILocation(line: 179, column: 11, scope: !1050)
!1050 = !DILexicalBlockFile(scope: !1043, file: !3, discriminator: 1)
!1051 = !DILocation(line: 185, column: 3, scope: !991)
!1052 = !DILocation(line: 109, column: 29, scope: !972)
!1053 = !DILocation(line: 109, column: 40, scope: !972)
!1054 = !DILocation(line: 112, column: 10, scope: !982)
!1055 = !DILocation(line: 112, column: 7, scope: !982)
!1056 = !DILocation(line: 112, column: 7, scope: !972)
!1057 = !DILocation(line: 113, column: 19, scope: !982)
!1058 = !DILocation(line: 113, column: 56, scope: !982)
!1059 = !DILocation(line: 113, column: 5, scope: !988)
!1060 = !DILocation(line: 113, column: 5, scope: !982)
!1061 = !DILocation(line: 114, column: 1, scope: !972)
!1062 = distinct !DISubprogram(name: "prog_fprintf", scope: !595, file: !595, line: 28, type: !1063, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, unit: !594, variables: !1117)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !1065, !54, null}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1067, line: 49, baseType: !1068)
!1067 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1069, line: 241, size: 1728, elements: !1070)
!1069 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1091, !1092, !1093, !1094, !1097, !1098, !1100, !1102, !1105, !1107, !1108, !1109, !1110, !1111, !1112, !1113}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1068, file: !1069, line: 242, baseType: !28, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1068, file: !1069, line: 247, baseType: !43, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1068, file: !1069, line: 248, baseType: !43, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1068, file: !1069, line: 249, baseType: !43, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1068, file: !1069, line: 250, baseType: !43, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1068, file: !1069, line: 251, baseType: !43, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1068, file: !1069, line: 252, baseType: !43, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1068, file: !1069, line: 253, baseType: !43, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1068, file: !1069, line: 254, baseType: !43, size: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1068, file: !1069, line: 256, baseType: !43, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1068, file: !1069, line: 257, baseType: !43, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1068, file: !1069, line: 258, baseType: !43, size: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1068, file: !1069, line: 260, baseType: !1084, size: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1069, line: 156, size: 192, elements: !1086)
!1086 = !{!1087, !1088, !1090}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1085, file: !1069, line: 157, baseType: !1084, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1085, file: !1069, line: 158, baseType: !1089, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1085, file: !1069, line: 162, baseType: !28, size: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1068, file: !1069, line: 262, baseType: !1089, size: 64, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1068, file: !1069, line: 264, baseType: !28, size: 32, offset: 896)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1068, file: !1069, line: 268, baseType: !28, size: 32, offset: 928)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1068, file: !1069, line: 270, baseType: !1095, size: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 140, baseType: !1096)
!1096 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1068, file: !1069, line: 274, baseType: !157, size: 16, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1068, file: !1069, line: 275, baseType: !1099, size: 8, offset: 1040)
!1099 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1068, file: !1069, line: 276, baseType: !1101, size: 8, offset: 1048)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !580)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1068, file: !1069, line: 280, baseType: !1103, size: 64, offset: 1088)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1069, line: 150, baseType: null)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1068, file: !1069, line: 289, baseType: !1106, size: 64, offset: 1152)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 141, baseType: !1096)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1068, file: !1069, line: 297, baseType: !45, size: 64, offset: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1068, file: !1069, line: 298, baseType: !45, size: 64, offset: 1280)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1068, file: !1069, line: 299, baseType: !45, size: 64, offset: 1344)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1068, file: !1069, line: 300, baseType: !45, size: 64, offset: 1408)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1068, file: !1069, line: 302, baseType: !46, size: 64, offset: 1472)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1068, file: !1069, line: 303, baseType: !28, size: 32, offset: 1536)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1068, file: !1069, line: 305, baseType: !1114, size: 160, offset: 1568)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 20)
!1117 = !{!1118, !1119, !1120}
!1118 = !DILocalVariable(name: "fp", arg: 1, scope: !1062, file: !595, line: 28, type: !1065)
!1119 = !DILocalVariable(name: "fmt", arg: 2, scope: !1062, file: !595, line: 28, type: !54)
!1120 = !DILocalVariable(name: "ap", scope: !1062, file: !595, line: 30, type: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1067, line: 80, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !571, line: 50, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !595, line: 30, baseType: !1124)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 192, elements: !580)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !595, line: 30, size: 192, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1125, file: !595, line: 30, baseType: !58, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1125, file: !595, line: 30, baseType: !58, size: 32, offset: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1125, file: !595, line: 30, baseType: !45, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1125, file: !595, line: 30, baseType: !45, size: 64, offset: 128)
!1131 = !DILocation(line: 28, column: 21, scope: !1062)
!1132 = !DILocation(line: 28, column: 37, scope: !1062)
!1133 = !DILocation(line: 30, column: 3, scope: !1062)
!1134 = !DILocation(line: 30, column: 11, scope: !1062)
!1135 = !DILocation(line: 31, column: 3, scope: !1062)
!1136 = !DILocation(line: 32, column: 3, scope: !1062)
!1137 = !DILocation(line: 33, column: 3, scope: !1062)
!1138 = !DILocalVariable(name: "__stream", arg: 1, scope: !1139, file: !1140, line: 124, type: !1143)
!1139 = distinct !DISubprogram(name: "vfprintf", scope: !1140, file: !1140, line: 124, type: !1141, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !594, variables: !1146)
!1140 = !DIFile(filename: "/usr/include/bits/stdio2.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!28, !1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1065)
!1144 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !54)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1146 = !{!1138, !1147, !1148}
!1147 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1139, file: !1140, line: 125, type: !1144)
!1148 = !DILocalVariable(name: "__ap", arg: 3, scope: !1139, file: !1140, line: 125, type: !1145)
!1149 = !DILocation(line: 124, column: 28, scope: !1139, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 34, column: 3, scope: !1062)
!1151 = !DILocation(line: 125, column: 27, scope: !1139, inlinedAt: !1150)
!1152 = !DILocation(line: 125, column: 45, scope: !1139, inlinedAt: !1150)
!1153 = !DILocation(line: 127, column: 10, scope: !1139, inlinedAt: !1150)
!1154 = !DILocation(line: 35, column: 3, scope: !1062)
!1155 = !DILocalVariable(name: "__c", arg: 1, scope: !1156, file: !1157, line: 88, type: !28)
!1156 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1157, file: !1157, line: 88, type: !1158, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !594, variables: !1160)
!1157 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!28, !28, !1065}
!1160 = !{!1155, !1161}
!1161 = !DILocalVariable(name: "__stream", arg: 2, scope: !1156, file: !1157, line: 88, type: !1065)
!1162 = !DILocation(line: 88, column: 21, scope: !1156, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 36, column: 3, scope: !1062)
!1164 = !DILocation(line: 88, column: 32, scope: !1156, inlinedAt: !1163)
!1165 = !DILocation(line: 90, column: 10, scope: !1156, inlinedAt: !1163)
!1166 = !{!1167, !726, i64 40}
!1167 = !{!"_IO_FILE", !820, i64 0, !726, i64 8, !726, i64 16, !726, i64 24, !726, i64 32, !726, i64 40, !726, i64 48, !726, i64 56, !726, i64 64, !726, i64 72, !726, i64 80, !726, i64 88, !726, i64 96, !726, i64 104, !820, i64 112, !820, i64 116, !1168, i64 120, !1169, i64 128, !727, i64 130, !727, i64 131, !726, i64 136, !1168, i64 144, !726, i64 152, !726, i64 160, !726, i64 168, !726, i64 176, !1168, i64 184, !820, i64 192, !727, i64 196}
!1168 = !{!"long", !727, i64 0}
!1169 = !{!"short", !727, i64 0}
!1170 = !{!1167, !726, i64 48}
!1171 = !{!"branch_weights", i32 2000, i32 1}
!1172 = !DILocation(line: 90, column: 10, scope: !1173, inlinedAt: !1163)
!1173 = !DILexicalBlockFile(scope: !1156, file: !1157, discriminator: 1)
!1174 = !DILocation(line: 90, column: 10, scope: !1175, inlinedAt: !1163)
!1175 = !DILexicalBlockFile(scope: !1156, file: !1157, discriminator: 2)
!1176 = !{!727, !727, i64 0}
!1177 = !DILocation(line: 37, column: 1, scope: !1062)
!1178 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !115, file: !115, line: 41, type: !66, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1179)
!1179 = !{!1180}
!1180 = !DILocalVariable(name: "file", arg: 1, scope: !1178, file: !115, line: 41, type: !54)
!1181 = !DILocation(line: 41, column: 41, scope: !1178)
!1182 = !DILocation(line: 43, column: 13, scope: !1178)
!1183 = !DILocation(line: 44, column: 1, scope: !1178)
!1184 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !115, file: !115, line: 78, type: !1185, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1187)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !116}
!1187 = !{!1188}
!1188 = !DILocalVariable(name: "ignore", arg: 1, scope: !1184, file: !115, line: 78, type: !116)
!1189 = !DILocation(line: 78, column: 37, scope: !1184)
!1190 = !DILocation(line: 80, column: 16, scope: !1184)
!1191 = !{!821, !821, i64 0}
!1192 = !DILocation(line: 81, column: 1, scope: !1184)
!1193 = distinct !DISubprogram(name: "close_stdout", scope: !115, file: !115, line: 107, type: !741, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1194)
!1194 = !{!1195}
!1195 = !DILocalVariable(name: "write_error", scope: !1196, file: !115, line: 112, type: !54)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !115, line: 111, column: 5)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !115, line: 109, column: 7)
!1198 = !DILocation(line: 109, column: 21, scope: !1197)
!1199 = !DILocation(line: 109, column: 7, scope: !1197)
!1200 = !DILocation(line: 109, column: 29, scope: !1197)
!1201 = !DILocation(line: 110, column: 7, scope: !1197)
!1202 = !DILocation(line: 110, column: 12, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1197, file: !115, discriminator: 1)
!1204 = !DILocation(line: 114, column: 19, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1196, file: !115, line: 113, column: 11)
!1206 = !DILocation(line: 110, column: 25, scope: !1203)
!1207 = !DILocation(line: 110, column: 28, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1197, file: !115, discriminator: 2)
!1209 = !DILocation(line: 110, column: 34, scope: !1208)
!1210 = !DILocation(line: 109, column: 7, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1193, file: !115, discriminator: 1)
!1212 = !DILocation(line: 112, column: 33, scope: !1196)
!1213 = !DILocation(line: 112, column: 19, scope: !1196)
!1214 = !DILocation(line: 113, column: 11, scope: !1205)
!1215 = !DILocation(line: 113, column: 11, scope: !1196)
!1216 = !DILocation(line: 114, column: 36, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1205, file: !115, discriminator: 1)
!1218 = !DILocation(line: 114, column: 9, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !1205, file: !115, discriminator: 2)
!1220 = !DILocation(line: 114, column: 9, scope: !1205)
!1221 = !DILocation(line: 117, column: 9, scope: !1217)
!1222 = !DILocation(line: 119, column: 14, scope: !1196)
!1223 = !DILocation(line: 119, column: 7, scope: !1196)
!1224 = !DILocation(line: 122, column: 22, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1193, file: !115, line: 122, column: 8)
!1226 = !DILocation(line: 122, column: 8, scope: !1225)
!1227 = !DILocation(line: 122, column: 30, scope: !1225)
!1228 = !DILocation(line: 122, column: 8, scope: !1193)
!1229 = !DILocation(line: 123, column: 13, scope: !1225)
!1230 = !DILocation(line: 123, column: 6, scope: !1225)
!1231 = !DILocation(line: 124, column: 1, scope: !1193)
!1232 = distinct !DISubprogram(name: "make_dir_parents", scope: !1233, file: !1233, line: 85, type: !1234, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !599, variables: !1238)
!1233 = !DIFile(filename: "lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!116, !43, !1236, !791, !45, !695, !1237, !695, !56, !59, !116}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1258, !1259, !1260, !1263, !1299, !1304, !1305, !1308}
!1239 = !DILocalVariable(name: "dir", arg: 1, scope: !1232, file: !1233, line: 85, type: !43)
!1240 = !DILocalVariable(name: "wd", arg: 2, scope: !1232, file: !1233, line: 86, type: !1236)
!1241 = !DILocalVariable(name: "make_ancestor", arg: 3, scope: !1232, file: !1233, line: 87, type: !791)
!1242 = !DILocalVariable(name: "options", arg: 4, scope: !1232, file: !1233, line: 88, type: !45)
!1243 = !DILocalVariable(name: "mode", arg: 5, scope: !1232, file: !1233, line: 89, type: !695)
!1244 = !DILocalVariable(name: "announce", arg: 6, scope: !1232, file: !1233, line: 90, type: !1237)
!1245 = !DILocalVariable(name: "mode_bits", arg: 7, scope: !1232, file: !1233, line: 91, type: !695)
!1246 = !DILocalVariable(name: "owner", arg: 8, scope: !1232, file: !1233, line: 92, type: !56)
!1247 = !DILocalVariable(name: "group", arg: 9, scope: !1232, file: !1233, line: 93, type: !59)
!1248 = !DILocalVariable(name: "preserve_existing", arg: 10, scope: !1232, file: !1233, line: 94, type: !116)
!1249 = !DILocalVariable(name: "mkdir_errno", scope: !1232, file: !1233, line: 96, type: !28)
!1250 = !DILocalVariable(name: "prefix_len", scope: !1251, file: !1233, line: 100, type: !1253)
!1251 = distinct !DILexicalBlock(scope: !1252, file: !1233, line: 99, column: 5)
!1252 = distinct !DILexicalBlock(scope: !1232, file: !1233, line: 98, column: 7)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !47, line: 51, baseType: !1096)
!1254 = !DILocalVariable(name: "savewd_chdir_options", scope: !1251, file: !1233, line: 101, type: !28)
!1255 = !DILocalVariable(name: "keep_owner", scope: !1256, file: !1233, line: 121, type: !116)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !1233, line: 115, column: 9)
!1257 = distinct !DILexicalBlock(scope: !1251, file: !1233, line: 114, column: 11)
!1258 = !DILocalVariable(name: "keep_special_mode_bits", scope: !1256, file: !1233, line: 122, type: !116)
!1259 = !DILocalVariable(name: "mkdir_mode", scope: !1256, file: !1233, line: 124, type: !695)
!1260 = !DILocalVariable(name: "umask_must_be_ok", scope: !1261, file: !1233, line: 134, type: !116)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !1233, line: 131, column: 13)
!1262 = distinct !DILexicalBlock(scope: !1256, file: !1233, line: 130, column: 15)
!1263 = !DILocalVariable(name: "st", scope: !1264, file: !1233, line: 149, type: !1266)
!1264 = distinct !DILexicalBlock(scope: !1265, file: !1233, line: 148, column: 13)
!1265 = distinct !DILexicalBlock(scope: !1256, file: !1233, line: 147, column: 15)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1267, line: 46, size: 1152, elements: !1268)
