!llvm.dbg.cu = !{!2, !441, !447, !455, !937, !940, !942, !944, !947, !952, !462, !469, !956, !959, !961, !522, !969, !986, !988, !991, !994, !996, !998, !1002, !1004, !535, !1006, !1008, !1010, !1013, !1035, !566, !913}
!llvm.ident = !{!1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037, !1037}
!llvm.module.flags = !{!1038, !1039, !1040, !1041}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 740, type: !436, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !149, globals: !160)
!3 = !DIFile(filename: "src/pr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !13, !16, !19, !111, !125, !134}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 26, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!9 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!10 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!12 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 537, size: 32, elements: !14)
!14 = !{!15}
!15 = !DIEnumerator(name: "lines_per_header", value: 5)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 539, size: 32, elements: !17)
!17 = !{!18}
!18 = !DIEnumerator(name: "lines_per_footer", value: 5)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !20, file: !3, line: 388, size: 32, elements: !106)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "COLUMN", file: !3, line: 384, size: 512, elements: !21)
!21 = !{!22, !86, !89, !90, !96, !100, !101, !102, !103, !104, !105}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !20, file: !3, line: 386, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 49, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !27, line: 241, size: 1728, elements: !28)
!27 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!28 = !{!29, !31, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !52, !53, !54, !55, !59, !61, !63, !67, !70, !72, !74, !75, !76, !77, !81, !82}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !26, file: !27, line: 242, baseType: !30, size: 32)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !26, file: !27, line: 247, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !26, file: !27, line: 248, baseType: !32, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !26, file: !27, line: 249, baseType: !32, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !26, file: !27, line: 250, baseType: !32, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !26, file: !27, line: 251, baseType: !32, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !26, file: !27, line: 252, baseType: !32, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !26, file: !27, line: 253, baseType: !32, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !26, file: !27, line: 254, baseType: !32, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !26, file: !27, line: 256, baseType: !32, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !26, file: !27, line: 257, baseType: !32, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !26, file: !27, line: 258, baseType: !32, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !26, file: !27, line: 260, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !27, line: 156, size: 192, elements: !47)
!47 = !{!48, !49, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !46, file: !27, line: 157, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !46, file: !27, line: 158, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !46, file: !27, line: 162, baseType: !30, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !26, file: !27, line: 262, baseType: !50, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !26, file: !27, line: 264, baseType: !30, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !26, file: !27, line: 268, baseType: !30, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !26, file: !27, line: 270, baseType: !56, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 140, baseType: !58)
!57 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !26, file: !27, line: 274, baseType: !60, size: 16, offset: 1024)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !26, file: !27, line: 275, baseType: !62, size: 8, offset: 1040)
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !26, file: !27, line: 276, baseType: !64, size: 8, offset: 1048)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !26, file: !27, line: 280, baseType: !68, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !27, line: 150, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !26, file: !27, line: 289, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 141, baseType: !58)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !26, file: !27, line: 297, baseType: !73, size: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !26, file: !27, line: 298, baseType: !73, size: 64, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !26, file: !27, line: 299, baseType: !73, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !26, file: !27, line: 300, baseType: !73, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !26, file: !27, line: 302, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 62, baseType: !80)
!79 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !26, file: !27, line: 303, baseType: !30, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !26, file: !27, line: 305, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !3, line: 387, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !20, file: !3, line: 396, baseType: !19, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "print_func", scope: !20, file: !3, line: 399, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !95}
!94 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "char_func", scope: !20, file: !3, line: 402, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !33}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_line", scope: !20, file: !3, line: 404, baseType: !30, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "lines_stored", scope: !20, file: !3, line: 405, baseType: !30, size: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lines_to_print", scope: !20, file: !3, line: 406, baseType: !30, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "start_position", scope: !20, file: !3, line: 407, baseType: !30, size: 32, offset: 416)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !20, file: !3, line: 408, baseType: !94, size: 8, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "full_page_printed", scope: !20, file: !3, line: 409, baseType: !94, size: 8, offset: 456)
!106 = !{!107, !108, !109, !110}
!107 = !DIEnumerator(name: "OPEN", value: 0)
!108 = !DIEnumerator(name: "FF_FOUND", value: 1)
!109 = !DIEnumerator(name: "ON_HOLD", value: 2)
!110 = !DIEnumerator(name: "CLOSED", value: 3)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !112, line: 32, size: 32, elements: !113)
!112 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!114 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!115 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!116 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!117 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!118 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!119 = !DIEnumerator(name: "c_quoting_style", value: 5)
!120 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!121 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!122 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!123 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!124 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 45, size: 32, elements: !127)
!126 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!127 = !{!128, !129, !130, !131, !132, !133}
!128 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!129 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!130 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!131 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!132 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!133 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 46, size: 32, elements: !136)
!135 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!137 = !DIEnumerator(name: "_ISupper", value: 256)
!138 = !DIEnumerator(name: "_ISlower", value: 512)
!139 = !DIEnumerator(name: "_ISalpha", value: 1024)
!140 = !DIEnumerator(name: "_ISdigit", value: 2048)
!141 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!142 = !DIEnumerator(name: "_ISspace", value: 8192)
!143 = !DIEnumerator(name: "_ISprint", value: 16384)
!144 = !DIEnumerator(name: "_ISgraph", value: 32768)
!145 = !DIEnumerator(name: "_ISblank", value: 1)
!146 = !DIEnumerator(name: "_IScntrl", value: 2)
!147 = !DIEnumerator(name: "_ISpunct", value: 4)
!148 = !DIEnumerator(name: "_ISalnum", value: 8)
!149 = !{!73, !150, !32, !78, !62, !151, !152, !60, !30, !58, !80, !153, !154, !155, !157, !87, !159}
!150 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!160 = !{!161, !163, !165, !0, !171, !185, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !280, !358, !360, !362, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406}
!161 = !DIGlobalVariableExpression(var: !162)
!162 = distinct !DIGlobalVariable(name: "custom_header", scope: !2, file: !3, line: 709, type: !32, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164)
!164 = distinct !DIGlobalVariable(name: "date_format", scope: !2, file: !3, line: 712, type: !87, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 715, type: !167, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !168, line: 594, baseType: !169)
!168 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !168, line: 594, flags: DIFlagFwdDecl)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 743, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 6912, elements: !183)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !176, line: 104, size: 256, elements: !177)
!176 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!177 = !{!178, !179, !180, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !176, line: 106, baseType: !87, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !175, file: !176, line: 109, baseType: !30, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !176, line: 110, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !176, line: 111, baseType: !30, size: 32, offset: 192)
!183 = !{!184}
!184 = !DISubrange(count: 27)
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "first_page_number", scope: !2, file: !3, line: 612, type: !187, isLocal: true, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !188, line: 136, baseType: !189)
!188 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !57, line: 62, baseType: !80)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "last_page_number", scope: !2, file: !3, line: 613, type: !187, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 608, type: !30, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "print_across_flag", scope: !2, file: !3, line: 521, type: !94, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "storing_columns", scope: !2, file: !3, line: 524, type: !94, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "balance_columns", scope: !2, file: !3, line: 530, type: !94, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "use_cntrl_prefix", scope: !2, file: !3, line: 672, type: !94, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "double_space", scope: !2, file: !3, line: 675, type: !94, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "input_tab_char", scope: !2, file: !3, line: 560, type: !33, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "chars_per_input_tab", scope: !2, file: !3, line: 564, type: !30, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "untabify_input", scope: !2, file: !3, line: 557, type: !94, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "use_form_feed", scope: !2, file: !3, line: 515, type: !94, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "output_tab_char", scope: !2, file: !3, line: 570, type: !33, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "chars_per_output_tab", scope: !2, file: !3, line: 573, type: !30, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "tabify_output", scope: !2, file: !3, line: 567, type: !94, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "join_lines", scope: !2, file: !3, line: 550, type: !94, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "lines_per_page", scope: !2, file: !3, line: 533, type: !30, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "parallel_files", scope: !2, file: !3, line: 480, type: !94, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "numbered_lines", scope: !2, file: !3, line: 637, type: !94, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "number_separator", scope: !2, file: !3, line: 640, type: !33, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "chars_per_number", scope: !2, file: !3, line: 656, type: !30, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "skip_count", scope: !2, file: !3, line: 649, type: !94, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233)
!233 = distinct !DIGlobalVariable(name: "start_line_num", scope: !2, file: !3, line: 653, type: !30, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "chars_per_margin", scope: !2, file: !3, line: 581, type: !30, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "ignore_failed_opens", scope: !2, file: !3, line: 682, type: !94, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "use_col_separator", scope: !2, file: !3, line: 686, type: !94, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241)
!241 = distinct !DIGlobalVariable(name: "col_sep_string", scope: !2, file: !3, line: 691, type: !87, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "col_sep_length", scope: !2, file: !3, line: 692, type: !30, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245)
!245 = distinct !DIGlobalVariable(name: "extremities", scope: !2, file: !3, line: 503, type: !94, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "keep_FF", scope: !2, file: !3, line: 507, type: !94, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "use_esc_sequence", scope: !2, file: !3, line: 668, type: !94, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "truncate_lines", scope: !2, file: !3, line: 546, type: !94, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "chars_per_line", scope: !2, file: !3, line: 543, type: !30, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "explicit_columns", scope: !2, file: !3, line: 500, type: !94, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 518, type: !94, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "failed_opens", scope: !2, file: !3, line: 597, type: !94, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261)
!261 = distinct !DIGlobalVariable(name: "lines_per_body", scope: !2, file: !3, line: 538, type: !30, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "line_separator", scope: !2, file: !3, line: 694, type: !32, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "column_separator", scope: !2, file: !3, line: 693, type: !32, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 661, type: !30, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "chars_per_column", scope: !2, file: !3, line: 554, type: !30, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "number_buff", scope: !2, file: !3, line: 664, type: !32, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "clump_buff", scope: !2, file: !3, line: 724, type: !32, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275)
!275 = distinct !DIGlobalVariable(name: "total_files", scope: !2, file: !3, line: 679, type: !30, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277)
!277 = distinct !DIGlobalVariable(name: "column_vector", scope: !2, file: !3, line: 450, type: !278, isLocal: true, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLUMN", file: !3, line: 417, baseType: !20)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "timespec", scope: !282, file: !3, line: 1642, type: !313, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "init_header", scope: !3, file: !3, line: 1627, type: !283, isLocal: true, isDefinition: true, scopeLine: 1628, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !87, !30}
!285 = !{!286, !287, !288, !289, !326, !327, !328, !343, !346, !347, !349, !350, !353}
!286 = !DILocalVariable(name: "filename", arg: 1, scope: !282, file: !3, line: 1627, type: !87)
!287 = !DILocalVariable(name: "desc", arg: 2, scope: !282, file: !3, line: 1627, type: !30)
!288 = !DILocalVariable(name: "buf", scope: !282, file: !3, line: 1629, type: !32)
!289 = !DILocalVariable(name: "st", scope: !282, file: !3, line: 1630, type: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !291, line: 46, size: 1152, elements: !292)
!291 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!292 = !{!293, !295, !297, !299, !301, !303, !305, !306, !307, !308, !310, !312, !320, !321, !322}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !290, file: !291, line: 48, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !57, line: 133, baseType: !80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !290, file: !291, line: 53, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !57, line: 136, baseType: !80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !290, file: !291, line: 61, baseType: !298, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !57, line: 139, baseType: !80)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !290, file: !291, line: 62, baseType: !300, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !57, line: 138, baseType: !150)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !290, file: !291, line: 64, baseType: !302, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !57, line: 134, baseType: !150)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !290, file: !291, line: 65, baseType: !304, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !57, line: 135, baseType: !150)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !290, file: !291, line: 67, baseType: !30, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !290, file: !291, line: 69, baseType: !294, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !290, file: !291, line: 74, baseType: !56, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !290, file: !291, line: 78, baseType: !309, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !57, line: 162, baseType: !58)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !290, file: !291, line: 80, baseType: !311, size: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !57, line: 167, baseType: !58)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !290, file: !291, line: 91, baseType: !313, size: 128, offset: 576)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !314, line: 8, size: 128, elements: !315)
!314 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !313, file: !314, line: 10, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !57, line: 148, baseType: !58)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !313, file: !314, line: 11, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !57, line: 184, baseType: !58)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !290, file: !291, line: 92, baseType: !313, size: 128, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !290, file: !291, line: 93, baseType: !313, size: 128, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !290, file: !291, line: 106, baseType: !323, size: 192, offset: 960)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 192, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 3)
!326 = !DILocalVariable(name: "t", scope: !282, file: !3, line: 1631, type: !313)
!327 = !DILocalVariable(name: "ns", scope: !282, file: !3, line: 1632, type: !30)
!328 = !DILocalVariable(name: "tm", scope: !282, file: !3, line: 1633, type: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !330, line: 8, size: 448, elements: !331)
!330 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !329, file: !330, line: 10, baseType: !30, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !329, file: !330, line: 11, baseType: !30, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !329, file: !330, line: 12, baseType: !30, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !329, file: !330, line: 13, baseType: !30, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !329, file: !330, line: 14, baseType: !30, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !329, file: !330, line: 15, baseType: !30, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !329, file: !330, line: 16, baseType: !30, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !329, file: !330, line: 17, baseType: !30, size: 32, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !329, file: !330, line: 18, baseType: !30, size: 32, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !329, file: !330, line: 21, baseType: !58, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !329, file: !330, line: 22, baseType: !87, size: 64, offset: 384)
!343 = !DILocalVariable(name: "__s1_len", scope: !344, file: !3, line: 1636, type: !78)
!344 = distinct !DILexicalBlock(scope: !345, file: !3, line: 1636, column: 7)
!345 = distinct !DILexicalBlock(scope: !282, file: !3, line: 1636, column: 7)
!346 = !DILocalVariable(name: "__s2_len", scope: !344, file: !3, line: 1636, type: !78)
!347 = !DILocalVariable(name: "__s2", scope: !348, file: !3, line: 1636, type: !157)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 1636, column: 7)
!349 = !DILocalVariable(name: "__result", scope: !348, file: !3, line: 1636, type: !30)
!350 = !DILocalVariable(name: "bufsize", scope: !351, file: !3, line: 1651, type: !78)
!351 = distinct !DILexicalBlock(scope: !352, file: !3, line: 1650, column: 5)
!352 = distinct !DILexicalBlock(scope: !282, file: !3, line: 1649, column: 7)
!353 = !DILocalVariable(name: "secbuf", scope: !354, file: !3, line: 1658, type: !355)
!354 = distinct !DILexicalBlock(scope: !352, file: !3, line: 1657, column: 5)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 168, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 21)
!358 = !DIGlobalVariableExpression(var: !359)
!359 = distinct !DIGlobalVariable(name: "date_text", scope: !2, file: !3, line: 718, type: !32, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361)
!361 = distinct !DIGlobalVariable(name: "file_text", scope: !2, file: !3, line: 719, type: !87, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "header_width_available", scope: !2, file: !3, line: 722, type: !30, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "files_ready_to_read", scope: !2, file: !3, line: 616, type: !30, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367)
!367 = distinct !DIGlobalVariable(name: "line_vector", scope: !2, file: !3, line: 470, type: !181, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369)
!369 = distinct !DIGlobalVariable(name: "end_vector", scope: !2, file: !3, line: 477, type: !181, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "buff", scope: !2, file: !3, line: 456, type: !32, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373)
!373 = distinct !DIGlobalVariable(name: "buff_allocated", scope: !2, file: !3, line: 464, type: !78, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375)
!375 = distinct !DIGlobalVariable(name: "last_line", scope: !2, file: !3, line: 730, type: !94, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377)
!377 = distinct !DIGlobalVariable(name: "page_number", scope: !2, file: !3, line: 619, type: !187, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "buff_current", scope: !2, file: !3, line: 460, type: !150, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381)
!381 = distinct !DIGlobalVariable(name: "pad_vertically", scope: !2, file: !3, line: 706, type: !94, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383)
!383 = distinct !DIGlobalVariable(name: "print_a_header", scope: !2, file: !3, line: 512, type: !94, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385)
!385 = distinct !DIGlobalVariable(name: "padding_not_printed", scope: !2, file: !3, line: 702, type: !30, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387)
!387 = distinct !DIGlobalVariable(name: "separators_not_printed", scope: !2, file: !3, line: 698, type: !30, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389)
!389 = distinct !DIGlobalVariable(name: "spaces_not_printed", scope: !2, file: !3, line: 578, type: !30, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391)
!391 = distinct !DIGlobalVariable(name: "output_position", scope: !2, file: !3, line: 587, type: !30, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393)
!393 = distinct !DIGlobalVariable(name: "input_position", scope: !2, file: !3, line: 593, type: !30, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395)
!395 = distinct !DIGlobalVariable(name: "FF_only", scope: !2, file: !3, line: 495, type: !94, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397)
!397 = distinct !DIGlobalVariable(name: "print_a_FF", scope: !2, file: !3, line: 508, type: !94, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399)
!399 = distinct !DIGlobalVariable(name: "align_empty_cols", scope: !2, file: !3, line: 484, type: !94, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401)
!401 = distinct !DIGlobalVariable(name: "empty_line", scope: !2, file: !3, line: 488, type: !94, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403)
!403 = distinct !DIGlobalVariable(name: "line_count", scope: !2, file: !3, line: 644, type: !30, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405)
!405 = distinct !DIGlobalVariable(name: "line_number", scope: !2, file: !3, line: 634, type: !30, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407)
!407 = distinct !DIGlobalVariable(name: "infomap", scope: !408, file: !409, line: 632, type: !433, isLocal: true, isDefinition: true)
!408 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !409, file: !409, line: 630, type: !410, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !412)
!409 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!410 = !DISubroutineType(types: !411)
!411 = !{null, !87}
!412 = !{!413, !414, !415, !422, !424, !425, !426, !429, !430, !432}
!413 = !DILocalVariable(name: "program", arg: 1, scope: !408, file: !409, line: 630, type: !87)
!414 = !DILocalVariable(name: "node", scope: !408, file: !409, line: 642, type: !87)
!415 = !DILocalVariable(name: "map_prog", scope: !408, file: !409, line: 643, type: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !408, file: !409, line: 632, size: 128, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !418, file: !409, line: 632, baseType: !87, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !418, file: !409, line: 632, baseType: !87, size: 64, offset: 64)
!422 = !DILocalVariable(name: "__s1_len", scope: !423, file: !409, line: 645, type: !78)
!423 = distinct !DILexicalBlock(scope: !408, file: !409, line: 645, column: 33)
!424 = !DILocalVariable(name: "__s2_len", scope: !423, file: !409, line: 645, type: !78)
!425 = !DILocalVariable(name: "lc_messages", scope: !408, file: !409, line: 655, type: !87)
!426 = !DILocalVariable(name: "__s1_len", scope: !427, file: !409, line: 656, type: !78)
!427 = distinct !DILexicalBlock(scope: !428, file: !409, line: 656, column: 22)
!428 = distinct !DILexicalBlock(scope: !408, file: !409, line: 656, column: 7)
!429 = !DILocalVariable(name: "__s2_len", scope: !427, file: !409, line: 656, type: !78)
!430 = !DILocalVariable(name: "__s2", scope: !431, file: !409, line: 656, type: !157)
!431 = distinct !DILexicalBlock(scope: !427, file: !409, line: 656, column: 22)
!432 = !DILocalVariable(name: "__result", scope: !431, file: !409, line: 656, type: !30)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 896, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 7)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 424, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 53)
!439 = !DIGlobalVariableExpression(var: !440)
!440 = distinct !DIGlobalVariable(name: "Version", scope: !441, file: !442, line: 2, type: !87, isDefinition: true)
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, globals: !444)
!442 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!443 = !{}
!444 = !{!439}
!445 = !DIGlobalVariableExpression(var: !446)
!446 = distinct !DIGlobalVariable(name: "file_name", scope: !447, file: !452, line: 36, type: !87, isLocal: true, isDefinition: true)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, globals: !449)
!448 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!449 = !{!445, !450}
!450 = !DIGlobalVariableExpression(var: !451)
!451 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !447, file: !452, line: 46, type: !94, isLocal: true, isDefinition: true)
!452 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!453 = !DIGlobalVariableExpression(var: !454)
!454 = distinct !DIGlobalVariable(name: "exit_failure", scope: !455, file: !458, line: 24, type: !459, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, globals: !457)
!456 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!457 = !{!453}
!458 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!460 = !DIGlobalVariableExpression(var: !461)
!461 = distinct !DIGlobalVariable(name: "program_name", scope: !462, file: !466, line: 33, type: !87, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !464, globals: !465)
!463 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!464 = !{!73, !32}
!465 = !{!460}
!466 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!467 = !DIGlobalVariableExpression(var: !468)
!468 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !469, file: !481, line: 77, type: !516, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !471, retainedTypes: !477, globals: !478)
!470 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!471 = !{!111, !472, !134}
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !112, line: 242, size: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!475 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!476 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!477 = !{!30, !60, !78, !32}
!478 = !{!467, !479, !486, !498, !500, !505, !512, !514}
!479 = !DIGlobalVariableExpression(var: !480)
!480 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !469, file: !481, line: 93, type: !482, isDefinition: true)
!481 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 320, elements: !484)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!484 = !{!485}
!485 = !DISubrange(count: 10)
!486 = !DIGlobalVariableExpression(var: !487)
!487 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !469, file: !481, line: 1043, type: !488, isDefinition: true)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !481, line: 57, size: 448, elements: !489)
!489 = !{!490, !491, !492, !496, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !488, file: !481, line: 60, baseType: !111, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !488, file: !481, line: 63, baseType: !30, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !488, file: !481, line: 67, baseType: !493, size: 256, offset: 64)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 8)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !488, file: !481, line: 70, baseType: !87, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !488, file: !481, line: 73, baseType: !87, size: 64, offset: 384)
!498 = !DIGlobalVariableExpression(var: !499)
!499 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !469, file: !481, line: 108, type: !488, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501)
!501 = distinct !DIGlobalVariable(name: "slot0", scope: !469, file: !481, line: 834, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 256)
!505 = !DIGlobalVariableExpression(var: !506)
!506 = distinct !DIGlobalVariable(name: "slotvec", scope: !469, file: !481, line: 837, type: !507, isLocal: true, isDefinition: true)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !481, line: 826, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !508, file: !481, line: 828, baseType: !78, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !508, file: !481, line: 829, baseType: !32, size: 64, offset: 64)
!512 = !DIGlobalVariableExpression(var: !513)
!513 = distinct !DIGlobalVariable(name: "nslots", scope: !469, file: !481, line: 835, type: !30, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515)
!515 = distinct !DIGlobalVariable(name: "slotvec0", scope: !469, file: !481, line: 836, type: !508, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 704, elements: !518)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!518 = !{!519}
!519 = !DISubrange(count: 11)
!520 = !DIGlobalVariableExpression(var: !521)
!521 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !522, file: !525, line: 26, type: !526, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, globals: !524)
!523 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!524 = !{!520}
!525 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 376, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 47)
!529 = !DIGlobalVariableExpression(var: !530)
!530 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !531, file: !532, line: 335, type: !30, isLocal: true, isDefinition: true)
!531 = distinct !DISubprogram(name: "rpl_fcntl", scope: !532, file: !532, line: 272, type: !533, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !535, variables: !538)
!532 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!533 = !DISubroutineType(types: !534)
!534 = !{!30, !30, !30, null}
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, globals: !537)
!536 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!537 = !{!529}
!538 = !{!539, !540, !541, !552, !553, !556, !559, !562}
!539 = !DILocalVariable(name: "fd", arg: 1, scope: !531, file: !532, line: 272, type: !30)
!540 = !DILocalVariable(name: "action", arg: 2, scope: !531, file: !532, line: 272, type: !30)
!541 = !DILocalVariable(name: "arg", scope: !531, file: !532, line: 274, type: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !543, line: 30, baseType: !544)
!543 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !536, line: 274, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 192, elements: !65)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !536, line: 274, size: 192, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !546, file: !536, line: 274, baseType: !150, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !546, file: !536, line: 274, baseType: !150, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !546, file: !536, line: 274, baseType: !73, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !546, file: !536, line: 274, baseType: !73, size: 64, offset: 128)
!552 = !DILocalVariable(name: "result", scope: !531, file: !532, line: 275, type: !30)
!553 = !DILocalVariable(name: "target", scope: !554, file: !532, line: 322, type: !30)
!554 = distinct !DILexicalBlock(scope: !555, file: !532, line: 321, column: 7)
!555 = distinct !DILexicalBlock(scope: !531, file: !532, line: 278, column: 5)
!556 = !DILocalVariable(name: "flags", scope: !557, file: !532, line: 359, type: !30)
!557 = distinct !DILexicalBlock(scope: !558, file: !532, line: 358, column: 11)
!558 = distinct !DILexicalBlock(scope: !554, file: !532, line: 357, column: 13)
!559 = !DILocalVariable(name: "saved_errno", scope: !560, file: !532, line: 362, type: !30)
!560 = distinct !DILexicalBlock(scope: !561, file: !532, line: 361, column: 15)
!561 = distinct !DILexicalBlock(scope: !557, file: !532, line: 360, column: 17)
!562 = !DILocalVariable(name: "p", scope: !563, file: !532, line: 404, type: !73)
!563 = distinct !DILexicalBlock(scope: !555, file: !532, line: 402, column: 7)
!564 = !DIGlobalVariableExpression(var: !565)
!565 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !566, file: !909, line: 120, type: !910, isLocal: true, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !568, retainedTypes: !907, globals: !908)
!567 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!568 = !{!569}
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 41, size: 32, elements: !571)
!570 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906}
!572 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!573 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!574 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!575 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!576 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!577 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!578 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!579 = !DIEnumerator(name: "DAY_1", value: 131079)
!580 = !DIEnumerator(name: "DAY_2", value: 131080)
!581 = !DIEnumerator(name: "DAY_3", value: 131081)
!582 = !DIEnumerator(name: "DAY_4", value: 131082)
!583 = !DIEnumerator(name: "DAY_5", value: 131083)
!584 = !DIEnumerator(name: "DAY_6", value: 131084)
!585 = !DIEnumerator(name: "DAY_7", value: 131085)
!586 = !DIEnumerator(name: "ABMON_1", value: 131086)
!587 = !DIEnumerator(name: "ABMON_2", value: 131087)
!588 = !DIEnumerator(name: "ABMON_3", value: 131088)
!589 = !DIEnumerator(name: "ABMON_4", value: 131089)
!590 = !DIEnumerator(name: "ABMON_5", value: 131090)
!591 = !DIEnumerator(name: "ABMON_6", value: 131091)
!592 = !DIEnumerator(name: "ABMON_7", value: 131092)
!593 = !DIEnumerator(name: "ABMON_8", value: 131093)
!594 = !DIEnumerator(name: "ABMON_9", value: 131094)
!595 = !DIEnumerator(name: "ABMON_10", value: 131095)
!596 = !DIEnumerator(name: "ABMON_11", value: 131096)
!597 = !DIEnumerator(name: "ABMON_12", value: 131097)
!598 = !DIEnumerator(name: "MON_1", value: 131098)
!599 = !DIEnumerator(name: "MON_2", value: 131099)
!600 = !DIEnumerator(name: "MON_3", value: 131100)
!601 = !DIEnumerator(name: "MON_4", value: 131101)
!602 = !DIEnumerator(name: "MON_5", value: 131102)
!603 = !DIEnumerator(name: "MON_6", value: 131103)
!604 = !DIEnumerator(name: "MON_7", value: 131104)
!605 = !DIEnumerator(name: "MON_8", value: 131105)
!606 = !DIEnumerator(name: "MON_9", value: 131106)
!607 = !DIEnumerator(name: "MON_10", value: 131107)
!608 = !DIEnumerator(name: "MON_11", value: 131108)
!609 = !DIEnumerator(name: "MON_12", value: 131109)
!610 = !DIEnumerator(name: "AM_STR", value: 131110)
!611 = !DIEnumerator(name: "PM_STR", value: 131111)
!612 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!613 = !DIEnumerator(name: "D_FMT", value: 131113)
!614 = !DIEnumerator(name: "T_FMT", value: 131114)
!615 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!616 = !DIEnumerator(name: "ERA", value: 131116)
!617 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!618 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!619 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!620 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!621 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!622 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!623 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!624 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!625 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!626 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!627 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!628 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!629 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!630 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!631 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!632 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!633 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!634 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!635 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!636 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!637 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!638 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!639 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!640 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!641 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!642 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!643 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!644 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!645 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!646 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!647 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!648 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!649 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!650 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!651 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!652 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!653 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!654 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!655 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!656 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!657 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!658 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!659 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!660 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!661 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!662 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!663 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!664 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!665 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!666 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!667 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!668 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!669 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!670 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!671 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!672 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!673 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!674 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!675 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!676 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!677 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!678 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!679 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!680 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!681 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!682 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!683 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!684 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!685 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!686 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!687 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!688 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!689 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!690 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!691 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!692 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!693 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!694 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!695 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!696 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!697 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!698 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!699 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!700 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!701 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!702 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!703 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!704 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!705 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!706 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!707 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!708 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!709 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!710 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!711 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!712 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!713 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!714 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!715 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!716 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!717 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!718 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!719 = !DIEnumerator(name: "CODESET", value: 14)
!720 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!721 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!722 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!723 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!766 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!767 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!768 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!769 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!770 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!771 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!772 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!773 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!774 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!775 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!776 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!777 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!784 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!785 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!786 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!787 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!788 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!791 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!792 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!793 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!794 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!795 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!796 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!797 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!798 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!799 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!800 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!801 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!802 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!803 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!804 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!805 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!806 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!807 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!808 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!809 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!810 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!811 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!812 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!813 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!824 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!830 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!831 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!832 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!834 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!835 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!836 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!837 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!838 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!839 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!840 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!841 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!842 = !DIEnumerator(name: "THOUSEP", value: 65537)
!843 = !DIEnumerator(name: "__GROUPING", value: 65538)
!844 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!845 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!846 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!847 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!848 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!849 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!850 = !DIEnumerator(name: "__YESSTR", value: 327682)
!851 = !DIEnumerator(name: "__NOSTR", value: 327683)
!852 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!853 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!854 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!855 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!856 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!857 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!858 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!859 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!860 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!861 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!862 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!863 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!864 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!865 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!866 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!867 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!868 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!869 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!870 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!871 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!872 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!873 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!874 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!875 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!876 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!877 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!878 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!879 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!880 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!881 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!882 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!883 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!884 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!885 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!886 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!887 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!888 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!898 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!899 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!905 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!906 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!907 = !{!73, !32, !159}
!908 = !{!564}
!909 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!910 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!911 = !DIGlobalVariableExpression(var: !912)
!912 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !913, file: !919, line: 124, type: !932, isLocal: true, isDefinition: true)
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !915, globals: !916)
!914 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!915 = !{!150, !30, !62, !151, !152, !60, !58, !80, !153, !154}
!916 = !{!917, !923, !926, !911}
!917 = !DIGlobalVariableExpression(var: !918, expr: !922)
!918 = distinct !DIGlobalVariable(name: "mktime_min", scope: !913, file: !919, line: 95, type: !920, isLocal: true, isDefinition: true)
!919 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !919, line: 68, baseType: !58)
!922 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!923 = !DIGlobalVariableExpression(var: !924, expr: !925)
!924 = distinct !DIGlobalVariable(name: "mktime_max", scope: !913, file: !919, line: 98, type: !920, isLocal: true, isDefinition: true)
!925 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!926 = !DIGlobalVariableExpression(var: !927)
!927 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !913, file: !919, line: 462, type: !928, isLocal: true, isDefinition: true)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !929, line: 30, baseType: !930)
!929 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !931, line: 8, baseType: !317)
!931 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 416, elements: !934)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!934 = !{!935, !936}
!935 = !DISubrange(count: 2)
!936 = !DISubrange(count: 13)
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !939)
!938 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!939 = !{!125}
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443)
!941 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!942 = distinct !DICompileUnit(language: DW_LANG_C99, file: !943, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443)
!943 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!944 = distinct !DICompileUnit(language: DW_LANG_C99, file: !945, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !946)
!945 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!946 = !{!78, !155, !157, !87}
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !949)
!948 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !188, line: 135, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !57, line: 61, baseType: !58)
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !954, retainedTypes: !955)
!953 = !DIFile(filename: "./lib/mbswidth.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!954 = !{!134}
!955 = !{!78, !151, !30, !60}
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !958)
!957 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!958 = !{!87, !150, !78, !73, !155, !30, !151}
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443)
!960 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !963, retainedTypes: !968)
!962 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!963 = !{!964}
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !965, line: 41, size: 32, elements: !966)
!965 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!966 = !{!967}
!967 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!968 = !{!73}
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !971, retainedTypes: !985)
!970 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!971 = !{!972}
!972 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !974, file: !973, line: 192, size: 32, elements: !983)
!973 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!974 = distinct !DISubprogram(name: "x2nrealloc", scope: !973, file: !973, line: 180, type: !975, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !969, variables: !978)
!975 = !DISubroutineType(types: !976)
!976 = !{!73, !73, !977, !78}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!978 = !{!979, !980, !981, !982}
!979 = !DILocalVariable(name: "p", arg: 1, scope: !974, file: !973, line: 180, type: !73)
!980 = !DILocalVariable(name: "pn", arg: 2, scope: !974, file: !973, line: 180, type: !977)
!981 = !DILocalVariable(name: "s", arg: 3, scope: !974, file: !973, line: 180, type: !78)
!982 = !DILocalVariable(name: "n", scope: !974, file: !973, line: 182, type: !78)
!983 = !{!984}
!984 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!985 = !{!78, !32, !73}
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443)
!987 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !990)
!989 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!990 = !{!5}
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !990, retainedTypes: !993)
!992 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!993 = !{!32}
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !990, retainedTypes: !993)
!995 = !DIFile(filename: "./lib/xstrtol.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !990)
!997 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1000, retainedTypes: !1001)
!999 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1000 = !{!5, !134}
!1001 = !{!30, !60, !32}
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !968)
!1003 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1005, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443)
!1005 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !968)
!1007 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1008 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1009, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !968)
!1009 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443, retainedTypes: !1012)
!1011 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1012 = !{!78}
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1015, retainedTypes: !993, globals: !1020)
!1014 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1015 = !{!1016}
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1017, line: 49, size: 32, elements: !1018)
!1017 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1018 = !{!1019}
!1019 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!1020 = !{!1021}
!1021 = !DIGlobalVariableExpression(var: !1022)
!1022 = distinct !DIGlobalVariable(name: "local_tz", scope: !1013, file: !1017, line: 54, type: !1023, isLocal: true, isDefinition: true)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !168, line: 594, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1027, line: 21, size: 128, elements: !1028)
!1027 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !1027, line: 25, baseType: !1025, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1026, file: !1027, line: 36, baseType: !33, size: 8, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1026, file: !1027, line: 48, baseType: !1032, offset: 72)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: -1)
!1035 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1036, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !443)
!1036 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1037 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!1038 = !{i32 2, !"Dwarf Version", i32 4}
!1039 = !{i32 2, !"Debug Info Version", i32 3}
!1040 = !{i32 1, !"PIC Level", i32 2}
!1041 = !{i32 1, !"PIE Level", i32 2}
!1042 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 857, type: !1043, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1046)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!30, !30, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1059, !1060, !1063}
!1047 = !DILocalVariable(name: "argc", arg: 1, scope: !1042, file: !3, line: 857, type: !30)
!1048 = !DILocalVariable(name: "argv", arg: 2, scope: !1042, file: !3, line: 857, type: !1045)
!1049 = !DILocalVariable(name: "n_files", scope: !1042, file: !3, line: 859, type: !150)
!1050 = !DILocalVariable(name: "old_options", scope: !1042, file: !3, line: 860, type: !94)
!1051 = !DILocalVariable(name: "old_w", scope: !1042, file: !3, line: 861, type: !94)
!1052 = !DILocalVariable(name: "old_s", scope: !1042, file: !3, line: 862, type: !94)
!1053 = !DILocalVariable(name: "file_names", scope: !1042, file: !3, line: 863, type: !1045)
!1054 = !DILocalVariable(name: "column_count_string", scope: !1042, file: !3, line: 866, type: !32)
!1055 = !DILocalVariable(name: "n_digits", scope: !1042, file: !3, line: 867, type: !78)
!1056 = !DILocalVariable(name: "n_alloc", scope: !1042, file: !3, line: 868, type: !78)
!1057 = !DILocalVariable(name: "oi", scope: !1058, file: !3, line: 885, type: !30)
!1058 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 884, column: 5)
!1059 = !DILocalVariable(name: "c", scope: !1058, file: !3, line: 886, type: !30)
!1060 = !DILocalVariable(name: "tmp_cpl", scope: !1061, file: !3, line: 1032, type: !30)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 1031, column: 11)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 904, column: 9)
!1063 = !DILocalVariable(name: "i", scope: !1064, file: !3, line: 1139, type: !150)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1138, column: 9)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 1135, column: 11)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 1134, column: 5)
!1067 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 1128, column: 7)
!1068 = !DIExpression()
!1069 = !DILocation(line: 857, column: 11, scope: !1042)
!1070 = !DILocation(line: 857, column: 24, scope: !1042)
!1071 = !DILocation(line: 860, column: 8, scope: !1042)
!1072 = !DILocation(line: 861, column: 8, scope: !1042)
!1073 = !DILocation(line: 862, column: 8, scope: !1042)
!1074 = !DILocation(line: 866, column: 9, scope: !1042)
!1075 = !DILocation(line: 867, column: 10, scope: !1042)
!1076 = !DILocation(line: 868, column: 3, scope: !1042)
!1077 = !DILocation(line: 868, column: 10, scope: !1042)
!1078 = !{!1079, !1079, i64 0}
!1079 = !{!"long", !1080, i64 0}
!1080 = !{!"omnipotent char", !1081, i64 0}
!1081 = !{!"Simple C/C++ TBAA"}
!1082 = !DILocation(line: 871, column: 21, scope: !1042)
!1083 = !{!1084, !1084, i64 0}
!1084 = !{!"any pointer", !1080, i64 0}
!1085 = !DILocation(line: 871, column: 3, scope: !1042)
!1086 = !DILocation(line: 872, column: 3, scope: !1042)
!1087 = !DILocation(line: 873, column: 3, scope: !1042)
!1088 = !DILocation(line: 874, column: 3, scope: !1042)
!1089 = !DILocation(line: 876, column: 3, scope: !1042)
!1090 = !DILocation(line: 859, column: 16, scope: !1042)
!1091 = !DILocation(line: 879, column: 22, scope: !1042)
!1092 = !DILocation(line: 879, column: 17, scope: !1042)
!1093 = !DILocalVariable(name: "n", arg: 1, scope: !1094, file: !973, line: 105, type: !78)
!1094 = distinct !DISubprogram(name: "xnmalloc", scope: !973, file: !973, line: 105, type: !1095, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1097)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!73, !78, !78}
!1097 = !{!1093, !1098}
!1098 = !DILocalVariable(name: "s", arg: 2, scope: !1094, file: !973, line: 105, type: !78)
!1099 = !DILocation(line: 105, column: 18, scope: !1094, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 880, column: 19, scope: !1042)
!1101 = !DILocation(line: 105, column: 28, scope: !1094, inlinedAt: !1100)
!1102 = !DILocation(line: 880, column: 34, scope: !1042)
!1103 = !DILocation(line: 880, column: 29, scope: !1042)
!1104 = !DILocation(line: 109, column: 21, scope: !1094, inlinedAt: !1100)
!1105 = !DILocation(line: 109, column: 10, scope: !1094, inlinedAt: !1100)
!1106 = !DILocation(line: 879, column: 17, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1042, file: !3, discriminator: 1)
!1108 = !DILocation(line: 879, column: 17, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1042, file: !3, discriminator: 3)
!1110 = !DILocation(line: 879, column: 16, scope: !1109)
!1111 = !DILocation(line: 863, column: 10, scope: !1042)
!1112 = !DILocation(line: 885, column: 7, scope: !1058)
!1113 = !DILocation(line: 885, column: 11, scope: !1058)
!1114 = !{!1115, !1115, i64 0}
!1115 = !{!"int", !1080, i64 0}
!1116 = !DIExpression(DW_OP_deref)
!1117 = !DILocation(line: 886, column: 15, scope: !1058)
!1118 = !DILocation(line: 886, column: 11, scope: !1058)
!1119 = !DILocation(line: 887, column: 13, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 887, column: 11)
!1121 = !DILocation(line: 887, column: 11, scope: !1058)
!1122 = !DILocation(line: 890, column: 11, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 890, column: 11)
!1124 = !DILocation(line: 1051, column: 5, scope: !1042)
!1125 = !DILocation(line: 1053, column: 7, scope: !1042)
!1126 = !DILocation(line: 890, column: 11, scope: !1058)
!1127 = !DILocation(line: 893, column: 24, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 893, column: 15)
!1129 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 891, column: 9)
!1130 = !DILocation(line: 893, column: 31, scope: !1128)
!1131 = !DILocation(line: 893, column: 28, scope: !1128)
!1132 = !DILocation(line: 893, column: 15, scope: !1129)
!1133 = !DILocation(line: 895, column: 17, scope: !1128)
!1134 = !DILocation(line: 894, column: 13, scope: !1128)
!1135 = !DILocation(line: 896, column: 45, scope: !1129)
!1136 = !DILocation(line: 896, column: 11, scope: !1129)
!1137 = !DILocation(line: 896, column: 43, scope: !1129)
!1138 = !{!1080, !1080, i64 0}
!1139 = !DILocation(line: 897, column: 11, scope: !1129)
!1140 = !DILocation(line: 897, column: 41, scope: !1129)
!1141 = !DILocation(line: 898, column: 11, scope: !1129)
!1142 = distinct !{!1142, !1143, !1124}
!1143 = !DILocation(line: 883, column: 3, scope: !1042)
!1144 = !DILocation(line: 903, column: 7, scope: !1058)
!1145 = !DILocation(line: 907, column: 18, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 907, column: 15)
!1147 = !DILocation(line: 907, column: 36, scope: !1146)
!1148 = !DILocation(line: 908, column: 18, scope: !1146)
!1149 = !DILocation(line: 908, column: 22, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1146, file: !3, discriminator: 1)
!1151 = !DILocation(line: 908, column: 21, scope: !1150)
!1152 = !DILocation(line: 908, column: 29, scope: !1150)
!1153 = !DILocation(line: 908, column: 36, scope: !1150)
!1154 = !DILocation(line: 908, column: 72, scope: !1155)
!1155 = !DILexicalBlockFile(scope: !1146, file: !3, discriminator: 2)
!1156 = !DILocation(line: 908, column: 39, scope: !1155)
!1157 = !DILocation(line: 907, column: 15, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1062, file: !3, discriminator: 1)
!1159 = !DILocation(line: 909, column: 37, scope: !1146)
!1160 = !DILocation(line: 909, column: 31, scope: !1146)
!1161 = !DILocation(line: 909, column: 13, scope: !1146)
!1162 = !DILocation(line: 909, column: 35, scope: !1146)
!1163 = !DILocation(line: 914, column: 19, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 914, column: 17)
!1165 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 913, column: 11)
!1166 = !DILocation(line: 914, column: 17, scope: !1165)
!1167 = !DILocation(line: 915, column: 15, scope: !1164)
!1168 = !DILocation(line: 915, column: 15, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1164, file: !3, discriminator: 1)
!1170 = !DILocation(line: 917, column: 41, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 917, column: 22)
!1172 = !DILocation(line: 917, column: 24, scope: !1171)
!1173 = !DILocation(line: 917, column: 22, scope: !1164)
!1174 = !DILocation(line: 918, column: 15, scope: !1171)
!1175 = !DILocation(line: 918, column: 15, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1171, file: !3, discriminator: 1)
!1177 = !DILocation(line: 918, column: 15, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1171, file: !3, discriminator: 2)
!1179 = !DILocation(line: 925, column: 33, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 924, column: 11)
!1181 = !DILocalVariable(name: "s", arg: 1, scope: !1182, file: !3, line: 838, type: !87)
!1182 = distinct !DISubprogram(name: "parse_column_count", scope: !3, file: !3, line: 838, type: !410, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1183)
!1183 = !{!1181}
!1184 = !DILocation(line: 838, column: 33, scope: !1182, inlinedAt: !1185)
!1185 = distinct !DILocation(line: 925, column: 13, scope: !1180)
!1186 = !DILocation(line: 840, column: 30, scope: !1182, inlinedAt: !1185)
!1187 = !DILocalVariable(name: "n_str", arg: 1, scope: !1188, file: !3, line: 1156, type: !87)
