!llvm.dbg.cu = !{!2, !374, !829, !380, !388, !833, !836, !395, !839, !406, !413, !1062, !1066, !1087, !464, !1094, !1110, !1112, !1114, !1116, !1118, !1120, !473, !1123, !1125, !483}
!llvm.ident = !{!1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128, !1128}
!llvm.module.flags = !{!1129, !1130, !1131, !1132}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "page_size", scope: !2, file: !3, line: 75, type: !54, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !66)
!3 = !DIFile(filename: "src/wc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !26, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !20, line: 25, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/argv-iter.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "AI_ERR_OK", value: 1)
!23 = !DIEnumerator(name: "AI_ERR_EOF", value: 2)
!24 = !DIEnumerator(name: "AI_ERR_MEM", value: 3)
!25 = !DIEnumerator(name: "AI_ERR_READ", value: 4)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 45, size: 32, elements: !28)
!27 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!30 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!31 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!32 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!33 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!34 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, size: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256)
!39 = !DIEnumerator(name: "_ISlower", value: 512)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!43 = !DIEnumerator(name: "_ISspace", value: 8192)
!44 = !DIEnumerator(name: "_ISprint", value: 16384)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768)
!46 = !DIEnumerator(name: "_ISblank", value: 1)
!47 = !DIEnumerator(name: "_IScntrl", value: 2)
!48 = !DIEnumerator(name: "_ISpunct", value: 4)
!49 = !DIEnumerator(name: "_ISalnum", value: 8)
!50 = !{!51, !53, !54, !57, !59, !62, !64, !65, !61}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 62, baseType: !56)
!55 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!66 = !{!67, !281, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !0, !308, !338, !352}
!67 = !DIGlobalVariableExpression(var: !68)
!68 = distinct !DIGlobalVariable(name: "stdin_only", scope: !69, file: !3, line: 765, type: !280, isLocal: true, isDefinition: true)
!69 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 648, type: !70, isDefinition: true, scopeLine: 649, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !73)
!70 = !DISubroutineType(types: !71)
!71 = !{!64, !64, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!73 = !{!74, !75, !76, !78, !79, !80, !81, !82, !128, !188, !189, !192, !247, !250, !251, !253, !254, !255, !256, !260, !261, !262, !265, !266, !268, !269, !271, !272, !274, !275}
!74 = !DILocalVariable(name: "argc", arg: 1, scope: !69, file: !3, line: 648, type: !64)
!75 = !DILocalVariable(name: "argv", arg: 2, scope: !69, file: !3, line: 648, type: !72)
!76 = !DILocalVariable(name: "ok", scope: !69, file: !3, line: 650, type: !77)
!77 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!78 = !DILocalVariable(name: "optc", scope: !69, file: !3, line: 651, type: !64)
!79 = !DILocalVariable(name: "nfiles", scope: !69, file: !3, line: 652, type: !54)
!80 = !DILocalVariable(name: "files", scope: !69, file: !3, line: 653, type: !72)
!81 = !DILocalVariable(name: "files_from", scope: !69, file: !3, line: 654, type: !51)
!82 = !DILocalVariable(name: "fstatus", scope: !69, file: !3, line: 655, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !3, line: 78, size: 1216, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !84, file: !3, line: 82, baseType: !64, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !84, file: !3, line: 85, baseType: !88, size: 1152, offset: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !89, line: 46, size: 1152, elements: !90)
!89 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91, !94, !96, !98, !101, !103, !105, !106, !107, !110, !112, !114, !122, !123, !124}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !88, file: !89, line: 48, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !93, line: 133, baseType: !56)
!93 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !88, file: !89, line: 53, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !93, line: 136, baseType: !56)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !88, file: !89, line: 61, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !93, line: 139, baseType: !56)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !88, file: !89, line: 62, baseType: !99, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !93, line: 138, baseType: !100)
!100 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !88, file: !89, line: 64, baseType: !102, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !93, line: 134, baseType: !100)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !88, file: !89, line: 65, baseType: !104, size: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !93, line: 135, baseType: !100)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !88, file: !89, line: 67, baseType: !64, size: 32, offset: 288)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !88, file: !89, line: 69, baseType: !92, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !88, file: !89, line: 74, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 140, baseType: !109)
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !88, file: !89, line: 78, baseType: !111, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !93, line: 162, baseType: !109)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !88, file: !89, line: 80, baseType: !113, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !93, line: 167, baseType: !109)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !88, file: !89, line: 91, baseType: !115, size: 128, offset: 576)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !116, line: 8, size: 128, elements: !117)
!116 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !{!118, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !115, file: !116, line: 10, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !93, line: 148, baseType: !109)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !115, file: !116, line: 11, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !93, line: 184, baseType: !109)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !88, file: !89, line: 92, baseType: !115, size: 128, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !88, file: !89, line: 93, baseType: !115, size: 128, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !88, file: !89, line: 106, baseType: !125, size: 192, offset: 960)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 3)
!128 = !DILocalVariable(name: "tok", scope: !69, file: !3, line: 656, type: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !130, line: 28, size: 2304, elements: !131)
!130 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !{!132, !133, !134, !136, !186, !187}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !129, file: !130, line: 30, baseType: !54, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !129, file: !130, line: 31, baseType: !72, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !129, file: !130, line: 32, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !129, file: !130, line: 33, baseType: !137, size: 704, offset: 192)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !138, line: 174, size: 704, elements: !139)
!138 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!139 = !{!140, !141, !151, !152, !153, !154, !159, !160, !171, !182, !183, !184, !185}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !137, file: !138, line: 176, baseType: !54, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !137, file: !138, line: 177, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !138, line: 167, size: 128, elements: !144)
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !143, file: !138, line: 169, baseType: !51, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !138, line: 170, baseType: !142, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !143, file: !138, line: 171, baseType: !148, offset: 128)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: -1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !137, file: !138, line: 178, baseType: !51, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !137, file: !138, line: 179, baseType: !51, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !137, file: !138, line: 180, baseType: !51, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !137, file: !138, line: 185, baseType: !155, size: 64, offset: 320)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !138, line: 181, size: 64, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !155, file: !138, line: 183, baseType: !54, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !155, file: !138, line: 184, baseType: !53, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !137, file: !138, line: 186, baseType: !54, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !137, file: !138, line: 193, baseType: !161, size: 64, offset: 448)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !138, line: 189, size: 64, elements: !162)
!162 = !{!163, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !161, file: !138, line: 191, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!53, !54}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !161, file: !138, line: 192, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!53, !53, !54}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !137, file: !138, line: 198, baseType: !172, size: 64, offset: 512)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !138, line: 194, size: 64, elements: !173)
!173 = !{!174, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !172, file: !138, line: 196, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !53}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !172, file: !138, line: 197, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !53, !53}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !137, file: !138, line: 200, baseType: !53, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !137, file: !138, line: 201, baseType: !100, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !137, file: !138, line: 202, baseType: !100, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !137, file: !138, line: 206, baseType: !100, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !129, file: !130, line: 34, baseType: !137, size: 704, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !129, file: !130, line: 35, baseType: !137, size: 704, offset: 1600)
!188 = !DILocalVariable(name: "read_tokens", scope: !69, file: !3, line: 714, type: !77)
!189 = !DILocalVariable(name: "ai", scope: !69, file: !3, line: 715, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !20, line: 23, flags: DIFlagFwdDecl)
!192 = !DILocalVariable(name: "stream", scope: !193, file: !3, line: 718, type: !195)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 717, column: 5)
!194 = distinct !DILexicalBlock(scope: !69, file: !3, line: 716, column: 7)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !197, line: 49, baseType: !198)
!197 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !199, line: 241, size: 1728, elements: !200)
!199 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !221, !222, !223, !224, !225, !226, !228, !232, !235, !237, !238, !239, !240, !241, !242, !243}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !198, file: !199, line: 242, baseType: !64, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !198, file: !199, line: 247, baseType: !51, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !198, file: !199, line: 248, baseType: !51, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !198, file: !199, line: 249, baseType: !51, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !198, file: !199, line: 250, baseType: !51, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !198, file: !199, line: 251, baseType: !51, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !198, file: !199, line: 252, baseType: !51, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !198, file: !199, line: 253, baseType: !51, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !198, file: !199, line: 254, baseType: !51, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !198, file: !199, line: 256, baseType: !51, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !198, file: !199, line: 257, baseType: !51, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !198, file: !199, line: 258, baseType: !51, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !198, file: !199, line: 260, baseType: !214, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !199, line: 156, size: 192, elements: !216)
!216 = !{!217, !218, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !215, file: !199, line: 157, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !215, file: !199, line: 158, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !215, file: !199, line: 162, baseType: !64, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !198, file: !199, line: 262, baseType: !219, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !198, file: !199, line: 264, baseType: !64, size: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !198, file: !199, line: 268, baseType: !64, size: 32, offset: 928)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !198, file: !199, line: 270, baseType: !108, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !198, file: !199, line: 274, baseType: !65, size: 16, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !198, file: !199, line: 275, baseType: !227, size: 8, offset: 1040)
!227 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !198, file: !199, line: 276, baseType: !229, size: 8, offset: 1048)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 1)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !198, file: !199, line: 280, baseType: !233, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !199, line: 150, baseType: null)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !198, file: !199, line: 289, baseType: !236, size: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 141, baseType: !109)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !198, file: !199, line: 297, baseType: !53, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !198, file: !199, line: 298, baseType: !53, size: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !198, file: !199, line: 299, baseType: !53, size: 64, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !198, file: !199, line: 300, baseType: !53, size: 64, offset: 1408)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !198, file: !199, line: 302, baseType: !54, size: 64, offset: 1472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !198, file: !199, line: 303, baseType: !64, size: 32, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !198, file: !199, line: 305, baseType: !244, size: 160, offset: 1568)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 20)
!247 = !DILocalVariable(name: "__s1_len", scope: !248, file: !3, line: 730, type: !54)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 730, column: 11)
!249 = distinct !DILexicalBlock(scope: !193, file: !3, line: 730, column: 11)
!250 = !DILocalVariable(name: "__s2_len", scope: !248, file: !3, line: 730, type: !54)
!251 = !DILocalVariable(name: "__s2", scope: !252, file: !3, line: 730, type: !59)
!252 = distinct !DILexicalBlock(scope: !248, file: !3, line: 730, column: 11)
!253 = !DILocalVariable(name: "__result", scope: !252, file: !3, line: 730, type: !64)
!254 = !DILocalVariable(name: "st", scope: !193, file: !3, line: 742, type: !88)
!255 = !DILocalVariable(name: "i", scope: !69, file: !3, line: 777, type: !64)
!256 = !DILocalVariable(name: "skip_file", scope: !257, file: !3, line: 781, type: !77)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 780, column: 5)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 779, column: 3)
!259 = distinct !DILexicalBlock(scope: !69, file: !3, line: 779, column: 3)
!260 = !DILocalVariable(name: "ai_err", scope: !257, file: !3, line: 782, type: !19)
!261 = !DILocalVariable(name: "file_name", scope: !257, file: !3, line: 783, type: !51)
!262 = !DILocalVariable(name: "__s1_len", scope: !263, file: !3, line: 801, type: !54)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 801, column: 25)
!264 = distinct !DILexicalBlock(scope: !257, file: !3, line: 801, column: 11)
!265 = !DILocalVariable(name: "__s2_len", scope: !263, file: !3, line: 801, type: !54)
!266 = !DILocalVariable(name: "__s2", scope: !267, file: !3, line: 801, type: !59)
!267 = distinct !DILexicalBlock(scope: !263, file: !3, line: 801, column: 25)
!268 = !DILocalVariable(name: "__result", scope: !267, file: !3, line: 801, type: !64)
!269 = !DILocalVariable(name: "__s1_len", scope: !270, file: !3, line: 801, type: !54)
!270 = distinct !DILexicalBlock(scope: !264, file: !3, line: 801, column: 52)
!271 = !DILocalVariable(name: "__s2_len", scope: !270, file: !3, line: 801, type: !54)
!272 = !DILocalVariable(name: "__s2", scope: !273, file: !3, line: 801, type: !59)
!273 = distinct !DILexicalBlock(scope: !270, file: !3, line: 801, column: 52)
!274 = !DILocalVariable(name: "__result", scope: !273, file: !3, line: 801, type: !64)
!275 = !DILocalVariable(name: "file_number", scope: !276, file: !3, line: 824, type: !56)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 820, column: 13)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 817, column: 15)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 812, column: 9)
!279 = distinct !DILexicalBlock(scope: !257, file: !3, line: 811, column: 11)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !230)
!281 = !DIGlobalVariableExpression(var: !282)
!282 = distinct !DIGlobalVariable(name: "total_lines", scope: !2, file: !3, line: 58, type: !283, isLocal: true, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !284, line: 136, baseType: !285)
!284 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !93, line: 62, baseType: !56)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "total_words", scope: !2, file: !3, line: 59, type: !283, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289)
!289 = distinct !DIGlobalVariable(name: "total_chars", scope: !2, file: !3, line: 60, type: !283, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291)
!291 = distinct !DIGlobalVariable(name: "total_bytes", scope: !2, file: !3, line: 61, type: !283, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "max_line_length", scope: !2, file: !3, line: 62, type: !283, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295)
!295 = distinct !DIGlobalVariable(name: "print_lines", scope: !2, file: !3, line: 65, type: !77, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297)
!297 = distinct !DIGlobalVariable(name: "print_words", scope: !2, file: !3, line: 65, type: !77, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299)
!299 = distinct !DIGlobalVariable(name: "print_chars", scope: !2, file: !3, line: 65, type: !77, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301)
!301 = distinct !DIGlobalVariable(name: "print_bytes", scope: !2, file: !3, line: 65, type: !77, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303)
!303 = distinct !DIGlobalVariable(name: "print_linelength", scope: !2, file: !3, line: 66, type: !77, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305)
!305 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 69, type: !64, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307)
!307 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 72, type: !77, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309)
!309 = distinct !DIGlobalVariable(name: "infomap", scope: !310, file: !311, line: 632, type: !335, isLocal: true, isDefinition: true)
!310 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !311, file: !311, line: 630, type: !312, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !314)
!311 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!312 = !DISubroutineType(types: !313)
!313 = !{null, !62}
!314 = !{!315, !316, !317, !324, !326, !327, !328, !331, !332, !334}
!315 = !DILocalVariable(name: "program", arg: 1, scope: !310, file: !311, line: 630, type: !62)
!316 = !DILocalVariable(name: "node", scope: !310, file: !311, line: 642, type: !62)
!317 = !DILocalVariable(name: "map_prog", scope: !310, file: !311, line: 643, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !310, file: !311, line: 632, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !320, file: !311, line: 632, baseType: !62, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !320, file: !311, line: 632, baseType: !62, size: 64, offset: 64)
!324 = !DILocalVariable(name: "__s1_len", scope: !325, file: !311, line: 645, type: !54)
!325 = distinct !DILexicalBlock(scope: !310, file: !311, line: 645, column: 33)
!326 = !DILocalVariable(name: "__s2_len", scope: !325, file: !311, line: 645, type: !54)
!327 = !DILocalVariable(name: "lc_messages", scope: !310, file: !311, line: 655, type: !62)
!328 = !DILocalVariable(name: "__s1_len", scope: !329, file: !311, line: 656, type: !54)
!329 = distinct !DILexicalBlock(scope: !330, file: !311, line: 656, column: 22)
!330 = distinct !DILexicalBlock(scope: !310, file: !311, line: 656, column: 7)
!331 = !DILocalVariable(name: "__s2_len", scope: !329, file: !311, line: 656, type: !54)
!332 = !DILocalVariable(name: "__s2", scope: !333, file: !311, line: 656, type: !59)
!333 = distinct !DILexicalBlock(scope: !329, file: !311, line: 656, column: 22)
!334 = !DILocalVariable(name: "__result", scope: !333, file: !311, line: 656, type: !64)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 896, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 7)
!338 = !DIGlobalVariableExpression(var: !339)
!339 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 95, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 2304, elements: !350)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !343, line: 104, size: 256, elements: !344)
!343 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !{!345, !346, !347, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !343, line: 106, baseType: !62, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !342, file: !343, line: 109, baseType: !64, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !343, line: 110, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !342, file: !343, line: 111, baseType: !64, size: 32, offset: 192)
!350 = !{!351}
!351 = !DISubrange(count: 9)
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !354, file: !3, line: 160, type: !369, isLocal: true, isDefinition: true)
!354 = distinct !DISubprogram(name: "write_counts", scope: !3, file: !3, line: 153, type: !355, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !283, !283, !283, !283, !283, !62}
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365}
!358 = !DILocalVariable(name: "lines", arg: 1, scope: !354, file: !3, line: 153, type: !283)
!359 = !DILocalVariable(name: "words", arg: 2, scope: !354, file: !3, line: 154, type: !283)
!360 = !DILocalVariable(name: "chars", arg: 3, scope: !354, file: !3, line: 155, type: !283)
!361 = !DILocalVariable(name: "bytes", arg: 4, scope: !354, file: !3, line: 156, type: !283)
!362 = !DILocalVariable(name: "linelength", arg: 5, scope: !354, file: !3, line: 157, type: !283)
!363 = !DILocalVariable(name: "file", arg: 6, scope: !354, file: !3, line: 158, type: !62)
!364 = !DILocalVariable(name: "format_int", scope: !354, file: !3, line: 161, type: !62)
!365 = !DILocalVariable(name: "buf", scope: !354, file: !3, line: 162, type: !366)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 168, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 21)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 40, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 5)
!372 = !DIGlobalVariableExpression(var: !373)
!373 = distinct !DIGlobalVariable(name: "Version", scope: !374, file: !375, line: 2, type: !62, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, globals: !377)
!375 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!376 = !{}
!377 = !{!372}
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "file_name", scope: !380, file: !385, line: 36, type: !62, isLocal: true, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, globals: !382)
!381 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !{!378, !383}
!383 = !DIGlobalVariableExpression(var: !384)
!384 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !380, file: !385, line: 46, type: !77, isLocal: true, isDefinition: true)
!385 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!386 = !DIGlobalVariableExpression(var: !387)
!387 = distinct !DIGlobalVariable(name: "exit_failure", scope: !388, file: !391, line: 24, type: !392, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, globals: !390)
!389 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!390 = !{!386}
!391 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!393 = !DIGlobalVariableExpression(var: !394)
!394 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !395, file: !399, line: 28, type: !400, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !397, globals: !398)
!396 = !DIFile(filename: "./lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!397 = !{!61}
!398 = !{!393}
!399 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 256, elements: !402)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!402 = !{!403}
!403 = !DISubrange(count: 8)
!404 = !DIGlobalVariableExpression(var: !405)
!405 = distinct !DIGlobalVariable(name: "program_name", scope: !406, file: !410, line: 33, type: !62, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !408, globals: !409)
!407 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!408 = !{!53, !51}
!409 = !{!404}
!410 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!411 = !DIGlobalVariableExpression(var: !412)
!412 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !413, file: !425, line: 77, type: !458, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !415, retainedTypes: !421, globals: !422)
!414 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!415 = !{!5, !416, !35}
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!419 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!420 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!421 = !{!64, !65, !54, !51}
!422 = !{!411, !423, !430, !440, !442, !447, !454, !456}
!423 = !DIGlobalVariableExpression(var: !424)
!424 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !413, file: !425, line: 93, type: !426, isDefinition: true)
!425 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 320, elements: !428)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!428 = !{!429}
!429 = !DISubrange(count: 10)
!430 = !DIGlobalVariableExpression(var: !431)
!431 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !413, file: !425, line: 1043, type: !432, isDefinition: true)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !425, line: 57, size: 448, elements: !433)
!433 = !{!434, !435, !436, !438, !439}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !432, file: !425, line: 60, baseType: !5, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !432, file: !425, line: 63, baseType: !64, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !432, file: !425, line: 67, baseType: !437, size: 256, offset: 64)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 256, elements: !402)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !432, file: !425, line: 70, baseType: !62, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !432, file: !425, line: 73, baseType: !62, size: 64, offset: 384)
!440 = !DIGlobalVariableExpression(var: !441)
!441 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !413, file: !425, line: 108, type: !432, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443)
!443 = distinct !DIGlobalVariable(name: "slot0", scope: !413, file: !425, line: 834, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 256)
!447 = !DIGlobalVariableExpression(var: !448)
!448 = distinct !DIGlobalVariable(name: "slotvec", scope: !413, file: !425, line: 837, type: !449, isLocal: true, isDefinition: true)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !425, line: 826, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !450, file: !425, line: 828, baseType: !54, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !450, file: !425, line: 829, baseType: !51, size: 64, offset: 64)
!454 = !DIGlobalVariableExpression(var: !455)
!455 = distinct !DIGlobalVariable(name: "nslots", scope: !413, file: !425, line: 835, type: !64, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457)
!457 = distinct !DIGlobalVariable(name: "slotvec0", scope: !413, file: !425, line: 836, type: !450, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 704, elements: !460)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!460 = !{!461}
!461 = !DISubrange(count: 11)
!462 = !DIGlobalVariableExpression(var: !463)
!463 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !464, file: !467, line: 26, type: !468, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, globals: !466)
!465 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!466 = !{!462}
!467 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 376, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 47)
!471 = !DIGlobalVariableExpression(var: !472)
!472 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !473, file: !477, line: 351, type: !478, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !475, globals: !476)
!474 = !DIFile(filename: "./lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!475 = !{!51, !53}
!476 = !{!471}
!477 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null}
!481 = !DIGlobalVariableExpression(var: !482)
!482 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !483, file: !827, line: 120, type: !828, isLocal: true, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !485, retainedTypes: !824, globals: !826)
!484 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!485 = !{!486}
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !487, line: 41, size: 32, elements: !488)
!487 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!489 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!490 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!491 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!492 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!493 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!494 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!495 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!496 = !DIEnumerator(name: "DAY_1", value: 131079)
!497 = !DIEnumerator(name: "DAY_2", value: 131080)
!498 = !DIEnumerator(name: "DAY_3", value: 131081)
!499 = !DIEnumerator(name: "DAY_4", value: 131082)
!500 = !DIEnumerator(name: "DAY_5", value: 131083)
!501 = !DIEnumerator(name: "DAY_6", value: 131084)
!502 = !DIEnumerator(name: "DAY_7", value: 131085)
!503 = !DIEnumerator(name: "ABMON_1", value: 131086)
!504 = !DIEnumerator(name: "ABMON_2", value: 131087)
!505 = !DIEnumerator(name: "ABMON_3", value: 131088)
!506 = !DIEnumerator(name: "ABMON_4", value: 131089)
!507 = !DIEnumerator(name: "ABMON_5", value: 131090)
!508 = !DIEnumerator(name: "ABMON_6", value: 131091)
!509 = !DIEnumerator(name: "ABMON_7", value: 131092)
!510 = !DIEnumerator(name: "ABMON_8", value: 131093)
!511 = !DIEnumerator(name: "ABMON_9", value: 131094)
!512 = !DIEnumerator(name: "ABMON_10", value: 131095)
!513 = !DIEnumerator(name: "ABMON_11", value: 131096)
!514 = !DIEnumerator(name: "ABMON_12", value: 131097)
!515 = !DIEnumerator(name: "MON_1", value: 131098)
!516 = !DIEnumerator(name: "MON_2", value: 131099)
!517 = !DIEnumerator(name: "MON_3", value: 131100)
!518 = !DIEnumerator(name: "MON_4", value: 131101)
!519 = !DIEnumerator(name: "MON_5", value: 131102)
!520 = !DIEnumerator(name: "MON_6", value: 131103)
!521 = !DIEnumerator(name: "MON_7", value: 131104)
!522 = !DIEnumerator(name: "MON_8", value: 131105)
!523 = !DIEnumerator(name: "MON_9", value: 131106)
!524 = !DIEnumerator(name: "MON_10", value: 131107)
!525 = !DIEnumerator(name: "MON_11", value: 131108)
!526 = !DIEnumerator(name: "MON_12", value: 131109)
!527 = !DIEnumerator(name: "AM_STR", value: 131110)
!528 = !DIEnumerator(name: "PM_STR", value: 131111)
!529 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!530 = !DIEnumerator(name: "D_FMT", value: 131113)
!531 = !DIEnumerator(name: "T_FMT", value: 131114)
!532 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!533 = !DIEnumerator(name: "ERA", value: 131116)
!534 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!535 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!536 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!537 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!538 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!539 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!540 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!541 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!542 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!543 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!544 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!545 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!546 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!547 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!548 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!549 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!550 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!551 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!552 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!553 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!554 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!555 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!556 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!557 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!558 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!559 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!560 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!561 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!562 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!563 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!564 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!565 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!566 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!567 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!568 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!569 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!570 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!571 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!572 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!573 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!574 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!575 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!576 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!577 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!578 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!579 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!580 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!581 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!582 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!583 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!584 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!585 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!586 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!587 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!588 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!589 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!590 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!591 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!592 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!593 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!594 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!595 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!596 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!597 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!598 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!599 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!600 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!601 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!602 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!603 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!604 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!605 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!606 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!607 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!608 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!609 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!610 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!611 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!612 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!613 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!614 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!615 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!616 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!617 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!618 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!619 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!620 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!621 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!622 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!623 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!624 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!625 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!626 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!627 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!628 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!629 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!630 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!631 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!632 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!633 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!634 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!635 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!636 = !DIEnumerator(name: "CODESET", value: 14)
!637 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!638 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!639 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!640 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!662 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!668 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!669 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!675 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!682 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!683 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!684 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!685 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!686 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!687 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!688 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!689 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!690 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!691 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!692 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!693 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!694 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!695 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!696 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!697 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!698 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!699 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!700 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!701 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!702 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!703 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!704 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!705 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!706 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!707 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!708 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!709 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!710 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!711 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!712 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!713 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!714 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!715 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!716 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!717 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!718 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!719 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!720 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!721 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!722 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!723 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!724 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!725 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!726 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!727 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!728 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!729 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!730 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!731 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!732 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!736 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!737 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!739 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!740 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!743 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!746 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!747 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!748 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!749 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!750 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!751 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!752 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!753 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!754 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!755 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!756 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!757 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!758 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!759 = !DIEnumerator(name: "THOUSEP", value: 65537)
!760 = !DIEnumerator(name: "__GROUPING", value: 65538)
!761 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!762 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!763 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!764 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!765 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!766 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!767 = !DIEnumerator(name: "__YESSTR", value: 327682)
!768 = !DIEnumerator(name: "__NOSTR", value: 327683)
!769 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!770 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!771 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!772 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!773 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!774 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!775 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!776 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!777 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!778 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!779 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!780 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!781 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!782 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!783 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!784 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!785 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!786 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!787 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!788 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!789 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!790 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!791 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!792 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!793 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!794 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!795 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!796 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!797 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!798 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!799 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!800 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!801 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!802 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!803 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!804 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!805 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!806 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!807 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!808 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!809 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!810 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!811 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!812 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!814 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!815 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!816 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!817 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!818 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!821 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!822 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!823 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!824 = !{!53, !51, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!826 = !{!481}
!827 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!828 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!829 = distinct !DICompileUnit(language: DW_LANG_C99, file: !830, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !831, retainedTypes: !832)
!830 = !DIFile(filename: "./lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!831 = !{!19}
!832 = !{!53}
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !835)
!834 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!835 = !{!26}
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !838)
!837 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!838 = !{!283}
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !841, retainedTypes: !1060)
!840 = !DIFile(filename: "./lib/physmem.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = !{!842}
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !843, line: 71, size: 32, elements: !844)
!843 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!845 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!846 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!847 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!848 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!849 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!850 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!851 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!852 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!853 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!854 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!855 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!856 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!857 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!858 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!859 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!860 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!861 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!862 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!863 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!864 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!865 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!866 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!867 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!868 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!869 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!870 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!871 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!872 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!873 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!874 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!875 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!876 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!877 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!878 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!879 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!880 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!881 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!882 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!883 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!884 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!885 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!886 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!887 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!888 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!889 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!890 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!891 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!892 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!893 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!894 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!895 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!896 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!897 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!898 = !DIEnumerator(name: "_SC_PII", value: 53)
!899 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!900 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!901 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!902 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!903 = !DIEnumerator(name: "_SC_POLL", value: 58)
!904 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!905 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!906 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!907 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!908 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!909 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!910 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!911 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!912 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!913 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!914 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!915 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!916 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!917 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!918 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!919 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!920 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!921 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!922 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!923 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!924 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!925 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!926 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!927 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!928 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!929 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!930 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!931 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!932 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!933 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!934 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!935 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!936 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!937 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!938 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!939 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!940 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!941 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!942 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!943 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!944 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!945 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!946 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!947 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!948 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!949 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!950 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!951 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!952 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!953 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!954 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!955 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!956 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!957 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!958 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!959 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!960 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!961 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!962 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!963 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!964 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!965 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!966 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!967 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!968 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!969 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!970 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!971 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!972 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!973 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!974 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!975 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!976 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!977 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!978 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!979 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!980 = !DIEnumerator(name: "_SC_BASE", value: 134)
!981 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!982 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!983 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!984 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!985 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!986 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!987 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!988 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!989 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!990 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!991 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!992 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!993 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!994 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!995 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!996 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!997 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!998 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!999 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!1000 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!1001 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!1002 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!1003 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!1004 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!1005 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!1006 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!1007 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!1008 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!1009 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!1010 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!1011 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!1012 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!1013 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!1014 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!1015 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!1016 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!1017 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!1018 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!1019 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!1020 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!1021 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!1022 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!1023 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!1024 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!1025 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!1026 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!1027 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!1028 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!1029 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!1030 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!1031 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!1032 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!1033 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!1034 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!1035 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!1036 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!1037 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!1038 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!1039 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!1040 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!1041 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!1042 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!1043 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!1044 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!1045 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!1046 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!1047 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!1048 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!1049 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!1050 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!1051 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!1052 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!1053 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!1054 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!1055 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!1056 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!1057 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!1058 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!1059 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!1060 = !{!1061}
!1061 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1062 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1063, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !1064)
!1063 = !DIFile(filename: "./lib/readtokens0.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1064 = !{!53, !51, !54, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!1066 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1067, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1068)
!1067 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1068 = !{!1069}
!1069 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1071, file: !1070, line: 62, size: 32, elements: !1085)
!1070 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1071 = distinct !DISubprogram(name: "safe_read", scope: !1070, file: !1070, line: 56, type: !1072, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !1066, variables: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!54, !64, !53, !54}
!1074 = !{!1075, !1076, !1077, !1078}
!1075 = !DILocalVariable(name: "fd", arg: 1, scope: !1071, file: !1070, line: 56, type: !64)
!1076 = !DILocalVariable(name: "buf", arg: 2, scope: !1071, file: !1070, line: 56, type: !53)
!1077 = !DILocalVariable(name: "count", arg: 3, scope: !1071, file: !1070, line: 56, type: !54)
!1078 = !DILocalVariable(name: "result", scope: !1079, file: !1070, line: 66, type: !1082)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !1070, line: 65, column: 5)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !1070, line: 64, column: 3)
!1081 = distinct !DILexicalBlock(scope: !1071, file: !1070, line: 64, column: 3)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1083, line: 109, baseType: !1084)
!1083 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !93, line: 181, baseType: !109)
!1085 = !{!1086}
!1086 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!1087 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1088, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1089, retainedTypes: !832)
!1088 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1089 = !{!1090}
!1090 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1091, line: 41, size: 32, elements: !1092)
!1091 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1092 = !{!1093}
!1093 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!1094 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1095, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1096, retainedTypes: !1109)
!1095 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1096 = !{!1097}
!1097 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1099, file: !1098, line: 192, size: 32, elements: !1107)
!1098 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1099 = distinct !DISubprogram(name: "x2nrealloc", scope: !1098, file: !1098, line: 180, type: !1100, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !1094, variables: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!53, !53, !135, !54}
!1102 = !{!1103, !1104, !1105, !1106}
!1103 = !DILocalVariable(name: "p", arg: 1, scope: !1099, file: !1098, line: 180, type: !53)
!1104 = !DILocalVariable(name: "pn", arg: 2, scope: !1099, file: !1098, line: 180, type: !135)
!1105 = !DILocalVariable(name: "s", arg: 3, scope: !1099, file: !1098, line: 180, type: !54)
!1106 = !DILocalVariable(name: "n", scope: !1099, file: !1098, line: 182, type: !54)
!1107 = !{!1108}
!1108 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1109 = !{!54, !51, !53}
!1110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1111, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376)
!1111 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1113, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !832)
!1113 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1115, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376)
!1115 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1116 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1117, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !832)
!1117 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1119, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !832)
!1119 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1121, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !1122)
!1121 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1122 = !{!54}
!1123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1124, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376)
!1124 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1126, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !1127)
!1126 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1127 = !{!54, !57, !59, !62}
!1128 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!1129 = !{i32 2, !"Dwarf Version", i32 4}
!1130 = !{i32 2, !"Debug Info Version", i32 3}
!1131 = !{i32 1, !"PIC Level", i32 2}
!1132 = !{i32 1, !"PIE Level", i32 2}
!1133 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 109, type: !1134, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !1136)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !64}
!1136 = !{!1137}
!1137 = !DILocalVariable(name: "status", arg: 1, scope: !1133, file: !3, line: 109, type: !64)
!1138 = !DIExpression()
!1139 = !DILocation(line: 109, column: 12, scope: !1133)
!1140 = !DILocation(line: 111, column: 14, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 111, column: 7)
!1142 = !DILocation(line: 111, column: 7, scope: !1133)
!1143 = !DILocation(line: 112, column: 5, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1145, file: !3, discriminator: 1)
!1145 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 112, column: 5)
!1146 = !{!1147, !1147, i64 0}
!1147 = !{!"any pointer", !1148, i64 0}
!1148 = !{!"omnipotent char", !1149, i64 0}
!1149 = !{!"Simple C/C++ TBAA"}
!1150 = !DILocation(line: 112, column: 5, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1145, file: !3, discriminator: 3)
!1152 = !DILocation(line: 112, column: 5, scope: !1153)
!1153 = !DILexicalBlockFile(scope: !1145, file: !3, discriminator: 2)
!1154 = !DILocation(line: 115, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 114, column: 5)
!1156 = !DILocation(line: 115, column: 7, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1155, file: !3, discriminator: 1)
!1158 = !DILocation(line: 120, column: 7, scope: !1155)
!1159 = !DILocation(line: 120, column: 7, scope: !1157)
!1160 = !DILocation(line: 580, column: 3, scope: !1161, inlinedAt: !1162)
!1161 = distinct !DISubprogram(name: "emit_stdin_note", scope: !311, file: !311, line: 578, type: !479, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !376)
!1162 = distinct !DILocation(line: 126, column: 7, scope: !1155)
!1163 = !DILocation(line: 580, column: 3, scope: !1164, inlinedAt: !1162)
!1164 = !DILexicalBlockFile(scope: !1161, file: !311, discriminator: 1)
!1165 = !DILocation(line: 128, column: 7, scope: !1155)
!1166 = !DILocation(line: 128, column: 7, scope: !1157)
!1167 = !DILocation(line: 136, column: 7, scope: !1155)
!1168 = !DILocation(line: 136, column: 7, scope: !1157)
!1169 = !DILocation(line: 143, column: 7, scope: !1155)
!1170 = !DILocation(line: 143, column: 7, scope: !1157)
!1171 = !DILocation(line: 144, column: 7, scope: !1155)
!1172 = !DILocation(line: 144, column: 7, scope: !1157)
!1173 = !DILocation(line: 642, column: 15, scope: !310, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 145, column: 7, scope: !1155)
!1175 = !DILocation(line: 651, column: 3, scope: !310, inlinedAt: !1174)
!1176 = !DILocation(line: 651, column: 3, scope: !1177, inlinedAt: !1174)
!1177 = !DILexicalBlockFile(scope: !310, file: !311, discriminator: 1)
!1178 = !DILocation(line: 655, column: 29, scope: !310, inlinedAt: !1174)
!1179 = !DILocation(line: 655, column: 15, scope: !310, inlinedAt: !1174)
!1180 = !DILocation(line: 656, column: 7, scope: !330, inlinedAt: !1174)
!1181 = !DILocation(line: 656, column: 19, scope: !330, inlinedAt: !1174)
!1182 = !DILocation(line: 656, column: 22, scope: !1183, inlinedAt: !1174)
!1183 = !DILexicalBlockFile(scope: !330, file: !311, discriminator: 16)
!1184 = !DILocation(line: 656, column: 7, scope: !1185, inlinedAt: !1174)
!1185 = !DILexicalBlockFile(scope: !310, file: !311, discriminator: 16)
!1186 = !DILocation(line: 662, column: 7, scope: !1187, inlinedAt: !1174)
!1187 = distinct !DILexicalBlock(scope: !330, file: !311, line: 657, column: 5)
!1188 = !DILocation(line: 662, column: 7, scope: !1189, inlinedAt: !1174)
!1189 = !DILexicalBlockFile(scope: !1187, file: !311, discriminator: 1)
!1190 = !DILocation(line: 664, column: 5, scope: !1187, inlinedAt: !1174)
!1191 = !DILocation(line: 665, column: 3, scope: !310, inlinedAt: !1174)
!1192 = !DILocation(line: 665, column: 3, scope: !1177, inlinedAt: !1174)
!1193 = !DILocation(line: 667, column: 3, scope: !310, inlinedAt: !1174)
!1194 = !DILocation(line: 667, column: 3, scope: !1177, inlinedAt: !1174)
!1195 = !DILocation(line: 147, column: 3, scope: !1133)
!1196 = !DILocation(line: 648, column: 11, scope: !69)
!1197 = !DILocation(line: 648, column: 24, scope: !69)
!1198 = !DILocation(line: 654, column: 9, scope: !69)
!1199 = !DILocation(line: 656, column: 3, scope: !69)
!1200 = !DILocation(line: 659, column: 21, scope: !69)
!1201 = !DILocation(line: 659, column: 3, scope: !69)
!1202 = !DILocation(line: 660, column: 3, scope: !69)
!1203 = !DILocation(line: 661, column: 3, scope: !69)
!1204 = !DILocation(line: 662, column: 3, scope: !69)
!1205 = !DILocation(line: 664, column: 3, scope: !69)
!1206 = !DILocation(line: 666, column: 15, scope: !69)
!1207 = !DILocation(line: 666, column: 13, scope: !69)
!1208 = !{!1209, !1209, i64 0}
!1209 = !{!"long", !1148, i64 0}
!1210 = !DILocation(line: 669, column: 12, scope: !69)
!1211 = !DILocation(line: 669, column: 3, scope: !69)
!1212 = !DILocation(line: 673, column: 75, scope: !69)
!1213 = !DILocation(line: 673, column: 57, scope: !69)
!1214 = !DILocation(line: 673, column: 43, scope: !69)
!1215 = !DILocation(line: 673, column: 29, scope: !69)
!1216 = !DILocation(line: 673, column: 15, scope: !69)
!1217 = !DILocation(line: 675, column: 3, scope: !69)
!1218 = !DILocation(line: 675, column: 18, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !69, file: !3, discriminator: 1)
!1220 = !DILocation(line: 651, column: 7, scope: !69)
!1221 = !DILocation(line: 675, column: 3, scope: !1219)
!1222 = !DILocation(line: 680, column: 9, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !69, file: !3, line: 677, column: 7)
!1224 = !DILocation(line: 688, column: 9, scope: !1223)
!1225 = !DILocation(line: 692, column: 9, scope: !1223)
!1226 = !DILocation(line: 696, column: 9, scope: !1223)
!1227 = distinct !{!1227, !1217, !1228}
!1228 = !DILocation(line: 708, column: 7, scope: !69)
!1229 = !DILocation(line: 699, column: 22, scope: !1223)
!1230 = !DILocation(line: 700, column: 9, scope: !1223)
!1231 = !DILocation(line: 702, column: 7, scope: !1223)
!1232 = !DILocation(line: 704, column: 7, scope: !1223)
!1233 = !DILocation(line: 704, column: 7, scope: !1234)
!1234 = !DILexicalBlockFile(scope: !1223, file: !3, discriminator: 1)
!1235 = !DILocation(line: 707, column: 9, scope: !1223)
!1236 = !DILocation(line: 710, column: 22, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !69, file: !3, line: 710, column: 7)
!1238 = !DILocation(line: 710, column: 37, scope: !1239)
!1239 = !DILexicalBlockFile(scope: !1237, file: !3, discriminator: 1)
!1240 = !DILocation(line: 710, column: 52, scope: !1241)
!1241 = !DILexicalBlockFile(scope: !1237, file: !3, discriminator: 2)
!1242 = !DILocation(line: 711, column: 10, scope: !1237)
!1243 = !DILocation(line: 710, column: 7, scope: !1244)
!1244 = !DILexicalBlockFile(scope: !69, file: !3, discriminator: 4)
!1245 = !DILocation(line: 712, column: 5, scope: !1237)
!1246 = !DILocation(line: 714, column: 8, scope: !69)
!1247 = !DILocation(line: 716, column: 7, scope: !194)
!1248 = !{!1249, !1249, i64 0}
!1249 = !{!"int", !1148, i64 0}
!1250 = !DILocation(line: 716, column: 7, scope: !69)
!1251 = !DILocation(line: 722, column: 11, scope: !193)
!1252 = !DILocation(line: 724, column: 24, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !3, line: 723, column: 9)
!1254 = distinct !DILexicalBlock(scope: !193, file: !3, line: 722, column: 11)
!1255 = !DILocation(line: 724, column: 47, scope: !1253)
!1256 = !DILocation(line: 724, column: 47, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1253, file: !3, discriminator: 1)
!1258 = !DILocation(line: 724, column: 11, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1253, file: !3, discriminator: 2)
!1260 = !DILocation(line: 725, column: 11, scope: !1253)
!1261 = !DILocation(line: 725, column: 11, scope: !1257)
!1262 = !DILocation(line: 727, column: 11, scope: !1253)
!1263 = !DILocation(line: 730, column: 11, scope: !248)
!1264 = !DILocation(line: 730, column: 11, scope: !252)
!1265 = !DILocation(line: 730, column: 11, scope: !1266)
!1266 = !DILexicalBlockFile(scope: !252, file: !3, discriminator: 2)
!1267 = !{!1148, !1148, i64 0}
!1268 = !DILocation(line: 730, column: 11, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1270, file: !3, discriminator: 3)
