!llvm.dbg.cu = !{!2, !325, !331, !374, !382, !814, !817, !389, !396, !823, !459, !831, !848, !850, !852, !855, !866, !468, !868, !870, !872}
!llvm.ident = !{!874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874, !874}
!llvm.module.flags = !{!875, !876, !877, !878}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 162, type: !311, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !44)
!3 = !DIFile(filename: "src/who.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !10}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 208, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1)
!9 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !11, line: 32, size: 32, elements: !12)
!11 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")

!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 62, baseType: !30)
!29 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !39, line: 8, baseType: !40)
!39 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 148, baseType: !42)
!41 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!42 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !{!45, !48, !50, !52, !54, !56, !58, !60, !62, !64, !66, !68, !70, !72, !74, !76, !78, !81, !0, !111, !143, !248, !250, !261, !266, !293, !302, !304}
!45 = !DIGlobalVariableExpression(var: !46)
!46 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !47, isLocal: true, isDefinition: true)
!47 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!48 = !DIGlobalVariableExpression(var: !49)
!49 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !47, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51)
!51 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !47, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53)
!53 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !47, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55)
!55 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !47, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57)
!57 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !47, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59)
!59 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !47, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61)
!61 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !47, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !47, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65)
!65 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !47, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !47, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69)
!69 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !47, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71)
!71 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !47, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !47, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !47, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !36, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !80, isLocal: true, isDefinition: true)
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIGlobalVariableExpression(var: !82)
!82 = distinct !DIGlobalVariable(name: "infomap", scope: !83, file: !84, line: 632, type: !108, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !84, file: !84, line: 630, type: !85, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !87)
!84 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!85 = !DISubroutineType(types: !86)
!86 = !{null, !36}
!87 = !{!88, !89, !90, !97, !99, !100, !101, !104, !105, !107}
!88 = !DILocalVariable(name: "program", arg: 1, scope: !83, file: !84, line: 630, type: !36)
!89 = !DILocalVariable(name: "node", scope: !83, file: !84, line: 642, type: !36)
!90 = !DILocalVariable(name: "map_prog", scope: !83, file: !84, line: 643, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !83, file: !84, line: 632, size: 128, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !93, file: !84, line: 632, baseType: !36, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !93, file: !84, line: 632, baseType: !36, size: 64, offset: 64)
!97 = !DILocalVariable(name: "__s1_len", scope: !98, file: !84, line: 645, type: !28)
!98 = distinct !DILexicalBlock(scope: !83, file: !84, line: 645, column: 33)
!99 = !DILocalVariable(name: "__s2_len", scope: !98, file: !84, line: 645, type: !28)
!100 = !DILocalVariable(name: "lc_messages", scope: !83, file: !84, line: 655, type: !36)
!101 = !DILocalVariable(name: "__s1_len", scope: !102, file: !84, line: 656, type: !28)
!102 = distinct !DILexicalBlock(scope: !103, file: !84, line: 656, column: 22)
!103 = distinct !DILexicalBlock(scope: !83, file: !84, line: 656, column: 7)
!104 = !DILocalVariable(name: "__s2_len", scope: !102, file: !84, line: 656, type: !28)
!105 = !DILocalVariable(name: "__s2", scope: !106, file: !84, line: 656, type: !33)
!106 = distinct !DILexicalBlock(scope: !102, file: !84, line: 656, column: 22)
!107 = !DILocalVariable(name: "__result", scope: !106, file: !84, line: 656, type: !80)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 896, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 7)
!111 = !DIGlobalVariableExpression(var: !112)
!112 = distinct !DIGlobalVariable(name: "mesg", scope: !113, file: !3, line: 249, type: !140, isLocal: true, isDefinition: true)
!113 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !114, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !80, !36, !37, !80, !36, !36, !36, !36, !36, !36}
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !132, !136, !137, !138}
!117 = !DILocalVariable(name: "userlen", arg: 1, scope: !113, file: !3, line: 244, type: !80)
!118 = !DILocalVariable(name: "user", arg: 2, scope: !113, file: !3, line: 244, type: !36)
!119 = !DILocalVariable(name: "state", arg: 3, scope: !113, file: !3, line: 244, type: !37)
!120 = !DILocalVariable(name: "linelen", arg: 4, scope: !113, file: !3, line: 245, type: !80)
!121 = !DILocalVariable(name: "line", arg: 5, scope: !113, file: !3, line: 245, type: !36)
!122 = !DILocalVariable(name: "time_str", arg: 6, scope: !113, file: !3, line: 246, type: !36)
!123 = !DILocalVariable(name: "idle", arg: 7, scope: !113, file: !3, line: 246, type: !36)
!124 = !DILocalVariable(name: "pid", arg: 8, scope: !113, file: !3, line: 246, type: !36)
!125 = !DILocalVariable(name: "comment", arg: 9, scope: !113, file: !3, line: 247, type: !36)
!126 = !DILocalVariable(name: "exitstr", arg: 10, scope: !113, file: !3, line: 247, type: !36)
!127 = !DILocalVariable(name: "buf", scope: !113, file: !3, line: 250, type: !25)
!128 = !DILocalVariable(name: "x_idle", scope: !113, file: !3, line: 251, type: !129)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 8)
!132 = !DILocalVariable(name: "x_pid", scope: !113, file: !3, line: 252, type: !133)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 104, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 13)
!136 = !DILocalVariable(name: "x_exitstr", scope: !113, file: !3, line: 253, type: !25)
!137 = !DILocalVariable(name: "err", scope: !113, file: !3, line: 254, type: !80)
!138 = !DILocalVariable(name: "p", scope: !139, file: !3, line: 303, type: !25)
!139 = distinct !DILexicalBlock(scope: !113, file: !3, line: 301, column: 3)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 3)
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "hoststr", scope: !145, file: !3, line: 339, type: !25, isLocal: true, isDefinition: true)
!145 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !146, isLocal: true, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !188)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !38}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !6, line: 146, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !152, line: 55, size: 3072, elements: !153)
!152 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!153 = !{!154, !155, !157, !161, !165, !166, !170, !175, !177, !182, !184}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !151, file: !152, line: 57, baseType: !43, size: 16)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !151, file: !152, line: 58, baseType: !156, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !41, line: 142, baseType: !80)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !151, file: !152, line: 59, baseType: !158, size: 256, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !151, file: !152, line: 60, baseType: !162, size: 32, offset: 320)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 4)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !151, file: !152, line: 61, baseType: !158, size: 256, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !151, file: !152, line: 62, baseType: !167, size: 2048, offset: 608)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !151, file: !152, line: 63, baseType: !171, size: 32, offset: 2656)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !152, line: 42, size: 32, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !171, file: !152, line: 45, baseType: !43, size: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !171, file: !152, line: 46, baseType: !43, size: 16, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !151, file: !152, line: 70, baseType: !176, size: 32, offset: 2688)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !41, line: 40, baseType: !80)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !151, file: !152, line: 75, baseType: !178, size: 64, offset: 2720)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !152, line: 71, size: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !178, file: !152, line: 73, baseType: !176, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !178, file: !152, line: 74, baseType: !176, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !151, file: !152, line: 80, baseType: !183, size: 128, offset: 2784)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !163)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !151, file: !152, line: 81, baseType: !185, size: 160, offset: 2912)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 20)
!188 = !{!189, !190, !191, !227, !228, !229, !231, !235, !236, !240, !246, !247}
!189 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !145, file: !3, line: 333, type: !148)
!190 = !DILocalVariable(name: "boottime", arg: 2, scope: !145, file: !3, line: 333, type: !38)
!191 = !DILocalVariable(name: "stats", scope: !145, file: !3, line: 335, type: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !193, line: 46, size: 1152, elements: !194)
!193 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!194 = !{!195, !197, !199, !201, !204, !206, !208, !209, !210, !212, !214, !216, !223, !224, !225}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !192, file: !193, line: 48, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 133, baseType: !30)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !192, file: !193, line: 53, baseType: !198, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !41, line: 136, baseType: !30)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !192, file: !193, line: 61, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !41, line: 139, baseType: !30)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !192, file: !193, line: 62, baseType: !202, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 138, baseType: !203)
!203 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !192, file: !193, line: 64, baseType: !205, size: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 134, baseType: !203)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !192, file: !193, line: 65, baseType: !207, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 135, baseType: !203)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !192, file: !193, line: 67, baseType: !80, size: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !192, file: !193, line: 69, baseType: !196, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !192, file: !193, line: 74, baseType: !211, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 140, baseType: !42)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !192, file: !193, line: 78, baseType: !213, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !41, line: 162, baseType: !42)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !192, file: !193, line: 80, baseType: !215, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !41, line: 167, baseType: !42)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !192, file: !193, line: 91, baseType: !217, size: 128, offset: 576)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !218, line: 8, size: 128, elements: !219)
!218 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !217, file: !218, line: 10, baseType: !40, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !217, file: !218, line: 11, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !41, line: 184, baseType: !42)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !192, file: !193, line: 92, baseType: !217, size: 128, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !192, file: !193, line: 93, baseType: !217, size: 128, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !192, file: !193, line: 106, baseType: !226, size: 192, offset: 960)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 192, elements: !141)
!227 = !DILocalVariable(name: "last_change", scope: !145, file: !3, line: 336, type: !38)
!228 = !DILocalVariable(name: "mesg", scope: !145, file: !3, line: 337, type: !26)
!229 = !DILocalVariable(name: "idlestr", scope: !145, file: !3, line: 338, type: !230)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 56, elements: !109)
!231 = !DILocalVariable(name: "line", scope: !145, file: !3, line: 347, type: !232)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 304, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 38)
!235 = !DILocalVariable(name: "p", scope: !145, file: !3, line: 348, type: !25)
!236 = !DILocalVariable(name: "pidstr", scope: !145, file: !3, line: 349, type: !237)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 12)
!240 = !DILocalVariable(name: "ut_host", scope: !241, file: !3, line: 377, type: !243)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 376, column: 5)
!242 = distinct !DILexicalBlock(scope: !145, file: !3, line: 375, column: 7)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2056, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 257)
!246 = !DILocalVariable(name: "host", scope: !241, file: !3, line: 378, type: !25)
!247 = !DILocalVariable(name: "display", scope: !241, file: !3, line: 379, type: !25)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "hostlen", scope: !145, file: !3, line: 341, type: !28, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "now", scope: !252, file: !3, line: 190, type: !38, isLocal: true, isDefinition: true)
!252 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !253, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !255)
!253 = !DISubroutineType(types: !254)
!254 = !{!36, !38, !38}
!255 = !{!256, !257, !258}
!256 = !DILocalVariable(name: "when", arg: 1, scope: !252, file: !3, line: 188, type: !38)
!257 = !DILocalVariable(name: "boottime", arg: 2, scope: !252, file: !3, line: 188, type: !38)
!258 = !DILocalVariable(name: "seconds_idle", scope: !259, file: !3, line: 197, type: !80)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 196, column: 5)
!260 = distinct !DILexicalBlock(scope: !252, file: !3, line: 195, column: 7)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !252, file: !3, line: 202, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 48, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 6)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "buf", scope: !268, file: !3, line: 220, type: !290, isLocal: true, isDefinition: true)
!268 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !269, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !271)
!269 = !DISubroutineType(types: !270)
!270 = !{!36, !148}
!271 = !{!272, !273, !274}
!272 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !268, file: !3, line: 218, type: !148)
!273 = !DILocalVariable(name: "t", scope: !268, file: !3, line: 228, type: !38)
!274 = !DILocalVariable(name: "tmp", scope: !268, file: !3, line: 229, type: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !277, line: 8, size: 448, elements: !278)
!277 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !276, file: !277, line: 10, baseType: !80, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !276, file: !277, line: 11, baseType: !80, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !276, file: !277, line: 12, baseType: !80, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !276, file: !277, line: 13, baseType: !80, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !276, file: !277, line: 14, baseType: !80, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !276, file: !277, line: 15, baseType: !80, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !276, file: !277, line: 16, baseType: !80, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !276, file: !277, line: 17, baseType: !80, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !276, file: !277, line: 18, baseType: !80, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !276, file: !277, line: 21, baseType: !42, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !276, file: !277, line: 22, baseType: !36, size: 64, offset: 384)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 264, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 33)
!293 = !DIGlobalVariableExpression(var: !294)
!294 = distinct !DIGlobalVariable(name: "runlevline", scope: !295, file: !3, line: 515, type: !25, isLocal: true, isDefinition: true)
!295 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 513, type: !296, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !148}
!298 = !{!299, !300, !301}
!299 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !295, file: !3, line: 513, type: !148)
!300 = !DILocalVariable(name: "last", scope: !295, file: !3, line: 516, type: !35)
!301 = !DILocalVariable(name: "curr", scope: !295, file: !3, line: 517, type: !35)
!302 = !DIGlobalVariableExpression(var: !303)
!303 = distinct !DIGlobalVariable(name: "comment", scope: !295, file: !3, line: 515, type: !25, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305)
!305 = distinct !DIGlobalVariable(name: "exitstr", scope: !306, file: !3, line: 460, type: !25, isLocal: true, isDefinition: true)
!306 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 458, type: !296, isLocal: true, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !307)
!307 = !{!308, !309, !310}
!308 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !306, file: !3, line: 458, type: !148)
!309 = !DILocalVariable(name: "comment", scope: !306, file: !3, line: 461, type: !25)
!310 = !DILocalVariable(name: "pidstr", scope: !306, file: !3, line: 462, type: !237)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 4608, elements: !321)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !314, line: 104, size: 256, elements: !315)
!314 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!315 = !{!316, !317, !318, !320}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !314, line: 106, baseType: !36, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !313, file: !314, line: 109, baseType: !80, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !314, line: 110, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !313, file: !314, line: 111, baseType: !80, size: 32, offset: 192)
!321 = !{!322}
!322 = !DISubrange(count: 18)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "Version", scope: !325, file: !326, line: 2, type: !36, isDefinition: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !328)
!326 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!327 = !{}
!328 = !{!323}
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "last_cherror", scope: !331, file: !337, line: 28, type: !80, isLocal: true, isDefinition: true)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !333)
!332 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !{!334, !329}
!334 = !DIGlobalVariableExpression(var: !335)
!335 = distinct !DIGlobalVariable(name: "hints", scope: !336, file: !337, line: 63, type: !346, isLocal: true, isDefinition: true)
!336 = distinct !DISubprogram(name: "canon_host_r", scope: !337, file: !337, line: 60, type: !338, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !331, variables: !340)
!337 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!338 = !DISubroutineType(types: !339)
!339 = !{!25, !36, !319}
!340 = !{!341, !342, !343, !344, !371}
!341 = !DILocalVariable(name: "host", arg: 1, scope: !336, file: !337, line: 60, type: !36)
!342 = !DILocalVariable(name: "cherror", arg: 2, scope: !336, file: !337, line: 60, type: !319)
!343 = !DILocalVariable(name: "retval", scope: !336, file: !337, line: 62, type: !25)
!344 = !DILocalVariable(name: "res", scope: !336, file: !337, line: 64, type: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !347, line: 566, size: 384, elements: !348)
!347 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!348 = !{!349, !350, !351, !352, !353, !357, !369, !370}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !346, file: !347, line: 568, baseType: !80, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !346, file: !347, line: 569, baseType: !80, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !346, file: !347, line: 570, baseType: !80, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !346, file: !347, line: 571, baseType: !80, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !346, file: !347, line: 572, baseType: !354, size: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !355, line: 33, baseType: !356)
!355 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !41, line: 198, baseType: !203)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !346, file: !347, line: 573, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !355, line: 172, size: 128, elements: !360)
!360 = !{!361, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !359, file: !355, line: 174, baseType: !362, size: 16)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !363, line: 28, baseType: !364)
!363 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!364 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !359, file: !355, line: 175, baseType: !366, size: 112, offset: 16)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 112, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 14)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !346, file: !347, line: 574, baseType: !25, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !346, file: !347, line: 575, baseType: !345, size: 64, offset: 320)
!371 = !DILocalVariable(name: "status", scope: !336, file: !337, line: 65, type: !80)
!372 = !DIGlobalVariableExpression(var: !373)
!373 = distinct !DIGlobalVariable(name: "file_name", scope: !374, file: !379, line: 36, type: !36, isLocal: true, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !376)
!375 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!376 = !{!372, !377}
!377 = !DIGlobalVariableExpression(var: !378)
!378 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !374, file: !379, line: 46, type: !47, isLocal: true, isDefinition: true)
!379 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!380 = !DIGlobalVariableExpression(var: !381)
!381 = distinct !DIGlobalVariable(name: "exit_failure", scope: !382, file: !385, line: 24, type: !386, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !384)
!383 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!384 = !{!380}
!385 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!386 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!387 = !DIGlobalVariableExpression(var: !388)
!388 = distinct !DIGlobalVariable(name: "program_name", scope: !389, file: !393, line: 33, type: !36, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !391, globals: !392)
!390 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!391 = !{!27, !25}
!392 = !{!387}
!393 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!394 = !DIGlobalVariableExpression(var: !395)
!395 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !396, file: !423, line: 77, type: !453, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !398, retainedTypes: !419, globals: !420)
!397 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!398 = !{!10, !399, !404}
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !11, line: 242, size: 32, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!402 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!403 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 46, size: 32, elements: !406)
!405 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!407 = !DIEnumerator(name: "_ISupper", value: 256)
!408 = !DIEnumerator(name: "_ISlower", value: 512)
!409 = !DIEnumerator(name: "_ISalpha", value: 1024)
!410 = !DIEnumerator(name: "_ISdigit", value: 2048)
!411 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!412 = !DIEnumerator(name: "_ISspace", value: 8192)
!413 = !DIEnumerator(name: "_ISprint", value: 16384)
!414 = !DIEnumerator(name: "_ISgraph", value: 32768)
!415 = !DIEnumerator(name: "_ISblank", value: 1)
!416 = !DIEnumerator(name: "_IScntrl", value: 2)
!417 = !DIEnumerator(name: "_ISpunct", value: 4)
!418 = !DIEnumerator(name: "_ISalnum", value: 8)
!419 = !{!80, !364, !28, !25}
!420 = !{!394, !421, !428, !438, !440, !442, !449, !451}
!421 = !DIGlobalVariableExpression(var: !422)
!422 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !396, file: !423, line: 93, type: !424, isDefinition: true)
!423 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 320, elements: !426)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!426 = !{!427}
!427 = !DISubrange(count: 10)
!428 = !DIGlobalVariableExpression(var: !429)
!429 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !396, file: !423, line: 1043, type: !430, isDefinition: true)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !423, line: 57, size: 448, elements: !431)
!431 = !{!432, !433, !434, !436, !437}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !430, file: !423, line: 60, baseType: !10, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !430, file: !423, line: 63, baseType: !80, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !430, file: !423, line: 67, baseType: !435, size: 256, offset: 64)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 256, elements: !130)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !430, file: !423, line: 70, baseType: !36, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !430, file: !423, line: 73, baseType: !36, size: 64, offset: 384)
!438 = !DIGlobalVariableExpression(var: !439)
!439 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !396, file: !423, line: 108, type: !430, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441)
!441 = distinct !DIGlobalVariable(name: "slot0", scope: !396, file: !423, line: 834, type: !167, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443)
!443 = distinct !DIGlobalVariable(name: "slotvec", scope: !396, file: !423, line: 837, type: !444, isLocal: true, isDefinition: true)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !423, line: 826, size: 128, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !445, file: !423, line: 828, baseType: !28, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !445, file: !423, line: 829, baseType: !25, size: 64, offset: 64)
!449 = !DIGlobalVariableExpression(var: !450)
!450 = distinct !DIGlobalVariable(name: "nslots", scope: !396, file: !423, line: 835, type: !80, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452)
!452 = distinct !DIGlobalVariable(name: "slotvec0", scope: !396, file: !423, line: 836, type: !445, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 704, elements: !455)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!455 = !{!456}
!456 = !DISubrange(count: 11)
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !459, file: !462, line: 26, type: !463, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, globals: !461)
!460 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !{!457}
!462 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 47)
!466 = !DIGlobalVariableExpression(var: !467)
!467 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !468, file: !812, line: 120, type: !813, isLocal: true, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !470, retainedTypes: !809, globals: !811)
!469 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!470 = !{!471}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !472, line: 41, size: 32, elements: !473)
!472 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!474 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!475 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!476 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!477 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!478 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!479 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!480 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!481 = !DIEnumerator(name: "DAY_1", value: 131079)
!482 = !DIEnumerator(name: "DAY_2", value: 131080)
!483 = !DIEnumerator(name: "DAY_3", value: 131081)
!484 = !DIEnumerator(name: "DAY_4", value: 131082)
!485 = !DIEnumerator(name: "DAY_5", value: 131083)
!486 = !DIEnumerator(name: "DAY_6", value: 131084)
!487 = !DIEnumerator(name: "DAY_7", value: 131085)
!488 = !DIEnumerator(name: "ABMON_1", value: 131086)
!489 = !DIEnumerator(name: "ABMON_2", value: 131087)
!490 = !DIEnumerator(name: "ABMON_3", value: 131088)
!491 = !DIEnumerator(name: "ABMON_4", value: 131089)
!492 = !DIEnumerator(name: "ABMON_5", value: 131090)
!493 = !DIEnumerator(name: "ABMON_6", value: 131091)
!494 = !DIEnumerator(name: "ABMON_7", value: 131092)
!495 = !DIEnumerator(name: "ABMON_8", value: 131093)
!496 = !DIEnumerator(name: "ABMON_9", value: 131094)
!497 = !DIEnumerator(name: "ABMON_10", value: 131095)
!498 = !DIEnumerator(name: "ABMON_11", value: 131096)
!499 = !DIEnumerator(name: "ABMON_12", value: 131097)
!500 = !DIEnumerator(name: "MON_1", value: 131098)
!501 = !DIEnumerator(name: "MON_2", value: 131099)
!502 = !DIEnumerator(name: "MON_3", value: 131100)
!503 = !DIEnumerator(name: "MON_4", value: 131101)
!504 = !DIEnumerator(name: "MON_5", value: 131102)
!505 = !DIEnumerator(name: "MON_6", value: 131103)
!506 = !DIEnumerator(name: "MON_7", value: 131104)
!507 = !DIEnumerator(name: "MON_8", value: 131105)
!508 = !DIEnumerator(name: "MON_9", value: 131106)
!509 = !DIEnumerator(name: "MON_10", value: 131107)
!510 = !DIEnumerator(name: "MON_11", value: 131108)
!511 = !DIEnumerator(name: "MON_12", value: 131109)
!512 = !DIEnumerator(name: "AM_STR", value: 131110)
!513 = !DIEnumerator(name: "PM_STR", value: 131111)
!514 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!515 = !DIEnumerator(name: "D_FMT", value: 131113)
!516 = !DIEnumerator(name: "T_FMT", value: 131114)
!517 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!518 = !DIEnumerator(name: "ERA", value: 131116)
!519 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!520 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!521 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!522 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!523 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!524 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!525 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!526 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!527 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!528 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!529 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!530 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!531 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!532 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!533 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!534 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!535 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!536 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!537 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!538 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!539 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!540 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!541 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!542 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!543 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!544 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!545 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!546 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!547 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!548 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!549 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!550 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!551 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!552 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!553 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!554 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!555 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!556 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!557 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!558 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!559 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!560 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!561 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!562 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!563 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!564 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!565 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!566 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!567 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!568 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!569 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!570 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!571 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!572 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!573 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!574 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!575 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!576 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!577 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!578 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!579 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!580 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!581 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!582 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!583 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!584 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!585 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!586 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!587 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!588 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!589 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!590 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!591 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!592 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!593 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!594 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!595 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!596 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!597 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!598 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!599 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!600 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!601 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!602 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!603 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!604 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!605 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!606 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!607 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!608 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!609 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!610 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!611 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!612 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!613 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!614 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!615 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!616 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!617 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!618 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!619 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!620 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!621 = !DIEnumerator(name: "CODESET", value: 14)
!622 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!623 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!624 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!625 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!629 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!630 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!631 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!632 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!633 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!634 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!635 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!636 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!637 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!638 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!639 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!640 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!649 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!650 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!651 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!652 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!653 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!654 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!655 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!656 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!657 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!658 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!659 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!660 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!661 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!662 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!668 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!669 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!670 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!671 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!672 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!673 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!674 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!675 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!676 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!677 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!678 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!679 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!680 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!681 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!682 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!683 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!684 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!685 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!686 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!687 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!688 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!689 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!690 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!691 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!692 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!693 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!694 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!695 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!696 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!697 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!698 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!699 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!700 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!701 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!702 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!703 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!704 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!705 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!706 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!707 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!708 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!709 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!710 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!711 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!712 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!713 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!714 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!715 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!717 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!718 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!719 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!720 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!721 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!722 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!723 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!724 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!725 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!726 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!727 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!728 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!729 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!730 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!731 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!732 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!733 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!736 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!737 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!738 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!739 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!740 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!741 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!742 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!743 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!744 = !DIEnumerator(name: "THOUSEP", value: 65537)
!745 = !DIEnumerator(name: "__GROUPING", value: 65538)
!746 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!747 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!748 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!749 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!750 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!751 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!752 = !DIEnumerator(name: "__YESSTR", value: 327682)
!753 = !DIEnumerator(name: "__NOSTR", value: 327683)
!754 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!755 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!756 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!757 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!758 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!759 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!760 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!761 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!762 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!763 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!764 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!765 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!766 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!767 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!768 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!769 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!770 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!771 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!772 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!773 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!774 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!775 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!776 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!777 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!778 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!779 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!780 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!781 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!782 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!783 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!784 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!785 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!786 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!787 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!788 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!789 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!790 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!791 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!792 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!793 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!794 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!795 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!796 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!797 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!798 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!799 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!800 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!801 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!802 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!803 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!804 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!805 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!806 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!807 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!808 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!809 = !{!27, !25, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!811 = !{!466}
!812 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!813 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !816)
!815 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!816 = !{!28, !31, !33, !36}
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !819)
!818 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !821, line: 135, baseType: !822)
!821 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !41, line: 61, baseType: !42)
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !825, retainedTypes: !830)
!824 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!825 = !{!826}
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !827, line: 41, size: 32, elements: !828)
!827 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!828 = !{!829}
!829 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!830 = !{!27}
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !833, retainedTypes: !847)
!832 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!833 = !{!834}
!834 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !836, file: !835, line: 192, size: 32, elements: !845)
!835 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = distinct !DISubprogram(name: "x2nrealloc", scope: !835, file: !835, line: 180, type: !837, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !831, variables: !840)
!837 = !DISubroutineType(types: !838)
!838 = !{!27, !27, !839, !28}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!840 = !{!841, !842, !843, !844}
!841 = !DILocalVariable(name: "p", arg: 1, scope: !836, file: !835, line: 180, type: !27)
!842 = !DILocalVariable(name: "pn", arg: 2, scope: !836, file: !835, line: 180, type: !839)
!843 = !DILocalVariable(name: "s", arg: 3, scope: !836, file: !835, line: 180, type: !28)
!844 = !DILocalVariable(name: "n", scope: !836, file: !835, line: 182, type: !28)
!845 = !{!846}
!846 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!847 = !{!28, !25, !27}
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!849 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !830)
!851 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !854)
!853 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!854 = !{!28}
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !857, retainedTypes: !865)
!856 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = !{!5, !858}
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !859, file: !835, line: 192, size: 32, elements: !845)
!859 = distinct !DISubprogram(name: "x2nrealloc", scope: !835, file: !835, line: 180, type: !837, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !855, variables: !860)
!860 = !{!861, !862, !863, !864}
!861 = !DILocalVariable(name: "p", arg: 1, scope: !859, file: !835, line: 180, type: !27)
!862 = !DILocalVariable(name: "pn", arg: 2, scope: !859, file: !835, line: 180, type: !839)
!863 = !DILocalVariable(name: "s", arg: 3, scope: !859, file: !835, line: 180, type: !28)
!864 = !DILocalVariable(name: "n", scope: !859, file: !835, line: 182, type: !28)
!865 = !{!25, !27}
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!867 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327)
!869 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !830)
!871 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !830)
!873 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!875 = !{i32 2, !"Dwarf Version", i32 4}
!876 = !{i32 2, !"Debug Info Version", i32 3}
!877 = !{i32 1, !"PIC Level", i32 2}
!878 = !{i32 1, !"PIE Level", i32 2}
!879 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 637, type: !880, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !80}
!882 = !{!883}
!883 = !DILocalVariable(name: "status", arg: 1, scope: !879, file: !3, line: 637, type: !80)
!884 = !DIExpression()
!885 = !DILocation(line: 637, column: 12, scope: !879)
!886 = !DILocation(line: 639, column: 14, scope: !887)
!887 = distinct !DILexicalBlock(scope: !879, file: !3, line: 639, column: 7)
!888 = !DILocation(line: 639, column: 7, scope: !879)
!889 = !DILocation(line: 640, column: 5, scope: !890)
!890 = !DILexicalBlockFile(scope: !891, file: !3, discriminator: 1)
!891 = distinct !DILexicalBlock(scope: !887, file: !3, line: 640, column: 5)
!892 = !{!893, !893, i64 0}
!893 = !{!"any pointer", !894, i64 0}
!894 = !{!"omnipotent char", !895, i64 0}
!895 = !{!"Simple C/C++ TBAA"}
!896 = !DILocation(line: 640, column: 5, scope: !897)
!897 = !DILexicalBlockFile(scope: !891, file: !3, discriminator: 3)
!898 = !DILocation(line: 640, column: 5, scope: !899)
!899 = !DILexicalBlockFile(scope: !891, file: !3, discriminator: 2)
!900 = !DILocation(line: 643, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !887, file: !3, line: 642, column: 5)
!902 = !DILocation(line: 643, column: 7, scope: !903)
!903 = !DILexicalBlockFile(scope: !901, file: !3, discriminator: 1)
!904 = !DILocation(line: 644, column: 7, scope: !901)
!905 = !DILocation(line: 644, column: 7, scope: !903)
!906 = !DILocation(line: 647, column: 7, scope: !901)
!907 = !DILocation(line: 647, column: 7, scope: !903)
!908 = !DILocation(line: 654, column: 7, scope: !901)
!909 = !DILocation(line: 654, column: 7, scope: !903)
!910 = !DILocation(line: 657, column: 7, scope: !901)
!911 = !DILocation(line: 657, column: 7, scope: !903)
!912 = !DILocation(line: 662, column: 7, scope: !901)
!913 = !DILocation(line: 662, column: 7, scope: !903)
!914 = !DILocation(line: 668, column: 7, scope: !901)
!915 = !DILocation(line: 668, column: 7, scope: !903)
!916 = !DILocation(line: 674, column: 7, scope: !901)
!917 = !DILocation(line: 674, column: 7, scope: !903)
!918 = !DILocation(line: 675, column: 7, scope: !901)
!919 = !DILocation(line: 675, column: 7, scope: !903)
!920 = !DILocation(line: 676, column: 7, scope: !901)
!921 = !DILocation(line: 676, column: 7, scope: !903)
!922 = !DILocation(line: 642, column: 15, scope: !83, inlinedAt: !923)
!923 = distinct !DILocation(line: 681, column: 7, scope: !901)
!924 = !DILocation(line: 651, column: 3, scope: !83, inlinedAt: !923)
!925 = !DILocation(line: 651, column: 3, scope: !926, inlinedAt: !923)
!926 = !DILexicalBlockFile(scope: !83, file: !84, discriminator: 1)
!927 = !DILocation(line: 655, column: 29, scope: !83, inlinedAt: !923)
!928 = !DILocation(line: 655, column: 15, scope: !83, inlinedAt: !923)
!929 = !DILocation(line: 656, column: 7, scope: !103, inlinedAt: !923)
!930 = !DILocation(line: 656, column: 19, scope: !103, inlinedAt: !923)
!931 = !DILocation(line: 656, column: 22, scope: !932, inlinedAt: !923)
!932 = !DILexicalBlockFile(scope: !103, file: !84, discriminator: 16)
!933 = !DILocation(line: 656, column: 7, scope: !934, inlinedAt: !923)
!934 = !DILexicalBlockFile(scope: !83, file: !84, discriminator: 16)
!935 = !DILocation(line: 662, column: 7, scope: !936, inlinedAt: !923)
!936 = distinct !DILexicalBlock(scope: !103, file: !84, line: 657, column: 5)
!937 = !DILocation(line: 662, column: 7, scope: !938, inlinedAt: !923)
!938 = !DILexicalBlockFile(scope: !936, file: !84, discriminator: 1)
!939 = !DILocation(line: 664, column: 5, scope: !936, inlinedAt: !923)
!940 = !DILocation(line: 665, column: 3, scope: !83, inlinedAt: !923)
!941 = !DILocation(line: 665, column: 3, scope: !926, inlinedAt: !923)
!942 = !DILocation(line: 667, column: 3, scope: !83, inlinedAt: !923)
!943 = !DILocation(line: 667, column: 3, scope: !926, inlinedAt: !923)
!944 = !DILocation(line: 683, column: 3, scope: !879)
!945 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 687, type: !946, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !949)
!946 = !DISubroutineType(types: !947)
!947 = !{!80, !80, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!949 = !{!950, !951, !952, !953}
!950 = !DILocalVariable(name: "argc", arg: 1, scope: !945, file: !3, line: 687, type: !80)
!951 = !DILocalVariable(name: "argv", arg: 2, scope: !945, file: !3, line: 687, type: !948)
!952 = !DILocalVariable(name: "optc", scope: !945, file: !3, line: 689, type: !80)
!953 = !DILocalVariable(name: "assumptions", scope: !945, file: !3, line: 690, type: !47)
!954 = !DILocation(line: 687, column: 11, scope: !945)
!955 = !DILocation(line: 687, column: 24, scope: !945)
!956 = !DILocation(line: 690, column: 8, scope: !945)
!957 = !DILocation(line: 693, column: 21, scope: !945)
!958 = !DILocation(line: 693, column: 3, scope: !945)
!959 = !DILocation(line: 694, column: 3, scope: !945)
!960 = !DILocation(line: 695, column: 3, scope: !945)
!961 = !DILocation(line: 696, column: 3, scope: !945)
!962 = !DILocation(line: 698, column: 3, scope: !945)
!963 = !DILocation(line: 700, column: 3, scope: !945)
!964 = !DILocation(line: 700, column: 18, scope: !965)
!965 = !DILexicalBlockFile(scope: !945, file: !3, discriminator: 1)
!966 = !DILocation(line: 689, column: 7, scope: !945)
!967 = !DILocation(line: 700, column: 3, scope: !965)
!968 = !DILocation(line: 717, column: 11, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !3, line: 704, column: 9)
!970 = distinct !DILexicalBlock(scope: !945, file: !3, line: 702, column: 5)
!971 = !DILocation(line: 729, column: 11, scope: !969)
!972 = !DILocation(line: 733, column: 11, scope: !969)
!973 = !DILocation(line: 739, column: 11, scope: !969)
!974 = !DILocation(line: 743, column: 11, scope: !969)
!975 = !DILocation(line: 748, column: 11, scope: !969)
!976 = !DILocation(line: 752, column: 11, scope: !969)
!977 = !DILocation(line: 758, column: 11, scope: !969)
!978 = !DILocation(line: 762, column: 11, scope: !969)
!979 = !DILocation(line: 767, column: 11, scope: !969)
!980 = !DILocation(line: 772, column: 11, scope: !969)
!981 = !DILocation(line: 778, column: 11, scope: !969)
!982 = !DILocation(line: 782, column: 11, scope: !969)
!983 = distinct !{!983, !963, !984}
!984 = !DILocation(line: 791, column: 5, scope: !945)
!985 = !DILocation(line: 784, column: 9, scope: !969)
!986 = !DILocation(line: 786, column: 9, scope: !969)
!987 = !DILocation(line: 786, column: 9, scope: !988)
!988 = !DILexicalBlockFile(scope: !969, file: !3, discriminator: 1)
!989 = !DILocation(line: 789, column: 11, scope: !969)
!990 = !DILocation(line: 793, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !945, file: !3, line: 793, column: 7)
!992 = !DILocation(line: 793, column: 7, scope: !945)
!993 = !DILocation(line: 797, column: 5, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !3, line: 794, column: 5)
!995 = !DILocation(line: 799, column: 7, scope: !945)
!996 = !DILocation(line: 802, column: 5, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 800, column: 5)
!998 = distinct !DILexicalBlock(scope: !945, file: !3, line: 799, column: 7)
!999 = !DILocation(line: 804, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !945, file: !3, line: 804, column: 7)
!1001 = !DILocation(line: 804, column: 7, scope: !945)
!1002 = !{!1003, !1003, i64 0}
!1003 = !{!"int", !894, i64 0}
!1004 = !DILocation(line: 815, column: 18, scope: !945)
!1005 = !DILocation(line: 815, column: 16, scope: !945)
!1006 = !DILocation(line: 815, column: 3, scope: !945)
!1007 = !DILocation(line: 818, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !945, file: !3, line: 816, column: 5)
!1009 = !DILocation(line: 822, column: 7, scope: !1008)
!1010 = !DILocation(line: 823, column: 7, scope: !1008)
!1011 = !DILocation(line: 826, column: 12, scope: !1008)
!1012 = !DILocation(line: 826, column: 7, scope: !1008)
!1013 = !DILocation(line: 827, column: 7, scope: !1008)
!1014 = !DILocation(line: 830, column: 20, scope: !1008)
!1015 = !DILocation(line: 830, column: 55, scope: !1008)
!1016 = !DILocation(line: 830, column: 62, scope: !1008)
!1017 = !DILocation(line: 830, column: 50, scope: !1008)
!1018 = !DILocation(line: 830, column: 43, scope: !1019)
!1019 = !DILexicalBlockFile(scope: !1008, file: !3, discriminator: 1)
!1020 = !DILocation(line: 830, column: 7, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !1008, file: !3, discriminator: 2)
!1022 = !DILocation(line: 831, column: 7, scope: !1008)
!1023 = !DILocation(line: 834, column: 3, scope: !945)
!1024 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 620, type: !1025, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !36, !80}
!1027 = !{!1028, !1029, !1030, !1031}
!1028 = !DILocalVariable(name: "filename", arg: 1, scope: !1024, file: !3, line: 620, type: !36)
!1029 = !DILocalVariable(name: "options", arg: 2, scope: !1024, file: !3, line: 620, type: !80)
!1030 = !DILocalVariable(name: "n_users", scope: !1024, file: !3, line: 622, type: !28)
!1031 = !DILocalVariable(name: "utmp_buf", scope: !1024, file: !3, line: 623, type: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!1033 = !DILocation(line: 338, column: 8, scope: !145, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 592, column: 13, scope: !1035, inlinedAt: !1047)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 591, column: 15)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 590, column: 9)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 587, column: 11)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 586, column: 5)
!1039 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 568, type: !1040, isLocal: true, isDefinition: true, scopeLine: 569, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1042)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !28, !148}
!1042 = !{!1043, !1044, !1045, !1046}
!1043 = !DILocalVariable(name: "n", arg: 1, scope: !1039, file: !3, line: 568, type: !28)
!1044 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !1039, file: !3, line: 568, type: !148)
!1045 = !DILocalVariable(name: "ttyname_b", scope: !1039, file: !3, line: 570, type: !25)
!1046 = !DILocalVariable(name: "boottime", scope: !1039, file: !3, line: 571, type: !38)
!1047 = distinct !DILocation(line: 631, column: 5, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 628, column: 7)
!1049 = !DILocation(line: 347, column: 8, scope: !145, inlinedAt: !1034)
!1050 = !DILocation(line: 349, column: 3, scope: !145, inlinedAt: !1034)
!1051 = !DILocation(line: 377, column: 12, scope: !241, inlinedAt: !1034)
!1052 = !DILocation(line: 620, column: 18, scope: !1024)
!1053 = !DILocation(line: 620, column: 32, scope: !1024)
!1054 = !DILocation(line: 622, column: 3, scope: !1024)
!1055 = !DILocation(line: 623, column: 3, scope: !1024)
!1056 = !DIExpression(DW_OP_deref)
!1057 = !DILocation(line: 622, column: 10, scope: !1024)
!1058 = !DILocation(line: 623, column: 16, scope: !1024)
!1059 = !DILocation(line: 625, column: 7, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 625, column: 7)
!1061 = !DILocation(line: 625, column: 58, scope: !1060)
!1062 = !DILocation(line: 625, column: 7, scope: !1024)
!1063 = !DILocation(line: 626, column: 5, scope: !1060)
!1064 = !DILocation(line: 626, column: 5, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1060, file: !3, discriminator: 1)
!1066 = !DILocation(line: 626, column: 5, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1060, file: !3, discriminator: 2)
!1068 = !{!1069, !1069, i64 0}
!1069 = !{!"long", !894, i64 0}
!1070 = !DILocation(line: 628, column: 7, scope: !1024)
!1071 = !DILocalVariable(name: "n", arg: 1, scope: !1072, file: !3, line: 536, type: !28)
!1072 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 536, type: !1040, isLocal: true, isDefinition: true, scopeLine: 537, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1073)
!1073 = !{!1071, !1074, !1075, !1076, !1077}
!1074 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !1072, file: !3, line: 536, type: !148)
!1075 = !DILocalVariable(name: "entries", scope: !1072, file: !3, line: 538, type: !30)
!1076 = !DILocalVariable(name: "separator", scope: !1072, file: !3, line: 539, type: !36)
!1077 = !DILocalVariable(name: "trimmed_name", scope: !1078, file: !3, line: 545, type: !25)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 544, column: 9)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 543, column: 11)
!1080 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 542, column: 5)
!1081 = !DILocation(line: 536, column: 26, scope: !1072, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 629, column: 5, scope: !1048)
!1083 = !DILocation(line: 536, column: 48, scope: !1072, inlinedAt: !1082)
!1084 = !DILocation(line: 538, column: 21, scope: !1072, inlinedAt: !1082)
!1085 = !DILocation(line: 539, column: 15, scope: !1072, inlinedAt: !1082)
!1086 = !DILocation(line: 541, column: 3, scope: !1087, inlinedAt: !1082)
!1087 = !DILexicalBlockFile(scope: !1072, file: !3, discriminator: 1)
!1088 = !DILocation(line: 541, column: 11, scope: !1087, inlinedAt: !1082)
!1089 = !DILocation(line: 543, column: 11, scope: !1079, inlinedAt: !1082)
!1090 = !{!894, !894, i64 0}
!1091 = !DILocation(line: 543, column: 11, scope: !1092, inlinedAt: !1082)
!1092 = !DILexicalBlockFile(scope: !1079, file: !3, discriminator: 1)
!1093 = !{!1094, !1095, i64 0}
!1094 = !{!"utmpx", !1095, i64 0, !1003, i64 4, !894, i64 8, !894, i64 40, !894, i64 44, !894, i64 76, !1096, i64 332, !1003, i64 336, !1097, i64 340, !894, i64 348, !894, i64 364}
!1095 = !{!"short", !894, i64 0}
!1096 = !{!"__exit_status", !1095, i64 0, !1095, i64 2}
!1097 = !{!"", !1003, i64 0, !1003, i64 4}
!1098 = !DILocation(line: 543, column: 11, scope: !1099, inlinedAt: !1082)
!1099 = !DILexicalBlockFile(scope: !1080, file: !3, discriminator: 1)
!1100 = !DILocation(line: 547, column: 26, scope: !1078, inlinedAt: !1082)
!1101 = !DILocation(line: 545, column: 17, scope: !1078, inlinedAt: !1082)
!1102 = !DILocation(line: 549, column: 11, scope: !1078, inlinedAt: !1082)
!1103 = !DILocation(line: 550, column: 11, scope: !1078, inlinedAt: !1082)
!1104 = !DILocation(line: 552, column: 18, scope: !1078, inlinedAt: !1082)
!1105 = !DILocation(line: 553, column: 9, scope: !1078, inlinedAt: !1082)
!1106 = !DILocation(line: 554, column: 15, scope: !1080, inlinedAt: !1082)
!1107 = distinct !{!1107, !1108, !1109}
!1108 = !DILocation(line: 541, column: 3, scope: !1072)
!1109 = !DILocation(line: 555, column: 5, scope: !1072)
!1110 = !DILocation(line: 556, column: 3, scope: !1072, inlinedAt: !1082)
!1111 = !DILocation(line: 556, column: 3, scope: !1087, inlinedAt: !1082)
!1112 = !DILocation(line: 629, column: 5, scope: !1048)
!1113 = !DILocation(line: 462, column: 3, scope: !306, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 607, column: 13, scope: !1115, inlinedAt: !1047)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !3, line: 606, column: 20)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 604, column: 20)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 602, column: 20)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 600, column: 20)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 595, column: 20)
!1120 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 593, column: 20)
!1121 = !DILocalVariable(name: "pidstr", scope: !1122, file: !3, line: 484, type: !237)
!1122 = distinct !DISubprogram(name: "print_login", scope: !3, file: !3, line: 481, type: !296, isLocal: true, isDefinition: true, scopeLine: 482, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1123)
!1123 = !{!1124, !1125, !1121}
!1124 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1122, file: !3, line: 481, type: !148)
!1125 = !DILocalVariable(name: "comment", scope: !1122, file: !3, line: 483, type: !25)
!1126 = !DILocation(line: 484, column: 3, scope: !1122, inlinedAt: !1127)
!1127 = distinct !DILocation(line: 605, column: 13, scope: !1116, inlinedAt: !1047)
!1128 = !DILocalVariable(name: "pidstr", scope: !1129, file: !3, line: 497, type: !237)
!1129 = distinct !DISubprogram(name: "print_initspawn", scope: !3, file: !3, line: 494, type: !296, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1130)
!1130 = !{!1131, !1132, !1128}
!1131 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1129, file: !3, line: 494, type: !148)
!1132 = !DILocalVariable(name: "comment", scope: !1129, file: !3, line: 496, type: !25)
!1133 = !DILocation(line: 497, column: 3, scope: !1129, inlinedAt: !1134)
!1134 = distinct !DILocation(line: 603, column: 13, scope: !1117, inlinedAt: !1047)
!1135 = !DILocation(line: 568, column: 22, scope: !1039, inlinedAt: !1047)
!1136 = !DILocation(line: 568, column: 44, scope: !1039, inlinedAt: !1047)
!1137 = !DILocation(line: 571, column: 10, scope: !1039, inlinedAt: !1047)
!1138 = !DILocation(line: 573, column: 7, scope: !1039, inlinedAt: !1047)
!1139 = !DILocation(line: 562, column: 19, scope: !1140, inlinedAt: !1143)
!1140 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 560, type: !1141, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !327)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null}
!1143 = distinct !DILocation(line: 574, column: 5, scope: !1144, inlinedAt: !1047)
!1144 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 573, column: 7)
!1145 = !DILocation(line: 562, column: 39, scope: !1146, inlinedAt: !1143)
!1146 = !DILexicalBlockFile(scope: !1140, file: !3, discriminator: 1)
!1147 = !DILocation(line: 562, column: 50, scope: !1148, inlinedAt: !1143)
!1148 = !DILexicalBlockFile(scope: !1140, file: !3, discriminator: 2)
!1149 = !DILocation(line: 562, column: 61, scope: !1150, inlinedAt: !1143)
!1150 = !DILexicalBlockFile(scope: !1140, file: !3, discriminator: 3)
!1151 = !DILocation(line: 563, column: 15, scope: !1140, inlinedAt: !1143)
!1152 = !DILocation(line: 563, column: 25, scope: !1146, inlinedAt: !1143)
!1153 = !DILocation(line: 563, column: 39, scope: !1148, inlinedAt: !1143)
!1154 = !DILocation(line: 562, column: 3, scope: !1155, inlinedAt: !1143)
!1155 = !DILexicalBlockFile(scope: !1140, file: !3, discriminator: 4)
!1156 = !DILocation(line: 574, column: 5, scope: !1144, inlinedAt: !1047)
!1157 = !DILocation(line: 576, column: 7, scope: !1039, inlinedAt: !1047)
!1158 = !DILocation(line: 578, column: 19, scope: !1159, inlinedAt: !1047)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 577, column: 5)
!1160 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 576, column: 7)
!1161 = !DILocation(line: 570, column: 9, scope: !1039, inlinedAt: !1047)
!1162 = !DILocation(line: 579, column: 12, scope: !1163, inlinedAt: !1047)
!1163 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 579, column: 11)
!1164 = !DILocation(line: 579, column: 11, scope: !1159, inlinedAt: !1047)
!1165 = !DILocation(line: 581, column: 11, scope: !1166, inlinedAt: !1047)
!1166 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 581, column: 11)
!1167 = !DILocation(line: 581, column: 64, scope: !1166, inlinedAt: !1047)
!1168 = !DILocation(line: 582, column: 19, scope: !1166, inlinedAt: !1047)
!1169 = !DILocation(line: 581, column: 11, scope: !1159, inlinedAt: !1047)
!1170 = !DILocation(line: 585, column: 3, scope: !1171, inlinedAt: !1047)
!1171 = !DILexicalBlockFile(scope: !1039, file: !3, discriminator: 1)
!1172 = !DILocation(line: 585, column: 11, scope: !1171, inlinedAt: !1047)
!1173 = !DILocation(line: 588, column: 11, scope: !1037, inlinedAt: !1047)
!1174 = !DILocation(line: 588, column: 14, scope: !1175, inlinedAt: !1047)
!1175 = !DILexicalBlockFile(scope: !1037, file: !3, discriminator: 1)
!1176 = !DILocation(line: 587, column: 11, scope: !1177, inlinedAt: !1047)
!1177 = !DILexicalBlockFile(scope: !1038, file: !3, discriminator: 1)
!1178 = !DILocation(line: 591, column: 26, scope: !1035, inlinedAt: !1047)
!1179 = !DILocation(line: 591, column: 29, scope: !1180, inlinedAt: !1047)
!1180 = !DILexicalBlockFile(scope: !1035, file: !3, discriminator: 1)
!1181 = !DILocation(line: 591, column: 29, scope: !1182, inlinedAt: !1047)
!1182 = !DILexicalBlockFile(scope: !1035, file: !3, discriminator: 2)
!1183 = !DILocation(line: 591, column: 15, scope: !1184, inlinedAt: !1047)
!1184 = !DILexicalBlockFile(scope: !1036, file: !3, discriminator: 2)
!1185 = !DILocation(line: 333, column: 32, scope: !145, inlinedAt: !1034)
!1186 = !DILocation(line: 333, column: 49, scope: !145, inlinedAt: !1034)
!1187 = !DILocation(line: 335, column: 3, scope: !145, inlinedAt: !1034)
!1188 = !DILocation(line: 338, column: 3, scope: !145, inlinedAt: !1034)
!1189 = !DILocation(line: 347, column: 3, scope: !145, inlinedAt: !1034)
!1190 = !DILocation(line: 348, column: 9, scope: !145, inlinedAt: !1034)
!1191 = !{!1094, !1003, i64 4}
!1192 = !DILocation(line: 354, column: 10, scope: !1193, inlinedAt: !1034)
!1193 = distinct !DILexicalBlock(scope: !145, file: !3, line: 354, column: 8)
!1194 = !DILocation(line: 354, column: 8, scope: !145, inlinedAt: !1034)
!1195 = !DILocation(line: 355, column: 9, scope: !1193, inlinedAt: !1034)
!1196 = !DILocalVariable(name: "dest", arg: 1, scope: !1197, file: !84, line: 737, type: !1200)
!1197 = distinct !DISubprogram(name: "stzncpy", scope: !84, file: !84, line: 737, type: !1198, isLocal: true, isDefinition: true, scopeLine: 738, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1202)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!25, !1200, !1201, !28}
!1200 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !25)
!1201 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !36)
!1202 = !{!1196, !1203, !1204, !1205}
!1203 = !DILocalVariable(name: "src", arg: 2, scope: !1197, file: !84, line: 737, type: !1201)
!1204 = !DILocalVariable(name: "len", arg: 3, scope: !1197, file: !84, line: 737, type: !28)
!1205 = !DILocalVariable(name: "src_end", scope: !1197, file: !84, line: 739, type: !36)
!1206 = !DILocation(line: 737, column: 25, scope: !1197, inlinedAt: !1207)
!1207 = distinct !DILocation(line: 356, column: 3, scope: !145, inlinedAt: !1034)
!1208 = !DILocation(line: 737, column: 52, scope: !1197, inlinedAt: !1207)
!1209 = !DILocation(line: 740, column: 24, scope: !1210, inlinedAt: !1207)
!1210 = !DILexicalBlockFile(scope: !1197, file: !84, discriminator: 2)
!1211 = !DILocation(line: 740, column: 3, scope: !1212, inlinedAt: !1207)
!1212 = !DILexicalBlockFile(scope: !1197, file: !84, discriminator: 3)
!1213 = !DILocation(line: 739, column: 29, scope: !1197, inlinedAt: !1207)
!1214 = !DILocation(line: 741, column: 19, scope: !1197, inlinedAt: !1207)
!1215 = !DILocation(line: 741, column: 10, scope: !1197, inlinedAt: !1207)
!1216 = !DILocation(line: 741, column: 13, scope: !1197, inlinedAt: !1207)
!1217 = !{!1218}
!1218 = distinct !{!1218, !1219, !"stzncpy: argument 0"}
!1219 = distinct !{!1219, !"stzncpy"}
!1220 = !{!1221}
!1221 = distinct !{!1221, !1219, !"stzncpy: argument 1"}
!1222 = !DILocation(line: 740, column: 14, scope: !1223, inlinedAt: !1207)
!1223 = !DILexicalBlockFile(scope: !1197, file: !84, discriminator: 1)
!1224 = !DILocation(line: 740, column: 24, scope: !1223, inlinedAt: !1207)
!1225 = distinct !{!1225, !1226, !1227}
!1226 = !DILocation(line: 740, column: 3, scope: !1197)
!1227 = !DILocation(line: 741, column: 19, scope: !1197)
!1228 = !DILocation(line: 742, column: 9, scope: !1197, inlinedAt: !1207)
!1229 = !DILocation(line: 335, column: 15, scope: !145, inlinedAt: !1034)
!1230 = !DILocalVariable(name: "__path", arg: 1, scope: !1231, file: !1232, line: 449, type: !36)
!1231 = distinct !DISubprogram(name: "stat", scope: !1232, file: !1232, line: 449, type: !1233, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1236)
!1232 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!80, !36, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!1236 = !{!1230, !1237}
!1237 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1231, file: !1232, line: 449, type: !1235)
!1238 = !DILocation(line: 449, column: 1, scope: !1231, inlinedAt: !1239)
!1239 = distinct !DILocation(line: 358, column: 7, scope: !1240, inlinedAt: !1034)
!1240 = distinct !DILexicalBlock(scope: !145, file: !3, line: 358, column: 7)
!1241 = !DILocation(line: 451, column: 10, scope: !1231, inlinedAt: !1239)
!1242 = !DILocation(line: 358, column: 27, scope: !1240, inlinedAt: !1034)
!1243 = !DILocation(line: 358, column: 7, scope: !145, inlinedAt: !1034)
!1244 = !DILocalVariable(name: "pstat", arg: 1, scope: !1245, file: !3, line: 317, type: !1248)
!1245 = distinct !DISubprogram(name: "is_tty_writable", scope: !3, file: !3, line: 317, type: !1246, isLocal: true, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1250)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!47, !1248}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!1250 = !{!1244}
!1251 = !DILocation(line: 317, column: 37, scope: !1245, inlinedAt: !1252)
!1252 = distinct !DILocation(line: 360, column: 14, scope: !1253, inlinedAt: !1034)
!1253 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 359, column: 5)
!1254 = !DILocation(line: 327, column: 17, scope: !1245, inlinedAt: !1252)
!1255 = !{!1256, !1003, i64 24}
!1256 = !{!"stat", !1069, i64 0, !1069, i64 8, !1069, i64 16, !1003, i64 24, !1003, i64 28, !1003, i64 32, !1003, i64 36, !1069, i64 40, !1069, i64 48, !1069, i64 56, !1069, i64 64, !1257, i64 72, !1257, i64 88, !1257, i64 104, !894, i64 120}
!1257 = !{!"timespec", !1069, i64 0, !1069, i64 8}
!1258 = !DILocation(line: 360, column: 14, scope: !1253, inlinedAt: !1034)
!1259 = !DILocation(line: 337, column: 8, scope: !145, inlinedAt: !1034)
!1260 = !DILocation(line: 361, column: 27, scope: !1253, inlinedAt: !1034)
!1261 = !{!1256, !1069, i64 72}
!1262 = !DILocation(line: 336, column: 10, scope: !145, inlinedAt: !1034)
!1263 = !DILocation(line: 369, column: 7, scope: !1264, inlinedAt: !1034)
!1264 = distinct !DILexicalBlock(scope: !145, file: !3, line: 369, column: 7)
!1265 = !DILocation(line: 369, column: 7, scope: !145, inlinedAt: !1034)
!1266 = !DILocation(line: 188, column: 21, scope: !252, inlinedAt: !1267)
!1267 = distinct !DILocation(line: 370, column: 5, scope: !1264, inlinedAt: !1034)
!1268 = !DILocation(line: 188, column: 34, scope: !252, inlinedAt: !1267)
!1269 = !DILocation(line: 192, column: 7, scope: !1270, inlinedAt: !1267)
!1270 = distinct !DILexicalBlock(scope: !252, file: !3, line: 192, column: 7)
!1271 = !DILocation(line: 192, column: 11, scope: !1270, inlinedAt: !1267)
!1272 = !DILocation(line: 192, column: 7, scope: !252, inlinedAt: !1267)
!1273 = !DILocation(line: 193, column: 5, scope: !1270, inlinedAt: !1267)
!1274 = !DILocation(line: 195, column: 16, scope: !260, inlinedAt: !1267)
!1275 = !DILocation(line: 195, column: 23, scope: !260, inlinedAt: !1267)
!1276 = !DILocation(line: 195, column: 26, scope: !1277, inlinedAt: !1267)
!1277 = !DILexicalBlockFile(scope: !260, file: !3, discriminator: 1)
!1278 = !DILocation(line: 195, column: 30, scope: !1277, inlinedAt: !1267)
