; ModuleID = 'coreutils-8.27/src/chcon.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 72, type: !115, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !33)
!3 = !DIFile(filename: "src/chcon.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !{!20, !22, !23, !26, !28, !31}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 62, baseType: !25)
!24 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!25 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!33 = !{!34, !66, !68, !70, !72, !75, !77, !79, !81, !83, !85, !0}
!34 = !DIGlobalVariableExpression(var: !35)
!35 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !36, file: !3, line: 573, type: !55, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 411, type: !37, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !41)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !39, !40}
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!41 = !{!42, !43, !44, !45, !46, !48, !49, !50, !51, !52}
!42 = !DILocalVariable(name: "argc", arg: 1, scope: !36, file: !3, line: 411, type: !39)
!43 = !DILocalVariable(name: "argv", arg: 2, scope: !36, file: !3, line: 411, type: !40)
!44 = !DILocalVariable(name: "bit_flags", scope: !36, file: !3, line: 414, type: !39)
!45 = !DILocalVariable(name: "dereference", scope: !36, file: !3, line: 418, type: !39)
!46 = !DILocalVariable(name: "ok", scope: !36, file: !3, line: 420, type: !47)
!47 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!48 = !DILocalVariable(name: "preserve_root", scope: !36, file: !3, line: 421, type: !47)
!49 = !DILocalVariable(name: "component_specified", scope: !36, file: !3, line: 422, type: !47)
!50 = !DILocalVariable(name: "reference_file", scope: !36, file: !3, line: 423, type: !20)
!51 = !DILocalVariable(name: "optc", scope: !36, file: !3, line: 424, type: !39)
!52 = !DILocalVariable(name: "ref_context", scope: !53, file: !3, line: 544, type: !20)
!53 = distinct !DILexicalBlock(scope: !54, file: !3, line: 543, column: 5)
!54 = distinct !DILexicalBlock(scope: !36, file: !3, line: 542, column: 7)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !56, line: 7, size: 128, elements: !57)
!56 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!57 = !{!58, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !55, file: !56, line: 9, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !60, line: 48, baseType: !61)
!60 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !62, line: 136, baseType: !25)
!62 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !55, file: !56, line: 10, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !60, line: 60, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !62, line: 133, baseType: !25)
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "affect_symlink_referent", scope: !2, file: !3, line: 41, type: !47, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69)
!69 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 44, type: !47, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71)
!71 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !47, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 51, type: !74, isLocal: true, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!75 = !DIGlobalVariableExpression(var: !76)
!76 = distinct !DIGlobalVariable(name: "specified_context", scope: !2, file: !3, line: 54, type: !31, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78)
!78 = distinct !DIGlobalVariable(name: "specified_user", scope: !2, file: !3, line: 57, type: !31, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80)
!80 = distinct !DIGlobalVariable(name: "specified_role", scope: !2, file: !3, line: 58, type: !31, isLocal: true, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82)
!82 = distinct !DIGlobalVariable(name: "specified_range", scope: !2, file: !3, line: 59, type: !31, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "specified_type", scope: !2, file: !3, line: 60, type: !31, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "infomap", scope: !87, file: !88, line: 632, type: !112, isLocal: true, isDefinition: true)
!87 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !88, file: !88, line: 630, type: !89, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !91)
!88 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!89 = !DISubroutineType(types: !90)
!90 = !{null, !31}
!91 = !{!92, !93, !94, !101, !103, !104, !105, !108, !109, !111}
!92 = !DILocalVariable(name: "program", arg: 1, scope: !87, file: !88, line: 630, type: !31)
!93 = !DILocalVariable(name: "node", scope: !87, file: !88, line: 642, type: !31)
!94 = !DILocalVariable(name: "map_prog", scope: !87, file: !88, line: 643, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !87, file: !88, line: 632, size: 128, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !97, file: !88, line: 632, baseType: !31, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !97, file: !88, line: 632, baseType: !31, size: 64, offset: 64)
!101 = !DILocalVariable(name: "__s1_len", scope: !102, file: !88, line: 645, type: !23)
!102 = distinct !DILexicalBlock(scope: !87, file: !88, line: 645, column: 33)
!103 = !DILocalVariable(name: "__s2_len", scope: !102, file: !88, line: 645, type: !23)
!104 = !DILocalVariable(name: "lc_messages", scope: !87, file: !88, line: 655, type: !31)
!105 = !DILocalVariable(name: "__s1_len", scope: !106, file: !88, line: 656, type: !23)
!106 = distinct !DILexicalBlock(scope: !107, file: !88, line: 656, column: 22)
!107 = distinct !DILexicalBlock(scope: !87, file: !88, line: 656, column: 7)
!108 = !DILocalVariable(name: "__s2_len", scope: !106, file: !88, line: 656, type: !23)
!109 = !DILocalVariable(name: "__s2", scope: !110, file: !88, line: 656, type: !28)
!110 = distinct !DILexicalBlock(scope: !106, file: !88, line: 656, column: 22)
!111 = !DILocalVariable(name: "__result", scope: !110, file: !88, line: 656, type: !39)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 896, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 7)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 3584, elements: !125)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !118, line: 104, size: 256, elements: !119)
!118 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = !{!120, !121, !122, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 106, baseType: !31, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !117, file: !118, line: 109, baseType: !39, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !118, line: 110, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !117, file: !118, line: 111, baseType: !39, size: 32, offset: 192)
!125 = !{!126}
!126 = !DISubrange(count: 14)
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "Version", scope: !129, file: !130, line: 2, type: !31, isLocal: false, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, globals: !132)
!130 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !{}
!132 = !{!127}
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "file_name", scope: !135, file: !140, line: 36, type: !31, isLocal: true, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, globals: !137)
!136 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!137 = !{!133, !138}
!138 = !DIGlobalVariableExpression(var: !139)
!139 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !135, file: !140, line: 46, type: !47, isLocal: true, isDefinition: true)
!140 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "exit_failure", scope: !143, file: !146, line: 24, type: !147, isLocal: false, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, globals: !145)
!144 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!145 = !{!141}
!146 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!147 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "program_name", scope: !150, file: !154, line: 33, type: !31, isLocal: false, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !152, globals: !153)
!151 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!152 = !{!22, !20}
!153 = !{!148}
!154 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!155 = !DIGlobalVariableExpression(var: !156)
!156 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !157, file: !185, line: 77, type: !221, isLocal: false, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !180, globals: !182)
!158 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!159 = !{!5, !160, !165}
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!163 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!164 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !166, line: 46, size: 32, elements: !167)
!166 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!168 = !DIEnumerator(name: "_ISupper", value: 256)
!169 = !DIEnumerator(name: "_ISlower", value: 512)
!170 = !DIEnumerator(name: "_ISalpha", value: 1024)
!171 = !DIEnumerator(name: "_ISdigit", value: 2048)
!172 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!173 = !DIEnumerator(name: "_ISspace", value: 8192)
!174 = !DIEnumerator(name: "_ISprint", value: 16384)
!175 = !DIEnumerator(name: "_ISgraph", value: 32768)
!176 = !DIEnumerator(name: "_ISblank", value: 1)
!177 = !DIEnumerator(name: "_IScntrl", value: 2)
!178 = !DIEnumerator(name: "_ISpunct", value: 4)
!179 = !DIEnumerator(name: "_ISalnum", value: 8)
!180 = !{!39, !181, !23, !20}
!181 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!182 = !{!155, !183, !190, !203, !205, !210, !217, !219}
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !157, file: !185, line: 93, type: !186, isLocal: false, isDefinition: true)
!185 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 320, elements: !188)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!188 = !{!189}
!189 = !DISubrange(count: 10)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !157, file: !185, line: 1043, type: !192, isLocal: false, isDefinition: true)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !185, line: 57, size: 448, elements: !193)
!193 = !{!194, !195, !196, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !192, file: !185, line: 60, baseType: !5, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !185, line: 63, baseType: !39, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !192, file: !185, line: 67, baseType: !197, size: 256, offset: 64)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 256, elements: !199)
!198 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !192, file: !185, line: 70, baseType: !31, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !192, file: !185, line: 73, baseType: !31, size: 64, offset: 384)
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !157, file: !185, line: 108, type: !192, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206)
!206 = distinct !DIGlobalVariable(name: "slot0", scope: !157, file: !185, line: 834, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 256)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "slotvec", scope: !157, file: !185, line: 837, type: !212, isLocal: true, isDefinition: true)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !185, line: 826, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !213, file: !185, line: 828, baseType: !23, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !213, file: !185, line: 829, baseType: !20, size: 64, offset: 64)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "nslots", scope: !157, file: !185, line: 835, type: !39, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220)
!220 = distinct !DIGlobalVariable(name: "slotvec0", scope: !157, file: !185, line: 836, type: !213, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 704, elements: !223)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!223 = !{!224}
!224 = !DISubrange(count: 11)
!225 = !DIGlobalVariableExpression(var: !226)
!226 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !227, file: !230, line: 26, type: !231, isLocal: false, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, globals: !229)
!228 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!229 = !{!225}
!230 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 376, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 47)
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "default_tuning", scope: !236, file: !240, line: 130, type: !241, isLocal: true, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !238, globals: !239)
!237 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!238 = !{!25, !22, !23}
!239 = !{!234}
!240 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !243, line: 65, baseType: !244)
!243 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !243, line: 53, size: 160, elements: !245)
!245 = !{!246, !248, !249, !250, !251}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !244, file: !243, line: 58, baseType: !247, size: 32)
!247 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !244, file: !243, line: 59, baseType: !247, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !244, file: !243, line: 60, baseType: !247, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !244, file: !243, line: 61, baseType: !247, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !244, file: !243, line: 62, baseType: !47, size: 8, offset: 128)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !254, file: !598, line: 120, type: !599, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !595, globals: !597)
!255 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!256 = !{!257}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !258, line: 41, size: 32, elements: !259)
!258 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!260 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!261 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!262 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!263 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!264 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!265 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!266 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!267 = !DIEnumerator(name: "DAY_1", value: 131079)
!268 = !DIEnumerator(name: "DAY_2", value: 131080)
!269 = !DIEnumerator(name: "DAY_3", value: 131081)
!270 = !DIEnumerator(name: "DAY_4", value: 131082)
!271 = !DIEnumerator(name: "DAY_5", value: 131083)
!272 = !DIEnumerator(name: "DAY_6", value: 131084)
!273 = !DIEnumerator(name: "DAY_7", value: 131085)
!274 = !DIEnumerator(name: "ABMON_1", value: 131086)
!275 = !DIEnumerator(name: "ABMON_2", value: 131087)
!276 = !DIEnumerator(name: "ABMON_3", value: 131088)
!277 = !DIEnumerator(name: "ABMON_4", value: 131089)
!278 = !DIEnumerator(name: "ABMON_5", value: 131090)
!279 = !DIEnumerator(name: "ABMON_6", value: 131091)
!280 = !DIEnumerator(name: "ABMON_7", value: 131092)
!281 = !DIEnumerator(name: "ABMON_8", value: 131093)
!282 = !DIEnumerator(name: "ABMON_9", value: 131094)
!283 = !DIEnumerator(name: "ABMON_10", value: 131095)
!284 = !DIEnumerator(name: "ABMON_11", value: 131096)
!285 = !DIEnumerator(name: "ABMON_12", value: 131097)
!286 = !DIEnumerator(name: "MON_1", value: 131098)
!287 = !DIEnumerator(name: "MON_2", value: 131099)
!288 = !DIEnumerator(name: "MON_3", value: 131100)
!289 = !DIEnumerator(name: "MON_4", value: 131101)
!290 = !DIEnumerator(name: "MON_5", value: 131102)
!291 = !DIEnumerator(name: "MON_6", value: 131103)
!292 = !DIEnumerator(name: "MON_7", value: 131104)
!293 = !DIEnumerator(name: "MON_8", value: 131105)
!294 = !DIEnumerator(name: "MON_9", value: 131106)
!295 = !DIEnumerator(name: "MON_10", value: 131107)
!296 = !DIEnumerator(name: "MON_11", value: 131108)
!297 = !DIEnumerator(name: "MON_12", value: 131109)
!298 = !DIEnumerator(name: "AM_STR", value: 131110)
!299 = !DIEnumerator(name: "PM_STR", value: 131111)
!300 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!301 = !DIEnumerator(name: "D_FMT", value: 131113)
!302 = !DIEnumerator(name: "T_FMT", value: 131114)
!303 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!304 = !DIEnumerator(name: "ERA", value: 131116)
!305 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!306 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!307 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!308 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!309 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!310 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!311 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!312 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!313 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!314 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!315 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!316 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!317 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!318 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!319 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!320 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!321 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!322 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!323 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!324 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!325 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!326 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!327 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!328 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!329 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!330 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!331 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!332 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!333 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!334 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!335 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!336 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!337 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!338 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!339 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!340 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!341 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!342 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!343 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!344 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!345 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!346 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!347 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!348 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!349 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!350 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!351 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!352 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!353 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!354 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!355 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!356 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!357 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!358 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!359 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!360 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!361 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!362 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!363 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!364 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!365 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!366 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!367 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!368 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!369 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!370 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!371 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!372 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!373 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!374 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!375 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!376 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!377 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!378 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!379 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!380 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!381 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!382 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!383 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!384 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!385 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!386 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!387 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!388 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!389 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!390 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!391 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!392 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!393 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!394 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!395 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!396 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!397 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!398 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!399 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!400 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!401 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!402 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!403 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!404 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!405 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!406 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!407 = !DIEnumerator(name: "CODESET", value: 14)
!408 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!409 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!410 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!411 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!454 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!455 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!456 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!457 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!458 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!459 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!460 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!461 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!462 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!463 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!464 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!471 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!472 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!473 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!474 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!475 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!478 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!479 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!480 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!481 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!482 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!483 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!484 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!485 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!486 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!487 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!488 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!489 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!490 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!491 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!492 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!493 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!494 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!495 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!496 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!497 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!498 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!499 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!500 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!501 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!511 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!518 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!519 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!522 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!523 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!524 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!525 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!526 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!527 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!528 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!529 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!530 = !DIEnumerator(name: "THOUSEP", value: 65537)
!531 = !DIEnumerator(name: "__GROUPING", value: 65538)
!532 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!533 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!534 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!535 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!536 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!537 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!538 = !DIEnumerator(name: "__YESSTR", value: 327682)
!539 = !DIEnumerator(name: "__NOSTR", value: 327683)
!540 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!541 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!542 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!543 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!544 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!545 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!546 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!547 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!548 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!549 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!550 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!551 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!552 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!553 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!554 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!555 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!556 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!557 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!558 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!559 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!560 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!561 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!562 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!563 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!564 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!565 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!566 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!567 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!568 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!569 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!570 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!571 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!572 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!573 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!574 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!575 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!576 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!586 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!587 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!593 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!594 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!595 = !{!22, !20, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!597 = !{!252}
!598 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!599 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!600 = !DIGlobalVariableExpression(var: !601)
!601 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !602, file: !603, line: 335, type: !39, isLocal: true, isDefinition: true)
!602 = distinct !DISubprogram(name: "rpl_fcntl", scope: !603, file: !603, line: 272, type: !604, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !606, variables: !609)
!603 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!604 = !DISubroutineType(types: !605)
!605 = !{!39, !39, !39, null}
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, globals: !608)
!607 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = !{!600}
!609 = !{!610, !611, !612, !625, !626, !629, !632, !635}
!610 = !DILocalVariable(name: "fd", arg: 1, scope: !602, file: !603, line: 272, type: !39)
!611 = !DILocalVariable(name: "action", arg: 2, scope: !602, file: !603, line: 272, type: !39)
!612 = !DILocalVariable(name: "arg", scope: !602, file: !603, line: 274, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !614, line: 30, baseType: !615)
!614 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !607, line: 274, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 192, elements: !623)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !607, line: 274, size: 192, elements: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !617, file: !607, line: 274, baseType: !198, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !617, file: !607, line: 274, baseType: !198, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !617, file: !607, line: 274, baseType: !22, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !617, file: !607, line: 274, baseType: !22, size: 64, offset: 128)
!623 = !{!624}
!624 = !DISubrange(count: 1)
!625 = !DILocalVariable(name: "result", scope: !602, file: !603, line: 275, type: !39)
!626 = !DILocalVariable(name: "target", scope: !627, file: !603, line: 322, type: !39)
!627 = distinct !DILexicalBlock(scope: !628, file: !603, line: 321, column: 7)
!628 = distinct !DILexicalBlock(scope: !602, file: !603, line: 278, column: 5)
!629 = !DILocalVariable(name: "flags", scope: !630, file: !603, line: 359, type: !39)
!630 = distinct !DILexicalBlock(scope: !631, file: !603, line: 358, column: 11)
!631 = distinct !DILexicalBlock(scope: !627, file: !603, line: 357, column: 13)
!632 = !DILocalVariable(name: "saved_errno", scope: !633, file: !603, line: 362, type: !39)
!633 = distinct !DILexicalBlock(scope: !634, file: !603, line: 361, column: 15)
!634 = distinct !DILexicalBlock(scope: !630, file: !603, line: 360, column: 17)
!635 = !DILocalVariable(name: "p", scope: !636, file: !603, line: 404, type: !22)
!636 = distinct !DILexicalBlock(scope: !628, file: !603, line: 402, column: 7)
!637 = !DIGlobalVariableExpression(var: !638)
!638 = distinct !DIGlobalVariable(name: "proc_status", scope: !639, file: !640, line: 65, type: !39, isLocal: true, isDefinition: true)
!639 = distinct !DISubprogram(name: "openat_proc_name", scope: !640, file: !640, line: 44, type: !641, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !643, variables: !650)
!640 = !DIFile(filename: "lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = !DISubroutineType(types: !642)
!642 = !{!20, !20, !39, !31}
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !645, globals: !649)
!644 = !DIFile(filename: "./lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!645 = !{!646}
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !639, file: !640, line: 59, size: 32, elements: !647)
!647 = !{!648}
!648 = !DIEnumerator(name: "PROC_SELF_FD_DIR_SIZE_BOUND", value: 27)
!649 = !{!637}
!650 = !{!651, !652, !653, !654, !655, !656, !660, !666}
!651 = !DILocalVariable(name: "buf", arg: 1, scope: !639, file: !640, line: 44, type: !20)
!652 = !DILocalVariable(name: "fd", arg: 2, scope: !639, file: !640, line: 44, type: !39)
!653 = !DILocalVariable(name: "file", arg: 3, scope: !639, file: !640, line: 44, type: !31)
!654 = !DILocalVariable(name: "result", scope: !639, file: !640, line: 46, type: !20)
!655 = !DILocalVariable(name: "dirlen", scope: !639, file: !640, line: 47, type: !39)
!656 = !DILocalVariable(name: "proc_self_fd", scope: !657, file: !640, line: 76, type: !39)
!657 = distinct !DILexicalBlock(scope: !658, file: !640, line: 67, column: 7)
!658 = distinct !DILexicalBlock(scope: !659, file: !640, line: 66, column: 9)
!659 = distinct !DILexicalBlock(scope: !639, file: !640, line: 58, column: 3)
!660 = !DILocalVariable(name: "dotdot_buf", scope: !661, file: !640, line: 87, type: !663)
!661 = distinct !DILexicalBlock(scope: !662, file: !640, line: 81, column: 11)
!662 = distinct !DILexicalBlock(scope: !657, file: !640, line: 78, column: 13)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 32)
!666 = !DILocalVariable(name: "bufsize", scope: !667, file: !640, line: 98, type: !23)
!667 = distinct !DILexicalBlock(scope: !668, file: !640, line: 97, column: 7)
!668 = distinct !DILexicalBlock(scope: !659, file: !640, line: 94, column: 9)
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!670 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !678)
!672 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!673 = !{!674}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 41, size: 32, elements: !676)
!675 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = !{!677}
!677 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!678 = !{!22}
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !695)
!680 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !{!682}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !684, file: !683, line: 192, size: 32, elements: !693)
!683 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!684 = distinct !DISubprogram(name: "x2nrealloc", scope: !683, file: !683, line: 180, type: !685, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !679, variables: !688)
!685 = !DISubroutineType(types: !686)
!686 = !{!22, !22, !687, !23}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!688 = !{!689, !690, !691, !692}
!689 = !DILocalVariable(name: "p", arg: 1, scope: !684, file: !683, line: 180, type: !22)
!690 = !DILocalVariable(name: "pn", arg: 2, scope: !684, file: !683, line: 180, type: !687)
!691 = !DILocalVariable(name: "s", arg: 3, scope: !684, file: !683, line: 180, type: !23)
!692 = !DILocalVariable(name: "n", scope: !684, file: !683, line: 182, type: !23)
!693 = !{!694}
!694 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!695 = !{!23, !20, !22}
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!697 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !678)
!699 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !678)
!701 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !863)
!703 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!704 = !{!705, !710, !846, !849, !860}
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !706, line: 160, size: 32, elements: !707)
!706 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = !{!708, !709}
!708 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!709 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !712, file: !711, line: 54, size: 32, elements: !844)
!711 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!712 = distinct !DISubprogram(name: "setup_dir", scope: !711, file: !711, line: 50, type: !713, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !702, variables: !842)
!713 = !DISubroutineType(types: !714)
!714 = !{!47, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !717, line: 199, baseType: !718)
!717 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 80, size: 1024, elements: !719)
!719 = !{!720, !790, !791, !793, !794, !795, !796, !797, !798, !799, !806, !807, !810, !829}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !718, file: !717, line: 81, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !717, line: 201, size: 2112, elements: !723)
!723 = !{!724, !725, !726, !727, !732, !734, !735, !736, !737, !738, !739, !740, !741, !743, !744, !747, !748, !749, !750, !786}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !722, file: !717, line: 202, baseType: !721, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !722, file: !717, line: 203, baseType: !721, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !722, file: !717, line: 204, baseType: !721, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !722, file: !717, line: 205, baseType: !728, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !730, line: 127, baseType: !731)
!730 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !730, line: 127, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !722, file: !717, line: 208, baseType: !733, size: 64, offset: 256)
!733 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !722, file: !717, line: 209, baseType: !22, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !722, file: !717, line: 210, baseType: !20, size: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !722, file: !717, line: 211, baseType: !20, size: 64, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !722, file: !717, line: 212, baseType: !39, size: 32, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !722, file: !717, line: 213, baseType: !39, size: 32, offset: 544)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !722, file: !717, line: 214, baseType: !23, size: 64, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !722, file: !717, line: 216, baseType: !715, size: 64, offset: 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !722, file: !717, line: 220, baseType: !742, size: 64, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !24, line: 51, baseType: !733)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !722, file: !717, line: 222, baseType: !23, size: 64, offset: 768)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !722, file: !717, line: 223, baseType: !745, size: 64, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !60, line: 75, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !62, line: 139, baseType: !25)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !722, file: !717, line: 239, baseType: !181, size: 16, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !722, file: !717, line: 243, baseType: !181, size: 16, offset: 912)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !722, file: !717, line: 249, baseType: !181, size: 16, offset: 928)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !722, file: !717, line: 251, baseType: !751, size: 1152, offset: 960)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 1152, elements: !623)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !753, line: 46, size: 1152, elements: !754)
!753 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = !{!755, !756, !757, !758, !760, !762, !764, !765, !766, !768, !770, !772, !780, !781, !782}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !752, file: !753, line: 48, baseType: !65, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !752, file: !753, line: 53, baseType: !61, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !752, file: !753, line: 61, baseType: !746, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !752, file: !753, line: 62, baseType: !759, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !62, line: 138, baseType: !198)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !752, file: !753, line: 64, baseType: !761, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 134, baseType: !198)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !752, file: !753, line: 65, baseType: !763, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !62, line: 135, baseType: !198)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !752, file: !753, line: 67, baseType: !39, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !752, file: !753, line: 69, baseType: !65, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !752, file: !753, line: 74, baseType: !767, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 140, baseType: !733)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !752, file: !753, line: 78, baseType: !769, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !62, line: 162, baseType: !733)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !752, file: !753, line: 80, baseType: !771, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !62, line: 167, baseType: !733)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !752, file: !753, line: 91, baseType: !773, size: 128, offset: 576)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !774, line: 8, size: 128, elements: !775)
!774 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!775 = !{!776, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !773, file: !774, line: 10, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !62, line: 148, baseType: !733)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !773, file: !774, line: 11, baseType: !779, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !62, line: 184, baseType: !733)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !752, file: !753, line: 92, baseType: !773, size: 128, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !752, file: !753, line: 93, baseType: !773, size: 128, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !752, file: !753, line: 106, baseType: !783, size: 192, offset: 960)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 192, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 3)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !722, file: !717, line: 252, baseType: !787, offset: 2112)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: -1)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !718, file: !717, line: 82, baseType: !721, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !718, file: !717, line: 83, baseType: !792, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !718, file: !717, line: 84, baseType: !64, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !718, file: !717, line: 85, baseType: !20, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !718, file: !717, line: 86, baseType: !39, size: 32, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !718, file: !717, line: 87, baseType: !39, size: 32, offset: 352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !718, file: !717, line: 89, baseType: !23, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !718, file: !717, line: 90, baseType: !23, size: 64, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !718, file: !717, line: 91, baseType: !800, size: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!39, !803, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !718, file: !717, line: 162, baseType: !39, size: 32, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !718, file: !717, line: 171, baseType: !808, size: 64, offset: 640)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !717, line: 171, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !718, file: !717, line: 193, baseType: !811, size: 64, offset: 704)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !718, file: !717, line: 173, size: 64, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !811, file: !717, line: 186, baseType: !808, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !811, file: !717, line: 192, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !817, line: 28, size: 256, elements: !818)
!817 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!818 = !{!819, !824, !828}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !816, file: !817, line: 30, baseType: !820, size: 128)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !56, line: 7, size: 128, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !820, file: !56, line: 9, baseType: !59, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !820, file: !56, line: 10, baseType: !64, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !816, file: !817, line: 31, baseType: !825, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !826, line: 136, baseType: !827)
!826 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !62, line: 62, baseType: !25)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !816, file: !817, line: 32, baseType: !39, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !718, file: !717, line: 198, baseType: !830, size: 256, offset: 768)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !831, line: 39, baseType: !832)
!831 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !831, line: 31, size: 256, elements: !833)
!833 = !{!834, !838, !839, !840, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !832, file: !831, line: 33, baseType: !835, size: 128)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 4)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !832, file: !831, line: 34, baseType: !39, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !832, file: !831, line: 35, baseType: !198, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !832, file: !831, line: 36, baseType: !198, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !832, file: !831, line: 37, baseType: !47, size: 8, offset: 224)
!842 = !{!843}
!843 = !DILocalVariable(name: "fts", arg: 1, scope: !712, file: !711, line: 50, type: !715)
!844 = !{!845}
!845 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !706, line: 763, size: 32, elements: !847)
!847 = !{!848}
!848 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 97, size: 32, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859}
!851 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!852 = !DIEnumerator(name: "DT_FIFO", value: 1)
!853 = !DIEnumerator(name: "DT_CHR", value: 2)
!854 = !DIEnumerator(name: "DT_DIR", value: 4)
!855 = !DIEnumerator(name: "DT_BLK", value: 6)
!856 = !DIEnumerator(name: "DT_REG", value: 8)
!857 = !DIEnumerator(name: "DT_LNK", value: 10)
!858 = !DIEnumerator(name: "DT_SOCK", value: 12)
!859 = !DIEnumerator(name: "DT_WHT", value: 14)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !706, line: 155, size: 32, elements: !861)
!861 = !{!862}
!862 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!863 = !{!22, !825, !20, !733, !864, !867, !23, !26, !28, !31}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!39, !26, !26}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !717, line: 253, baseType: !722)
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !873)
!872 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = !{!23}
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!875 = !DIFile(filename: "./lib/selinux-at.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!877 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!879 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!881 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!883 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !886)
!885 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = !{!23, !26, !28, !31}
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !889)
!888 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!889 = !{!890}
!890 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !831, line: 20, size: 32, elements: !891)
!891 = !{!892}
!892 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!894 = !DIFile(filename: "./lib/openat-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!896 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!898 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!900 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!902 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !152)
!904 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131)
!906 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !678)
!908 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !678)
!910 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!912 = !{i32 2, !"Dwarf Version", i32 4}
!913 = !{i32 2, !"Debug Info Version", i32 3}
!914 = !{i32 1, !"PIC Level", i32 2}
!915 = !{i32 1, !"PIE Level", i32 2}
!916 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 346, type: !917, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !39}
!919 = !{!920}
!920 = !DILocalVariable(name: "status", arg: 1, scope: !916, file: !3, line: 346, type: !39)
!921 = !DIExpression()
!922 = !DILocation(line: 346, column: 12, scope: !916)
!923 = !DILocation(line: 348, column: 14, scope: !924)
!924 = distinct !DILexicalBlock(scope: !916, file: !3, line: 348, column: 7)
!925 = !DILocation(line: 348, column: 7, scope: !916)
!926 = !DILocation(line: 349, column: 5, scope: !927)
!927 = !DILexicalBlockFile(scope: !928, file: !3, discriminator: 1)
!928 = distinct !DILexicalBlock(scope: !924, file: !3, line: 349, column: 5)
!929 = !{!930, !930, i64 0}
!930 = !{!"any pointer", !931, i64 0}
!931 = !{!"omnipotent char", !932, i64 0}
!932 = !{!"Simple C/C++ TBAA"}
!933 = !DILocation(line: 349, column: 5, scope: !934)
!934 = !DILexicalBlockFile(scope: !928, file: !3, discriminator: 3)
!935 = !DILocation(line: 349, column: 5, scope: !936)
!936 = !DILexicalBlockFile(scope: !928, file: !3, discriminator: 2)
!937 = !DILocation(line: 352, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !924, file: !3, line: 351, column: 5)
!939 = !DILocation(line: 352, column: 7, scope: !940)
!940 = !DILexicalBlockFile(scope: !938, file: !3, discriminator: 1)
!941 = !DILocation(line: 358, column: 7, scope: !938)
!942 = !DILocation(line: 358, column: 7, scope: !940)
!943 = !DILocation(line: 587, column: 3, scope: !944, inlinedAt: !947)
!944 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !88, file: !88, line: 585, type: !945, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !131)
!945 = !DISubroutineType(types: !946)
!946 = !{null}
!947 = distinct !DILocation(line: 363, column: 7, scope: !938)
!948 = !DILocation(line: 587, column: 3, scope: !949, inlinedAt: !947)
!949 = !DILexicalBlockFile(scope: !944, file: !88, discriminator: 1)
!950 = !DILocation(line: 365, column: 7, scope: !938)
!951 = !DILocation(line: 365, column: 7, scope: !940)
!952 = !DILocation(line: 370, column: 7, scope: !938)
!953 = !DILocation(line: 370, column: 7, scope: !940)
!954 = !DILocation(line: 376, column: 7, scope: !938)
!955 = !DILocation(line: 376, column: 7, scope: !940)
!956 = !DILocation(line: 380, column: 7, scope: !938)
!957 = !DILocation(line: 380, column: 7, scope: !940)
!958 = !DILocation(line: 384, column: 7, scope: !938)
!959 = !DILocation(line: 384, column: 7, scope: !940)
!960 = !DILocation(line: 387, column: 7, scope: !938)
!961 = !DILocation(line: 387, column: 7, scope: !940)
!962 = !DILocation(line: 390, column: 7, scope: !938)
!963 = !DILocation(line: 390, column: 7, scope: !940)
!964 = !DILocation(line: 403, column: 7, scope: !938)
!965 = !DILocation(line: 403, column: 7, scope: !940)
!966 = !DILocation(line: 404, column: 7, scope: !938)
!967 = !DILocation(line: 404, column: 7, scope: !940)
!968 = !DILocation(line: 642, column: 15, scope: !87, inlinedAt: !969)
!969 = distinct !DILocation(line: 405, column: 7, scope: !938)
!970 = !DILocation(line: 651, column: 3, scope: !87, inlinedAt: !969)
!971 = !DILocation(line: 651, column: 3, scope: !972, inlinedAt: !969)
!972 = !DILexicalBlockFile(scope: !87, file: !88, discriminator: 1)
!973 = !DILocation(line: 655, column: 29, scope: !87, inlinedAt: !969)
!974 = !DILocation(line: 655, column: 15, scope: !87, inlinedAt: !969)
!975 = !DILocation(line: 656, column: 7, scope: !107, inlinedAt: !969)
!976 = !DILocation(line: 656, column: 19, scope: !107, inlinedAt: !969)
!977 = !DILocation(line: 656, column: 22, scope: !978, inlinedAt: !969)
!978 = !DILexicalBlockFile(scope: !107, file: !88, discriminator: 16)
!979 = !DILocation(line: 656, column: 7, scope: !980, inlinedAt: !969)
!980 = !DILexicalBlockFile(scope: !87, file: !88, discriminator: 16)
!981 = !DILocation(line: 662, column: 7, scope: !982, inlinedAt: !969)
!982 = distinct !DILexicalBlock(scope: !107, file: !88, line: 657, column: 5)
!983 = !DILocation(line: 662, column: 7, scope: !984, inlinedAt: !969)
!984 = !DILexicalBlockFile(scope: !982, file: !88, discriminator: 1)
!985 = !DILocation(line: 664, column: 5, scope: !982, inlinedAt: !969)
!986 = !DILocation(line: 665, column: 3, scope: !87, inlinedAt: !969)
!987 = !DILocation(line: 665, column: 3, scope: !972, inlinedAt: !969)
!988 = !DILocation(line: 667, column: 3, scope: !87, inlinedAt: !969)
!989 = !DILocation(line: 667, column: 3, scope: !972, inlinedAt: !969)
!990 = !DILocation(line: 407, column: 3, scope: !916)
!991 = !DILocation(line: 411, column: 11, scope: !36)
!992 = !DILocation(line: 411, column: 24, scope: !36)
!993 = !DILocation(line: 414, column: 7, scope: !36)
!994 = !DILocation(line: 418, column: 7, scope: !36)
!995 = !DILocation(line: 421, column: 8, scope: !36)
!996 = !DILocation(line: 422, column: 8, scope: !36)
!997 = !DILocation(line: 423, column: 9, scope: !36)
!998 = !DILocation(line: 427, column: 21, scope: !36)
!999 = !DILocation(line: 427, column: 3, scope: !36)
!1000 = !DILocation(line: 428, column: 3, scope: !36)
!1001 = !DILocation(line: 429, column: 3, scope: !36)
!1002 = !DILocation(line: 430, column: 3, scope: !36)
!1003 = !DILocation(line: 432, column: 3, scope: !36)
!1004 = !DILocation(line: 434, column: 3, scope: !36)
!1005 = !DILocation(line: 434, column: 18, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !36, file: !3, discriminator: 1)
!1007 = !DILocation(line: 424, column: 7, scope: !36)
!1008 = !DILocation(line: 434, column: 3, scope: !1006)
!1009 = !DILocation(line: 441, column: 11, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 438, column: 9)
!1011 = distinct !DILexicalBlock(scope: !36, file: !3, line: 436, column: 5)
!1012 = !DILocation(line: 445, column: 11, scope: !1010)
!1013 = !DILocation(line: 449, column: 11, scope: !1010)
!1014 = !DILocation(line: 453, column: 11, scope: !1010)
!1015 = !DILocation(line: 458, column: 11, scope: !1010)
!1016 = !DILocation(line: 462, column: 11, scope: !1010)
!1017 = !DILocation(line: 466, column: 11, scope: !1010)
!1018 = !DILocation(line: 469, column: 28, scope: !1010)
!1019 = !DILocation(line: 470, column: 11, scope: !1010)
!1020 = !DILocation(line: 474, column: 11, scope: !1010)
!1021 = !DILocation(line: 482, column: 11, scope: !1010)
!1022 = !DILocation(line: 485, column: 28, scope: !1010)
!1023 = !DILocation(line: 485, column: 26, scope: !1010)
!1024 = !DILocation(line: 487, column: 11, scope: !1010)
!1025 = !DILocation(line: 490, column: 28, scope: !1010)
!1026 = !DILocation(line: 490, column: 26, scope: !1010)
!1027 = !DILocation(line: 492, column: 11, scope: !1010)
!1028 = !DILocation(line: 495, column: 28, scope: !1010)
!1029 = !DILocation(line: 495, column: 26, scope: !1010)
!1030 = !DILocation(line: 497, column: 11, scope: !1010)
!1031 = !DILocation(line: 500, column: 29, scope: !1010)
!1032 = !DILocation(line: 500, column: 27, scope: !1010)
!1033 = !DILocation(line: 502, column: 11, scope: !1010)
!1034 = distinct !{!1034, !1004, !1035}
!1035 = !DILocation(line: 509, column: 5, scope: !36)
!1036 = !DILocation(line: 504, column: 9, scope: !1010)
!1037 = !DILocation(line: 505, column: 9, scope: !1010)
!1038 = !DILocation(line: 505, column: 9, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1010, file: !3, discriminator: 1)
!1040 = !DILocation(line: 507, column: 11, scope: !1010)
!1041 = !DILocation(line: 511, column: 7, scope: !36)
!1042 = !DILocation(line: 513, column: 21, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 513, column: 11)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 512, column: 5)
!1045 = distinct !DILexicalBlock(scope: !36, file: !3, line: 511, column: 7)
!1046 = !DILocation(line: 513, column: 11, scope: !1044)
!1047 = !DILocation(line: 515, column: 27, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 515, column: 15)
!1049 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 514, column: 9)
!1050 = !DILocation(line: 515, column: 15, scope: !1049)
!1051 = !DILocation(line: 516, column: 13, scope: !1048)
!1052 = !DILocation(line: 516, column: 13, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !1048, file: !3, discriminator: 1)
!1054 = !DILocation(line: 522, column: 27, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 522, column: 15)
!1056 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 521, column: 9)
!1057 = !DILocation(line: 522, column: 15, scope: !1056)
!1058 = !DILocation(line: 523, column: 13, scope: !1055)
!1059 = !DILocation(line: 523, column: 13, scope: !1060)
!1060 = !DILexicalBlockFile(scope: !1055, file: !3, discriminator: 1)
!1061 = !DILocation(line: 530, column: 46, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 528, column: 5)
!1063 = !DILocation(line: 530, column: 31, scope: !1062)
!1064 = !{!1065, !1065, i64 0}
!1065 = !{!"_Bool", !931, i64 0}
!1066 = !DILocation(line: 533, column: 14, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !36, file: !3, line: 533, column: 7)
!1068 = !{!1069, !1069, i64 0}
!1069 = !{!"int", !931, i64 0}
!1070 = !DILocation(line: 533, column: 12, scope: !1067)
!1071 = !DILocation(line: 533, column: 24, scope: !1067)
!1072 = !DILocation(line: 533, column: 42, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1067, file: !3, discriminator: 1)
!1074 = !DILocation(line: 533, column: 39, scope: !1067)
!1075 = !DILocation(line: 533, column: 24, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1067, file: !3, discriminator: 2)
!1077 = !DILocation(line: 533, column: 21, scope: !1076)
!1078 = !DILocation(line: 533, column: 7, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !36, file: !3, discriminator: 2)
!1080 = !DILocation(line: 535, column: 16, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 535, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 534, column: 5)
!1083 = !DILocation(line: 535, column: 11, scope: !1082)
!1084 = !DILocation(line: 536, column: 22, scope: !1081)
!1085 = !DILocation(line: 536, column: 9, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1081, file: !3, discriminator: 1)
!1087 = !DILocation(line: 536, column: 9, scope: !1081)
!1088 = !DILocation(line: 538, column: 22, scope: !1081)
!1089 = !DILocation(line: 538, column: 70, scope: !1081)
!1090 = !DILocation(line: 538, column: 60, scope: !1081)
!1091 = !DILocation(line: 538, column: 53, scope: !1086)
!1092 = !DILocation(line: 538, column: 9, scope: !1093)
!1093 = !DILexicalBlockFile(scope: !1081, file: !3, discriminator: 2)
!1094 = !DILocation(line: 539, column: 7, scope: !1082)
!1095 = !DILocation(line: 542, column: 7, scope: !36)
!1096 = !DILocation(line: 544, column: 13, scope: !53)
!1097 = !DIExpression(DW_OP_deref)
!1098 = !DILocalVariable(name: "file", arg: 1, scope: !1099, file: !1100, line: 88, type: !31)
!1099 = distinct !DISubprogram(name: "getfilecon", scope: !1100, file: !1100, line: 88, type: !1101, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1105)
!1100 = !DIFile(filename: "./lib/selinux/selinux.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!39, !31, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_context_t", file: !1100, line: 67, baseType: !20)
!1105 = !{!1098, !1106}
!1106 = !DILocalVariable(name: "con", arg: 2, scope: !1099, file: !1100, line: 89, type: !1103)
!1107 = !DILocation(line: 88, column: 25, scope: !1099, inlinedAt: !1108)
!1108 = distinct !DILocation(line: 546, column: 11, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !53, file: !3, line: 546, column: 11)
!1110 = !DILocation(line: 89, column: 33, scope: !1099, inlinedAt: !1108)
!1111 = !DILocation(line: 90, column: 5, scope: !1099, inlinedAt: !1108)
!1112 = !DILocation(line: 90, column: 11, scope: !1099, inlinedAt: !1108)
!1113 = !DILocation(line: 547, column: 9, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 1)
!1115 = !DILocation(line: 547, column: 9, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 2)
!1117 = !DILocation(line: 547, column: 9, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 3)
!1119 = !DILocation(line: 547, column: 9, scope: !1109)
!1120 = !DILocation(line: 552, column: 12, scope: !54)
!1121 = !DILocation(line: 559, column: 38, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 558, column: 5)
!1123 = distinct !DILexicalBlock(scope: !54, file: !3, line: 552, column: 12)
!1124 = !DILocation(line: 559, column: 27, scope: !1122)
!1125 = !DILocation(line: 559, column: 25, scope: !1122)
!1126 = !DILocation(line: 113, column: 5, scope: !1127, inlinedAt: !1132)
!1127 = distinct !DISubprogram(name: "security_check_context", scope: !1100, file: !1100, line: 112, type: !1128, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1130)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!39, !1104}
!1130 = !{!1131}
!1131 = !DILocalVariable(name: "con", arg: 1, scope: !1127, file: !1100, line: 112, type: !1104)
!1132 = distinct !DILocation(line: 560, column: 11, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1134, file: !3, discriminator: 1)
!1134 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 560, column: 11)
!1135 = !DILocation(line: 113, column: 11, scope: !1127, inlinedAt: !1132)
!1136 = !DILocation(line: 561, column: 9, scope: !1133)
!1137 = !DILocation(line: 561, column: 9, scope: !1134)
!1138 = !DILocation(line: 561, column: 9, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1134, file: !3, discriminator: 2)
!1140 = !DILocation(line: 561, column: 9, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1134, file: !3, discriminator: 3)
!1142 = !DILocation(line: 555, column: 25, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 553, column: 5)
!1144 = !DILocation(line: 571, column: 15, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !36, file: !3, line: 571, column: 7)
!1146 = !DILocation(line: 571, column: 18, scope: !1147)
!1147 = !DILexicalBlockFile(scope: !1145, file: !3, discriminator: 1)
!1148 = !DILocation(line: 574, column: 22, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 572, column: 5)
!1150 = !DILocation(line: 574, column: 20, scope: !1149)
!1151 = !DILocation(line: 575, column: 24, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 575, column: 11)
!1153 = !DILocation(line: 575, column: 11, scope: !1149)
!1154 = !DILocation(line: 576, column: 9, scope: !1152)
!1155 = !DILocation(line: 576, column: 9, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1152, file: !3, discriminator: 1)
!1157 = !DILocation(line: 576, column: 9, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1152, file: !3, discriminator: 2)
!1159 = !DILocation(line: 576, column: 9, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1152, file: !3, discriminator: 3)
!1161 = !DILocation(line: 581, column: 20, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 580, column: 5)
!1163 = !DILocation(line: 584, column: 30, scope: !36)
!1164 = !DILocation(line: 584, column: 28, scope: !36)
!1165 = !DILocation(line: 584, column: 48, scope: !36)
!1166 = !DILocalVariable(name: "files", arg: 1, scope: !1167, file: !3, line: 311, type: !40)
!1167 = distinct !DISubprogram(name: "process_files", scope: !3, file: !3, line: 311, type: !1168, isLocal: true, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1170)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!47, !40, !39}
!1170 = !{!1166, !1171, !1172, !1173, !1258}
!1171 = !DILocalVariable(name: "bit_flags", arg: 2, scope: !1167, file: !3, line: 311, type: !39)
!1172 = !DILocalVariable(name: "ok", scope: !1167, file: !3, line: 313, type: !47)
!1173 = !DILocalVariable(name: "fts", scope: !1167, file: !3, line: 315, type: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !717, line: 199, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 80, size: 1024, elements: !1177)
!1177 = !{!1178, !1224, !1225, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1240, !1241, !1242, !1249}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1176, file: !717, line: 81, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !717, line: 201, size: 2112, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1223}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1180, file: !717, line: 202, baseType: !1179, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1180, file: !717, line: 203, baseType: !1179, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1180, file: !717, line: 204, baseType: !1179, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1180, file: !717, line: 205, baseType: !728, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1180, file: !717, line: 208, baseType: !733, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1180, file: !717, line: 209, baseType: !22, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1180, file: !717, line: 210, baseType: !20, size: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1180, file: !717, line: 211, baseType: !20, size: 64, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1180, file: !717, line: 212, baseType: !39, size: 32, offset: 512)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1180, file: !717, line: 213, baseType: !39, size: 32, offset: 544)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1180, file: !717, line: 214, baseType: !23, size: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1180, file: !717, line: 216, baseType: !1174, size: 64, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1180, file: !717, line: 220, baseType: !742, size: 64, offset: 704)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1180, file: !717, line: 222, baseType: !23, size: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !1180, file: !717, line: 223, baseType: !745, size: 64, offset: 832)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1180, file: !717, line: 239, baseType: !181, size: 16, offset: 896)
