; ModuleID = 'coreutils-8.27/src/cp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.hash_table*, %struct.hash_table* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.dir_attr = type { %struct.stat, i8, i64, %struct.dir_attr* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 117, type: !314, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !125, globals: !135)
!3 = !DIFile(filename: "src/cp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !19, !25, !31, !36, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "no_backups", value: 0)
!9 = !DIEnumerator(name: "simple_backups", value: 1)
!10 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!11 = !DIEnumerator(name: "numbered_backups", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !13, line: 69, size: 32, elements: !14)
!13 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!16 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!17 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!18 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !13, line: 60, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!22 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2)
!23 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!24 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !13, line: 26, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!28 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!29 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!30 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !13, line: 47, size: 32, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!34 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!35 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !37, line: 32, size: 32, elements: !38)
!37 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!40 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!41 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!42 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!43 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!44 = !DIEnumerator(name: "c_quoting_style", value: 5)
!45 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!46 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!47 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!48 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!49 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !51, file: !3, line: 839, size: 32, elements: !117)
!51 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !3, file: !3, line: 837, type: !52, isLocal: true, isDefinition: true, scopeLine: 838, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !107)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !57, !71}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !13, line: 98, size: 576, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !106}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !58, file: !13, line: 100, baseType: !5, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !58, file: !13, line: 103, baseType: !12, size: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !58, file: !13, line: 108, baseType: !19, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !58, file: !13, line: 111, baseType: !25, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !58, file: !13, line: 115, baseType: !65, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !66, line: 70, baseType: !67)
!66 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !68, line: 138, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !58, file: !13, line: 119, baseType: !71, size: 8, offset: 160)
!71 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !58, file: !13, line: 123, baseType: !71, size: 8, offset: 168)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !58, file: !13, line: 130, baseType: !71, size: 8, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !58, file: !13, line: 134, baseType: !71, size: 8, offset: 184)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !58, file: !13, line: 138, baseType: !71, size: 8, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !58, file: !13, line: 141, baseType: !71, size: 8, offset: 200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !58, file: !13, line: 145, baseType: !71, size: 8, offset: 208)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !58, file: !13, line: 152, baseType: !71, size: 8, offset: 216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !58, file: !13, line: 156, baseType: !71, size: 8, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !58, file: !13, line: 160, baseType: !71, size: 8, offset: 232)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !58, file: !13, line: 161, baseType: !71, size: 8, offset: 240)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !58, file: !13, line: 162, baseType: !71, size: 8, offset: 248)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !58, file: !13, line: 163, baseType: !71, size: 8, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !58, file: !13, line: 166, baseType: !71, size: 8, offset: 264)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !58, file: !13, line: 178, baseType: !71, size: 8, offset: 272)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !58, file: !13, line: 182, baseType: !71, size: 8, offset: 280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !58, file: !13, line: 188, baseType: !71, size: 8, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !58, file: !13, line: 192, baseType: !71, size: 8, offset: 296)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !58, file: !13, line: 201, baseType: !71, size: 8, offset: 304)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !58, file: !13, line: 205, baseType: !71, size: 8, offset: 312)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !58, file: !13, line: 214, baseType: !71, size: 8, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !58, file: !13, line: 223, baseType: !71, size: 8, offset: 328)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !58, file: !13, line: 227, baseType: !71, size: 8, offset: 336)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !58, file: !13, line: 231, baseType: !71, size: 8, offset: 344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !58, file: !13, line: 235, baseType: !71, size: 8, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !58, file: !13, line: 239, baseType: !71, size: 8, offset: 360)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !58, file: !13, line: 242, baseType: !71, size: 8, offset: 368)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !58, file: !13, line: 245, baseType: !71, size: 8, offset: 376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !58, file: !13, line: 250, baseType: !71, size: 8, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !58, file: !13, line: 253, baseType: !31, size: 32, offset: 416)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !58, file: !13, line: 264, baseType: !102, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !104, line: 69, baseType: !105)
!104 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !104, line: 67, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !58, file: !13, line: 267, baseType: !102, size: 64, offset: 512)
!107 = !{!108, !109, !110, !111, !113, !114, !116}
!108 = !DILocalVariable(name: "arg", arg: 1, scope: !51, file: !3, line: 837, type: !54)
!109 = !DILocalVariable(name: "x", arg: 2, scope: !51, file: !3, line: 837, type: !57)
!110 = !DILocalVariable(name: "on_off", arg: 3, scope: !51, file: !3, line: 837, type: !71)
!111 = !DILocalVariable(name: "arg_writable", scope: !51, file: !3, line: 863, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!113 = !DILocalVariable(name: "s", scope: !51, file: !3, line: 864, type: !112)
!114 = !DILocalVariable(name: "comma", scope: !115, file: !3, line: 868, type: !112)
!115 = distinct !DILexicalBlock(scope: !51, file: !3, line: 866, column: 5)
!116 = !DILocalVariable(name: "val", scope: !115, file: !3, line: 869, type: !50)
!117 = !{!118, !119, !120, !121, !122, !123, !124}
!118 = !DIEnumerator(name: "PRESERVE_MODE", value: 0)
!119 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1)
!120 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2)
!121 = !DIEnumerator(name: "PRESERVE_LINK", value: 3)
!122 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4)
!123 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5)
!124 = !DIEnumerator(name: "PRESERVE_ALL", value: 6)
!125 = !{!54, !126, !112, !127, !130, !132}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !128, line: 62, baseType: !129)
!128 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!129 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !{!136, !138, !140, !0, !171, !177, !183, !189, !192, !196, !201, !203}
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 88, type: !71, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139)
!139 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 95, type: !71, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141)
!141 = distinct !DIGlobalVariable(name: "infomap", scope: !142, file: !143, line: 632, type: !168, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !143, file: !143, line: 630, type: !144, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !146)
!143 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = !DISubroutineType(types: !145)
!145 = !{null, !54}
!146 = !{!147, !148, !149, !156, !158, !159, !160, !163, !164, !166}
!147 = !DILocalVariable(name: "program", arg: 1, scope: !142, file: !143, line: 630, type: !54)
!148 = !DILocalVariable(name: "node", scope: !142, file: !143, line: 642, type: !54)
!149 = !DILocalVariable(name: "map_prog", scope: !142, file: !143, line: 643, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !142, file: !143, line: 632, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !152, file: !143, line: 632, baseType: !54, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !152, file: !143, line: 632, baseType: !54, size: 64, offset: 64)
!156 = !DILocalVariable(name: "__s1_len", scope: !157, file: !143, line: 645, type: !127)
!157 = distinct !DILexicalBlock(scope: !142, file: !143, line: 645, column: 33)
!158 = !DILocalVariable(name: "__s2_len", scope: !157, file: !143, line: 645, type: !127)
!159 = !DILocalVariable(name: "lc_messages", scope: !142, file: !143, line: 655, type: !54)
!160 = !DILocalVariable(name: "__s1_len", scope: !161, file: !143, line: 656, type: !127)
!161 = distinct !DILexicalBlock(scope: !162, file: !143, line: 656, column: 22)
!162 = distinct !DILexicalBlock(scope: !142, file: !143, line: 656, column: 7)
!163 = !DILocalVariable(name: "__s2_len", scope: !161, file: !143, line: 656, type: !127)
!164 = !DILocalVariable(name: "__s2", scope: !165, file: !143, line: 656, type: !132)
!165 = distinct !DILexicalBlock(scope: !161, file: !143, line: 656, column: 22)
!166 = !DILocalVariable(name: "__result", scope: !165, file: !143, line: 656, type: !167)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 896, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 7)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "sparse_type", scope: !2, file: !3, line: 101, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 96, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIGlobalVariableExpression(var: !178)
!178 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !2, file: !3, line: 97, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!181 = !{!182}
!182 = !DISubrange(count: 4)
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "reflink_type", scope: !2, file: !3, line: 111, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 64, elements: !187)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!187 = !{!188}
!188 = !DISubrange(count: 2)
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !2, file: !3, line: 107, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, elements: !175)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !51, file: !3, line: 849, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 224, elements: !169)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "preserve_args", scope: !51, file: !3, line: 856, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 512, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "parents_option", scope: !2, file: !3, line: 92, type: !71, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "x_tmp", scope: !205, file: !3, line: 760, type: !58, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "do_copy", scope: !3, file: !3, line: 597, type: !206, isLocal: true, isDefinition: true, scopeLine: 599, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !209)
!206 = !DISubroutineType(types: !207)
!207 = !{!71, !167, !208, !54, !71, !57}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!209 = !{!210, !211, !212, !213, !214, !215, !251, !252, !253, !257, !260, !264, !265, !273, !274, !275, !278, !281, !282, !283, !285, !287, !290, !291, !292, !294, !295, !297, !298, !301, !305, !307, !308, !309, !310, !313}
!210 = !DILocalVariable(name: "n_files", arg: 1, scope: !205, file: !3, line: 597, type: !167)
!211 = !DILocalVariable(name: "file", arg: 2, scope: !205, file: !3, line: 597, type: !208)
!212 = !DILocalVariable(name: "target_directory", arg: 3, scope: !205, file: !3, line: 597, type: !54)
!213 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !205, file: !3, line: 598, type: !71)
!214 = !DILocalVariable(name: "x", arg: 5, scope: !205, file: !3, line: 598, type: !57)
!215 = !DILocalVariable(name: "sb", scope: !205, file: !3, line: 600, type: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !217, line: 46, size: 1152, elements: !218)
!217 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!218 = !{!219, !221, !223, !225, !226, !228, !230, !231, !232, !235, !237, !239, !247, !248, !249}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !216, file: !217, line: 48, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !68, line: 133, baseType: !129)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !216, file: !217, line: 53, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !68, line: 136, baseType: !129)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !216, file: !217, line: 61, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !68, line: 139, baseType: !129)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !216, file: !217, line: 62, baseType: !67, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !216, file: !217, line: 64, baseType: !227, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !68, line: 134, baseType: !69)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !216, file: !217, line: 65, baseType: !229, size: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !68, line: 135, baseType: !69)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !216, file: !217, line: 67, baseType: !167, size: 32, offset: 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !216, file: !217, line: 69, baseType: !220, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !216, file: !217, line: 74, baseType: !233, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 140, baseType: !234)
!234 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !216, file: !217, line: 78, baseType: !236, size: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !68, line: 162, baseType: !234)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !216, file: !217, line: 80, baseType: !238, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !68, line: 167, baseType: !234)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !216, file: !217, line: 91, baseType: !240, size: 128, offset: 576)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !241, line: 8, size: 128, elements: !242)
!241 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!242 = !{!243, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !240, file: !241, line: 10, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !68, line: 148, baseType: !234)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !240, file: !241, line: 11, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !68, line: 184, baseType: !234)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !216, file: !217, line: 92, baseType: !240, size: 128, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !216, file: !217, line: 93, baseType: !240, size: 128, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !216, file: !217, line: 106, baseType: !250, size: 192, offset: 960)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 192, elements: !175)
!251 = !DILocalVariable(name: "new_dst", scope: !205, file: !3, line: 601, type: !71)
!252 = !DILocalVariable(name: "ok", scope: !205, file: !3, line: 602, type: !71)
!253 = !DILocalVariable(name: "__x", scope: !254, file: !3, line: 626, type: !71)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 626, column: 7)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 615, column: 5)
!256 = distinct !DILexicalBlock(scope: !205, file: !3, line: 614, column: 7)
!257 = !DILocalVariable(name: "i", scope: !258, file: !3, line: 643, type: !167)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 639, column: 5)
!259 = distinct !DILexicalBlock(scope: !205, file: !3, line: 638, column: 7)
!260 = !DILocalVariable(name: "dst_name", scope: !261, file: !3, line: 656, type: !112)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 655, column: 9)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 654, column: 7)
!263 = distinct !DILexicalBlock(scope: !258, file: !3, line: 654, column: 7)
!264 = !DILocalVariable(name: "parent_exists", scope: !261, file: !3, line: 657, type: !71)
!265 = !DILocalVariable(name: "attr_list", scope: !261, file: !3, line: 658, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !3, line: 64, size: 1344, elements: !268)
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !267, file: !3, line: 66, baseType: !216, size: 1152)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !267, file: !3, line: 67, baseType: !71, size: 8, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !267, file: !3, line: 68, baseType: !127, size: 64, offset: 1216)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !3, line: 69, baseType: !266, size: 64, offset: 1280)
!273 = !DILocalVariable(name: "arg_in_concat", scope: !261, file: !3, line: 659, type: !112)
!274 = !DILocalVariable(name: "arg", scope: !261, file: !3, line: 660, type: !112)
!275 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !276, file: !3, line: 669, type: !112)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 668, column: 13)
!277 = distinct !DILexicalBlock(scope: !261, file: !3, line: 667, column: 15)
!278 = !DILocalVariable(name: "__old", scope: !279, file: !3, line: 676, type: !54)
!279 = distinct !DILexicalBlock(scope: !280, file: !3, line: 676, column: 15)
!280 = distinct !DILexicalBlock(scope: !276, file: !3, line: 676, column: 15)
!281 = !DILocalVariable(name: "__len", scope: !279, file: !3, line: 676, type: !127)
!282 = !DILocalVariable(name: "__new", scope: !279, file: !3, line: 676, type: !112)
!283 = !DILocalVariable(name: "arg_base", scope: !284, file: !3, line: 695, type: !112)
!284 = distinct !DILexicalBlock(scope: !277, file: !3, line: 694, column: 13)
!285 = !DILocalVariable(name: "tmp_abns_", scope: !286, file: !3, line: 698, type: !112)
!286 = distinct !DILexicalBlock(scope: !284, file: !3, line: 698, column: 15)
!287 = !DILocalVariable(name: "__old", scope: !288, file: !3, line: 698, type: !54)
!288 = distinct !DILexicalBlock(scope: !289, file: !3, line: 698, column: 15)
!289 = distinct !DILexicalBlock(scope: !286, file: !3, line: 698, column: 15)
!290 = !DILocalVariable(name: "__len", scope: !288, file: !3, line: 698, type: !127)
!291 = !DILocalVariable(name: "__new", scope: !288, file: !3, line: 698, type: !112)
!292 = !DILocalVariable(name: "__s1_len", scope: !293, file: !3, line: 700, type: !127)
!293 = distinct !DILexicalBlock(scope: !284, file: !3, line: 700, column: 27)
!294 = !DILocalVariable(name: "__s2_len", scope: !293, file: !3, line: 700, type: !127)
!295 = !DILocalVariable(name: "__s2", scope: !296, file: !3, line: 700, type: !132)
!296 = distinct !DILexicalBlock(scope: !293, file: !3, line: 700, column: 27)
!297 = !DILocalVariable(name: "__result", scope: !296, file: !3, line: 700, type: !167)
!298 = !DILocalVariable(name: "copy_into_self", scope: !299, file: !3, line: 714, type: !71)
!299 = distinct !DILexicalBlock(scope: !300, file: !3, line: 713, column: 13)
!300 = distinct !DILexicalBlock(scope: !261, file: !3, line: 706, column: 15)
!301 = !DILocalVariable(name: "p", scope: !302, file: !3, line: 726, type: !266)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 725, column: 17)
!303 = distinct !DILexicalBlock(scope: !304, file: !3, line: 723, column: 13)
!304 = distinct !DILexicalBlock(scope: !261, file: !3, line: 722, column: 15)
!305 = !DILocalVariable(name: "new_dest", scope: !306, file: !3, line: 737, type: !54)
!306 = distinct !DILexicalBlock(scope: !259, file: !3, line: 736, column: 5)
!307 = !DILocalVariable(name: "source", scope: !306, file: !3, line: 738, type: !54)
!308 = !DILocalVariable(name: "dest", scope: !306, file: !3, line: 739, type: !54)
!309 = !DILocalVariable(name: "unused", scope: !306, file: !3, line: 740, type: !71)
!310 = !DILocalVariable(name: "__s1_len", scope: !311, file: !3, line: 757, type: !127)
!311 = distinct !DILexicalBlock(scope: !312, file: !3, line: 757, column: 14)
!312 = distinct !DILexicalBlock(scope: !306, file: !3, line: 755, column: 11)
!313 = !DILocalVariable(name: "__s2_len", scope: !311, file: !3, line: 757, type: !127)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 7680, elements: !324)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !317, line: 104, size: 256, elements: !318)
!317 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!318 = !{!319, !320, !321, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 106, baseType: !54, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !316, file: !317, line: 109, baseType: !167, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !317, line: 110, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !317, line: 111, baseType: !167, size: 32, offset: 192)
!324 = !{!325}
!325 = !DISubrange(count: 30)
!326 = !DIGlobalVariableExpression(var: !327)
!327 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !328, file: !329, line: 146, type: !54, isLocal: true, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !330, retainedTypes: !355, globals: !358)
!329 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!330 = !{!5, !12, !19, !25, !31, !36, !331, !335, !342, !351}
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 27, size: 32, elements: !333)
!332 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !{!334}
!334 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !336, line: 26, size: 32, elements: !337)
!336 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!337 = !{!338, !339, !340, !341}
!338 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!339 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!340 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!341 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !343, line: 45, size: 32, elements: !344)
!343 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !{!345, !346, !347, !348, !349, !350}
!345 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!346 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!347 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!348 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!349 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!350 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !352, line: 73, size: 32, elements: !353)
!352 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!353 = !{!354}
!354 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072)
!355 = !{!65, !126, !69, !112, !127, !130, !132, !54, !129, !134, !356}
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !357, line: 91, baseType: !233)
!357 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!358 = !{!359, !326, !365, !367, !377, !379}
!359 = !DIGlobalVariableExpression(var: !360)
!360 = distinct !DIGlobalVariable(name: "mask", scope: !361, file: !329, line: 2992, type: !65, isLocal: true, isDefinition: true)
!361 = distinct !DISubprogram(name: "cached_umask", scope: !329, file: !329, line: 2990, type: !362, isLocal: false, isDefinition: true, scopeLine: 2991, flags: DIFlagPrototyped, isOptimized: true, unit: !328, variables: !364)
!362 = !DISubroutineType(types: !363)
!363 = !{!65}
!364 = !{}
!365 = !DIGlobalVariableExpression(var: !366)
!366 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !328, file: !329, line: 147, type: !54, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368)
!368 = distinct !DIGlobalVariable(name: "zeros", scope: !369, file: !329, line: 350, type: !112, isLocal: true, isDefinition: true)
!369 = distinct !DISubprogram(name: "write_zeros", scope: !329, file: !329, line: 348, type: !370, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !328, variables: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{!71, !167, !356}
!372 = !{!373, !374, !375}
!373 = !DILocalVariable(name: "fd", arg: 1, scope: !369, file: !329, line: 348, type: !167)
!374 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !369, file: !329, line: 348, type: !356)
!375 = !DILocalVariable(name: "n", scope: !376, file: !329, line: 369, type: !127)
!376 = distinct !DILexicalBlock(scope: !369, file: !329, line: 368, column: 5)
!377 = !DIGlobalVariableExpression(var: !378)
!378 = distinct !DIGlobalVariable(name: "nz", scope: !369, file: !329, line: 351, type: !127, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "fallback", scope: !369, file: !329, line: 358, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8192, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 1024)
!384 = !DIGlobalVariableExpression(var: !385)
!385 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !386, file: !387, line: 45, type: !102, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !388, globals: !392)
!387 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!126, !112, !389}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !390, line: 136, baseType: !391)
!390 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !68, line: 62, baseType: !129)
!392 = !{!384}
!393 = !DIGlobalVariableExpression(var: !394)
!394 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !395, file: !396, line: 38, type: !405, isLocal: true, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !397, globals: !404)
!396 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!397 = !{!398, !401}
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 39, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIEnumerator(name: "x_suffix_len", value: 6)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 44, size: 32, elements: !402)
!402 = !{!403}
!403 = !DIEnumerator(name: "smallsize", value: 256)
!404 = !{!393}
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 72, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 9)
!408 = !DIGlobalVariableExpression(var: !409)
!409 = distinct !DIGlobalVariable(name: "Version", scope: !410, file: !411, line: 2, type: !54, isLocal: false, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !412)
!411 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!412 = !{!408}
!413 = !DIGlobalVariableExpression(var: !414)
!414 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !415, file: !420, line: 69, type: !421, isLocal: false, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !417, retainedTypes: !418, globals: !419)
!416 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!417 = !{!36}
!418 = !{!127, !126, !134}
!419 = !{!413}
!420 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !422, line: 55, baseType: !423)
!422 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null}
!426 = !DIGlobalVariableExpression(var: !427)
!427 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !428, file: !432, line: 83, type: !54, isLocal: false, isDefinition: true)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !430, retainedTypes: !479, globals: !480)
!429 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!430 = !{!5, !431, !450, !455}
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !433, file: !432, line: 285, size: 32, elements: !448)
!432 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = distinct !DISubprogram(name: "find_backup_file_name", scope: !432, file: !432, line: 264, type: !434, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !428, variables: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!112, !54, !5}
!436 = !{!437, !438, !439, !440, !441, !442, !443, !446, !447}
!437 = !DILocalVariable(name: "file", arg: 1, scope: !433, file: !432, line: 264, type: !54)
!438 = !DILocalVariable(name: "backup_type", arg: 2, scope: !433, file: !432, line: 264, type: !5)
!439 = !DILocalVariable(name: "filelen", scope: !433, file: !432, line: 266, type: !127)
!440 = !DILocalVariable(name: "s", scope: !433, file: !432, line: 267, type: !112)
!441 = !DILocalVariable(name: "ssize", scope: !433, file: !432, line: 268, type: !127)
!442 = !DILocalVariable(name: "simple", scope: !433, file: !432, line: 269, type: !71)
!443 = !DILocalVariable(name: "env_suffix", scope: !444, file: !432, line: 274, type: !54)
!444 = distinct !DILexicalBlock(scope: !445, file: !432, line: 273, column: 5)
!445 = distinct !DILexicalBlock(scope: !433, file: !432, line: 272, column: 7)
!446 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !433, file: !432, line: 283, type: !127)
!447 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !433, file: !432, line: 284, type: !127)
!448 = !{!449}
!449 = !DIEnumerator(name: "GUESS", value: 9)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !432, line: 146, size: 32, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!453 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!454 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 24, size: 32, elements: !457)
!456 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!458 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!459 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!460 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!461 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!462 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!463 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!464 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!465 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!466 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!467 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!468 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!469 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!470 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!471 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!472 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!473 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!474 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!475 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!476 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!477 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!478 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!479 = !{!54, !126, !69, !127}
!480 = !{!426, !481, !485}
!481 = !DIGlobalVariableExpression(var: !482)
!482 = distinct !DIGlobalVariable(name: "backup_types", scope: !428, file: !432, line: 325, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 256, elements: !199)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!485 = !DIGlobalVariableExpression(var: !486)
!486 = distinct !DIGlobalVariable(name: "backup_args", scope: !428, file: !432, line: 314, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 576, elements: !406)
!488 = !DIGlobalVariableExpression(var: !489)
!489 = distinct !DIGlobalVariable(name: "file_name", scope: !490, file: !493, line: 37, type: !54, isLocal: true, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !492)
!491 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!492 = !{!488}
!493 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!494 = !DIGlobalVariableExpression(var: !495)
!495 = distinct !DIGlobalVariable(name: "file_name", scope: !496, file: !501, line: 36, type: !54, isLocal: true, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !498)
!497 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!498 = !{!494, !499}
!499 = !DIGlobalVariableExpression(var: !500)
!500 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !496, file: !501, line: 46, type: !71, isLocal: true, isDefinition: true)
!501 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!502 = !DIGlobalVariableExpression(var: !503)
!503 = distinct !DIGlobalVariable(name: "exit_failure", scope: !504, file: !507, line: 24, type: !508, isLocal: false, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !506)
!505 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!506 = !{!502}
!507 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!508 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!509 = !DIGlobalVariableExpression(var: !510)
!510 = distinct !DIGlobalVariable(name: "default_tuning", scope: !511, file: !515, line: 130, type: !516, isLocal: true, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !513, globals: !514)
!512 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!513 = !{!129, !126, !127}
!514 = !{!509}
!515 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !104, line: 65, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !104, line: 53, size: 160, elements: !519)
!519 = !{!520, !522, !523, !524, !525}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !518, file: !104, line: 58, baseType: !521, size: 32)
!521 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !518, file: !104, line: 59, baseType: !521, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !518, file: !104, line: 60, baseType: !521, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !518, file: !104, line: 61, baseType: !521, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !518, file: !104, line: 62, baseType: !71, size: 8, offset: 128)
!526 = !DIGlobalVariableExpression(var: !527)
!527 = distinct !DIGlobalVariable(name: "program_name", scope: !528, file: !532, line: 33, type: !54, isLocal: false, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !530, globals: !531)
!529 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!530 = !{!126, !112}
!531 = !{!526}
!532 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !535, file: !563, line: 77, type: !596, isLocal: false, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !537, retainedTypes: !558, globals: !560)
!536 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!537 = !{!36, !538, !543}
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !37, line: 242, size: 32, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!541 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!542 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !544, line: 46, size: 32, elements: !545)
!544 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!546 = !DIEnumerator(name: "_ISupper", value: 256)
!547 = !DIEnumerator(name: "_ISlower", value: 512)
!548 = !DIEnumerator(name: "_ISalpha", value: 1024)
!549 = !DIEnumerator(name: "_ISdigit", value: 2048)
!550 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!551 = !DIEnumerator(name: "_ISspace", value: 8192)
!552 = !DIEnumerator(name: "_ISprint", value: 16384)
!553 = !DIEnumerator(name: "_ISgraph", value: 32768)
!554 = !DIEnumerator(name: "_ISblank", value: 1)
!555 = !DIEnumerator(name: "_IScntrl", value: 2)
!556 = !DIEnumerator(name: "_ISpunct", value: 4)
!557 = !DIEnumerator(name: "_ISalnum", value: 8)
!558 = !{!167, !559, !127, !112}
!559 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!560 = !{!533, !561, !568, !578, !580, !585, !592, !594}
!561 = !DIGlobalVariableExpression(var: !562)
!562 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !535, file: !563, line: 93, type: !564, isLocal: false, isDefinition: true)
!563 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 320, elements: !566)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!566 = !{!567}
!567 = !DISubrange(count: 10)
!568 = !DIGlobalVariableExpression(var: !569)
!569 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !535, file: !563, line: 1043, type: !570, isLocal: false, isDefinition: true)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !563, line: 57, size: 448, elements: !571)
!571 = !{!572, !573, !574, !576, !577}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !570, file: !563, line: 60, baseType: !36, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !570, file: !563, line: 63, baseType: !167, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !570, file: !563, line: 67, baseType: !575, size: 256, offset: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !199)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !570, file: !563, line: 70, baseType: !54, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !570, file: !563, line: 73, baseType: !54, size: 64, offset: 384)
!578 = !DIGlobalVariableExpression(var: !579)
!579 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !535, file: !563, line: 108, type: !570, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581)
!581 = distinct !DIGlobalVariable(name: "slot0", scope: !535, file: !563, line: 834, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 2048, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 256)
!585 = !DIGlobalVariableExpression(var: !586)
!586 = distinct !DIGlobalVariable(name: "slotvec", scope: !535, file: !563, line: 837, type: !587, isLocal: true, isDefinition: true)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !563, line: 826, size: 128, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !563, line: 828, baseType: !127, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !588, file: !563, line: 829, baseType: !112, size: 64, offset: 64)
!592 = !DIGlobalVariableExpression(var: !593)
!593 = distinct !DIGlobalVariable(name: "nslots", scope: !535, file: !563, line: 835, type: !167, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595)
!595 = distinct !DIGlobalVariable(name: "slotvec0", scope: !535, file: !563, line: 836, type: !588, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 704, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 11)
!599 = !DIGlobalVariableExpression(var: !600)
!600 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !601, file: !619, line: 74, type: !620, isLocal: true, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !603, retainedTypes: !617, globals: !618)
!602 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!603 = !{!335, !604}
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !606, file: !605, line: 192, size: 32, elements: !615)
!605 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!606 = distinct !DISubprogram(name: "x2nrealloc", scope: !605, file: !605, line: 180, type: !607, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !601, variables: !610)
!607 = !DISubroutineType(types: !608)
!608 = !{!126, !126, !609, !127}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!610 = !{!611, !612, !613, !614}
!611 = !DILocalVariable(name: "p", arg: 1, scope: !606, file: !605, line: 180, type: !126)
!612 = !DILocalVariable(name: "pn", arg: 2, scope: !606, file: !605, line: 180, type: !609)
!613 = !DILocalVariable(name: "s", arg: 3, scope: !606, file: !605, line: 180, type: !127)
!614 = !DILocalVariable(name: "n", scope: !606, file: !605, line: 182, type: !127)
!615 = !{!616}
!616 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!617 = !{!126}
!618 = !{!599}
!619 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 192, elements: !175)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !619, line: 72, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!167, !130, !130}
!626 = !DIGlobalVariableExpression(var: !627)
!627 = distinct !DIGlobalVariable(name: "letters", scope: !628, file: !631, line: 185, type: !632, isLocal: true, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !630)
!629 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!630 = !{!626}
!631 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 504, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 63)
!635 = !DIGlobalVariableExpression(var: !636)
!636 = distinct !DIGlobalVariable(name: "ht", scope: !637, file: !638, line: 147, type: !102, isLocal: true, isDefinition: true)
!637 = distinct !DISubprogram(name: "utimecmp", scope: !638, file: !638, line: 116, type: !639, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !664, variables: !680)
!638 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!639 = !DISubroutineType(types: !640)
!640 = !{!167, !54, !641, !641, !167}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !217, line: 46, size: 1152, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !661, !662, !663}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !643, file: !217, line: 48, baseType: !220, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !643, file: !217, line: 53, baseType: !222, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !643, file: !217, line: 61, baseType: !224, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !643, file: !217, line: 62, baseType: !67, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !643, file: !217, line: 64, baseType: !227, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !643, file: !217, line: 65, baseType: !229, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !643, file: !217, line: 67, baseType: !167, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !643, file: !217, line: 69, baseType: !220, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !643, file: !217, line: 74, baseType: !233, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !643, file: !217, line: 78, baseType: !236, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !643, file: !217, line: 80, baseType: !238, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !643, file: !217, line: 91, baseType: !657, size: 128, offset: 576)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !241, line: 8, size: 128, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !657, file: !241, line: 10, baseType: !244, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !657, file: !241, line: 11, baseType: !246, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !643, file: !217, line: 92, baseType: !657, size: 128, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !643, file: !217, line: 93, baseType: !657, size: 128, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !643, file: !217, line: 106, baseType: !250, size: 192, offset: 960)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, globals: !670)
!665 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = !{!331, !667}
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !638, line: 47, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!670 = !{!635, !671}
!671 = !DIGlobalVariableExpression(var: !672)
!672 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !637, file: !638, line: 150, type: !673, isLocal: true, isDefinition: true)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !638, line: 60, size: 128, elements: !675)
!675 = !{!676, !678, !679}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !674, file: !638, line: 63, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !66, line: 60, baseType: !220)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !674, file: !638, line: 70, baseType: !167, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !674, file: !638, line: 74, baseType: !71, size: 8, offset: 96)
!680 = !{!681, !682, !683, !684, !685, !688, !689, !690, !691, !694, !695, !696, !699, !700, !701, !702, !703, !704, !706, !709, !710, !711, !712, !716, !717, !719, !721, !723}
!681 = !DILocalVariable(name: "dst_name", arg: 1, scope: !637, file: !638, line: 116, type: !54)
!682 = !DILocalVariable(name: "dst_stat", arg: 2, scope: !637, file: !638, line: 117, type: !641)
!683 = !DILocalVariable(name: "src_stat", arg: 3, scope: !637, file: !638, line: 118, type: !641)
!684 = !DILocalVariable(name: "options", arg: 4, scope: !637, file: !638, line: 119, type: !167)
!685 = !DILocalVariable(name: "dst_s", scope: !637, file: !638, line: 137, type: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !687, line: 8, baseType: !244)
!687 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !DILocalVariable(name: "src_s", scope: !637, file: !638, line: 138, type: !686)
!689 = !DILocalVariable(name: "dst_ns", scope: !637, file: !638, line: 139, type: !167)
!690 = !DILocalVariable(name: "src_ns", scope: !637, file: !638, line: 140, type: !167)
!691 = !DILocalVariable(name: "dst_res", scope: !692, file: !638, line: 151, type: !673)
!692 = distinct !DILexicalBlock(scope: !693, file: !638, line: 143, column: 5)
!693 = distinct !DILexicalBlock(scope: !637, file: !638, line: 142, column: 7)
!694 = !DILocalVariable(name: "tmp_dst_res", scope: !692, file: !638, line: 152, type: !674)
!695 = !DILocalVariable(name: "res", scope: !692, file: !638, line: 155, type: !167)
!696 = !DILocalVariable(name: "dst_a_s", scope: !697, file: !638, line: 229, type: !686)
!697 = distinct !DILexicalBlock(scope: !698, file: !638, line: 225, column: 9)
!698 = distinct !DILexicalBlock(scope: !692, file: !638, line: 224, column: 11)
!699 = !DILocalVariable(name: "dst_c_s", scope: !697, file: !638, line: 230, type: !686)
!700 = !DILocalVariable(name: "dst_m_s", scope: !697, file: !638, line: 231, type: !686)
!701 = !DILocalVariable(name: "dst_a_ns", scope: !697, file: !638, line: 232, type: !167)
!702 = !DILocalVariable(name: "dst_c_ns", scope: !697, file: !638, line: 233, type: !167)
!703 = !DILocalVariable(name: "dst_m_ns", scope: !697, file: !638, line: 234, type: !167)
!704 = !DILocalVariable(name: "odd_second", scope: !705, file: !638, line: 243, type: !71)
!705 = distinct !DILexicalBlock(scope: !697, file: !638, line: 242, column: 11)
!706 = !DILocalVariable(name: "a", scope: !707, file: !638, line: 252, type: !167)
!707 = distinct !DILexicalBlock(scope: !708, file: !638, line: 251, column: 15)
!708 = distinct !DILexicalBlock(scope: !705, file: !638, line: 245, column: 17)
!709 = !DILocalVariable(name: "c", scope: !707, file: !638, line: 253, type: !167)
!710 = !DILocalVariable(name: "m", scope: !707, file: !638, line: 254, type: !167)
!711 = !DILocalVariable(name: "SR10", scope: !707, file: !638, line: 258, type: !167)
!712 = !DILocalVariable(name: "timespec", scope: !713, file: !638, line: 280, type: !715)
!713 = distinct !DILexicalBlock(scope: !714, file: !638, line: 279, column: 13)
!714 = distinct !DILexicalBlock(scope: !697, file: !638, line: 278, column: 15)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 256, elements: !187)
!716 = !DILocalVariable(name: "dst_status", scope: !713, file: !638, line: 281, type: !643)
!717 = !DILocalVariable(name: "s", scope: !718, file: !638, line: 291, type: !686)
!718 = distinct !DILexicalBlock(scope: !713, file: !638, line: 290, column: 15)
!719 = !DILocalVariable(name: "stat_result", scope: !720, file: !638, line: 320, type: !167)
!720 = distinct !DILexicalBlock(scope: !713, file: !638, line: 319, column: 15)
!721 = !DILocalVariable(name: "old_res", scope: !722, file: !638, line: 345, type: !167)
!722 = distinct !DILexicalBlock(scope: !713, file: !638, line: 344, column: 15)
!723 = !DILocalVariable(name: "a", scope: !722, file: !638, line: 346, type: !167)
!724 = !DIGlobalVariableExpression(var: !725)
!725 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !726, file: !736, line: 73, type: !167, isLocal: true, isDefinition: true)
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !728, globals: !733)
!727 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!728 = !{!729}
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 35, size: 32, elements: !731)
!730 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!731 = !{!732}
!732 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!733 = !{!724, !734}
!734 = !DIGlobalVariableExpression(var: !735)
!735 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !726, file: !736, line: 74, type: !167, isLocal: true, isDefinition: true)
!736 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!737 = !DIGlobalVariableExpression(var: !738)
!738 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !739, file: !742, line: 26, type: !743, isLocal: false, isDefinition: true)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !741)
!740 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!741 = !{!737}
!742 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 376, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 47)
!746 = !DIGlobalVariableExpression(var: !747)
!747 = distinct !DIGlobalVariable(name: "can_write", scope: !748, file: !749, line: 35, type: !71, isLocal: true, isDefinition: true)
!748 = distinct !DISubprogram(name: "can_write_any_file", scope: !749, file: !749, line: 32, type: !750, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !752, variables: !757)
!749 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!750 = !DISubroutineType(types: !751)
!751 = !{!71}
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !753, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !754)
!753 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = !{!755, !746}
!755 = !DIGlobalVariableExpression(var: !756)
!756 = distinct !DIGlobalVariable(name: "initialized", scope: !748, file: !749, line: 34, type: !71, isLocal: true, isDefinition: true)
!757 = !{!758}
!758 = !DILocalVariable(name: "can", scope: !759, file: !749, line: 39, type: !71)
!759 = distinct !DILexicalBlock(scope: !760, file: !749, line: 38, column: 5)
!760 = distinct !DILexicalBlock(scope: !748, file: !749, line: 37, column: 7)
!761 = !DIGlobalVariableExpression(var: !762)
!762 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !763, file: !764, line: 335, type: !167, isLocal: true, isDefinition: true)
!763 = distinct !DISubprogram(name: "rpl_fcntl", scope: !764, file: !764, line: 272, type: !765, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !767, variables: !770)
!764 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!765 = !DISubroutineType(types: !766)
!766 = !{!167, !167, !167, null}
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, globals: !769)
!768 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!769 = !{!761}
!770 = !{!771, !772, !773, !786, !787, !790, !793, !796}
!771 = !DILocalVariable(name: "fd", arg: 1, scope: !763, file: !764, line: 272, type: !167)
!772 = !DILocalVariable(name: "action", arg: 2, scope: !763, file: !764, line: 272, type: !167)
!773 = !DILocalVariable(name: "arg", scope: !763, file: !764, line: 274, type: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !775, line: 30, baseType: !776)
!775 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !768, line: 274, baseType: !777)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 192, elements: !784)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !768, line: 274, size: 192, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !778, file: !768, line: 274, baseType: !69, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !778, file: !768, line: 274, baseType: !69, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !778, file: !768, line: 274, baseType: !126, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !778, file: !768, line: 274, baseType: !126, size: 64, offset: 128)
!784 = !{!785}
!785 = !DISubrange(count: 1)
!786 = !DILocalVariable(name: "result", scope: !763, file: !764, line: 275, type: !167)
!787 = !DILocalVariable(name: "target", scope: !788, file: !764, line: 322, type: !167)
!788 = distinct !DILexicalBlock(scope: !789, file: !764, line: 321, column: 7)
!789 = distinct !DILexicalBlock(scope: !763, file: !764, line: 278, column: 5)
!790 = !DILocalVariable(name: "flags", scope: !791, file: !764, line: 359, type: !167)
!791 = distinct !DILexicalBlock(scope: !792, file: !764, line: 358, column: 11)
!792 = distinct !DILexicalBlock(scope: !788, file: !764, line: 357, column: 13)
!793 = !DILocalVariable(name: "saved_errno", scope: !794, file: !764, line: 362, type: !167)
!794 = distinct !DILexicalBlock(scope: !795, file: !764, line: 361, column: 15)
!795 = distinct !DILexicalBlock(scope: !791, file: !764, line: 360, column: 17)
!796 = !DILocalVariable(name: "p", scope: !797, file: !764, line: 404, type: !126)
!797 = distinct !DILexicalBlock(scope: !789, file: !764, line: 402, column: 7)
!798 = !DIGlobalVariableExpression(var: !799)
!799 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !800, file: !1144, line: 120, type: !1145, isLocal: true, isDefinition: true)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !802, retainedTypes: !1141, globals: !1143)
!801 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!802 = !{!803}
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 41, size: 32, elements: !805)
!804 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140}
!806 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!807 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!808 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!809 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!810 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!811 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!812 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!813 = !DIEnumerator(name: "DAY_1", value: 131079)
!814 = !DIEnumerator(name: "DAY_2", value: 131080)
!815 = !DIEnumerator(name: "DAY_3", value: 131081)
!816 = !DIEnumerator(name: "DAY_4", value: 131082)
!817 = !DIEnumerator(name: "DAY_5", value: 131083)
!818 = !DIEnumerator(name: "DAY_6", value: 131084)
!819 = !DIEnumerator(name: "DAY_7", value: 131085)
!820 = !DIEnumerator(name: "ABMON_1", value: 131086)
!821 = !DIEnumerator(name: "ABMON_2", value: 131087)
!822 = !DIEnumerator(name: "ABMON_3", value: 131088)
!823 = !DIEnumerator(name: "ABMON_4", value: 131089)
!824 = !DIEnumerator(name: "ABMON_5", value: 131090)
!825 = !DIEnumerator(name: "ABMON_6", value: 131091)
!826 = !DIEnumerator(name: "ABMON_7", value: 131092)
!827 = !DIEnumerator(name: "ABMON_8", value: 131093)
!828 = !DIEnumerator(name: "ABMON_9", value: 131094)
!829 = !DIEnumerator(name: "ABMON_10", value: 131095)
!830 = !DIEnumerator(name: "ABMON_11", value: 131096)
!831 = !DIEnumerator(name: "ABMON_12", value: 131097)
!832 = !DIEnumerator(name: "MON_1", value: 131098)
!833 = !DIEnumerator(name: "MON_2", value: 131099)
!834 = !DIEnumerator(name: "MON_3", value: 131100)
!835 = !DIEnumerator(name: "MON_4", value: 131101)
!836 = !DIEnumerator(name: "MON_5", value: 131102)
!837 = !DIEnumerator(name: "MON_6", value: 131103)
!838 = !DIEnumerator(name: "MON_7", value: 131104)
!839 = !DIEnumerator(name: "MON_8", value: 131105)
!840 = !DIEnumerator(name: "MON_9", value: 131106)
!841 = !DIEnumerator(name: "MON_10", value: 131107)
!842 = !DIEnumerator(name: "MON_11", value: 131108)
!843 = !DIEnumerator(name: "MON_12", value: 131109)
!844 = !DIEnumerator(name: "AM_STR", value: 131110)
!845 = !DIEnumerator(name: "PM_STR", value: 131111)
!846 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!847 = !DIEnumerator(name: "D_FMT", value: 131113)
!848 = !DIEnumerator(name: "T_FMT", value: 131114)
!849 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!850 = !DIEnumerator(name: "ERA", value: 131116)
!851 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!852 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!853 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!854 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!855 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!856 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!857 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!858 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!859 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!860 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!861 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!862 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!863 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!864 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!865 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!866 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!867 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!868 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!869 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!870 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!871 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!872 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!873 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!874 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!875 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!876 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!877 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!878 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!879 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!880 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!881 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!882 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!883 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!884 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!885 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!886 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!887 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!888 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!889 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!890 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!891 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!892 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!893 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!894 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!895 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!896 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!897 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!898 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!899 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!900 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!901 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!902 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!903 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!904 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!905 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!906 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!907 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!908 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!909 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!910 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!911 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!912 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!913 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!914 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!915 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!916 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!917 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!918 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!919 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!920 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!921 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!922 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!923 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!924 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!925 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!926 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!927 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!928 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!929 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!930 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!931 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!932 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!933 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!934 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!935 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!936 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!937 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!938 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!939 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!940 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!941 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!942 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!943 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!944 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!945 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!946 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!947 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!948 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!949 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!950 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!951 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!952 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!953 = !DIEnumerator(name: "CODESET", value: 14)
!954 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!955 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!956 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!957 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!958 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!959 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!960 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!961 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!962 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!963 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!964 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!965 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!966 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!967 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!968 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!969 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!970 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!971 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!972 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!973 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!974 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!975 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!976 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!977 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!978 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!979 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!980 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!981 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!982 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!983 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!984 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!985 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!986 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!987 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!988 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!989 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!990 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!991 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!992 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!993 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!994 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!995 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!996 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!997 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!998 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!999 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!1000 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!1001 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!1002 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!1003 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!1004 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!1005 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!1006 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!1007 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!1008 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!1009 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!1010 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!1011 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!1012 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!1013 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!1014 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!1015 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!1016 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!1017 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!1018 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!1019 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!1020 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!1021 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!1022 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!1023 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!1024 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!1025 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!1026 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!1027 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!1028 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!1029 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!1030 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!1031 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!1032 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!1033 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!1034 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!1035 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!1036 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!1037 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!1038 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!1039 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!1040 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!1041 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!1042 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!1043 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!1044 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!1045 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!1046 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!1047 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!1048 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1049 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1050 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1051 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1052 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1053 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1054 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1055 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1056 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1057 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1058 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1059 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1060 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1061 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1062 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1063 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1064 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1065 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1066 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1067 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1068 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1069 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1070 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1071 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1072 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1073 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1074 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1075 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1076 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1077 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1078 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1079 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1080 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1081 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1082 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1083 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1084 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1085 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1086 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1087 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1088 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1089 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1090 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1091 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1092 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1093 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1094 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1095 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1096 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1097 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!1098 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!1099 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!1100 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!1101 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!1102 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!1103 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!1104 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!1105 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!1106 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1107 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1108 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1109 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1110 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1111 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1112 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1113 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1114 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1115 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1116 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1117 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1118 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1119 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1120 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1121 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1122 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1123 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1124 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1125 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1126 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1127 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1128 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1129 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1130 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1131 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1132 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1133 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1134 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1135 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1136 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1137 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1138 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1139 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1140 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1141 = !{!126, !112, !1142}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!1143 = !{!798}
!1144 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1145 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!1146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1147, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1148, retainedTypes: !1226)
!1147 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1148 = !{!1149}
!1149 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1150, file: !1147, line: 97, size: 32, elements: !1224)
!1150 = distinct !DISubprogram(name: "extent_scan_read", scope: !1147, file: !1147, line: 87, type: !1151, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !1146, variables: !1171)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!71, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !1155, line: 36, size: 384, elements: !1156)
!1155 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1156 = !{!1157, !1158, !1160, !1161, !1162, !1163, !1164}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1154, file: !1155, line: 39, baseType: !167, size: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !1154, file: !1155, line: 42, baseType: !1159, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !66, line: 86, baseType: !233)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1154, file: !1155, line: 45, baseType: !69, size: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !1154, file: !1155, line: 48, baseType: !127, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !1154, file: !1155, line: 52, baseType: !71, size: 8, offset: 256)
