; ModuleID = 'coreutils-8.27/src/ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.hash_table*, %struct.hash_table* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "owner_name", scope: !2, file: !3, line: 74, type: !87, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !81, globals: !152)
!3 = !DIFile(filename: "src/install.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !19, !25, !31, !36, !50, !58}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "no_backups", value: 0)
!9 = !DIEnumerator(name: "simple_backups", value: 1)
!10 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!11 = !DIEnumerator(name: "numbered_backups", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !13, line: 69, size: 32, elements: !14)
!13 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!16 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!17 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!18 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !13, line: 60, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!22 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2)
!23 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!24 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !13, line: 26, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!28 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!29 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!30 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !13, line: 47, size: 32, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!34 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!35 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !37, line: 32, size: 32, elements: !38)
!37 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!40 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!41 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!42 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!43 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!44 = !DIEnumerator(name: "c_quoting_style", value: 5)
!45 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!46 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!47 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!48 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!49 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !51, line: 26, size: 32, elements: !52)
!51 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!54 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!55 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!56 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!57 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !60, file: !59, line: 39, size: 32, elements: !74)
!59 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !59, line: 36, size: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !60, file: !59, line: 66, baseType: !58, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !60, file: !59, line: 74, baseType: !64, size: 32, offset: 32)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !59, line: 69, size: 32, elements: !65)
!65 = !{!66, !68, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !64, file: !59, line: 71, baseType: !67, size: 32)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !64, file: !59, line: 72, baseType: !67, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !64, file: !59, line: 73, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !71, line: 98, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !73, line: 142, baseType: !67)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !{!75, !76, !77, !78, !79, !80}
!75 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!76 = !DIEnumerator(name: "FD_STATE", value: 1)
!77 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!78 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!79 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!80 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!81 = !{!82, !87, !89, !90, !93, !95, !98, !100, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !83, line: 84, baseType: !84)
!83 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !67}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 62, baseType: !92)
!91 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!92 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !71, line: 80, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !73, line: 134, baseType: !102)
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !71, line: 65, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !73, line: 135, baseType: !102)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !13, line: 98, size: 576, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !115, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !151}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !106, file: !13, line: 100, baseType: !5, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !106, file: !13, line: 103, baseType: !12, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !106, file: !13, line: 108, baseType: !19, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !106, file: !13, line: 111, baseType: !25, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !106, file: !13, line: 115, baseType: !113, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !71, line: 70, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !73, line: 138, baseType: !102)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !106, file: !13, line: 119, baseType: !116, size: 8, offset: 160)
!116 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !106, file: !13, line: 123, baseType: !116, size: 8, offset: 168)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !106, file: !13, line: 130, baseType: !116, size: 8, offset: 176)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !106, file: !13, line: 134, baseType: !116, size: 8, offset: 184)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !106, file: !13, line: 138, baseType: !116, size: 8, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !106, file: !13, line: 141, baseType: !116, size: 8, offset: 200)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !106, file: !13, line: 145, baseType: !116, size: 8, offset: 208)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !106, file: !13, line: 152, baseType: !116, size: 8, offset: 216)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !106, file: !13, line: 156, baseType: !116, size: 8, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !106, file: !13, line: 160, baseType: !116, size: 8, offset: 232)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !106, file: !13, line: 161, baseType: !116, size: 8, offset: 240)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !106, file: !13, line: 162, baseType: !116, size: 8, offset: 248)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !106, file: !13, line: 163, baseType: !116, size: 8, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !106, file: !13, line: 166, baseType: !116, size: 8, offset: 264)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !106, file: !13, line: 178, baseType: !116, size: 8, offset: 272)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !106, file: !13, line: 182, baseType: !116, size: 8, offset: 280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !106, file: !13, line: 188, baseType: !116, size: 8, offset: 288)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !106, file: !13, line: 192, baseType: !116, size: 8, offset: 296)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !106, file: !13, line: 201, baseType: !116, size: 8, offset: 304)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !106, file: !13, line: 205, baseType: !116, size: 8, offset: 312)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !106, file: !13, line: 214, baseType: !116, size: 8, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !106, file: !13, line: 223, baseType: !116, size: 8, offset: 328)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !106, file: !13, line: 227, baseType: !116, size: 8, offset: 336)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !106, file: !13, line: 231, baseType: !116, size: 8, offset: 344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !106, file: !13, line: 235, baseType: !116, size: 8, offset: 352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !106, file: !13, line: 239, baseType: !116, size: 8, offset: 360)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !106, file: !13, line: 242, baseType: !116, size: 8, offset: 368)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !106, file: !13, line: 245, baseType: !116, size: 8, offset: 376)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !106, file: !13, line: 250, baseType: !116, size: 8, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !106, file: !13, line: 253, baseType: !31, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !106, file: !13, line: 264, baseType: !147, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !149, line: 69, baseType: !150)
!149 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !149, line: 67, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !106, file: !13, line: 267, baseType: !147, size: 64, offset: 512)
!152 = !{!0, !153, !155, !157, !159, !161, !191, !193, !207, !209, !211, !213, !215, !217, !219, !221, !233, !235}
!153 = !DIGlobalVariableExpression(var: !154)
!154 = distinct !DIGlobalVariable(name: "group_name", scope: !2, file: !3, line: 81, type: !87, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156)
!156 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !2, file: !3, line: 102, type: !116, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158)
!158 = distinct !DIGlobalVariable(name: "strip_files", scope: !2, file: !3, line: 105, type: !116, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160)
!160 = distinct !DIGlobalVariable(name: "dir_arg", scope: !2, file: !3, line: 108, type: !116, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162)
!162 = distinct !DIGlobalVariable(name: "infomap", scope: !163, file: !164, line: 632, type: !188, isLocal: true, isDefinition: true)
!163 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !164, file: !164, line: 630, type: !165, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !167)
!164 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!165 = !DISubroutineType(types: !166)
!166 = !{null, !98}
!167 = !{!168, !169, !170, !177, !179, !180, !181, !184, !185, !187}
!168 = !DILocalVariable(name: "program", arg: 1, scope: !163, file: !164, line: 630, type: !98)
!169 = !DILocalVariable(name: "node", scope: !163, file: !164, line: 642, type: !98)
!170 = !DILocalVariable(name: "map_prog", scope: !163, file: !164, line: 643, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !163, file: !164, line: 632, size: 128, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !173, file: !164, line: 632, baseType: !98, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !173, file: !164, line: 632, baseType: !98, size: 64, offset: 64)
!177 = !DILocalVariable(name: "__s1_len", scope: !178, file: !164, line: 645, type: !90)
!178 = distinct !DILexicalBlock(scope: !163, file: !164, line: 645, column: 33)
!179 = !DILocalVariable(name: "__s2_len", scope: !178, file: !164, line: 645, type: !90)
!180 = !DILocalVariable(name: "lc_messages", scope: !163, file: !164, line: 655, type: !98)
!181 = !DILocalVariable(name: "__s1_len", scope: !182, file: !164, line: 656, type: !90)
!182 = distinct !DILexicalBlock(scope: !183, file: !164, line: 656, column: 22)
!183 = distinct !DILexicalBlock(scope: !163, file: !164, line: 656, column: 7)
!184 = !DILocalVariable(name: "__s2_len", scope: !182, file: !164, line: 656, type: !90)
!185 = !DILocalVariable(name: "__s2", scope: !186, file: !164, line: 656, type: !95)
!186 = distinct !DILexicalBlock(scope: !182, file: !164, line: 656, column: 22)
!187 = !DILocalVariable(name: "__result", scope: !186, file: !164, line: 656, type: !67)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 896, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 7)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 53, type: !67, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194)
!194 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 121, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 4608, elements: !205)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !198, line: 104, size: 256, elements: !199)
!198 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!199 = !{!200, !201, !202, !204}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !198, line: 106, baseType: !98, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !197, file: !198, line: 109, baseType: !67, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !198, line: 110, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !197, file: !198, line: 111, baseType: !67, size: 32, offset: 192)
!205 = !{!206}
!206 = !DISubrange(count: 18)
!207 = !DIGlobalVariableExpression(var: !208)
!208 = distinct !DIGlobalVariable(name: "strip_program", scope: !2, file: !3, line: 111, type: !98, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !2, file: !3, line: 54, type: !116, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212)
!212 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !3, line: 90, type: !113, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !2, file: !3, line: 99, type: !113, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "dir_mode", scope: !2, file: !3, line: 93, type: !113, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "owner_id", scope: !2, file: !3, line: 77, type: !100, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220)
!220 = distinct !DIGlobalVariable(name: "group_id", scope: !2, file: !3, line: 84, type: !103, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "a_buff", scope: !223, file: !3, line: 149, type: !230, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "have_same_content", scope: !3, file: !3, line: 146, type: !224, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!116, !67, !67}
!226 = !{!227, !228, !229}
!227 = !DILocalVariable(name: "a_fd", arg: 1, scope: !223, file: !3, line: 146, type: !67)
!228 = !DILocalVariable(name: "b_fd", arg: 2, scope: !223, file: !3, line: 146, type: !67)
!229 = !DILocalVariable(name: "size", scope: !223, file: !3, line: 152, type: !90)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32768, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 4096)
!233 = !DIGlobalVariableExpression(var: !234)
!234 = distinct !DIGlobalVariable(name: "b_buff", scope: !223, file: !3, line: 150, type: !230, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "first_call", scope: !237, file: !3, line: 318, type: !116, isLocal: true, isDefinition: true)
!237 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !3, file: !3, line: 314, type: !165, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !238)
!238 = !{!239, !240, !276, !277, !280, !281, !284, !287, !288, !290}
!239 = !DILocalVariable(name: "file", arg: 1, scope: !237, file: !3, line: 314, type: !98)
!240 = !DILocalVariable(name: "st", scope: !237, file: !3, line: 316, type: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !242, line: 46, size: 1152, elements: !243)
!242 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = !{!244, !246, !248, !250, !251, !252, !253, !254, !255, !258, !260, !262, !270, !271, !272}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !241, file: !242, line: 48, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !73, line: 133, baseType: !92)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !241, file: !242, line: 53, baseType: !247, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !73, line: 136, baseType: !92)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !241, file: !242, line: 61, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !73, line: 139, baseType: !92)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !241, file: !242, line: 62, baseType: !114, size: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !241, file: !242, line: 64, baseType: !101, size: 32, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !241, file: !242, line: 65, baseType: !104, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !241, file: !242, line: 67, baseType: !67, size: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !241, file: !242, line: 69, baseType: !245, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !241, file: !242, line: 74, baseType: !256, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 140, baseType: !257)
!257 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !241, file: !242, line: 78, baseType: !259, size: 64, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !73, line: 162, baseType: !257)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !241, file: !242, line: 80, baseType: !261, size: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !73, line: 167, baseType: !257)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !241, file: !242, line: 91, baseType: !263, size: 128, offset: 576)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !264, line: 8, size: 128, elements: !265)
!264 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!265 = !{!266, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !263, file: !264, line: 10, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !73, line: 148, baseType: !257)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !263, file: !264, line: 11, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !73, line: 184, baseType: !257)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !241, file: !242, line: 92, baseType: !263, size: 128, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !241, file: !242, line: 93, baseType: !263, size: 128, offset: 832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !241, file: !242, line: 106, baseType: !273, size: 192, offset: 960)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 192, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 3)
!276 = !DILocalVariable(name: "scontext", scope: !237, file: !3, line: 317, type: !87)
!277 = !DILocalVariable(name: "p0", scope: !278, file: !3, line: 337, type: !98)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 329, column: 5)
!279 = distinct !DILexicalBlock(scope: !237, file: !3, line: 328, column: 7)
!280 = !DILocalVariable(name: "p", scope: !278, file: !3, line: 338, type: !98)
!281 = !DILocalVariable(name: "prefix", scope: !282, file: !3, line: 347, type: !87)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 346, column: 9)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 345, column: 11)
!284 = !DILocalVariable(name: "__s1_len", scope: !285, file: !3, line: 369, type: !90)
!285 = distinct !DILexicalBlock(scope: !286, file: !3, line: 369, column: 10)
!286 = distinct !DILexicalBlock(scope: !237, file: !3, line: 368, column: 7)
!287 = !DILocalVariable(name: "__s2_len", scope: !285, file: !3, line: 369, type: !90)
!288 = !DILocalVariable(name: "__s2", scope: !289, file: !3, line: 369, type: !95)
!289 = distinct !DILexicalBlock(scope: !285, file: !3, line: 369, column: 10)
!290 = !DILocalVariable(name: "__result", scope: !289, file: !3, line: 369, type: !67)
!291 = !DIGlobalVariableExpression(var: !292)
!292 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !293, file: !294, line: 146, type: !98, isLocal: true, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !320, globals: !323)
!294 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!295 = !{!5, !12, !19, !25, !31, !36, !296, !300, !307, !316}
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 27, size: 32, elements: !298)
!297 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!298 = !{!299}
!299 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !301, line: 26, size: 32, elements: !302)
!301 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!304 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!305 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!306 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !308, line: 45, size: 32, elements: !309)
!308 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!311 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!312 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!313 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!314 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!315 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 73, size: 32, elements: !318)
!317 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!318 = !{!319}
!319 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072)
!320 = !{!113, !89, !102, !87, !90, !93, !95, !98, !92, !97, !321}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !322, line: 91, baseType: !256)
!322 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!323 = !{!324, !291, !330, !332, !342, !344}
!324 = !DIGlobalVariableExpression(var: !325)
!325 = distinct !DIGlobalVariable(name: "mask", scope: !326, file: !294, line: 2992, type: !113, isLocal: true, isDefinition: true)
!326 = distinct !DISubprogram(name: "cached_umask", scope: !294, file: !294, line: 2990, type: !327, isLocal: false, isDefinition: true, scopeLine: 2991, flags: DIFlagPrototyped, isOptimized: true, unit: !293, variables: !329)
!327 = !DISubroutineType(types: !328)
!328 = !{!113}
!329 = !{}
!330 = !DIGlobalVariableExpression(var: !331)
!331 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !293, file: !294, line: 147, type: !98, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333)
!333 = distinct !DIGlobalVariable(name: "zeros", scope: !334, file: !294, line: 350, type: !87, isLocal: true, isDefinition: true)
!334 = distinct !DISubprogram(name: "write_zeros", scope: !294, file: !294, line: 348, type: !335, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !293, variables: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!116, !67, !321}
!337 = !{!338, !339, !340}
!338 = !DILocalVariable(name: "fd", arg: 1, scope: !334, file: !294, line: 348, type: !67)
!339 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !334, file: !294, line: 348, type: !321)
!340 = !DILocalVariable(name: "n", scope: !341, file: !294, line: 369, type: !90)
!341 = distinct !DILexicalBlock(scope: !334, file: !294, line: 368, column: 5)
!342 = !DIGlobalVariableExpression(var: !343)
!343 = distinct !DIGlobalVariable(name: "nz", scope: !334, file: !294, line: 351, type: !90, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345)
!345 = distinct !DIGlobalVariable(name: "fallback", scope: !334, file: !294, line: 358, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 1024)
!349 = !DIGlobalVariableExpression(var: !350)
!350 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !351, file: !352, line: 45, type: !147, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !353, globals: !357)
!352 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!353 = !{!89, !87, !354}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !355, line: 136, baseType: !356)
!355 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 62, baseType: !92)
!357 = !{!349}
!358 = !DIGlobalVariableExpression(var: !359)
!359 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !360, file: !361, line: 38, type: !370, isLocal: true, isDefinition: true)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !362, globals: !369)
!361 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!362 = !{!363, !366}
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !361, line: 39, size: 32, elements: !364)
!364 = !{!365}
!365 = !DIEnumerator(name: "x_suffix_len", value: 6)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !361, line: 44, size: 32, elements: !367)
!367 = !{!368}
!368 = !DIEnumerator(name: "smallsize", value: 256)
!369 = !{!358}
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 72, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 9)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "Version", scope: !375, file: !376, line: 2, type: !98, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !377)
!376 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !{!373}
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !380, file: !384, line: 83, type: !98, isLocal: false, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !431, globals: !432)
!381 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !{!5, !383, !402, !407}
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !385, file: !384, line: 285, size: 32, elements: !400)
!384 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!385 = distinct !DISubprogram(name: "find_backup_file_name", scope: !384, file: !384, line: 264, type: !386, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !380, variables: !388)
!386 = !DISubroutineType(types: !387)
!387 = !{!87, !98, !5}
!388 = !{!389, !390, !391, !392, !393, !394, !395, !398, !399}
!389 = !DILocalVariable(name: "file", arg: 1, scope: !385, file: !384, line: 264, type: !98)
!390 = !DILocalVariable(name: "backup_type", arg: 2, scope: !385, file: !384, line: 264, type: !5)
!391 = !DILocalVariable(name: "filelen", scope: !385, file: !384, line: 266, type: !90)
!392 = !DILocalVariable(name: "s", scope: !385, file: !384, line: 267, type: !87)
!393 = !DILocalVariable(name: "ssize", scope: !385, file: !384, line: 268, type: !90)
!394 = !DILocalVariable(name: "simple", scope: !385, file: !384, line: 269, type: !116)
!395 = !DILocalVariable(name: "env_suffix", scope: !396, file: !384, line: 274, type: !98)
!396 = distinct !DILexicalBlock(scope: !397, file: !384, line: 273, column: 5)
!397 = distinct !DILexicalBlock(scope: !385, file: !384, line: 272, column: 7)
!398 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !385, file: !384, line: 283, type: !90)
!399 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !385, file: !384, line: 284, type: !90)
!400 = !{!401}
!401 = !DIEnumerator(name: "GUESS", value: 9)
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !384, line: 146, size: 32, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!405 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!406 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !408, line: 24, size: 32, elements: !409)
!408 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!410 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!411 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!412 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!413 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!414 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!415 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!416 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!417 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!418 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!419 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!420 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!421 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!422 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!423 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!424 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!425 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!426 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!427 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!428 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!429 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!430 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!431 = !{!98, !89, !102, !90}
!432 = !{!378, !433, !439}
!433 = !DIGlobalVariableExpression(var: !434)
!434 = distinct !DIGlobalVariable(name: "backup_types", scope: !380, file: !384, line: 325, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 256, elements: !437)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!437 = !{!438}
!438 = !DISubrange(count: 8)
!439 = !DIGlobalVariableExpression(var: !440)
!440 = distinct !DIGlobalVariable(name: "backup_args", scope: !380, file: !384, line: 314, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 576, elements: !371)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "file_name", scope: !445, file: !448, line: 37, type: !98, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !447)
!446 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !{!443}
!448 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!449 = !DIGlobalVariableExpression(var: !450)
!450 = distinct !DIGlobalVariable(name: "file_name", scope: !451, file: !456, line: 36, type: !98, isLocal: true, isDefinition: true)
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !453)
!452 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!453 = !{!449, !454}
!454 = !DIGlobalVariableExpression(var: !455)
!455 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !451, file: !456, line: 46, type: !116, isLocal: true, isDefinition: true)
!456 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "exit_failure", scope: !459, file: !462, line: 24, type: !463, isLocal: false, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !461)
!460 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !{!457}
!462 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!464 = !DIGlobalVariableExpression(var: !465)
!465 = distinct !DIGlobalVariable(name: "default_tuning", scope: !466, file: !470, line: 130, type: !471, isLocal: true, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !468, globals: !469)
!467 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!468 = !{!92, !89, !90}
!469 = !{!464}
!470 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !149, line: 65, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !149, line: 53, size: 160, elements: !474)
!474 = !{!475, !477, !478, !479, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !473, file: !149, line: 58, baseType: !476, size: 32)
!476 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !473, file: !149, line: 59, baseType: !476, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !473, file: !149, line: 60, baseType: !476, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !473, file: !149, line: 61, baseType: !476, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !473, file: !149, line: 62, baseType: !116, size: 8, offset: 128)
!481 = !DIGlobalVariableExpression(var: !482)
!482 = distinct !DIGlobalVariable(name: "program_name", scope: !483, file: !487, line: 33, type: !98, isLocal: false, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !485, globals: !486)
!484 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!485 = !{!89, !87}
!486 = !{!481}
!487 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!488 = !DIGlobalVariableExpression(var: !489)
!489 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !490, file: !518, line: 77, type: !551, isLocal: false, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, retainedTypes: !513, globals: !515)
!491 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!492 = !{!36, !493, !498}
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !37, line: 242, size: 32, elements: !494)
!494 = !{!495, !496, !497}
!495 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!496 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!497 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 46, size: 32, elements: !500)
!499 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!501 = !DIEnumerator(name: "_ISupper", value: 256)
!502 = !DIEnumerator(name: "_ISlower", value: 512)
!503 = !DIEnumerator(name: "_ISalpha", value: 1024)
!504 = !DIEnumerator(name: "_ISdigit", value: 2048)
!505 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!506 = !DIEnumerator(name: "_ISspace", value: 8192)
!507 = !DIEnumerator(name: "_ISprint", value: 16384)
!508 = !DIEnumerator(name: "_ISgraph", value: 32768)
!509 = !DIEnumerator(name: "_ISblank", value: 1)
!510 = !DIEnumerator(name: "_IScntrl", value: 2)
!511 = !DIEnumerator(name: "_ISpunct", value: 4)
!512 = !DIEnumerator(name: "_ISalnum", value: 8)
!513 = !{!67, !514, !90, !87}
!514 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!515 = !{!488, !516, !523, !533, !535, !540, !547, !549}
!516 = !DIGlobalVariableExpression(var: !517)
!517 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !490, file: !518, line: 93, type: !519, isLocal: false, isDefinition: true)
!518 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !521)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!521 = !{!522}
!522 = !DISubrange(count: 10)
!523 = !DIGlobalVariableExpression(var: !524)
!524 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !490, file: !518, line: 1043, type: !525, isLocal: false, isDefinition: true)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !518, line: 57, size: 448, elements: !526)
!526 = !{!527, !528, !529, !531, !532}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !525, file: !518, line: 60, baseType: !36, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !525, file: !518, line: 63, baseType: !67, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !525, file: !518, line: 67, baseType: !530, size: 256, offset: 64)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 256, elements: !437)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !525, file: !518, line: 70, baseType: !98, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !525, file: !518, line: 73, baseType: !98, size: 64, offset: 384)
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !490, file: !518, line: 108, type: !525, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536)
!536 = distinct !DIGlobalVariable(name: "slot0", scope: !490, file: !518, line: 834, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 256)
!540 = !DIGlobalVariableExpression(var: !541)
!541 = distinct !DIGlobalVariable(name: "slotvec", scope: !490, file: !518, line: 837, type: !542, isLocal: true, isDefinition: true)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !518, line: 826, size: 128, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !543, file: !518, line: 828, baseType: !90, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !543, file: !518, line: 829, baseType: !87, size: 64, offset: 64)
!547 = !DIGlobalVariableExpression(var: !548)
!548 = distinct !DIGlobalVariable(name: "nslots", scope: !490, file: !518, line: 835, type: !67, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550)
!550 = distinct !DIGlobalVariable(name: "slotvec0", scope: !490, file: !518, line: 836, type: !543, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 704, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 11)
!554 = !DIGlobalVariableExpression(var: !555)
!555 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !556, file: !574, line: 74, type: !575, isLocal: true, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !558, retainedTypes: !572, globals: !573)
!557 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!558 = !{!300, !559}
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !561, file: !560, line: 192, size: 32, elements: !570)
!560 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!561 = distinct !DISubprogram(name: "x2nrealloc", scope: !560, file: !560, line: 180, type: !562, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !556, variables: !565)
!562 = !DISubroutineType(types: !563)
!563 = !{!89, !89, !564, !90}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!565 = !{!566, !567, !568, !569}
!566 = !DILocalVariable(name: "p", arg: 1, scope: !561, file: !560, line: 180, type: !89)
!567 = !DILocalVariable(name: "pn", arg: 2, scope: !561, file: !560, line: 180, type: !564)
!568 = !DILocalVariable(name: "s", arg: 3, scope: !561, file: !560, line: 180, type: !90)
!569 = !DILocalVariable(name: "n", scope: !561, file: !560, line: 182, type: !90)
!570 = !{!571}
!571 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!572 = !{!89}
!573 = !{!554}
!574 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 192, elements: !274)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !574, line: 72, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!67, !93, !93}
!581 = !DIGlobalVariableExpression(var: !582)
!582 = distinct !DIGlobalVariable(name: "letters", scope: !583, file: !586, line: 185, type: !587, isLocal: true, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !585)
!584 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!585 = !{!581}
!586 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 504, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 63)
!590 = !DIGlobalVariableExpression(var: !591)
!591 = distinct !DIGlobalVariable(name: "ht", scope: !592, file: !593, line: 147, type: !147, isLocal: true, isDefinition: true)
!592 = distinct !DISubprogram(name: "utimecmp", scope: !593, file: !593, line: 116, type: !594, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !619, variables: !635)
!593 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!594 = !DISubroutineType(types: !595)
!595 = !{!67, !98, !596, !596, !67}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !242, line: 46, size: 1152, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !616, !617, !618}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !598, file: !242, line: 48, baseType: !245, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !598, file: !242, line: 53, baseType: !247, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !598, file: !242, line: 61, baseType: !249, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !598, file: !242, line: 62, baseType: !114, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !598, file: !242, line: 64, baseType: !101, size: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !598, file: !242, line: 65, baseType: !104, size: 32, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !598, file: !242, line: 67, baseType: !67, size: 32, offset: 288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !598, file: !242, line: 69, baseType: !245, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !598, file: !242, line: 74, baseType: !256, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !598, file: !242, line: 78, baseType: !259, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !598, file: !242, line: 80, baseType: !261, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !598, file: !242, line: 91, baseType: !612, size: 128, offset: 576)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !264, line: 8, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !612, file: !264, line: 10, baseType: !267, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !612, file: !264, line: 11, baseType: !269, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !598, file: !242, line: 92, baseType: !612, size: 128, offset: 704)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !598, file: !242, line: 93, baseType: !612, size: 128, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !598, file: !242, line: 106, baseType: !273, size: 192, offset: 960)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !621, globals: !625)
!620 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = !{!296, !622}
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !593, line: 47, size: 32, elements: !623)
!623 = !{!624}
!624 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!625 = !{!590, !626}
!626 = !DIGlobalVariableExpression(var: !627)
!627 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !592, file: !593, line: 150, type: !628, isLocal: true, isDefinition: true)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !593, line: 60, size: 128, elements: !630)
!630 = !{!631, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !629, file: !593, line: 63, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !71, line: 60, baseType: !245)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !629, file: !593, line: 70, baseType: !67, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !629, file: !593, line: 74, baseType: !116, size: 8, offset: 96)
!635 = !{!636, !637, !638, !639, !640, !643, !644, !645, !646, !649, !650, !651, !654, !655, !656, !657, !658, !659, !661, !664, !665, !666, !667, !673, !674, !676, !678, !680}
!636 = !DILocalVariable(name: "dst_name", arg: 1, scope: !592, file: !593, line: 116, type: !98)
!637 = !DILocalVariable(name: "dst_stat", arg: 2, scope: !592, file: !593, line: 117, type: !596)
!638 = !DILocalVariable(name: "src_stat", arg: 3, scope: !592, file: !593, line: 118, type: !596)
!639 = !DILocalVariable(name: "options", arg: 4, scope: !592, file: !593, line: 119, type: !67)
!640 = !DILocalVariable(name: "dst_s", scope: !592, file: !593, line: 137, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !642, line: 8, baseType: !267)
!642 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = !DILocalVariable(name: "src_s", scope: !592, file: !593, line: 138, type: !641)
!644 = !DILocalVariable(name: "dst_ns", scope: !592, file: !593, line: 139, type: !67)
!645 = !DILocalVariable(name: "src_ns", scope: !592, file: !593, line: 140, type: !67)
!646 = !DILocalVariable(name: "dst_res", scope: !647, file: !593, line: 151, type: !628)
!647 = distinct !DILexicalBlock(scope: !648, file: !593, line: 143, column: 5)
!648 = distinct !DILexicalBlock(scope: !592, file: !593, line: 142, column: 7)
!649 = !DILocalVariable(name: "tmp_dst_res", scope: !647, file: !593, line: 152, type: !629)
!650 = !DILocalVariable(name: "res", scope: !647, file: !593, line: 155, type: !67)
!651 = !DILocalVariable(name: "dst_a_s", scope: !652, file: !593, line: 229, type: !641)
!652 = distinct !DILexicalBlock(scope: !653, file: !593, line: 225, column: 9)
!653 = distinct !DILexicalBlock(scope: !647, file: !593, line: 224, column: 11)
!654 = !DILocalVariable(name: "dst_c_s", scope: !652, file: !593, line: 230, type: !641)
!655 = !DILocalVariable(name: "dst_m_s", scope: !652, file: !593, line: 231, type: !641)
!656 = !DILocalVariable(name: "dst_a_ns", scope: !652, file: !593, line: 232, type: !67)
!657 = !DILocalVariable(name: "dst_c_ns", scope: !652, file: !593, line: 233, type: !67)
!658 = !DILocalVariable(name: "dst_m_ns", scope: !652, file: !593, line: 234, type: !67)
!659 = !DILocalVariable(name: "odd_second", scope: !660, file: !593, line: 243, type: !116)
!660 = distinct !DILexicalBlock(scope: !652, file: !593, line: 242, column: 11)
!661 = !DILocalVariable(name: "a", scope: !662, file: !593, line: 252, type: !67)
!662 = distinct !DILexicalBlock(scope: !663, file: !593, line: 251, column: 15)
!663 = distinct !DILexicalBlock(scope: !660, file: !593, line: 245, column: 17)
!664 = !DILocalVariable(name: "c", scope: !662, file: !593, line: 253, type: !67)
!665 = !DILocalVariable(name: "m", scope: !662, file: !593, line: 254, type: !67)
!666 = !DILocalVariable(name: "SR10", scope: !662, file: !593, line: 258, type: !67)
!667 = !DILocalVariable(name: "timespec", scope: !668, file: !593, line: 280, type: !670)
!668 = distinct !DILexicalBlock(scope: !669, file: !593, line: 279, column: 13)
!669 = distinct !DILexicalBlock(scope: !652, file: !593, line: 278, column: 15)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 256, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 2)
!673 = !DILocalVariable(name: "dst_status", scope: !668, file: !593, line: 281, type: !598)
!674 = !DILocalVariable(name: "s", scope: !675, file: !593, line: 291, type: !641)
!675 = distinct !DILexicalBlock(scope: !668, file: !593, line: 290, column: 15)
!676 = !DILocalVariable(name: "stat_result", scope: !677, file: !593, line: 320, type: !67)
!677 = distinct !DILexicalBlock(scope: !668, file: !593, line: 319, column: 15)
!678 = !DILocalVariable(name: "old_res", scope: !679, file: !593, line: 345, type: !67)
!679 = distinct !DILexicalBlock(scope: !668, file: !593, line: 344, column: 15)
!680 = !DILocalVariable(name: "a", scope: !679, file: !593, line: 346, type: !67)
!681 = !DIGlobalVariableExpression(var: !682)
!682 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !683, file: !693, line: 73, type: !67, isLocal: true, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !685, globals: !690)
!684 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!685 = !{!686}
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !687, line: 35, size: 32, elements: !688)
!687 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !{!689}
!689 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!690 = !{!681, !691}
!691 = !DIGlobalVariableExpression(var: !692)
!692 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !683, file: !693, line: 74, type: !67, isLocal: true, isDefinition: true)
!693 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!694 = !DIGlobalVariableExpression(var: !695)
!695 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !696, file: !699, line: 26, type: !700, isLocal: false, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !698)
!697 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!698 = !{!694}
!699 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 376, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 47)
!703 = !DIGlobalVariableExpression(var: !704)
!704 = distinct !DIGlobalVariable(name: "can_write", scope: !705, file: !706, line: 35, type: !116, isLocal: true, isDefinition: true)
!705 = distinct !DISubprogram(name: "can_write_any_file", scope: !706, file: !706, line: 32, type: !707, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !709, variables: !714)
!706 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = !DISubroutineType(types: !708)
!708 = !{!116}
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !711)
!710 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !{!712, !703}
!712 = !DIGlobalVariableExpression(var: !713)
!713 = distinct !DIGlobalVariable(name: "initialized", scope: !705, file: !706, line: 34, type: !116, isLocal: true, isDefinition: true)
!714 = !{!715}
!715 = !DILocalVariable(name: "can", scope: !716, file: !706, line: 39, type: !116)
!716 = distinct !DILexicalBlock(scope: !717, file: !706, line: 38, column: 5)
!717 = distinct !DILexicalBlock(scope: !705, file: !706, line: 37, column: 7)
!718 = !DIGlobalVariableExpression(var: !719)
!719 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !720, file: !721, line: 335, type: !67, isLocal: true, isDefinition: true)
!720 = distinct !DISubprogram(name: "rpl_fcntl", scope: !721, file: !721, line: 272, type: !722, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !724, variables: !727)
!721 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!722 = !DISubroutineType(types: !723)
!723 = !{!67, !67, !67, null}
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, globals: !726)
!725 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!726 = !{!718}
!727 = !{!728, !729, !730, !743, !744, !747, !750, !753}
!728 = !DILocalVariable(name: "fd", arg: 1, scope: !720, file: !721, line: 272, type: !67)
!729 = !DILocalVariable(name: "action", arg: 2, scope: !720, file: !721, line: 272, type: !67)
!730 = !DILocalVariable(name: "arg", scope: !720, file: !721, line: 274, type: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !732, line: 30, baseType: !733)
!732 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !725, line: 274, baseType: !734)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 192, elements: !741)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !725, line: 274, size: 192, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !735, file: !725, line: 274, baseType: !102, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !735, file: !725, line: 274, baseType: !102, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !735, file: !725, line: 274, baseType: !89, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !735, file: !725, line: 274, baseType: !89, size: 64, offset: 128)
!741 = !{!742}
!742 = !DISubrange(count: 1)
!743 = !DILocalVariable(name: "result", scope: !720, file: !721, line: 275, type: !67)
!744 = !DILocalVariable(name: "target", scope: !745, file: !721, line: 322, type: !67)
!745 = distinct !DILexicalBlock(scope: !746, file: !721, line: 321, column: 7)
!746 = distinct !DILexicalBlock(scope: !720, file: !721, line: 278, column: 5)
!747 = !DILocalVariable(name: "flags", scope: !748, file: !721, line: 359, type: !67)
!748 = distinct !DILexicalBlock(scope: !749, file: !721, line: 358, column: 11)
!749 = distinct !DILexicalBlock(scope: !745, file: !721, line: 357, column: 13)
!750 = !DILocalVariable(name: "saved_errno", scope: !751, file: !721, line: 362, type: !67)
!751 = distinct !DILexicalBlock(scope: !752, file: !721, line: 361, column: 15)
!752 = distinct !DILexicalBlock(scope: !748, file: !721, line: 360, column: 17)
!753 = !DILocalVariable(name: "p", scope: !754, file: !721, line: 404, type: !89)
!754 = distinct !DILexicalBlock(scope: !746, file: !721, line: 402, column: 7)
!755 = !DIGlobalVariableExpression(var: !756)
!756 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !757, file: !762, line: 69, type: !763, isLocal: false, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !759, retainedTypes: !760, globals: !761)
!758 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!759 = !{!36}
!760 = !{!90, !89, !97}
!761 = !{!755}
!762 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !764, line: 55, baseType: !765)
!764 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null}
!768 = !DIGlobalVariableExpression(var: !769)
!769 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !770, file: !1114, line: 120, type: !1115, isLocal: true, isDefinition: true)
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !772, retainedTypes: !1111, globals: !1113)
!771 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!772 = !{!773}
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !774, line: 41, size: 32, elements: !775)
!774 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110}
!776 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!777 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!778 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!779 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!780 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!781 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!782 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!783 = !DIEnumerator(name: "DAY_1", value: 131079)
!784 = !DIEnumerator(name: "DAY_2", value: 131080)
!785 = !DIEnumerator(name: "DAY_3", value: 131081)
!786 = !DIEnumerator(name: "DAY_4", value: 131082)
!787 = !DIEnumerator(name: "DAY_5", value: 131083)
!788 = !DIEnumerator(name: "DAY_6", value: 131084)
!789 = !DIEnumerator(name: "DAY_7", value: 131085)
!790 = !DIEnumerator(name: "ABMON_1", value: 131086)
!791 = !DIEnumerator(name: "ABMON_2", value: 131087)
!792 = !DIEnumerator(name: "ABMON_3", value: 131088)
!793 = !DIEnumerator(name: "ABMON_4", value: 131089)
!794 = !DIEnumerator(name: "ABMON_5", value: 131090)
!795 = !DIEnumerator(name: "ABMON_6", value: 131091)
!796 = !DIEnumerator(name: "ABMON_7", value: 131092)
!797 = !DIEnumerator(name: "ABMON_8", value: 131093)
!798 = !DIEnumerator(name: "ABMON_9", value: 131094)
!799 = !DIEnumerator(name: "ABMON_10", value: 131095)
!800 = !DIEnumerator(name: "ABMON_11", value: 131096)
!801 = !DIEnumerator(name: "ABMON_12", value: 131097)
!802 = !DIEnumerator(name: "MON_1", value: 131098)
!803 = !DIEnumerator(name: "MON_2", value: 131099)
!804 = !DIEnumerator(name: "MON_3", value: 131100)
!805 = !DIEnumerator(name: "MON_4", value: 131101)
!806 = !DIEnumerator(name: "MON_5", value: 131102)
!807 = !DIEnumerator(name: "MON_6", value: 131103)
!808 = !DIEnumerator(name: "MON_7", value: 131104)
!809 = !DIEnumerator(name: "MON_8", value: 131105)
!810 = !DIEnumerator(name: "MON_9", value: 131106)
!811 = !DIEnumerator(name: "MON_10", value: 131107)
!812 = !DIEnumerator(name: "MON_11", value: 131108)
!813 = !DIEnumerator(name: "MON_12", value: 131109)
!814 = !DIEnumerator(name: "AM_STR", value: 131110)
!815 = !DIEnumerator(name: "PM_STR", value: 131111)
!816 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!817 = !DIEnumerator(name: "D_FMT", value: 131113)
!818 = !DIEnumerator(name: "T_FMT", value: 131114)
!819 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!820 = !DIEnumerator(name: "ERA", value: 131116)
!821 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!822 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!823 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!824 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!825 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!826 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!827 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!828 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!829 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!830 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!831 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!832 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!833 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!834 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!835 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!836 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!837 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!838 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!839 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!840 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!841 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!842 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!843 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!844 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!845 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!846 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!847 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!848 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!849 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!850 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!851 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!852 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!853 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!854 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!855 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!856 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!857 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!858 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!859 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!860 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!861 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!862 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!863 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!864 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!865 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!866 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!867 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!868 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!869 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!870 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!871 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!872 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!873 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!874 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!875 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!876 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!877 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!878 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!879 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!880 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!881 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!882 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!883 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!884 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!885 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!886 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!887 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!888 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!889 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!890 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!891 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!892 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!893 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!894 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!895 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!896 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!897 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!898 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!899 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!900 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!901 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!902 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!903 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!904 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!905 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!906 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!907 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!908 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!909 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!910 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!911 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!912 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!913 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!914 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!915 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!916 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!917 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!918 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!919 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!920 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!921 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!922 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!923 = !DIEnumerator(name: "CODESET", value: 14)
!924 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!925 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!926 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!927 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!945 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!946 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!947 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!948 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!949 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!955 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!965 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!966 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!967 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!968 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!969 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!970 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!971 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!972 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!973 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!974 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!975 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!976 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!977 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!978 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!979 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!980 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!981 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!982 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!983 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!984 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!985 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!986 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!987 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!988 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!989 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!990 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!991 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!992 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!993 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!994 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!995 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!996 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!997 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!998 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!999 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!1000 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!1001 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!1002 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!1003 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!1004 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!1005 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!1006 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!1007 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!1008 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!1009 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!1010 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!1011 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!1012 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!1013 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!1014 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!1015 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!1016 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!1017 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1019 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1020 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1021 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1022 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1023 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1024 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1025 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1026 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1027 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1028 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1029 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1030 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1031 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1032 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1033 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1034 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1035 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1036 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1037 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1038 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1039 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1040 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1041 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1042 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1043 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1044 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1045 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1046 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1047 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1048 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1049 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1050 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1051 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1052 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1053 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1054 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1055 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1056 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1057 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1058 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1059 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1060 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1061 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1062 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1063 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1064 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1065 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1066 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1067 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!1068 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!1069 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!1070 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!1071 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!1072 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!1073 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!1074 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!1075 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!1076 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1077 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1078 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1079 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1080 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1081 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1082 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1083 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1084 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1085 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1086 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1087 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1088 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1089 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1090 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1091 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1092 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1093 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1094 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1095 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1096 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1097 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1098 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1099 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1100 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1101 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1102 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1103 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1104 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1105 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1106 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1107 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1108 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1109 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1110 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1111 = !{!89, !87, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!1113 = !{!768}
!1114 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1115 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !98)
!1116 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1117, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !1118)
!1117 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1118 = !{!97}
!1119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1120, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1121, retainedTypes: !1196)
!1120 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1121 = !{!1122}
!1122 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1123, file: !1120, line: 97, size: 32, elements: !1194)
!1123 = distinct !DISubprogram(name: "extent_scan_read", scope: !1120, file: !1120, line: 87, type: !1124, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !1119, variables: !1144)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!116, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !1128, line: 36, size: 384, elements: !1129)
!1128 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1129 = !{!1130, !1131, !1133, !1134, !1135, !1136, !1137}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1127, file: !1128, line: 39, baseType: !67, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !1127, file: !1128, line: 42, baseType: !1132, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !71, line: 86, baseType: !256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1127, file: !1128, line: 45, baseType: !102, size: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !1127, file: !1128, line: 48, baseType: !90, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !1127, file: !1128, line: 52, baseType: !116, size: 8, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !1127, file: !1128, line: 55, baseType: !116, size: 8, offset: 264)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !1127, file: !1128, line: 58, baseType: !1138, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !1128, line: 23, size: 192, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !1139, file: !1128, line: 26, baseType: !1132, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !1139, file: !1128, line: 29, baseType: !1132, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !1139, file: !1128, line: 32, baseType: !102, size: 32, offset: 128)
!1144 = !{!1145, !1146, !1147, !1148, !1179, !1181, !1183, !1185, !1186, !1193}
!1145 = !DILocalVariable(name: "scan", arg: 1, scope: !1123, file: !1120, line: 87, type: !1126)
!1146 = !DILocalVariable(name: "si", scope: !1123, file: !1120, line: 89, type: !102)
!1147 = !DILocalVariable(name: "last_ei", scope: !1123, file: !1120, line: 90, type: !1138)
!1148 = !DILocalVariable(name: "fiemap_buf", scope: !1149, file: !1120, line: 94, type: !1150)
!1149 = distinct !DILexicalBlock(scope: !1123, file: !1120, line: 93, column: 5)
!1150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1123, file: !1120, line: 94, size: 32768, elements: !1151)
!1151 = !{!1152, !1178}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1150, file: !1120, line: 94, baseType: !1153, size: 256)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !1154, line: 35, size: 256, elements: !1155)
!1154 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1155 = !{!1156, !1158, !1159, !1161, !1162, !1163, !1164}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !1153, file: !1154, line: 38, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !355, line: 57, baseType: !92)
