; ModuleID = 'coreutils-8.27/src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.table = type { i8*, i32, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.timezone = type { i32, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i64, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!324 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!325 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!326 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!327 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!328 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!329 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!330 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!331 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!332 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!333 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!334 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!335 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!336 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!337 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!338 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!339 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!340 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!341 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!342 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!343 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!344 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!345 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!346 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!347 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!348 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!349 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !351, line: 32, size: 32, elements: !352)
!351 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!353 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!354 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!355 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!356 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!357 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!358 = !DIEnumerator(name: "c_quoting_style", value: 5)
!359 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!360 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!361 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!362 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!363 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!364 = !{!365, !368, !369, !370, !373, !375, !377}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !371, line: 62, baseType: !372)
!371 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!372 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!378 = !{!379, !460, !465, !467, !0, !497, !511, !516, !522}
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !381, file: !3, line: 387, type: !457, isLocal: true, isDefinition: true)
!381 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 347, type: !382, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !386)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !384, !385}
!384 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!386 = !{!387, !388, !389, !390, !391, !392, !402, !404, !405, !406, !407, !439, !440, !441, !443, !446, !448, !449, !454}
!387 = !DILocalVariable(name: "argc", arg: 1, scope: !381, file: !3, line: 347, type: !384)
!388 = !DILocalVariable(name: "argv", arg: 2, scope: !381, file: !3, line: 347, type: !385)
!389 = !DILocalVariable(name: "optc", scope: !381, file: !3, line: 349, type: !384)
!390 = !DILocalVariable(name: "datestr", scope: !381, file: !3, line: 350, type: !365)
!391 = !DILocalVariable(name: "set_datestr", scope: !381, file: !3, line: 351, type: !365)
!392 = !DILocalVariable(name: "when", scope: !381, file: !3, line: 352, type: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !394, line: 8, size: 128, elements: !395)
!394 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!395 = !{!396, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !393, file: !394, line: 10, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !398, line: 148, baseType: !399)
!398 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!399 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !393, file: !394, line: 11, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !398, line: 184, baseType: !399)
!402 = !DILocalVariable(name: "set_date", scope: !381, file: !3, line: 353, type: !403)
!403 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!404 = !DILocalVariable(name: "format", scope: !381, file: !3, line: 354, type: !365)
!405 = !DILocalVariable(name: "batch_file", scope: !381, file: !3, line: 355, type: !368)
!406 = !DILocalVariable(name: "reference", scope: !381, file: !3, line: 356, type: !368)
!407 = !DILocalVariable(name: "refstats", scope: !381, file: !3, line: 357, type: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !409, line: 46, size: 1152, elements: !410)
!409 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!410 = !{!411, !413, !415, !417, !420, !422, !424, !425, !426, !428, !430, !432, !433, !434, !435}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !408, file: !409, line: 48, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !398, line: 133, baseType: !372)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !408, file: !409, line: 53, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !398, line: 136, baseType: !372)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !408, file: !409, line: 61, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !398, line: 139, baseType: !372)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !408, file: !409, line: 62, baseType: !418, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !398, line: 138, baseType: !419)
!419 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !408, file: !409, line: 64, baseType: !421, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !398, line: 134, baseType: !419)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !408, file: !409, line: 65, baseType: !423, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !398, line: 135, baseType: !419)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !408, file: !409, line: 67, baseType: !384, size: 32, offset: 288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !408, file: !409, line: 69, baseType: !412, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !408, file: !409, line: 74, baseType: !427, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !398, line: 140, baseType: !399)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !408, file: !409, line: 78, baseType: !429, size: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !398, line: 162, baseType: !399)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !408, file: !409, line: 80, baseType: !431, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !398, line: 167, baseType: !399)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !408, file: !409, line: 91, baseType: !393, size: 128, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !408, file: !409, line: 92, baseType: !393, size: 128, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !408, file: !409, line: 93, baseType: !393, size: 128, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !408, file: !409, line: 106, baseType: !436, size: 192, offset: 960)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 192, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 3)
!439 = !DILocalVariable(name: "ok", scope: !381, file: !3, line: 358, type: !403)
!440 = !DILocalVariable(name: "option_specified_date", scope: !381, file: !3, line: 359, type: !384)
!441 = !DILocalVariable(name: "new_format", scope: !442, file: !3, line: 372, type: !365)
!442 = distinct !DILexicalBlock(scope: !381, file: !3, line: 371, column: 5)
!443 = !DILocalVariable(name: "i", scope: !444, file: !3, line: 393, type: !5)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 386, column: 11)
!445 = distinct !DILexicalBlock(scope: !442, file: !3, line: 375, column: 9)
!446 = !DILocalVariable(name: "i", scope: !447, file: !3, line: 409, type: !5)
!447 = distinct !DILexicalBlock(scope: !445, file: !3, line: 400, column: 11)
!448 = !DILocalVariable(name: "tzstring", scope: !381, file: !3, line: 507, type: !365)
!449 = !DILocalVariable(name: "tz", scope: !381, file: !3, line: 508, type: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !451, line: 594, baseType: !452)
!451 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !451, line: 594, flags: DIFlagFwdDecl)
!454 = !DILocalVariable(name: "valid_date", scope: !455, file: !3, line: 514, type: !403)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 513, column: 5)
!456 = distinct !DILexicalBlock(scope: !381, file: !3, line: 510, column: 7)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 768, elements: !458)
!458 = !{!438, !459}
!459 = !DISubrange(count: 32)
!460 = !DIGlobalVariableExpression(var: !461)
!461 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !381, file: !3, line: 401, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1280, elements: !463)
!463 = !{!464, !459}
!464 = !DISubrange(count: 5)
!465 = !DIGlobalVariableExpression(var: !466)
!466 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !2, file: !3, line: 109, type: !419, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468)
!468 = distinct !DIGlobalVariable(name: "infomap", scope: !469, file: !470, line: 632, type: !494, isLocal: true, isDefinition: true)
!469 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !470, file: !470, line: 630, type: !471, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !473)
!470 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!471 = !DISubroutineType(types: !472)
!472 = !{null, !365}
!473 = !{!474, !475, !476, !483, !485, !486, !487, !490, !491, !493}
!474 = !DILocalVariable(name: "program", arg: 1, scope: !469, file: !470, line: 630, type: !365)
!475 = !DILocalVariable(name: "node", scope: !469, file: !470, line: 642, type: !365)
!476 = !DILocalVariable(name: "map_prog", scope: !469, file: !470, line: 643, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !469, file: !470, line: 632, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !479, file: !470, line: 632, baseType: !365, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !479, file: !470, line: 632, baseType: !365, size: 64, offset: 64)
!483 = !DILocalVariable(name: "__s1_len", scope: !484, file: !470, line: 645, type: !370)
!484 = distinct !DILexicalBlock(scope: !469, file: !470, line: 645, column: 33)
!485 = !DILocalVariable(name: "__s2_len", scope: !484, file: !470, line: 645, type: !370)
!486 = !DILocalVariable(name: "lc_messages", scope: !469, file: !470, line: 655, type: !365)
!487 = !DILocalVariable(name: "__s1_len", scope: !488, file: !470, line: 656, type: !370)
!488 = distinct !DILexicalBlock(scope: !489, file: !470, line: 656, column: 22)
!489 = distinct !DILexicalBlock(scope: !469, file: !470, line: 656, column: 7)
!490 = !DILocalVariable(name: "__s2_len", scope: !488, file: !470, line: 656, type: !370)
!491 = !DILocalVariable(name: "__s2", scope: !492, file: !470, line: 656, type: !375)
!492 = distinct !DILexicalBlock(scope: !488, file: !470, line: 656, column: 22)
!493 = !DILocalVariable(name: "__result", scope: !492, file: !470, line: 656, type: !384)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 896, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 7)
!497 = !DIGlobalVariableExpression(var: !498)
!498 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 4096, elements: !509)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !502, line: 104, size: 256, elements: !503)
!502 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!503 = !{!504, !505, !506, !508}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !501, file: !502, line: 106, baseType: !365, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !501, file: !502, line: 109, baseType: !384, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !502, line: 110, baseType: !507, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !501, file: !502, line: 111, baseType: !384, size: 32, offset: 192)
!509 = !{!510}
!510 = !DISubrange(count: 16)
!511 = !DIGlobalVariableExpression(var: !512)
!512 = distinct !DIGlobalVariable(name: "time_spec", scope: !2, file: !3, line: 68, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 160, elements: !515)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!515 = !{!464}
!516 = !DIGlobalVariableExpression(var: !517)
!517 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !2, file: !3, line: 61, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 384, elements: !520)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!520 = !{!521}
!521 = !DISubrange(count: 6)
!522 = !DIGlobalVariableExpression(var: !523)
!523 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !2, file: !3, line: 76, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 200, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 25)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 112, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 14)
!530 = !DIGlobalVariableExpression(var: !531)
!531 = distinct !DIGlobalVariable(name: "Version", scope: !532, file: !533, line: 2, type: !365, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, globals: !535)
!533 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!534 = !{}
!535 = !{!530}
!536 = !DIGlobalVariableExpression(var: !537)
!537 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !538, file: !543, line: 69, type: !544, isLocal: false, isDefinition: true)
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !540, retainedTypes: !541, globals: !542)
!539 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!540 = !{!350}
!541 = !{!370, !369, !377}
!542 = !{!536}
!543 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !545, line: 55, baseType: !546)
!545 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null}
!549 = !DIGlobalVariableExpression(var: !550)
!550 = distinct !DIGlobalVariable(name: "file_name", scope: !551, file: !556, line: 36, type: !365, isLocal: true, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, globals: !553)
!552 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!553 = !{!549, !554}
!554 = !DIGlobalVariableExpression(var: !555)
!555 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !551, file: !556, line: 46, type: !403, isLocal: true, isDefinition: true)
!556 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!557 = !DIGlobalVariableExpression(var: !558)
!558 = distinct !DIGlobalVariable(name: "exit_failure", scope: !559, file: !562, line: 24, type: !563, isLocal: false, isDefinition: true)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, globals: !561)
!560 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!561 = !{!557}
!562 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !384)
!564 = !DIGlobalVariableExpression(var: !565)
!565 = distinct !DIGlobalVariable(name: "yypact", scope: !566, file: !585, line: 1069, type: !796, isLocal: true, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !568, retainedTypes: !582, globals: !621)
!567 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!568 = !{!569, !575, !578}
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 167, size: 32, elements: !571)
!570 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !{!572, !573, !574}
!572 = !DIEnumerator(name: "MERam", value: 0)
!573 = !DIEnumerator(name: "MERpm", value: 1)
!574 = !DIEnumerator(name: "MER24", value: 2)
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 1562, size: 32, elements: !576)
!576 = !{!577}
!577 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 169, size: 32, elements: !579)
!579 = !{!580, !581}
!580 = !DIEnumerator(name: "BILLION", value: 1000000000)
!581 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!582 = !{!583, !419, !370, !373, !375, !365, !384, !619, !369}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !585, line: 900, size: 448, elements: !586)
!585 = !DIFile(filename: "parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!586 = !{!587, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !584, file: !585, line: 902, baseType: !588, size: 16)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !585, line: 743, baseType: !589)
!589 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !584, file: !585, line: 903, baseType: !591, size: 448)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !585, line: 703, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !585, line: 691, size: 448, elements: !593)
!593 = !{!594, !595, !602, !607}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !592, file: !570, line: 559, baseType: !399, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !592, file: !570, line: 560, baseType: !596, size: 192)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !570, line: 156, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 151, size: 192, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !597, file: !570, line: 153, baseType: !403, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !597, file: !570, line: 154, baseType: !399, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !597, file: !570, line: 155, baseType: !370, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !592, file: !570, line: 561, baseType: !603, size: 128)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !394, line: 8, size: 128, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !603, file: !394, line: 10, baseType: !397, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !603, file: !394, line: 11, baseType: !401, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !592, file: !570, line: 562, baseType: !608, size: 448)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !570, line: 182, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 172, size: 448, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !618}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !609, file: !570, line: 175, baseType: !399, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !609, file: !570, line: 176, baseType: !399, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !609, file: !570, line: 177, baseType: !399, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !609, file: !570, line: 178, baseType: !399, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !609, file: !570, line: 179, baseType: !399, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !609, file: !570, line: 180, baseType: !617, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_time_t", file: !570, line: 117, baseType: !399)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !609, file: !570, line: 181, baseType: !399, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !620, line: 8, baseType: !397)
!620 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = !{!622, !564, !706, !713, !721, !724, !729, !734, !736, !741, !743, !745, !749, !752, !757, !762, !767, !772, !777, !780, !793}
!622 = !DIGlobalVariableExpression(var: !623)
!623 = distinct !DIGlobalVariable(name: "yyval_default", scope: !624, file: !585, line: 1644, type: !591, isLocal: true, isDefinition: true)
!624 = distinct !DISubprogram(name: "yyparse", scope: !585, file: !585, line: 1635, type: !625, isLocal: false, isDefinition: true, scopeLine: 1636, flags: DIFlagPrototyped, isOptimized: true, unit: !566, variables: !671)
!625 = !DISubroutineType(types: !626)
!626 = !{!384, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !570, line: 253, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 191, size: 2880, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !629, file: !570, line: 194, baseType: !365, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !629, file: !570, line: 197, baseType: !399, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !629, file: !570, line: 200, baseType: !384, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !629, file: !570, line: 203, baseType: !384, size: 32, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !629, file: !570, line: 206, baseType: !399, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !629, file: !570, line: 209, baseType: !384, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !629, file: !570, line: 212, baseType: !596, size: 192, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !629, file: !570, line: 213, baseType: !399, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !629, file: !570, line: 214, baseType: !399, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !629, file: !570, line: 215, baseType: !399, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !629, file: !570, line: 216, baseType: !399, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !629, file: !570, line: 217, baseType: !603, size: 128, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !629, file: !570, line: 220, baseType: !608, size: 448, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !629, file: !570, line: 223, baseType: !403, size: 8, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !629, file: !570, line: 224, baseType: !403, size: 8, offset: 1352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !629, file: !570, line: 225, baseType: !370, size: 64, offset: 1408)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !629, file: !570, line: 226, baseType: !370, size: 64, offset: 1472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !629, file: !570, line: 227, baseType: !370, size: 64, offset: 1536)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !629, file: !570, line: 228, baseType: !370, size: 64, offset: 1600)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !629, file: !570, line: 229, baseType: !370, size: 64, offset: 1664)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !629, file: !570, line: 230, baseType: !370, size: 64, offset: 1728)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !629, file: !570, line: 231, baseType: !370, size: 64, offset: 1792)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !629, file: !570, line: 234, baseType: !403, size: 8, offset: 1856)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !629, file: !570, line: 237, baseType: !370, size: 64, offset: 1920)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !629, file: !570, line: 238, baseType: !370, size: 64, offset: 1984)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !629, file: !570, line: 239, baseType: !370, size: 64, offset: 2048)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dsts_seen", scope: !629, file: !570, line: 240, baseType: !370, size: 64, offset: 2112)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !629, file: !570, line: 241, baseType: !370, size: 64, offset: 2176)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !629, file: !570, line: 242, baseType: !370, size: 64, offset: 2240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !629, file: !570, line: 243, baseType: !370, size: 64, offset: 2304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !629, file: !570, line: 246, baseType: !403, size: 8, offset: 2368)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "debug_default_input_timezone", scope: !629, file: !570, line: 249, baseType: !399, size: 64, offset: 2432)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !629, file: !570, line: 252, baseType: !664, size: 384, offset: 2496)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 384, elements: !437)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !570, line: 164, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 159, size: 128, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !570, line: 161, baseType: !365, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !666, file: !570, line: 162, baseType: !384, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !666, file: !570, line: 163, baseType: !384, size: 32, offset: 96)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !682, !684, !685, !687, !689, !690, !691, !692, !693, !694, !695, !696, !699, !701, !702, !704}
!672 = !DILocalVariable(name: "pc", arg: 1, scope: !624, file: !585, line: 1635, type: !627)
!673 = !DILocalVariable(name: "yychar", scope: !624, file: !585, line: 1638, type: !384)
!674 = !DILocalVariable(name: "yylval", scope: !624, file: !585, line: 1645, type: !591)
!675 = !DILocalVariable(name: "yynerrs", scope: !624, file: !585, line: 1648, type: !384)
!676 = !DILocalVariable(name: "yystate", scope: !624, file: !585, line: 1650, type: !384)
!677 = !DILocalVariable(name: "yyerrstatus", scope: !624, file: !585, line: 1652, type: !384)
!678 = !DILocalVariable(name: "yyssa", scope: !624, file: !585, line: 1662, type: !679)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 320, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 20)
!682 = !DILocalVariable(name: "yyss", scope: !624, file: !585, line: 1663, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!684 = !DILocalVariable(name: "yyssp", scope: !624, file: !585, line: 1664, type: !683)
!685 = !DILocalVariable(name: "yyvsa", scope: !624, file: !585, line: 1667, type: !686)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 8960, elements: !680)
!687 = !DILocalVariable(name: "yyvs", scope: !624, file: !585, line: 1668, type: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!689 = !DILocalVariable(name: "yyvsp", scope: !624, file: !585, line: 1669, type: !688)
!690 = !DILocalVariable(name: "yystacksize", scope: !624, file: !585, line: 1671, type: !372)
!691 = !DILocalVariable(name: "yyn", scope: !624, file: !585, line: 1673, type: !384)
!692 = !DILocalVariable(name: "yyresult", scope: !624, file: !585, line: 1674, type: !384)
!693 = !DILocalVariable(name: "yytoken", scope: !624, file: !585, line: 1676, type: !384)
!694 = !DILocalVariable(name: "yyval", scope: !624, file: !585, line: 1679, type: !591)
!695 = !DILocalVariable(name: "yylen", scope: !624, file: !585, line: 1692, type: !384)
!696 = !DILocalVariable(name: "yysize", scope: !697, file: !585, line: 1720, type: !372)
!697 = distinct !DILexicalBlock(scope: !698, file: !585, line: 1718, column: 5)
!698 = distinct !DILexicalBlock(scope: !624, file: !585, line: 1717, column: 7)
!699 = !DILocalVariable(name: "yyss1", scope: !700, file: !585, line: 1754, type: !683)
!700 = distinct !DILexicalBlock(scope: !697, file: !585, line: 1753, column: 7)
!701 = !DILocalVariable(name: "yyptr", scope: !700, file: !585, line: 1755, type: !583)
!702 = !DILocalVariable(name: "yynewbytes", scope: !703, file: !585, line: 1759, type: !372)
!703 = distinct !DILexicalBlock(scope: !700, file: !585, line: 1759, column: 9)
!704 = !DILocalVariable(name: "yynewbytes", scope: !705, file: !585, line: 1760, type: !372)
!705 = distinct !DILexicalBlock(scope: !700, file: !585, line: 1760, column: 9)
!706 = !DIGlobalVariableExpression(var: !707)
!707 = distinct !DIGlobalVariable(name: "yytranslate", scope: !566, file: !585, line: 979, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 2224, elements: !711)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !585, line: 725, baseType: !377)
!711 = !{!712}
!712 = !DISubrange(count: 278)
!713 = !DIGlobalVariableExpression(var: !714)
!714 = distinct !DIGlobalVariable(name: "yycheck", scope: !566, file: !585, line: 1139, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 904, elements: !719)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !585, line: 731, baseType: !718)
!718 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!719 = !{!720}
!720 = !DISubrange(count: 113)
!721 = !DIGlobalVariableExpression(var: !722)
!722 = distinct !DIGlobalVariable(name: "yytable", scope: !566, file: !585, line: 1123, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 904, elements: !719)
!724 = !DIGlobalVariableExpression(var: !725)
!725 = distinct !DIGlobalVariable(name: "yydefact", scope: !566, file: !585, line: 1088, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 912, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 114)
!729 = !DIGlobalVariableExpression(var: !730)
!730 = distinct !DIGlobalVariable(name: "yyr2", scope: !566, file: !585, line: 1189, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 736, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 92)
!734 = !DIGlobalVariableExpression(var: !735)
!735 = distinct !DIGlobalVariable(name: "yyr1", scope: !566, file: !585, line: 1174, type: !731, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737)
!737 = distinct !DIGlobalVariable(name: "yypgoto", scope: !566, file: !585, line: 1105, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 208, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 26)
!741 = !DIGlobalVariableExpression(var: !742)
!742 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !566, file: !585, line: 1113, type: !738, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744)
!744 = distinct !DIGlobalVariable(name: "yystos", scope: !566, file: !585, line: 1157, type: !726, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746)
!746 = distinct !DIGlobalVariable(name: "meridian_table", scope: !566, file: !570, line: 982, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 640, elements: !515)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!749 = !DIGlobalVariableExpression(var: !750)
!750 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !566, file: !570, line: 996, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 3200, elements: !525)
!752 = !DIGlobalVariableExpression(var: !753)
!753 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !566, file: !570, line: 1070, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 512, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 4)
!757 = !DIGlobalVariableExpression(var: !758)
!758 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !566, file: !570, line: 1083, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 6144, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 48)
!762 = !DIGlobalVariableExpression(var: !763)
!763 = distinct !DIGlobalVariable(name: "dst_table", scope: !566, file: !570, line: 991, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 1)
!767 = !DIGlobalVariableExpression(var: !768)
!768 = distinct !DIGlobalVariable(name: "time_units_table", scope: !566, file: !570, line: 1025, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 1408, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 11)
!772 = !DIGlobalVariableExpression(var: !773)
!773 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !566, file: !570, line: 1041, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 2688, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 21)
!777 = !DIGlobalVariableExpression(var: !778)
!778 = distinct !DIGlobalVariable(name: "military_table", scope: !566, file: !570, line: 1139, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 3328, elements: !739)
!780 = !DIGlobalVariableExpression(var: !781)
!781 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !782, file: !570, line: 333, type: !792, isLocal: true, isDefinition: true)
!782 = distinct !DISubprogram(name: "str_days", scope: !570, file: !570, line: 330, type: !783, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, unit: !566, variables: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{!365, !627, !368, !370}
!785 = !{!786, !787, !788, !789}
!786 = !DILocalVariable(name: "pc", arg: 1, scope: !782, file: !570, line: 330, type: !627)
!787 = !DILocalVariable(name: "buffer", arg: 2, scope: !782, file: !570, line: 330, type: !368)
!788 = !DILocalVariable(name: "n", arg: 3, scope: !782, file: !570, line: 330, type: !370)
!789 = !DILocalVariable(name: "l", scope: !790, file: !570, line: 382, type: !370)
!790 = distinct !DILexicalBlock(scope: !791, file: !570, line: 381, column: 5)
!791 = distinct !DILexicalBlock(scope: !782, file: !570, line: 380, column: 7)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 896, elements: !528)
!793 = !DIGlobalVariableExpression(var: !794)
!794 = distinct !DIGlobalVariable(name: "days_values", scope: !782, file: !570, line: 349, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 448, elements: !495)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 912, elements: !727)
!797 = !DIGlobalVariableExpression(var: !798)
!798 = distinct !DIGlobalVariable(name: "program_name", scope: !799, file: !803, line: 33, type: !365, isLocal: false, isDefinition: true)
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !801, globals: !802)
!800 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!801 = !{!369, !368}
!802 = !{!797}
!803 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!804 = !DIGlobalVariableExpression(var: !805)
!805 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !806, file: !834, line: 77, type: !869, isLocal: false, isDefinition: true)
!806 = distinct !DICompileUnit(language: DW_LANG_C99, file: !807, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !808, retainedTypes: !829, globals: !831)
!807 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!808 = !{!350, !809, !814}
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !351, line: 242, size: 32, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!812 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!813 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !815, line: 46, size: 32, elements: !816)
!815 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!817 = !DIEnumerator(name: "_ISupper", value: 256)
!818 = !DIEnumerator(name: "_ISlower", value: 512)
!819 = !DIEnumerator(name: "_ISalpha", value: 1024)
!820 = !DIEnumerator(name: "_ISdigit", value: 2048)
!821 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!822 = !DIEnumerator(name: "_ISspace", value: 8192)
!823 = !DIEnumerator(name: "_ISprint", value: 16384)
!824 = !DIEnumerator(name: "_ISgraph", value: 32768)
!825 = !DIEnumerator(name: "_ISblank", value: 1)
!826 = !DIEnumerator(name: "_IScntrl", value: 2)
!827 = !DIEnumerator(name: "_ISpunct", value: 4)
!828 = !DIEnumerator(name: "_ISalnum", value: 8)
!829 = !{!384, !830, !370, !368}
!830 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!831 = !{!804, !832, !839, !851, !853, !858, !865, !867}
!832 = !DIGlobalVariableExpression(var: !833)
!833 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !806, file: !834, line: 93, type: !835, isLocal: false, isDefinition: true)
!834 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 320, elements: !837)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!837 = !{!838}
!838 = !DISubrange(count: 10)
!839 = !DIGlobalVariableExpression(var: !840)
!840 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !806, file: !834, line: 1043, type: !841, isLocal: false, isDefinition: true)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !834, line: 57, size: 448, elements: !842)
!842 = !{!843, !844, !845, !849, !850}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !841, file: !834, line: 60, baseType: !350, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !834, line: 63, baseType: !384, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !841, file: !834, line: 67, baseType: !846, size: 256, offset: 64)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 256, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 8)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !841, file: !834, line: 70, baseType: !365, size: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !841, file: !834, line: 73, baseType: !365, size: 64, offset: 384)
!851 = !DIGlobalVariableExpression(var: !852)
!852 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !806, file: !834, line: 108, type: !841, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854)
!854 = distinct !DIGlobalVariable(name: "slot0", scope: !806, file: !834, line: 834, type: !855, isLocal: true, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 2048, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 256)
!858 = !DIGlobalVariableExpression(var: !859)
!859 = distinct !DIGlobalVariable(name: "slotvec", scope: !806, file: !834, line: 837, type: !860, isLocal: true, isDefinition: true)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !834, line: 826, size: 128, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !861, file: !834, line: 828, baseType: !370, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !861, file: !834, line: 829, baseType: !368, size: 64, offset: 64)
!865 = !DIGlobalVariableExpression(var: !866)
!866 = distinct !DIGlobalVariable(name: "nslots", scope: !806, file: !834, line: 835, type: !384, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868)
!868 = distinct !DIGlobalVariable(name: "slotvec0", scope: !806, file: !834, line: 836, type: !861, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 704, elements: !770)
!870 = !DIGlobalVariableExpression(var: !871)
!871 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !872, file: !875, line: 26, type: !876, isLocal: false, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, globals: !874)
!873 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = !{!870}
!875 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 376, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 47)
!879 = !DIGlobalVariableExpression(var: !880)
!880 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !881, file: !889, line: 124, type: !900, isLocal: true, isDefinition: true)
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !883, globals: !886)
!882 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = !{!419, !384, !718, !377, !589, !830, !399, !372, !884, !885}
!884 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!885 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!886 = !{!887, !893, !896, !879}
!887 = !DIGlobalVariableExpression(var: !888, expr: !892)
!888 = distinct !DIGlobalVariable(name: "mktime_min", scope: !881, file: !889, line: 95, type: !890, isLocal: true, isDefinition: true)
!889 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !889, line: 68, baseType: !399)
!892 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!893 = !DIGlobalVariableExpression(var: !894, expr: !895)
!894 = distinct !DIGlobalVariable(name: "mktime_max", scope: !881, file: !889, line: 98, type: !890, isLocal: true, isDefinition: true)
!895 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!896 = !DIGlobalVariableExpression(var: !897)
!897 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !881, file: !889, line: 462, type: !898, isLocal: true, isDefinition: true)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !899, line: 30, baseType: !619)
!899 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 416, elements: !902)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!902 = !{!903, !904}
!903 = !DISubrange(count: 2)
!904 = !DISubrange(count: 13)
!905 = !DIGlobalVariableExpression(var: !906)
!906 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !907, file: !913, line: 120, type: !914, isLocal: true, isDefinition: true)
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !909, retainedTypes: !910, globals: !912)
!908 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!909 = !{!12}
!910 = !{!369, !368, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!912 = !{!905}
!913 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !365)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !917)
!916 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!917 = !{!370, !365, !419, !384, !377}
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534)
!919 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !922)
!921 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !924, line: 135, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !398, line: 61, baseType: !399)
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !928)
!927 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!928 = !{!619, !419}
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534)
!930 = !DIFile(filename: "./lib/settime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !933)
!932 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!933 = !{!365, !419, !370, !369, !373, !384, !377}
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !936, retainedTypes: !941)
!935 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!936 = !{!937}
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 41, size: 32, elements: !939)
!938 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!939 = !{!940}
!940 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!941 = !{!369}
!942 = distinct !DICompileUnit(language: DW_LANG_C99, file: !943, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !944, retainedTypes: !958)
!943 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!944 = !{!945}
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !947, file: !946, line: 192, size: 32, elements: !956)
!946 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!947 = distinct !DISubprogram(name: "x2nrealloc", scope: !946, file: !946, line: 180, type: !948, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !942, variables: !951)
!948 = !DISubroutineType(types: !949)
!949 = !{!369, !369, !950, !370}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!951 = !{!952, !953, !954, !955}
!952 = !DILocalVariable(name: "p", arg: 1, scope: !947, file: !946, line: 180, type: !369)
!953 = !DILocalVariable(name: "pn", arg: 2, scope: !947, file: !946, line: 180, type: !950)
!954 = !DILocalVariable(name: "s", arg: 3, scope: !947, file: !946, line: 180, type: !370)
!955 = !DILocalVariable(name: "n", scope: !947, file: !946, line: 182, type: !370)
!956 = !{!957}
!957 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!958 = !{!370, !368, !369}
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534)
!960 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !941)
!962 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534)
!964 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !941)
!966 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !941)
!968 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !971)
!970 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!971 = !{!370}
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !974, retainedTypes: !979, globals: !980)
!973 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!974 = !{!975}
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !976, line: 49, size: 32, elements: !977)
!976 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!977 = !{!978}
!978 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!979 = !{!368}
!980 = !{!981}
!981 = !DIGlobalVariableExpression(var: !982)
!982 = distinct !DIGlobalVariable(name: "local_tz", scope: !972, file: !976, line: 54, type: !983, isLocal: true, isDefinition: true)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !451, line: 594, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !987, line: 21, size: 128, elements: !988)
!987 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !987, line: 25, baseType: !985, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !986, file: !987, line: 36, baseType: !367, size: 8, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !986, file: !987, line: 48, baseType: !992, offset: 72)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: -1)
!995 = distinct !DICompileUnit(language: DW_LANG_C99, file: !996, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534)
!996 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !999)
!998 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!999 = !{!370, !373, !375, !365}
!1000 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!1001 = !{i32 2, !"Dwarf Version", i32 4}
!1002 = !{i32 2, !"Debug Info Version", i32 3}
!1003 = !{i32 1, !"PIC Level", i32 2}
!1004 = !{i32 1, !"PIE Level", i32 2}
!1005 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 124, type: !1006, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !1008)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !384}
!1008 = !{!1009}
!1009 = !DILocalVariable(name: "status", arg: 1, scope: !1005, file: !3, line: 124, type: !384)
!1010 = !DIExpression()
!1011 = !DILocation(line: 124, column: 12, scope: !1005)
!1012 = !DILocation(line: 126, column: 14, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 126, column: 7)
!1014 = !DILocation(line: 126, column: 7, scope: !1005)
!1015 = !DILocation(line: 127, column: 5, scope: !1016)
!1016 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 1)
!1017 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 127, column: 5)
!1018 = !{!1019, !1019, i64 0}
!1019 = !{!"any pointer", !1020, i64 0}
!1020 = !{!"omnipotent char", !1021, i64 0}
!1021 = !{!"Simple C/C++ TBAA"}
!1022 = !DILocation(line: 127, column: 5, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 3)
!1024 = !DILocation(line: 127, column: 5, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 2)
!1026 = !DILocation(line: 130, column: 7, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 129, column: 5)
!1028 = !DILocation(line: 130, column: 7, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1027, file: !3, discriminator: 1)
!1030 = !DILocation(line: 135, column: 7, scope: !1027)
!1031 = !DILocation(line: 135, column: 7, scope: !1029)
!1032 = !DILocation(line: 587, column: 3, scope: !1033, inlinedAt: !1034)
!1033 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !470, file: !470, line: 585, type: !547, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !534)
!1034 = distinct !DILocation(line: 139, column: 7, scope: !1027)
!1035 = !DILocation(line: 587, column: 3, scope: !1036, inlinedAt: !1034)
!1036 = !DILexicalBlockFile(scope: !1033, file: !470, discriminator: 1)
!1037 = !DILocation(line: 141, column: 7, scope: !1027)
!1038 = !DILocation(line: 141, column: 7, scope: !1029)
!1039 = !DILocation(line: 144, column: 7, scope: !1027)
!1040 = !DILocation(line: 144, column: 7, scope: !1029)
!1041 = !DILocation(line: 148, column: 7, scope: !1027)
!1042 = !DILocation(line: 148, column: 7, scope: !1029)
!1043 = !DILocation(line: 151, column: 7, scope: !1027)
!1044 = !DILocation(line: 151, column: 7, scope: !1029)
!1045 = !DILocation(line: 158, column: 7, scope: !1027)
!1046 = !DILocation(line: 158, column: 7, scope: !1029)
!1047 = !DILocation(line: 162, column: 7, scope: !1027)
!1048 = !DILocation(line: 162, column: 7, scope: !1029)
!1049 = !DILocation(line: 168, column: 7, scope: !1027)
!1050 = !DILocation(line: 168, column: 7, scope: !1029)
!1051 = !DILocation(line: 171, column: 7, scope: !1027)
!1052 = !DILocation(line: 171, column: 7, scope: !1029)
!1053 = !DILocation(line: 175, column: 7, scope: !1027)
!1054 = !DILocation(line: 175, column: 7, scope: !1029)
!1055 = !DILocation(line: 176, column: 7, scope: !1027)
!1056 = !DILocation(line: 176, column: 7, scope: !1029)
!1057 = !DILocation(line: 177, column: 7, scope: !1027)
!1058 = !DILocation(line: 177, column: 7, scope: !1029)
!1059 = !DILocation(line: 184, column: 7, scope: !1027)
!1060 = !DILocation(line: 184, column: 7, scope: !1029)
!1061 = !DILocation(line: 190, column: 7, scope: !1027)
!1062 = !DILocation(line: 190, column: 7, scope: !1029)
!1063 = !DILocation(line: 196, column: 7, scope: !1027)
!1064 = !DILocation(line: 196, column: 7, scope: !1029)
!1065 = !DILocation(line: 201, column: 7, scope: !1027)
!1066 = !DILocation(line: 201, column: 7, scope: !1029)
!1067 = !DILocation(line: 207, column: 7, scope: !1027)
!1068 = !DILocation(line: 207, column: 7, scope: !1029)
!1069 = !DILocation(line: 213, column: 7, scope: !1027)
!1070 = !DILocation(line: 213, column: 7, scope: !1029)
!1071 = !DILocation(line: 223, column: 7, scope: !1027)
!1072 = !DILocation(line: 223, column: 7, scope: !1029)
!1073 = !DILocation(line: 229, column: 7, scope: !1027)
!1074 = !DILocation(line: 229, column: 7, scope: !1029)
!1075 = !DILocation(line: 235, column: 7, scope: !1027)
!1076 = !DILocation(line: 235, column: 7, scope: !1029)
!1077 = !DILocation(line: 241, column: 7, scope: !1027)
!1078 = !DILocation(line: 241, column: 7, scope: !1029)
!1079 = !DILocation(line: 250, column: 7, scope: !1027)
!1080 = !DILocation(line: 250, column: 7, scope: !1029)
!1081 = !DILocation(line: 259, column: 7, scope: !1027)
!1082 = !DILocation(line: 259, column: 7, scope: !1029)
!1083 = !DILocation(line: 266, column: 7, scope: !1027)
!1084 = !DILocation(line: 266, column: 7, scope: !1029)
!1085 = !DILocation(line: 630, column: 34, scope: !469, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 278, column: 7, scope: !1027)
!1087 = !DILocation(line: 642, column: 15, scope: !469, inlinedAt: !1086)
!1088 = !DILocation(line: 651, column: 3, scope: !469, inlinedAt: !1086)
!1089 = !DILocation(line: 651, column: 3, scope: !1090, inlinedAt: !1086)
!1090 = !DILexicalBlockFile(scope: !469, file: !470, discriminator: 1)
!1091 = !DILocation(line: 655, column: 29, scope: !469, inlinedAt: !1086)
!1092 = !DILocation(line: 655, column: 15, scope: !469, inlinedAt: !1086)
!1093 = !DILocation(line: 656, column: 7, scope: !489, inlinedAt: !1086)
!1094 = !DILocation(line: 656, column: 19, scope: !489, inlinedAt: !1086)
!1095 = !DILocation(line: 656, column: 22, scope: !1096, inlinedAt: !1086)
!1096 = !DILexicalBlockFile(scope: !489, file: !470, discriminator: 16)
!1097 = !DILocation(line: 656, column: 7, scope: !1098, inlinedAt: !1086)
!1098 = !DILexicalBlockFile(scope: !469, file: !470, discriminator: 16)
!1099 = !DILocation(line: 662, column: 7, scope: !1100, inlinedAt: !1086)
!1100 = distinct !DILexicalBlock(scope: !489, file: !470, line: 657, column: 5)
!1101 = !DILocation(line: 662, column: 7, scope: !1102, inlinedAt: !1086)
!1102 = !DILexicalBlockFile(scope: !1100, file: !470, discriminator: 1)
!1103 = !DILocation(line: 664, column: 5, scope: !1100, inlinedAt: !1086)
!1104 = !DILocation(line: 665, column: 3, scope: !469, inlinedAt: !1086)
!1105 = !DILocation(line: 665, column: 3, scope: !1090, inlinedAt: !1086)
!1106 = !DILocation(line: 667, column: 3, scope: !469, inlinedAt: !1086)
!1107 = !DILocation(line: 667, column: 3, scope: !1090, inlinedAt: !1086)
!1108 = !DILocation(line: 280, column: 3, scope: !1005)
!1109 = !DILocation(line: 347, column: 11, scope: !381)
!1110 = !DILocation(line: 347, column: 24, scope: !381)
!1111 = !DILocation(line: 350, column: 15, scope: !381)
!1112 = !DILocation(line: 351, column: 15, scope: !381)
!1113 = !DILocation(line: 352, column: 3, scope: !381)
!1114 = !DILocation(line: 353, column: 8, scope: !381)
!1115 = !DILocation(line: 354, column: 15, scope: !381)
!1116 = !DILocation(line: 355, column: 9, scope: !381)
!1117 = !DILocation(line: 356, column: 9, scope: !381)
!1118 = !DILocation(line: 357, column: 3, scope: !381)
!1119 = !DILocation(line: 362, column: 21, scope: !381)
!1120 = !DILocation(line: 362, column: 3, scope: !381)
!1121 = !DILocation(line: 363, column: 3, scope: !381)
!1122 = !DILocation(line: 364, column: 3, scope: !381)
!1123 = !DILocation(line: 365, column: 3, scope: !381)
!1124 = !DILocation(line: 367, column: 3, scope: !381)
!1125 = !DILocation(line: 369, column: 3, scope: !381)
!1126 = !DILocation(line: 369, column: 18, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !381, file: !3, discriminator: 1)
!1128 = !DILocation(line: 349, column: 7, scope: !381)
!1129 = !DILocation(line: 369, column: 3, scope: !1127)
!1130 = !DILocation(line: 377, column: 21, scope: !445)
!1131 = !DILocation(line: 378, column: 11, scope: !445)
!1132 = !DILocation(line: 380, column: 32, scope: !445)
!1133 = !{!1134, !1134, i64 0}
!1134 = !{!"int", !1020, i64 0}
!1135 = !DILocation(line: 381, column: 11, scope: !445)
!1136 = !DILocation(line: 383, column: 24, scope: !445)
!1137 = !DILocation(line: 384, column: 11, scope: !445)
!1138 = !DILocation(line: 394, column: 15, scope: !444)
!1139 = !{!1020, !1020, i64 0}
!1140 = !DILocation(line: 393, column: 28, scope: !444)
!1141 = !DILocation(line: 396, column: 26, scope: !444)
!1142 = !DILocation(line: 372, column: 19, scope: !442)
!1143 = !DILocation(line: 410, column: 16, scope: !447)
!1144 = !DILocation(line: 411, column: 18, scope: !447)
!1145 = !DILocation(line: 410, column: 16, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !447, file: !3, discriminator: 1)
!1147 = !DILocation(line: 410, column: 16, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !447, file: !3, discriminator: 3)
!1149 = !DILocation(line: 409, column: 28, scope: !447)
!1150 = !DILocation(line: 413, column: 26, scope: !447)
!1151 = !DILocation(line: 417, column: 23, scope: !445)
!1152 = !DILocation(line: 418, column: 11, scope: !445)
!1153 = !DILocation(line: 423, column: 25, scope: !445)
!1154 = !DILocation(line: 425, column: 11, scope: !445)
!1155 = !DILocation(line: 430, column: 15, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1157, file: !3, discriminator: 1)
!1157 = distinct !DILexicalBlock(scope: !445, file: !3, line: 430, column: 15)
!1158 = !DILocation(line: 430, column: 45, scope: !1157)
!1159 = !DILocation(line: 430, column: 15, scope: !445)
!1160 = !DILocation(line: 431, column: 13, scope: !1157)
!1161 = !DILocation(line: 434, column: 9, scope: !445)
!1162 = !DILocation(line: 435, column: 9, scope: !445)
!1163 = !DILocation(line: 435, column: 9, scope: !1164)
!1164 = !DILexicalBlockFile(scope: !445, file: !3, discriminator: 1)
!1165 = !DILocation(line: 437, column: 11, scope: !445)
!1166 = !DILocation(line: 440, column: 11, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !442, file: !3, line: 440, column: 11)
!1168 = !DILocation(line: 440, column: 11, scope: !442)
!1169 = !DILocation(line: 442, column: 15, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 442, column: 15)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 441, column: 9)
!1172 = !DILocation(line: 442, column: 15, scope: !1171)
!1173 = distinct !{!1173, !1125, !1174}
!1174 = !DILocation(line: 446, column: 5, scope: !381)
!1175 = !DILocation(line: 443, column: 13, scope: !1170)
!1176 = !DILocation(line: 443, column: 13, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1170, file: !3, discriminator: 1)
!1178 = !DILocation(line: 448, column: 29, scope: !381)
!1179 = !DILocation(line: 449, column: 31, scope: !381)
!1180 = !DILocation(line: 450, column: 31, scope: !381)
!1181 = !DILocation(line: 449, column: 28, scope: !381)
!1182 = !DILocation(line: 450, column: 28, scope: !381)
!1183 = !DILocation(line: 359, column: 7, scope: !381)
!1184 = !DILocation(line: 452, column: 29, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !381, file: !3, line: 452, column: 7)
!1186 = !DILocation(line: 452, column: 7, scope: !381)
!1187 = !DILocation(line: 455, column: 9, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 453, column: 5)
!1189 = !DILocation(line: 454, column: 7, scope: !1188)
!1190 = !DILocation(line: 456, column: 7, scope: !1188)
!1191 = !DILocation(line: 459, column: 7, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !381, file: !3, line: 459, column: 7)
!1193 = !DILocation(line: 459, column: 19, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1192, file: !3, discriminator: 1)
!1195 = !DILocation(line: 459, column: 16, scope: !1192)
!1196 = !DILocation(line: 462, column: 11, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 460, column: 5)
!1198 = !DILocation(line: 461, column: 7, scope: !1197)
!1199 = !DILocation(line: 463, column: 7, scope: !1197)
!1200 = !DILocation(line: 466, column: 7, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !381, file: !3, line: 466, column: 7)
!1202 = !DILocation(line: 466, column: 14, scope: !1201)
!1203 = !DILocation(line: 466, column: 7, scope: !381)
!1204 = !DILocation(line: 468, column: 18, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 468, column: 11)
!1206 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 467, column: 5)
!1207 = !DILocation(line: 468, column: 22, scope: !1205)
!1208 = !DILocation(line: 468, column: 11, scope: !1206)
!1209 = !DILocation(line: 470, column: 24, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 469, column: 9)
!1211 = !DILocation(line: 470, column: 59, scope: !1210)
!1212 = !DILocation(line: 470, column: 66, scope: !1210)
!1213 = !DILocation(line: 470, column: 54, scope: !1210)
!1214 = !DILocation(line: 470, column: 47, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1210, file: !3, discriminator: 1)
!1216 = !DILocation(line: 470, column: 11, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1210, file: !3, discriminator: 2)
!1218 = !DILocation(line: 471, column: 11, scope: !1210)
!1219 = !DILocation(line: 474, column: 11, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 474, column: 11)
!1221 = !DILocation(line: 474, column: 27, scope: !1220)
!1222 = !DILocation(line: 474, column: 11, scope: !1206)
!1223 = !DILocation(line: 476, column: 15, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 476, column: 15)
!1225 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 475, column: 9)
!1226 = !DILocation(line: 476, column: 15, scope: !1225)
!1227 = !DILocation(line: 477, column: 13, scope: !1224)
!1228 = !DILocation(line: 477, column: 13, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1224, file: !3, discriminator: 1)
!1230 = !DILocation(line: 478, column: 31, scope: !1225)
!1231 = !DILocation(line: 478, column: 35, scope: !1225)
!1232 = !DILocation(line: 491, column: 7, scope: !381)
!1233 = !DILocation(line: 480, column: 25, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 480, column: 16)
!1235 = !DILocation(line: 483, column: 18, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 481, column: 9)
!1237 = !DILocation(line: 486, column: 30, scope: !1236)
!1238 = !DILocation(line: 486, column: 25, scope: !1236)
!1239 = !DILocation(line: 486, column: 18, scope: !1236)
!1240 = !DILocation(line: 482, column: 11, scope: !1236)
!1241 = !DILocation(line: 487, column: 11, scope: !1236)
!1242 = !DILocation(line: 491, column: 8, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !381, file: !3, line: 491, column: 7)
!1244 = !DILocation(line: 493, column: 16, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 492, column: 5)
!1246 = !DILocation(line: 494, column: 13, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 494, column: 11)
!1248 = !DILocation(line: 494, column: 11, scope: !1245)
!1249 = !DILocation(line: 505, column: 5, scope: !1245)
!1250 = !DILocation(line: 507, column: 26, scope: !381)
!1251 = !DILocation(line: 507, column: 15, scope: !381)
!1252 = !DILocation(line: 508, column: 19, scope: !381)
!1253 = !DILocation(line: 508, column: 14, scope: !381)
!1254 = !DILocation(line: 510, column: 7, scope: !381)
!1255 = !DILocalVariable(name: "input_filename", arg: 1, scope: !1256, file: !3, line: 289, type: !365)
!1256 = distinct !DISubprogram(name: "batch_convert", scope: !3, file: !3, line: 289, type: !1257, isLocal: true, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1259)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!403, !365, !365, !450, !365}
!1259 = !{!1255, !1260, !1261, !1262, !1263, !1264, !1312, !1313, !1314, !1315, !1318, !1319, !1321, !1322}
!1260 = !DILocalVariable(name: "format", arg: 2, scope: !1256, file: !3, line: 289, type: !365)
!1261 = !DILocalVariable(name: "tz", arg: 3, scope: !1256, file: !3, line: 290, type: !450)
!1262 = !DILocalVariable(name: "tzstring", arg: 4, scope: !1256, file: !3, line: 290, type: !365)
!1263 = !DILocalVariable(name: "ok", scope: !1256, file: !3, line: 292, type: !403)
!1264 = !DILocalVariable(name: "in_stream", scope: !1256, file: !3, line: 293, type: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1267, line: 49, baseType: !1268)
!1267 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1269, line: 241, size: 1728, elements: !1270)
!1269 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1270 = !{!1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1299, !1302, !1304, !1305, !1306, !1307, !1308, !1309, !1310}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1268, file: !1269, line: 242, baseType: !384, size: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1268, file: !1269, line: 247, baseType: !368, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1268, file: !1269, line: 248, baseType: !368, size: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1268, file: !1269, line: 249, baseType: !368, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1268, file: !1269, line: 250, baseType: !368, size: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1268, file: !1269, line: 251, baseType: !368, size: 64, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1268, file: !1269, line: 252, baseType: !368, size: 64, offset: 384)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1268, file: !1269, line: 253, baseType: !368, size: 64, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1268, file: !1269, line: 254, baseType: !368, size: 64, offset: 512)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1268, file: !1269, line: 256, baseType: !368, size: 64, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1268, file: !1269, line: 257, baseType: !368, size: 64, offset: 640)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1268, file: !1269, line: 258, baseType: !368, size: 64, offset: 704)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1268, file: !1269, line: 260, baseType: !1284, size: 64, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1269, line: 156, size: 192, elements: !1286)
!1286 = !{!1287, !1288, !1290}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1285, file: !1269, line: 157, baseType: !1284, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1285, file: !1269, line: 158, baseType: !1289, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1285, file: !1269, line: 162, baseType: !384, size: 32, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1268, file: !1269, line: 262, baseType: !1289, size: 64, offset: 832)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1268, file: !1269, line: 264, baseType: !384, size: 32, offset: 896)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1268, file: !1269, line: 268, baseType: !384, size: 32, offset: 928)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1268, file: !1269, line: 270, baseType: !427, size: 64, offset: 960)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1268, file: !1269, line: 274, baseType: !830, size: 16, offset: 1024)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1268, file: !1269, line: 275, baseType: !718, size: 8, offset: 1040)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1268, file: !1269, line: 276, baseType: !1298, size: 8, offset: 1048)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 8, elements: !765)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1268, file: !1269, line: 280, baseType: !1300, size: 64, offset: 1088)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1269, line: 150, baseType: null)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1268, file: !1269, line: 289, baseType: !1303, size: 64, offset: 1152)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !398, line: 141, baseType: !399)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1268, file: !1269, line: 297, baseType: !369, size: 64, offset: 1216)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1268, file: !1269, line: 298, baseType: !369, size: 64, offset: 1280)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1268, file: !1269, line: 299, baseType: !369, size: 64, offset: 1344)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1268, file: !1269, line: 300, baseType: !369, size: 64, offset: 1408)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1268, file: !1269, line: 302, baseType: !370, size: 64, offset: 1472)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1268, file: !1269, line: 303, baseType: !384, size: 32, offset: 1536)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1268, file: !1269, line: 305, baseType: !1311, size: 160, offset: 1568)
!1311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 160, elements: !680)
!1312 = !DILocalVariable(name: "line", scope: !1256, file: !3, line: 294, type: !368)
!1313 = !DILocalVariable(name: "buflen", scope: !1256, file: !3, line: 295, type: !370)
!1314 = !DILocalVariable(name: "when", scope: !1256, file: !3, line: 296, type: !393)
!1315 = !DILocalVariable(name: "__s1_len", scope: !1316, file: !3, line: 298, type: !370)
!1316 = distinct !DILexicalBlock(scope: !1317, file: !3, line: 298, column: 7)
!1317 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 298, column: 7)
!1318 = !DILocalVariable(name: "__s2_len", scope: !1316, file: !3, line: 298, type: !370)
!1319 = !DILocalVariable(name: "__s2", scope: !1320, file: !3, line: 298, type: !375)
!1320 = distinct !DILexicalBlock(scope: !1316, file: !3, line: 298, column: 7)
!1321 = !DILocalVariable(name: "__result", scope: !1320, file: !3, line: 298, type: !384)
!1322 = !DILocalVariable(name: "line_length", scope: !1323, file: !3, line: 317, type: !1324)
!1323 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 316, column: 5)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1267, line: 105, baseType: !1325)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !398, line: 181, baseType: !399)
!1326 = !DILocation(line: 289, column: 28, scope: !1256, inlinedAt: !1327)
!1327 = distinct !DILocation(line: 511, column: 10, scope: !456)
!1328 = !DILocation(line: 289, column: 56, scope: !1256, inlinedAt: !1327)
!1329 = !DILocation(line: 290, column: 27, scope: !1256, inlinedAt: !1327)
!1330 = !DILocation(line: 290, column: 43, scope: !1256, inlinedAt: !1327)
!1331 = !DILocation(line: 294, column: 3, scope: !1256, inlinedAt: !1327)
!1332 = !DILocation(line: 295, column: 3, scope: !1256, inlinedAt: !1327)
!1333 = !DILocation(line: 296, column: 3, scope: !1256, inlinedAt: !1327)
!1334 = !DILocation(line: 298, column: 7, scope: !1316, inlinedAt: !1327)
!1335 = !DILocation(line: 298, column: 7, scope: !1320, inlinedAt: !1327)
!1336 = !DILocation(line: 298, column: 7, scope: !1337, inlinedAt: !1327)
!1337 = !DILexicalBlockFile(scope: !1320, file: !3, discriminator: 2)
!1338 = !DILocation(line: 298, column: 7, scope: !1339, inlinedAt: !1327)
!1339 = !DILexicalBlockFile(scope: !1340, file: !3, discriminator: 3)
!1340 = distinct !DILexicalBlock(scope: !1320, file: !3, line: 298, column: 7)
!1341 = !DILocation(line: 298, column: 7, scope: !1342, inlinedAt: !1327)
!1342 = !DILexicalBlockFile(scope: !1340, file: !3, discriminator: 2)
!1343 = !DILocation(line: 298, column: 7, scope: !1344, inlinedAt: !1327)
!1344 = !DILexicalBlockFile(scope: !1345, file: !3, discriminator: 4)
!1345 = distinct !DILexicalBlock(scope: !1340, file: !3, line: 298, column: 7)
!1346 = !DILocation(line: 298, column: 7, scope: !1347, inlinedAt: !1327)
!1347 = !DILexicalBlockFile(scope: !1316, file: !3, discriminator: 11)
!1348 = !DILocation(line: 298, column: 7, scope: !1349, inlinedAt: !1327)
!1349 = !DILexicalBlockFile(scope: !1256, file: !3, discriminator: 13)
!1350 = !DILocation(line: 300, column: 24, scope: !1351, inlinedAt: !1327)
!1351 = distinct !DILexicalBlock(scope: !1317, file: !3, line: 299, column: 5)
!1352 = !DILocation(line: 301, column: 19, scope: !1351, inlinedAt: !1327)
!1353 = !DILocation(line: 293, column: 9, scope: !1256, inlinedAt: !1327)
!1354 = !DILocation(line: 302, column: 5, scope: !1351, inlinedAt: !1327)
!1355 = !DILocation(line: 305, column: 19, scope: !1356, inlinedAt: !1327)
!1356 = distinct !DILexicalBlock(scope: !1317, file: !3, line: 304, column: 5)
!1357 = !DILocation(line: 306, column: 21, scope: !1358, inlinedAt: !1327)
!1358 = distinct !DILexicalBlock(scope: !1356, file: !3, line: 306, column: 11)
!1359 = !DILocation(line: 306, column: 11, scope: !1356, inlinedAt: !1327)
!1360 = !DILocation(line: 308, column: 11, scope: !1361, inlinedAt: !1327)
!1361 = distinct !DILexicalBlock(scope: !1358, file: !3, line: 307, column: 9)
!1362 = !DILocation(line: 308, column: 11, scope: !1363, inlinedAt: !1327)
!1363 = !DILexicalBlockFile(scope: !1361, file: !3, discriminator: 1)
!1364 = !DILocation(line: 308, column: 11, scope: !1365, inlinedAt: !1327)
!1365 = !DILexicalBlockFile(scope: !1361, file: !3, discriminator: 2)
!1366 = !DILocation(line: 294, column: 9, scope: !1256, inlinedAt: !1327)
!1367 = !DILocation(line: 312, column: 8, scope: !1256, inlinedAt: !1327)
!1368 = !DILocation(line: 295, column: 10, scope: !1256, inlinedAt: !1327)
!1369 = !DILocation(line: 313, column: 10, scope: !1256, inlinedAt: !1327)
!1370 = !{!1371, !1371, i64 0}
!1371 = !{!"long", !1020, i64 0}
!1372 = !DILocation(line: 292, column: 8, scope: !1256, inlinedAt: !1327)
!1373 = !DIExpression(DW_OP_deref)
!1374 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1375, file: !1376, line: 115, type: !385)
!1375 = distinct !DISubprogram(name: "getline", scope: !1376, file: !1376, line: 115, type: !1377, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1379)
!1376 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!1325, !385, !950, !1265}
!1379 = !{!1374, !1380, !1381}
!1380 = !DILocalVariable(name: "__n", arg: 2, scope: !1375, file: !1376, line: 115, type: !950)
!1381 = !DILocalVariable(name: "__stream", arg: 3, scope: !1375, file: !1376, line: 115, type: !1265)
!1382 = !DILocation(line: 115, column: 17, scope: !1375, inlinedAt: !1383)
!1383 = distinct !DILocation(line: 317, column: 29, scope: !1323, inlinedAt: !1327)
!1384 = !DILocation(line: 115, column: 36, scope: !1375, inlinedAt: !1383)
!1385 = !DILocation(line: 115, column: 47, scope: !1375, inlinedAt: !1383)
!1386 = !DILocation(line: 117, column: 10, scope: !1375, inlinedAt: !1383)
!1387 = !DILocation(line: 317, column: 15, scope: !1323, inlinedAt: !1327)
!1388 = !DILocation(line: 318, column: 23, scope: !1389, inlinedAt: !1327)
!1389 = distinct !DILexicalBlock(scope: !1323, file: !3, line: 318, column: 11)
!1390 = !DILocation(line: 318, column: 11, scope: !1323, inlinedAt: !1327)
!1391 = !DILocation(line: 324, column: 37, scope: !1392, inlinedAt: !1327)
!1392 = distinct !DILexicalBlock(scope: !1323, file: !3, line: 324, column: 11)
!1393 = !DILocation(line: 325, column: 30, scope: !1392, inlinedAt: !1327)
!1394 = !DILocation(line: 296, column: 19, scope: !1256, inlinedAt: !1327)
!1395 = !DILocation(line: 324, column: 13, scope: !1392, inlinedAt: !1327)
!1396 = !DILocation(line: 324, column: 11, scope: !1323, inlinedAt: !1327)
!1397 = !DILocation(line: 327, column: 15, scope: !1398, inlinedAt: !1327)
!1398 = distinct !DILexicalBlock(scope: !1399, file: !3, line: 327, column: 15)
!1399 = distinct !DILexicalBlock(scope: !1392, file: !3, line: 326, column: 9)
!1400 = !DILocation(line: 327, column: 32, scope: !1398, inlinedAt: !1327)
!1401 = !DILocation(line: 327, column: 37, scope: !1398, inlinedAt: !1327)
!1402 = !DILocation(line: 327, column: 15, scope: !1399, inlinedAt: !1327)
!1403 = !DILocation(line: 328, column: 35, scope: !1398, inlinedAt: !1327)
!1404 = !DILocation(line: 328, column: 13, scope: !1398, inlinedAt: !1327)
!1405 = !DILocation(line: 329, column: 24, scope: !1399, inlinedAt: !1327)
!1406 = !DILocation(line: 329, column: 53, scope: !1399, inlinedAt: !1327)
!1407 = !DILocation(line: 329, column: 46, scope: !1408, inlinedAt: !1327)
!1408 = !DILexicalBlockFile(scope: !1399, file: !3, discriminator: 1)
!1409 = !DILocation(line: 329, column: 11, scope: !1410, inlinedAt: !1327)
!1410 = !DILexicalBlockFile(scope: !1399, file: !3, discriminator: 2)
!1411 = !DILocation(line: 331, column: 9, scope: !1399, inlinedAt: !1327)
!1412 = !DILocation(line: 334, column: 17, scope: !1413, inlinedAt: !1327)
!1413 = distinct !DILexicalBlock(scope: !1392, file: !3, line: 333, column: 9)
!1414 = !DILocation(line: 334, column: 14, scope: !1413, inlinedAt: !1327)
!1415 = !DILocation(line: 338, column: 7, scope: !1416, inlinedAt: !1327)
!1416 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 338, column: 7)
!1417 = !DILocation(line: 338, column: 26, scope: !1416, inlinedAt: !1327)
!1418 = !DILocation(line: 338, column: 7, scope: !1256, inlinedAt: !1327)
!1419 = !DILocation(line: 339, column: 5, scope: !1416, inlinedAt: !1327)
!1420 = !DILocation(line: 339, column: 5, scope: !1421, inlinedAt: !1327)
!1421 = !DILexicalBlockFile(scope: !1416, file: !3, discriminator: 1)
!1422 = !DILocation(line: 339, column: 5, scope: !1423, inlinedAt: !1327)
!1423 = !DILexicalBlockFile(scope: !1416, file: !3, discriminator: 2)
!1424 = !DILocation(line: 341, column: 9, scope: !1256, inlinedAt: !1327)
!1425 = !DILocation(line: 341, column: 3, scope: !1256, inlinedAt: !1327)
!1426 = !DILocation(line: 343, column: 10, scope: !1256, inlinedAt: !1327)
!1427 = !DILocation(line: 344, column: 1, scope: !1256, inlinedAt: !1327)
!1428 = !DILocation(line: 511, column: 8, scope: !456)
!1429 = !DILocation(line: 511, column: 5, scope: !456)
!1430 = !DILocation(line: 514, column: 12, scope: !455)
!1431 = !DILocation(line: 358, column: 8, scope: !381)
!1432 = !DILocation(line: 517, column: 34, scope: !1433)
!1433 = distinct !DILexicalBlock(scope: !455, file: !3, line: 517, column: 11)
!1434 = !DILocation(line: 519, column: 15, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1436, file: !3, line: 519, column: 15)
!1436 = distinct !DILexicalBlock(scope: !1433, file: !3, line: 518, column: 9)
!1437 = !DILocation(line: 519, column: 22, scope: !1435)
!1438 = !DILocation(line: 519, column: 15, scope: !1436)
!1439 = !DILocation(line: 352, column: 19, scope: !381)
!1440 = !DILocation(line: 534, column: 15, scope: !1441)
!1441 = distinct !DILexicalBlock(scope: !1435, file: !3, line: 532, column: 13)
!1442 = !DILocation(line: 540, column: 15, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1433, file: !3, line: 538, column: 9)
!1444 = !DILocation(line: 357, column: 15, scope: !381)
!1445 = !DILocalVariable(name: "__path", arg: 1, scope: !1446, file: !1447, line: 449, type: !365)
!1446 = distinct !DISubprogram(name: "stat", scope: !1447, file: !1447, line: 449, type: !1448, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1451)
!1447 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!384, !365, !1450}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!1451 = !{!1445, !1452}
!1452 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1446, file: !1447, line: 449, type: !1450)
!1453 = !DILocation(line: 449, column: 1, scope: !1446, inlinedAt: !1454)
!1454 = distinct !DILocation(line: 542, column: 19, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1456, file: !3, line: 542, column: 19)
!1456 = distinct !DILexicalBlock(scope: !1457, file: !3, line: 541, column: 13)
!1457 = distinct !DILexicalBlock(scope: !1443, file: !3, line: 540, column: 15)
!1458 = !DILocation(line: 451, column: 10, scope: !1446, inlinedAt: !1454)
!1459 = !DILocation(line: 542, column: 47, scope: !1455)
!1460 = !DILocation(line: 542, column: 19, scope: !1456)
!1461 = !DILocation(line: 543, column: 17, scope: !1455)
!1462 = !DILocation(line: 543, column: 17, scope: !1463)
!1463 = !DILexicalBlockFile(scope: !1455, file: !3, discriminator: 1)
!1464 = !DILocation(line: 543, column: 17, scope: !1465)
!1465 = !DILexicalBlockFile(scope: !1455, file: !3, discriminator: 2)
!1466 = !DILocalVariable(name: "st", arg: 1, scope: !1467, file: !1468, line: 140, type: !1471)
!1467 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1468, file: !1468, line: 140, type: !1469, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1473)
!1468 = !DIFile(filename: "./lib/stat-time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!393, !1471}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!1473 = !{!1466}
!1474 = !DILocation(line: 140, column: 36, scope: !1467, inlinedAt: !1475)
!1475 = distinct !DILocation(line: 544, column: 22, scope: !1456)
!1476 = !DILocation(line: 143, column: 10, scope: !1467, inlinedAt: !1475)
!1477 = !DILocation(line: 544, column: 22, scope: !1456)
!1478 = !DILocation(line: 545, column: 13, scope: !1456)
!1479 = !DILocation(line: 548, column: 19, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1481, file: !3, line: 548, column: 19)
!1481 = distinct !DILexicalBlock(scope: !1457, file: !3, line: 547, column: 13)
!1482 = !DILocation(line: 548, column: 19, scope: !1481)
!1483 = !DILocation(line: 551, column: 45, scope: !1481)
!1484 = !DILocation(line: 550, column: 28, scope: !1481)
!1485 = !DILocation(line: 556, column: 11, scope: !455)
!1486 = !DILocation(line: 524, column: 25, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1435, file: !3, line: 520, column: 13)
!1488 = !DILocation(line: 525, column: 45, scope: !1487)
!1489 = !DILocation(line: 525, column: 28, scope: !1487)
!1490 = !DILocation(line: 529, column: 20, scope: !1487)
!1491 = !DILocation(line: 529, column: 28, scope: !1487)
!1492 = !{!1493, !1371, i64 8}
!1493 = !{!"timespec", !1371, i64 0, !1371, i64 8}
!1494 = !DILocation(line: 557, column: 9, scope: !1495)
!1495 = distinct !DILexicalBlock(scope: !455, file: !3, line: 556, column: 11)
!1496 = !DILocation(line: 557, column: 9, scope: !1497)
!1497 = !DILexicalBlockFile(scope: !1495, file: !3, discriminator: 1)
!1498 = !DILocation(line: 557, column: 9, scope: !1499)
!1499 = !DILexicalBlockFile(scope: !1495, file: !3, discriminator: 2)
