; ModuleID = 'coreutils-8.27/src/df.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.fs_type_list = type { i8*, %struct.fs_type_list* }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.field_data_t = type { i32, i8*, i32, i8*, i64, i32, i8 }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.devlist = type { i64, %struct.mount_entry*, %struct.devlist* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.field_values_t = type { i64, i64, i64, i64, i8, i64, i64, i8 }

!74 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!76 = !DIEnumerator(name: "_ISupper", value: 256)
!77 = !DIEnumerator(name: "_ISlower", value: 512)
!78 = !DIEnumerator(name: "_ISalpha", value: 1024)
!79 = !DIEnumerator(name: "_ISdigit", value: 2048)
!80 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!81 = !DIEnumerator(name: "_ISspace", value: 8192)
!82 = !DIEnumerator(name: "_ISprint", value: 16384)
!83 = !DIEnumerator(name: "_ISgraph", value: 32768)
!84 = !DIEnumerator(name: "_ISblank", value: 1)
!85 = !DIEnumerator(name: "_IScntrl", value: 2)
!86 = !DIEnumerator(name: "_ISpunct", value: 4)
!87 = !DIEnumerator(name: "_ISalnum", value: 8)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !89, line: 24, size: 32, elements: !90)
!89 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "CAN_EXISTING", value: 0)
!92 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1)
!93 = !DIEnumerator(name: "CAN_MISSING", value: 2)
!94 = !DIEnumerator(name: "CAN_NOLINKS", value: 4)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 21, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1)
!98 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2)
!99 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4)
!100 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8)
!101 = !{!102, !104, !105, !108, !110, !113, !115, !116, !117, !121, !124, !112}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !118, line: 60, baseType: !119)
!118 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !120, line: 133, baseType: !107)
!120 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !122, line: 136, baseType: !123)
!122 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !120, line: 62, baseType: !107)
!124 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!125 = !{!126, !129, !131, !133, !135, !137, !139, !141, !0, !143, !150, !166, !168, !170, !182, !212, !226, !228, !230, !246, !251, !253, !257, !259}
!126 = !DIGlobalVariableExpression(var: !127)
!127 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !2, file: !3, line: 61, type: !128, isLocal: true, isDefinition: true)
!128 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !2, file: !3, line: 64, type: !128, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !2, file: !3, line: 68, type: !128, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 71, type: !115, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 74, type: !121, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138)
!138 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !2, file: !3, line: 77, type: !128, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "require_sync", scope: !2, file: !3, line: 83, type: !128, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 86, type: !115, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !2, file: !3, line: 112, type: !145, isLocal: true, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !3, line: 90, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !146, file: !3, line: 92, baseType: !102, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !146, file: !3, line: 93, baseType: !145, size: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "mount_list", scope: !2, file: !3, line: 115, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !154, line: 26, size: 448, elements: !155)
!154 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!155 = !{!156, !157, !158, !159, !160, !161, !163, !164, !165}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !153, file: !154, line: 28, baseType: !102, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !153, file: !154, line: 29, baseType: !102, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !153, file: !154, line: 30, baseType: !102, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !153, file: !154, line: 32, baseType: !102, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !153, file: !154, line: 33, baseType: !117, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !153, file: !154, line: 34, baseType: !162, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!162 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !153, file: !154, line: 35, baseType: !162, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !153, file: !154, line: 36, baseType: !162, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !153, file: !154, line: 37, baseType: !152, size: 64, offset: 384)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "print_type", scope: !2, file: !3, line: 118, type: !128, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169)
!169 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 121, type: !128, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !2, file: !3, line: 124, type: !172, isLocal: true, isDefinition: true)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !173, line: 27, size: 448, elements: !174)
!173 = !DIFile(filename: "./lib/fsusage.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!174 = !{!175, !176, !177, !178, !179, !180, !181}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !172, file: !173, line: 29, baseType: !121, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !172, file: !173, line: 30, baseType: !121, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !172, file: !173, line: 31, baseType: !121, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !172, file: !173, line: 32, baseType: !121, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !172, file: !173, line: 33, baseType: !128, size: 8, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !172, file: !173, line: 34, baseType: !121, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !172, file: !173, line: 35, baseType: !121, size: 64, offset: 384)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "infomap", scope: !184, file: !185, line: 632, type: !209, isLocal: true, isDefinition: true)
!184 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !185, file: !185, line: 630, type: !186, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !188)
!185 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!186 = !DISubroutineType(types: !187)
!187 = !{null, !113}
!188 = !{!189, !190, !191, !198, !200, !201, !202, !205, !206, !208}
!189 = !DILocalVariable(name: "program", arg: 1, scope: !184, file: !185, line: 630, type: !113)
!190 = !DILocalVariable(name: "node", scope: !184, file: !185, line: 642, type: !113)
!191 = !DILocalVariable(name: "map_prog", scope: !184, file: !185, line: 643, type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !184, file: !185, line: 632, size: 128, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !194, file: !185, line: 632, baseType: !113, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !194, file: !185, line: 632, baseType: !113, size: 64, offset: 64)
!198 = !DILocalVariable(name: "__s1_len", scope: !199, file: !185, line: 645, type: !105)
!199 = distinct !DILexicalBlock(scope: !184, file: !185, line: 645, column: 33)
!200 = !DILocalVariable(name: "__s2_len", scope: !199, file: !185, line: 645, type: !105)
!201 = !DILocalVariable(name: "lc_messages", scope: !184, file: !185, line: 655, type: !113)
!202 = !DILocalVariable(name: "__s1_len", scope: !203, file: !185, line: 656, type: !105)
!203 = distinct !DILexicalBlock(scope: !204, file: !185, line: 656, column: 22)
!204 = distinct !DILexicalBlock(scope: !184, file: !185, line: 656, column: 7)
!205 = !DILocalVariable(name: "__s2_len", scope: !203, file: !185, line: 656, type: !105)
!206 = !DILocalVariable(name: "__s2", scope: !207, file: !185, line: 656, type: !110)
!207 = distinct !DILexicalBlock(scope: !203, file: !185, line: 656, column: 22)
!208 = !DILocalVariable(name: "__result", scope: !207, file: !185, line: 656, type: !115)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 896, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 253, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 4352, elements: !224)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !217, line: 104, size: 256, elements: !218)
!217 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!218 = !{!219, !220, !221, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !217, line: 106, baseType: !113, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !216, file: !217, line: 109, baseType: !115, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !216, file: !217, line: 110, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !216, file: !217, line: 111, baseType: !115, size: 32, offset: 192)
!224 = !{!225}
!225 = !DISubrange(count: 17)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "header_mode", scope: !2, file: !3, line: 135, type: !115, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "ncolumns", scope: !2, file: !3, line: 222, type: !105, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 219, type: !232, isLocal: true, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !3, line: 164, size: 384, elements: !235)
!235 = !{!236, !238, !239, !241, !242, !243, !245}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !234, file: !3, line: 166, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !3, line: 153, baseType: !47)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !234, file: !3, line: 167, baseType: !113, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !234, file: !3, line: 168, baseType: !240, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !3, line: 161, baseType: !62)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !234, file: !3, line: 169, baseType: !113, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !234, file: !3, line: 170, baseType: !105, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !234, file: !3, line: 171, baseType: !244, size: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !68, line: 19, baseType: !67)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !234, file: !3, line: 172, baseType: !128, size: 8, offset: 352)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "field_data", scope: !2, file: !3, line: 176, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 4608, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 12)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "all_args_string", scope: !2, file: !3, line: 214, type: !113, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254)
!254 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 238, type: !255, isLocal: true, isDefinition: true)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "nrows", scope: !2, file: !3, line: 241, type: !105, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "devlist_table", scope: !2, file: !3, line: 57, type: !261, isLocal: true, isDefinition: true)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !263, line: 69, baseType: !264)
!263 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !263, line: 67, flags: DIFlagFwdDecl)
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "Version", scope: !267, file: !268, line: 2, type: !113, isLocal: false, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, globals: !270)
!268 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!269 = !{}
!270 = !{!265}
!271 = !DIGlobalVariableExpression(var: !272)
!272 = distinct !DIGlobalVariable(name: "file_name", scope: !273, file: !278, line: 36, type: !113, isLocal: true, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, globals: !275)
!274 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!275 = !{!271, !276}
!276 = !DIGlobalVariableExpression(var: !277)
!277 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !273, file: !278, line: 46, type: !128, isLocal: true, isDefinition: true)
!278 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!279 = !DIGlobalVariableExpression(var: !280)
!280 = distinct !DIGlobalVariable(name: "exit_failure", scope: !281, file: !284, line: 24, type: !285, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, globals: !283)
!282 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!283 = !{!279}
!284 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!285 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "default_tuning", scope: !288, file: !292, line: 130, type: !293, isLocal: true, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !290, globals: !291)
!289 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!290 = !{!107, !104, !105}
!291 = !{!286}
!292 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !263, line: 65, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !263, line: 53, size: 160, elements: !296)
!296 = !{!297, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !295, file: !263, line: 58, baseType: !298, size: 32)
!298 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !295, file: !263, line: 59, baseType: !298, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !295, file: !263, line: 60, baseType: !298, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !295, file: !263, line: 61, baseType: !298, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !295, file: !263, line: 62, baseType: !128, size: 8, offset: 128)
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "power_letter", scope: !305, file: !312, line: 36, type: !323, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !309)
!306 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = !{!20, !5}
!308 = !{!113}
!309 = !{!303, !310, !317}
!310 = !DIGlobalVariableExpression(var: !311)
!311 = distinct !DIGlobalVariable(name: "block_size_args", scope: !305, file: !312, line: 398, type: !313, isLocal: true, isDefinition: true)
!312 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 192, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !305, file: !312, line: 399, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 64, elements: !321)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!321 = !{!322}
!322 = !DISubrange(count: 2)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 72, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 9)
!326 = !DIGlobalVariableExpression(var: !327)
!327 = distinct !DIGlobalVariable(name: "program_name", scope: !328, file: !332, line: 33, type: !113, isLocal: false, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !330, globals: !331)
!329 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!330 = !{!104, !102}
!331 = !{!326}
!332 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !DIGlobalVariableExpression(var: !334)
!334 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !335, file: !347, line: 77, type: !382, isLocal: false, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !337, retainedTypes: !343, globals: !344)
!336 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!337 = !{!33, !338, !73}
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !34, line: 242, size: 32, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!341 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!342 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!343 = !{!115, !116, !105, !102}
!344 = !{!333, !345, !352, !364, !366, !371, !378, !380}
!345 = !DIGlobalVariableExpression(var: !346)
!346 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !335, file: !347, line: 93, type: !348, isLocal: false, isDefinition: true)
!347 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 320, elements: !350)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!350 = !{!351}
!351 = !DISubrange(count: 10)
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !335, file: !347, line: 1043, type: !354, isLocal: false, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !347, line: 57, size: 448, elements: !355)
!355 = !{!356, !357, !358, !362, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !354, file: !347, line: 60, baseType: !33, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !354, file: !347, line: 63, baseType: !115, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !354, file: !347, line: 67, baseType: !359, size: 256, offset: 64)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 256, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !354, file: !347, line: 70, baseType: !113, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !354, file: !347, line: 73, baseType: !113, size: 64, offset: 384)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !335, file: !347, line: 108, type: !354, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367)
!367 = distinct !DIGlobalVariable(name: "slot0", scope: !335, file: !347, line: 834, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2048, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 256)
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "slotvec", scope: !335, file: !347, line: 837, type: !373, isLocal: true, isDefinition: true)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !347, line: 826, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !374, file: !347, line: 828, baseType: !105, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !374, file: !347, line: 829, baseType: !102, size: 64, offset: 64)
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "nslots", scope: !335, file: !347, line: 835, type: !115, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381)
!381 = distinct !DIGlobalVariable(name: "slotvec0", scope: !335, file: !347, line: 836, type: !374, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 11)
!385 = !DIGlobalVariableExpression(var: !386)
!386 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !387, file: !390, line: 26, type: !391, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, globals: !389)
!388 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!389 = !{!385}
!390 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 376, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 47)
!394 = !DIGlobalVariableExpression(var: !395)
!395 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !396, file: !397, line: 100, type: !115, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "statvfs_works", scope: !397, file: !397, line: 98, type: !398, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, unit: !400, variables: !404)
!397 = !DIFile(filename: "lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!398 = !DISubroutineType(types: !399)
!399 = !{!115}
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !402, globals: !403)
!401 = !DIFile(filename: "./lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!402 = !{!121}
!403 = !{!394}
!404 = !{!405}
!405 = !DILocalVariable(name: "name", scope: !396, file: !397, line: 101, type: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !407, line: 48, size: 3120, elements: !408)
!407 = !DIFile(filename: "/usr/include/sys/utsname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!408 = !{!409, !413, !414, !415, !416, !417}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !406, file: !407, line: 51, baseType: !410, size: 520)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 520, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 65)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !406, file: !407, line: 54, baseType: !410, size: 520, offset: 520)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !406, file: !407, line: 57, baseType: !410, size: 520, offset: 1040)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !406, file: !407, line: 59, baseType: !410, size: 520, offset: 1560)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !406, file: !407, line: 62, baseType: !410, size: 520, offset: 2080)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !406, file: !407, line: 67, baseType: !410, size: 520, offset: 2600)
!418 = !DIGlobalVariableExpression(var: !419)
!419 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !420, file: !425, line: 69, type: !426, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !423, globals: !424)
!421 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!422 = !{!33}
!423 = !{!105, !104, !112}
!424 = !{!418}
!425 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !427, line: 55, baseType: !428)
!427 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null}
!431 = !DIGlobalVariableExpression(var: !432)
!432 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !433, file: !777, line: 120, type: !778, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !774, globals: !776)
!434 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!435 = !{!436}
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !437, line: 41, size: 32, elements: !438)
!437 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!439 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!440 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!441 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!442 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!443 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!444 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!445 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!446 = !DIEnumerator(name: "DAY_1", value: 131079)
!447 = !DIEnumerator(name: "DAY_2", value: 131080)
!448 = !DIEnumerator(name: "DAY_3", value: 131081)
!449 = !DIEnumerator(name: "DAY_4", value: 131082)
!450 = !DIEnumerator(name: "DAY_5", value: 131083)
!451 = !DIEnumerator(name: "DAY_6", value: 131084)
!452 = !DIEnumerator(name: "DAY_7", value: 131085)
!453 = !DIEnumerator(name: "ABMON_1", value: 131086)
!454 = !DIEnumerator(name: "ABMON_2", value: 131087)
!455 = !DIEnumerator(name: "ABMON_3", value: 131088)
!456 = !DIEnumerator(name: "ABMON_4", value: 131089)
!457 = !DIEnumerator(name: "ABMON_5", value: 131090)
!458 = !DIEnumerator(name: "ABMON_6", value: 131091)
!459 = !DIEnumerator(name: "ABMON_7", value: 131092)
!460 = !DIEnumerator(name: "ABMON_8", value: 131093)
!461 = !DIEnumerator(name: "ABMON_9", value: 131094)
!462 = !DIEnumerator(name: "ABMON_10", value: 131095)
!463 = !DIEnumerator(name: "ABMON_11", value: 131096)
!464 = !DIEnumerator(name: "ABMON_12", value: 131097)
!465 = !DIEnumerator(name: "MON_1", value: 131098)
!466 = !DIEnumerator(name: "MON_2", value: 131099)
!467 = !DIEnumerator(name: "MON_3", value: 131100)
!468 = !DIEnumerator(name: "MON_4", value: 131101)
!469 = !DIEnumerator(name: "MON_5", value: 131102)
!470 = !DIEnumerator(name: "MON_6", value: 131103)
!471 = !DIEnumerator(name: "MON_7", value: 131104)
!472 = !DIEnumerator(name: "MON_8", value: 131105)
!473 = !DIEnumerator(name: "MON_9", value: 131106)
!474 = !DIEnumerator(name: "MON_10", value: 131107)
!475 = !DIEnumerator(name: "MON_11", value: 131108)
!476 = !DIEnumerator(name: "MON_12", value: 131109)
!477 = !DIEnumerator(name: "AM_STR", value: 131110)
!478 = !DIEnumerator(name: "PM_STR", value: 131111)
!479 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!480 = !DIEnumerator(name: "D_FMT", value: 131113)
!481 = !DIEnumerator(name: "T_FMT", value: 131114)
!482 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!483 = !DIEnumerator(name: "ERA", value: 131116)
!484 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!485 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!486 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!487 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!488 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!489 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!490 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!491 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!492 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!493 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!494 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!495 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!496 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!497 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!498 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!499 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!500 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!501 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!502 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!503 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!504 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!505 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!506 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!507 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!508 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!509 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!510 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!511 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!512 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!513 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!514 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!515 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!516 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!517 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!518 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!519 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!520 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!521 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!522 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!523 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!524 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!525 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!526 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!527 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!528 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!529 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!530 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!531 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!532 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!533 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!534 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!535 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!536 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!537 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!538 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!539 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!540 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!541 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!542 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!543 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!544 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!545 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!546 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!547 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!548 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!549 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!550 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!551 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!552 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!553 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!554 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!555 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!556 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!557 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!558 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!559 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!560 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!561 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!562 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!563 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!564 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!565 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!566 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!567 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!568 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!569 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!570 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!571 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!572 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!573 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!574 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!575 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!576 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!577 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!578 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!579 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!580 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!581 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!582 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!583 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!584 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!585 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!586 = !DIEnumerator(name: "CODESET", value: 14)
!587 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!588 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!589 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!590 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!591 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!592 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!593 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!594 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!595 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!599 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!600 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!601 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!602 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!603 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!604 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!605 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!606 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!613 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!614 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!615 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!616 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!617 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!619 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!620 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!621 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!622 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!623 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!624 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!625 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!626 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!627 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!628 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!631 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!632 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!633 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!634 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!635 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!636 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!637 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!638 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!639 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!640 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!641 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!642 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!643 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!644 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!645 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!646 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!647 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!648 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!649 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!650 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!651 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!652 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!653 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!654 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!655 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!656 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!657 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!658 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!659 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!660 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!661 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!662 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!663 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!664 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!665 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!666 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!667 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!668 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!669 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!670 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!671 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!672 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!673 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!674 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!675 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!676 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!677 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!678 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!679 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!680 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!681 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!682 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!683 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!684 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!685 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!687 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!688 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!689 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!690 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!691 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!692 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!693 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!694 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!695 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!696 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!697 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!698 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!699 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!700 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!701 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!702 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!703 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!704 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!705 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!706 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!707 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!708 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!709 = !DIEnumerator(name: "THOUSEP", value: 65537)
!710 = !DIEnumerator(name: "__GROUPING", value: 65538)
!711 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!712 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!713 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!714 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!715 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!716 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!717 = !DIEnumerator(name: "__YESSTR", value: 327682)
!718 = !DIEnumerator(name: "__NOSTR", value: 327683)
!719 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!720 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!721 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!722 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!723 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!724 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!725 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!726 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!727 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!728 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!729 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!730 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!731 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!732 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!733 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!734 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!735 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!736 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!737 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!738 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!739 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!740 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!741 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!742 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!743 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!744 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!745 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!746 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!747 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!748 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!749 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!750 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!751 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!752 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!753 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!754 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!755 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!756 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!757 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!758 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!759 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!760 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!761 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!762 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!763 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!764 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!765 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!766 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!767 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!768 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!769 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!770 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!771 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!772 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!773 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!774 = !{!104, !102, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!776 = !{!431}
!777 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!779 = !DIGlobalVariableExpression(var: !780)
!780 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !781, file: !782, line: 335, type: !115, isLocal: true, isDefinition: true)
!781 = distinct !DISubprogram(name: "rpl_fcntl", scope: !782, file: !782, line: 272, type: !783, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !785, variables: !788)
!782 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!783 = !DISubroutineType(types: !784)
!784 = !{!115, !115, !115, null}
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, globals: !787)
!786 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!787 = !{!779}
!788 = !{!789, !790, !791, !804, !805, !808, !811, !814}
!789 = !DILocalVariable(name: "fd", arg: 1, scope: !781, file: !782, line: 272, type: !115)
!790 = !DILocalVariable(name: "action", arg: 2, scope: !781, file: !782, line: 272, type: !115)
!791 = !DILocalVariable(name: "arg", scope: !781, file: !782, line: 274, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !793, line: 30, baseType: !794)
!793 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !786, line: 274, baseType: !795)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 192, elements: !802)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !786, line: 274, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !796, file: !786, line: 274, baseType: !162, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !796, file: !786, line: 274, baseType: !162, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !796, file: !786, line: 274, baseType: !104, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !796, file: !786, line: 274, baseType: !104, size: 64, offset: 128)
!802 = !{!803}
!803 = !DISubrange(count: 1)
!804 = !DILocalVariable(name: "result", scope: !781, file: !782, line: 275, type: !115)
!805 = !DILocalVariable(name: "target", scope: !806, file: !782, line: 322, type: !115)
!806 = distinct !DILexicalBlock(scope: !807, file: !782, line: 321, column: 7)
!807 = distinct !DILexicalBlock(scope: !781, file: !782, line: 278, column: 5)
!808 = !DILocalVariable(name: "flags", scope: !809, file: !782, line: 359, type: !115)
!809 = distinct !DILexicalBlock(scope: !810, file: !782, line: 358, column: 11)
!810 = distinct !DILexicalBlock(scope: !806, file: !782, line: 357, column: 13)
!811 = !DILocalVariable(name: "saved_errno", scope: !812, file: !782, line: 362, type: !115)
!812 = distinct !DILexicalBlock(scope: !813, file: !782, line: 361, column: 15)
!813 = distinct !DILexicalBlock(scope: !809, file: !782, line: 360, column: 17)
!814 = !DILocalVariable(name: "p", scope: !815, file: !782, line: 404, type: !104)
!815 = distinct !DILexicalBlock(scope: !807, file: !782, line: 402, column: 7)
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !818)
!817 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!818 = !{!102}
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !821, retainedTypes: !330)
!820 = !DIFile(filename: "./lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = !{!88}
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!823 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!825 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !827, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !818)
!827 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !330)
!829 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!831 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !402)
!833 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !836, retainedTypes: !837)
!835 = !DIFile(filename: "./lib/mbsalign.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = !{!67, !95}
!837 = !{!104, !838}
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !106, line: 132, baseType: !162)
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !841, retainedTypes: !842)
!840 = !DIFile(filename: "./lib/mbswidth.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = !{!73}
!842 = !{!105, !112, !115, !116}
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!844 = !DIFile(filename: "./lib/same.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!846 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !849, retainedTypes: !854)
!848 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!849 = !{!850}
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 41, size: 32, elements: !852)
!851 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!852 = !{!853}
!853 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!854 = !{!104}
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !857, retainedTypes: !871)
!856 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = !{!858}
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !860, file: !859, line: 192, size: 32, elements: !869)
!859 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!860 = distinct !DISubprogram(name: "x2nrealloc", scope: !859, file: !859, line: 180, type: !861, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !855, variables: !864)
!861 = !DISubroutineType(types: !862)
!862 = !{!104, !104, !863, !105}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!864 = !{!865, !866, !867, !868}
!865 = !DILocalVariable(name: "p", arg: 1, scope: !860, file: !859, line: 180, type: !104)
!866 = !DILocalVariable(name: "pn", arg: 2, scope: !860, file: !859, line: 180, type: !863)
!867 = !DILocalVariable(name: "s", arg: 3, scope: !860, file: !859, line: 180, type: !105)
!868 = !DILocalVariable(name: "n", scope: !860, file: !859, line: 182, type: !105)
!869 = !{!870}
!870 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!871 = !{!105, !102, !104}
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!873 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!875 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !878)
!877 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!878 = !{!5}
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !881, retainedTypes: !882)
!880 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = !{!5, !73}
!882 = !{!115, !116, !102}
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !854)
!884 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !330)
!886 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !889)
!888 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!889 = !{!105}
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !892)
!891 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!892 = !{!104, !105, !108, !110, !113, !119}
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !854)
!894 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!896 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!898 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!900 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !903)
!902 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!903 = !{!105, !108, !110, !113}
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!905 = !DIFile(filename: "./lib/hash-pjw.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!907 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!909 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !854)
!911 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !854)
!913 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269)
!915 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!916 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!917 = !{i32 2, !"Dwarf Version", i32 4}
!918 = !{i32 2, !"Debug Info Version", i32 3}
!919 = !{i32 1, !"PIC Level", i32 2}
!920 = !{i32 1, !"PIE Level", i32 2}
!921 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1449, type: !922, isLocal: false, isDefinition: true, scopeLine: 1450, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !115}
!924 = !{!925}
!925 = !DILocalVariable(name: "status", arg: 1, scope: !921, file: !3, line: 1449, type: !115)
!926 = !DIExpression()
!927 = !DILocation(line: 1449, column: 12, scope: !921)
!928 = !DILocation(line: 1451, column: 14, scope: !929)
!929 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1451, column: 7)
!930 = !DILocation(line: 1451, column: 7, scope: !921)
!931 = !DILocation(line: 1452, column: 5, scope: !932)
!932 = !DILexicalBlockFile(scope: !933, file: !3, discriminator: 1)
!933 = distinct !DILexicalBlock(scope: !929, file: !3, line: 1452, column: 5)
!934 = !{!935, !935, i64 0}
!935 = !{!"any pointer", !936, i64 0}
!936 = !{!"omnipotent char", !937, i64 0}
!937 = !{!"Simple C/C++ TBAA"}
!938 = !DILocation(line: 1452, column: 5, scope: !939)
!939 = !DILexicalBlockFile(scope: !933, file: !3, discriminator: 3)
!940 = !DILocation(line: 1452, column: 5, scope: !941)
!941 = !DILexicalBlockFile(scope: !933, file: !3, discriminator: 2)
!942 = !DILocation(line: 1455, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !929, file: !3, line: 1454, column: 5)
!944 = !DILocation(line: 1455, column: 7, scope: !945)
!945 = !DILexicalBlockFile(scope: !943, file: !3, discriminator: 1)
!946 = !DILocation(line: 1456, column: 7, scope: !943)
!947 = !DILocation(line: 1456, column: 7, scope: !945)
!948 = !DILocation(line: 587, column: 3, scope: !949, inlinedAt: !950)
!949 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !185, file: !185, line: 585, type: !429, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !269)
!950 = distinct !DILocation(line: 1461, column: 7, scope: !943)
!951 = !DILocation(line: 587, column: 3, scope: !952, inlinedAt: !950)
!952 = !DILexicalBlockFile(scope: !949, file: !185, discriminator: 1)
!953 = !DILocation(line: 1465, column: 7, scope: !943)
!954 = !DILocation(line: 1465, column: 7, scope: !945)
!955 = !DILocation(line: 1473, column: 7, scope: !943)
!956 = !DILocation(line: 1473, column: 7, scope: !945)
!957 = !DILocation(line: 1480, column: 7, scope: !943)
!958 = !DILocation(line: 1480, column: 7, scope: !945)
!959 = !DILocation(line: 1486, column: 7, scope: !943)
!960 = !DILocation(line: 1486, column: 7, scope: !945)
!961 = !DILocation(line: 1490, column: 7, scope: !943)
!962 = !DILocation(line: 1490, column: 7, scope: !945)
!963 = !DILocation(line: 1496, column: 7, scope: !943)
!964 = !DILocation(line: 1496, column: 7, scope: !945)
!965 = !DILocation(line: 1497, column: 7, scope: !943)
!966 = !DILocation(line: 1497, column: 7, scope: !945)
!967 = !DILocation(line: 604, column: 3, scope: !968, inlinedAt: !971)
!968 = distinct !DISubprogram(name: "emit_blocksize_note", scope: !185, file: !185, line: 602, type: !186, isLocal: true, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !969)
!969 = !{!970}
!970 = !DILocalVariable(name: "program", arg: 1, scope: !968, file: !185, line: 602, type: !113)
!971 = distinct !DILocation(line: 1498, column: 7, scope: !943)
!972 = !DILocation(line: 604, column: 3, scope: !973, inlinedAt: !971)
!973 = !DILexicalBlockFile(scope: !968, file: !185, discriminator: 1)
!974 = !DILocation(line: 595, column: 3, scope: !975, inlinedAt: !976)
!975 = distinct !DISubprogram(name: "emit_size_note", scope: !185, file: !185, line: 593, type: !429, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !269)
!976 = distinct !DILocation(line: 1499, column: 7, scope: !943)
!977 = !DILocation(line: 595, column: 3, scope: !978, inlinedAt: !976)
!978 = !DILexicalBlockFile(scope: !975, file: !185, discriminator: 1)
!979 = !DILocation(line: 1500, column: 7, scope: !943)
!980 = !DILocation(line: 1500, column: 7, scope: !945)
!981 = !DILocation(line: 642, column: 15, scope: !184, inlinedAt: !982)
!982 = distinct !DILocation(line: 1505, column: 7, scope: !943)
!983 = !DILocation(line: 651, column: 3, scope: !184, inlinedAt: !982)
!984 = !DILocation(line: 651, column: 3, scope: !985, inlinedAt: !982)
!985 = !DILexicalBlockFile(scope: !184, file: !185, discriminator: 1)
!986 = !DILocation(line: 655, column: 29, scope: !184, inlinedAt: !982)
!987 = !DILocation(line: 655, column: 15, scope: !184, inlinedAt: !982)
!988 = !DILocation(line: 656, column: 7, scope: !204, inlinedAt: !982)
!989 = !DILocation(line: 656, column: 19, scope: !204, inlinedAt: !982)
!990 = !DILocation(line: 656, column: 22, scope: !991, inlinedAt: !982)
!991 = !DILexicalBlockFile(scope: !204, file: !185, discriminator: 16)
!992 = !DILocation(line: 656, column: 7, scope: !993, inlinedAt: !982)
!993 = !DILexicalBlockFile(scope: !184, file: !185, discriminator: 16)
!994 = !DILocation(line: 662, column: 7, scope: !995, inlinedAt: !982)
!995 = distinct !DILexicalBlock(scope: !204, file: !185, line: 657, column: 5)
!996 = !DILocation(line: 662, column: 7, scope: !997, inlinedAt: !982)
!997 = !DILexicalBlockFile(scope: !995, file: !185, discriminator: 1)
!998 = !DILocation(line: 664, column: 5, scope: !995, inlinedAt: !982)
!999 = !DILocation(line: 665, column: 3, scope: !184, inlinedAt: !982)
!1000 = !DILocation(line: 665, column: 3, scope: !985, inlinedAt: !982)
!1001 = !DILocation(line: 667, column: 3, scope: !184, inlinedAt: !982)
!1002 = !DILocation(line: 667, column: 3, scope: !985, inlinedAt: !982)
!1003 = !DILocation(line: 1507, column: 3, scope: !921)
!1004 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1511, type: !1005, isLocal: false, isDefinition: true, scopeLine: 1512, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1007)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!115, !115, !256}
!1007 = !{!1008, !1009, !1010, !1047, !1048, !1049, !1051, !1052, !1055, !1057, !1058, !1062, !1068, !1069, !1072, !1076, !1079, !1080}
!1008 = !DILocalVariable(name: "argc", arg: 1, scope: !1004, file: !3, line: 1511, type: !115)
!1009 = !DILocalVariable(name: "argv", arg: 2, scope: !1004, file: !3, line: 1511, type: !256)
!1010 = !DILocalVariable(name: "stats", scope: !1004, file: !3, line: 1513, type: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1013, line: 46, size: 1152, elements: !1014)
!1013 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1014 = !{!1015, !1016, !1018, !1020, !1022, !1024, !1026, !1027, !1028, !1031, !1033, !1035, !1043, !1044, !1045}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1012, file: !1013, line: 48, baseType: !119, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1012, file: !1013, line: 53, baseType: !1017, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !120, line: 136, baseType: !107)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1012, file: !1013, line: 61, baseType: !1019, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !120, line: 139, baseType: !107)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1012, file: !1013, line: 62, baseType: !1021, size: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !120, line: 138, baseType: !162)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1012, file: !1013, line: 64, baseType: !1023, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !120, line: 134, baseType: !162)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1012, file: !1013, line: 65, baseType: !1025, size: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !120, line: 135, baseType: !162)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1012, file: !1013, line: 67, baseType: !115, size: 32, offset: 288)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1012, file: !1013, line: 69, baseType: !119, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1012, file: !1013, line: 74, baseType: !1029, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !120, line: 140, baseType: !1030)
!1030 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1012, file: !1013, line: 78, baseType: !1032, size: 64, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !120, line: 162, baseType: !1030)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1012, file: !1013, line: 80, baseType: !1034, size: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !120, line: 167, baseType: !1030)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1012, file: !1013, line: 91, baseType: !1036, size: 128, offset: 576)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1037, line: 8, size: 128, elements: !1038)
!1037 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1038 = !{!1039, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1036, file: !1037, line: 10, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !120, line: 148, baseType: !1030)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1036, file: !1037, line: 11, baseType: !1042, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !120, line: 184, baseType: !1030)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1012, file: !1013, line: 92, baseType: !1036, size: 128, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1012, file: !1013, line: 93, baseType: !1036, size: 128, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1012, file: !1013, line: 106, baseType: !1046, size: 192, offset: 960)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 192, elements: !315)
!1047 = !DILocalVariable(name: "posix_format", scope: !1004, file: !3, line: 1535, type: !128)
!1048 = !DILocalVariable(name: "msg_mut_excl", scope: !1004, file: !3, line: 1537, type: !113)
!1049 = !DILocalVariable(name: "oi", scope: !1050, file: !3, line: 1541, type: !115)
!1050 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1540, column: 5)
!1051 = !DILocalVariable(name: "c", scope: !1050, file: !3, line: 1542, type: !115)
!1052 = !DILocalVariable(name: "e", scope: !1053, file: !3, line: 1554, type: !5)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1553, column: 11)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 1548, column: 9)
!1055 = !DILocalVariable(name: "match", scope: !1056, file: !3, line: 1677, type: !128)
!1056 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1676, column: 3)
!1057 = !DILocalVariable(name: "fs_incl", scope: !1056, file: !3, line: 1678, type: !145)
!1058 = !DILocalVariable(name: "fs_excl", scope: !1059, file: !3, line: 1681, type: !145)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 1680, column: 7)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 1679, column: 5)
!1061 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1679, column: 5)
!1062 = !DILocalVariable(name: "__s1_len", scope: !1063, file: !3, line: 1684, type: !105)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1684, column: 17)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1684, column: 17)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 1683, column: 11)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 1682, column: 9)
!1067 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 1682, column: 9)
!1068 = !DILocalVariable(name: "__s2_len", scope: !1063, file: !3, line: 1684, type: !105)
!1069 = !DILocalVariable(name: "i", scope: !1070, file: !3, line: 1702, type: !115)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 1701, column: 5)
!1071 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1700, column: 7)
!1072 = !DILocalVariable(name: "fd", scope: !1073, file: !3, line: 1712, type: !115)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 1709, column: 9)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 1708, column: 7)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 1708, column: 7)
!1076 = !DILocalVariable(name: "status", scope: !1077, file: !3, line: 1738, type: !115)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 1733, column: 5)
!1078 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1732, column: 7)
!1079 = !DILocalVariable(name: "warning", scope: !1077, file: !3, line: 1747, type: !113)
!1080 = !DILocalVariable(name: "i", scope: !1081, file: !3, line: 1760, type: !115)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 1759, column: 5)
!1082 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1758, column: 7)
!1083 = !DILocalVariable(name: "buf", scope: !1084, file: !3, line: 519, type: !1107)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 518, column: 9)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 514, column: 11)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 510, column: 5)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 509, column: 3)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 509, column: 3)
!1089 = distinct !DISubprogram(name: "get_header", scope: !3, file: !3, line: 503, type: !429, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1090)
!1090 = !{!1091, !1092, !1093, !1083, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1106}
!1091 = !DILocalVariable(name: "col", scope: !1089, file: !3, line: 505, type: !105)
!1092 = !DILocalVariable(name: "cell", scope: !1086, file: !3, line: 511, type: !102)
!1093 = !DILocalVariable(name: "header", scope: !1086, file: !3, line: 512, type: !113)
!1094 = !DILocalVariable(name: "opts", scope: !1084, file: !3, line: 521, type: !115)
!1095 = !DILocalVariable(name: "q1000", scope: !1084, file: !3, line: 529, type: !121)
!1096 = !DILocalVariable(name: "q1024", scope: !1084, file: !3, line: 530, type: !121)
!1097 = !DILocalVariable(name: "divisible_by_1000", scope: !1084, file: !3, line: 531, type: !128)
!1098 = !DILocalVariable(name: "divisible_by_1024", scope: !1084, file: !3, line: 532, type: !128)
!1099 = !DILocalVariable(name: "num", scope: !1084, file: !3, line: 548, type: !102)
!1100 = !DILocalVariable(name: "buf", scope: !1101, file: !3, line: 559, type: !1103)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 558, column: 9)
!1102 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 557, column: 16)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 168, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 21)
!1106 = !DILocalVariable(name: "num", scope: !1101, file: !3, line: 560, type: !102)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 5216, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 652)
!1110 = !DILocation(line: 519, column: 16, scope: !1084, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 1756, column: 3, scope: !1004)
!1112 = !DILocation(line: 559, column: 16, scope: !1101, inlinedAt: !1111)
!1113 = !DILocation(line: 1511, column: 11, scope: !1004)
!1114 = !DILocation(line: 1511, column: 24, scope: !1004)
!1115 = !DILocation(line: 1516, column: 21, scope: !1004)
!1116 = !DILocation(line: 1516, column: 3, scope: !1004)
!1117 = !DILocation(line: 1517, column: 3, scope: !1004)
!1118 = !DILocation(line: 1518, column: 3, scope: !1004)
!1119 = !DILocation(line: 1519, column: 3, scope: !1004)
!1120 = !DILocation(line: 1521, column: 3, scope: !1004)
!1121 = !DILocation(line: 1523, column: 18, scope: !1004)
!1122 = !DILocation(line: 1524, column: 19, scope: !1004)
!1123 = !DILocation(line: 1527, column: 21, scope: !1004)
!1124 = !{!1125, !1125, i64 0}
!1125 = !{!"int", !936, i64 0}
!1126 = !DILocation(line: 1532, column: 27, scope: !1004)
!1127 = !{!1128, !1129, i64 0}
!1128 = !{!"fs_usage", !1129, i64 0, !1129, i64 8, !1129, i64 16, !1129, i64 24, !1130, i64 32, !1129, i64 40, !1129, i64 48}
!1129 = !{!"long", !936, i64 0}
!1130 = !{!"_Bool", !936, i64 0}
!1131 = !DILocation(line: 1535, column: 8, scope: !1004)
!1132 = !DILocation(line: 1537, column: 30, scope: !1004)
!1133 = !DILocation(line: 1537, column: 15, scope: !1004)
!1134 = !DILocation(line: 1539, column: 3, scope: !1004)
!1135 = !DILocation(line: 1541, column: 7, scope: !1050)
!1136 = !DILocation(line: 1541, column: 11, scope: !1050)
!1137 = !DIExpression(DW_OP_deref)
!1138 = !DILocation(line: 1542, column: 15, scope: !1050)
!1139 = !DILocation(line: 1542, column: 11, scope: !1050)
!1140 = !DILocation(line: 1544, column: 11, scope: !1050)
!1141 = !DILocation(line: 1551, column: 11, scope: !1054)
!1142 = !DILocation(line: 1554, column: 50, scope: !1053)
!1143 = !DILocation(line: 1554, column: 35, scope: !1053)
!1144 = !DILocation(line: 1554, column: 31, scope: !1053)
!1145 = !DILocation(line: 1556, column: 19, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 1556, column: 17)
!1147 = !DILocation(line: 1556, column: 17, scope: !1053)
!1148 = !DILocation(line: 1557, column: 33, scope: !1146)
!1149 = !DILocation(line: 1557, column: 54, scope: !1146)
!1150 = !DILocation(line: 1557, column: 15, scope: !1146)
!1151 = !DILocation(line: 1561, column: 15, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1561, column: 15)
!1153 = !DILocation(line: 1561, column: 27, scope: !1152)
!1154 = !DILocation(line: 1561, column: 15, scope: !1054)
!1155 = !DILocation(line: 1563, column: 15, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 1562, column: 13)
!1157 = !DILocation(line: 1564, column: 15, scope: !1156)
!1158 = !DILocation(line: 1566, column: 23, scope: !1054)
!1159 = !DILocation(line: 1567, column: 11, scope: !1054)
!1160 = !DILocation(line: 1569, column: 29, scope: !1054)
!1161 = !DILocation(line: 1570, column: 29, scope: !1054)
!1162 = !{!1129, !1129, i64 0}
!1163 = !DILocation(line: 1571, column: 11, scope: !1054)
!1164 = !DILocation(line: 1573, column: 29, scope: !1054)
!1165 = !DILocation(line: 1574, column: 29, scope: !1054)
!1166 = !DILocation(line: 1575, column: 11, scope: !1054)
!1167 = !DILocation(line: 1577, column: 29, scope: !1054)
!1168 = !DILocation(line: 1578, column: 29, scope: !1054)
!1169 = !DILocation(line: 1579, column: 11, scope: !1054)
!1170 = !DILocation(line: 1582, column: 11, scope: !1054)
!1171 = !DILocation(line: 1584, column: 29, scope: !1054)
!1172 = !DILocation(line: 1585, column: 29, scope: !1054)
!1173 = !DILocation(line: 1586, column: 11, scope: !1054)
!1174 = !DILocation(line: 1588, column: 15, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1588, column: 15)
!1176 = !DILocation(line: 1588, column: 27, scope: !1175)
!1177 = !DILocation(line: 1588, column: 15, scope: !1054)
!1178 = !DILocation(line: 1590, column: 15, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1589, column: 13)
!1180 = !DILocation(line: 1591, column: 15, scope: !1179)
!1181 = !DILocation(line: 1594, column: 11, scope: !1054)
!1182 = !DILocation(line: 1596, column: 15, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1596, column: 15)
!1184 = !DILocation(line: 1596, column: 27, scope: !1183)
!1185 = !DILocation(line: 1596, column: 15, scope: !1054)
!1186 = !DILocation(line: 1598, column: 15, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 1597, column: 13)
!1188 = !DILocation(line: 1599, column: 15, scope: !1187)
!1189 = !DILocation(line: 1605, column: 11, scope: !1054)
!1190 = !DILocation(line: 1608, column: 11, scope: !1054)
!1191 = !DILocation(line: 1613, column: 24, scope: !1054)
!1192 = !DILocation(line: 1429, column: 9, scope: !1193, inlinedAt: !1197)
!1193 = distinct !DISubprogram(name: "add_fs_type", scope: !3, file: !3, line: 1425, type: !186, isLocal: true, isDefinition: true, scopeLine: 1426, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1194)
!1194 = !{!1195, !1196}
!1195 = !DILocalVariable(name: "fstype", arg: 1, scope: !1193, file: !3, line: 1425, type: !113)
!1196 = !DILocalVariable(name: "fsp", scope: !1193, file: !3, line: 1427, type: !145)
!1197 = distinct !DILocation(line: 1613, column: 11, scope: !1054)
!1198 = !DILocation(line: 1430, column: 16, scope: !1193, inlinedAt: !1197)
!1199 = !{!1200, !935, i64 0}
!1200 = !{!"fs_type_list", !935, i64 0, !935, i64 8}
!1201 = !DILocation(line: 1431, column: 18, scope: !1193, inlinedAt: !1197)
!1202 = !DILocation(line: 1431, column: 8, scope: !1193, inlinedAt: !1197)
!1203 = !DILocation(line: 1431, column: 16, scope: !1193, inlinedAt: !1197)
!1204 = !{!1200, !935, i64 8}
!1205 = !DILocation(line: 1432, column: 18, scope: !1193, inlinedAt: !1197)
!1206 = !DILocation(line: 1614, column: 11, scope: !1054)
!1207 = !DILocation(line: 1620, column: 33, scope: !1054)
!1208 = !DILocation(line: 1442, column: 9, scope: !1209, inlinedAt: !1213)
!1209 = distinct !DISubprogram(name: "add_excluded_fs_type", scope: !3, file: !3, line: 1438, type: !186, isLocal: true, isDefinition: true, scopeLine: 1439, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1210)
!1210 = !{!1211, !1212}
!1211 = !DILocalVariable(name: "fstype", arg: 1, scope: !1209, file: !3, line: 1438, type: !113)
!1212 = !DILocalVariable(name: "fsp", scope: !1209, file: !3, line: 1440, type: !145)
!1213 = distinct !DILocation(line: 1620, column: 11, scope: !1054)
!1214 = !DILocation(line: 1443, column: 16, scope: !1209, inlinedAt: !1213)
!1215 = !DILocation(line: 1444, column: 18, scope: !1209, inlinedAt: !1213)
!1216 = !DILocation(line: 1444, column: 8, scope: !1209, inlinedAt: !1213)
!1217 = !DILocation(line: 1444, column: 16, scope: !1209, inlinedAt: !1213)
!1218 = !DILocation(line: 1445, column: 19, scope: !1209, inlinedAt: !1213)
!1219 = !DILocation(line: 1621, column: 11, scope: !1054)
!1220 = !DILocation(line: 1624, column: 15, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1624, column: 15)
!1222 = !DILocation(line: 1624, column: 27, scope: !1221)
!1223 = !DILocation(line: 1624, column: 15, scope: !1054)
!1224 = !DILocation(line: 1626, column: 15, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 1625, column: 13)
!1226 = !DILocation(line: 1627, column: 15, scope: !1225)
!1227 = !DILocation(line: 1629, column: 15, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1629, column: 15)
!1229 = !DILocation(line: 1629, column: 43, scope: !1230)
!1230 = !DILexicalBlockFile(scope: !1228, file: !3, discriminator: 1)
!1231 = !DILocation(line: 1629, column: 28, scope: !1228)
!1232 = !DILocation(line: 1631, column: 15, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 1630, column: 13)
!1234 = !DILocation(line: 1632, column: 15, scope: !1233)
!1235 = !DILocation(line: 1634, column: 15, scope: !1054)
!1236 = !DILocation(line: 1636, column: 15, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 1635, column: 13)
!1238 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1634, column: 15)
!1239 = !DILocation(line: 1637, column: 15, scope: !1237)
!1240 = !DILocation(line: 1639, column: 23, scope: !1054)
!1241 = !DILocation(line: 1640, column: 15, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1640, column: 15)
!1243 = !DILocation(line: 1640, column: 15, scope: !1054)
!1244 = !DILocation(line: 1641, column: 13, scope: !1242)
!1245 = !DILocation(line: 1646, column: 11, scope: !1054)
!1246 = !DILocation(line: 1648, column: 9, scope: !1054)
!1247 = !DILocation(line: 1649, column: 9, scope: !1054)
!1248 = !DILocation(line: 1649, column: 9, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1054, file: !3, discriminator: 1)
