; ModuleID = 'coreutils-8.27/src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.timespec*, i8, i8, i8 }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !63)
!3 = !DIFile(filename: "src/rm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11, !16, !30, !36}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !6, line: 23, size: 32, elements: !7)
!6 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "RMI_ALWAYS", value: 3)
!9 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4)
!10 = !DIEnumerator(name: "RMI_NEVER", value: 5)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "interactive_type", file: !3, line: 56, size: 32, elements: !12)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "interactive_never", value: 0)
!14 = !DIEnumerator(name: "interactive_once", value: 1)
!15 = !DIEnumerator(name: "interactive_always", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !17, line: 32, size: 32, elements: !18)
!17 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!19 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!20 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!21 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!22 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!23 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!24 = !DIEnumerator(name: "c_quoting_style", value: 5)
!25 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!26 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!27 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!28 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!29 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 74, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "RM_OK", value: 2)
!33 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3)
!34 = !DIEnumerator(name: "RM_ERROR", value: 4)
!35 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !38, file: !37, line: 187, size: 32, elements: !48)
!37 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = distinct !DISubprogram(name: "select_plural", scope: !37, file: !37, line: 183, type: !39, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !46)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42}
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !43, line: 136, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !45, line: 62, baseType: !41)
!45 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!46 = !{!47}
!47 = !DILocalVariable(name: "n", arg: 1, scope: !38, file: !37, line: 183, type: !42)
!48 = !{!49}
!49 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!50 = !{!51, !54, !56, !58, !61, !62}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 62, baseType: !41)
!55 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !{!64, !115, !0, !144, !150}
!64 = !DIGlobalVariableExpression(var: !65)
!65 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !66, file: !3, line: 330, type: !86, isLocal: true, isDefinition: true)
!66 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 205, type: !67, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !71)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !69, !70}
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!71 = !{!72, !73, !74, !76, !99, !100, !101, !105, !108, !109, !111, !112, !113, !114}
!72 = !DILocalVariable(name: "argc", arg: 1, scope: !66, file: !3, line: 205, type: !69)
!73 = !DILocalVariable(name: "argv", arg: 2, scope: !66, file: !3, line: 205, type: !70)
!74 = !DILocalVariable(name: "preserve_root", scope: !66, file: !3, line: 207, type: !75)
!75 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!76 = !DILocalVariable(name: "x", scope: !66, file: !3, line: 208, type: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !96, !97, !98}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !77, file: !6, line: 35, baseType: !75, size: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !77, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !77, file: !6, line: 47, baseType: !75, size: 8, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !77, file: !6, line: 50, baseType: !75, size: 8, offset: 72)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !77, file: !6, line: 53, baseType: !75, size: 8, offset: 80)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !77, file: !6, line: 57, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !87, line: 7, size: 128, elements: !88)
!87 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !{!89, !93}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 9, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !91, line: 48, baseType: !92)
!91 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !45, line: 136, baseType: !41)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 10, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !91, line: 60, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !45, line: 133, baseType: !41)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !77, file: !6, line: 60, baseType: !75, size: 8, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !77, file: !6, line: 63, baseType: !75, size: 8, offset: 200)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !77, file: !6, line: 71, baseType: !75, size: 8, offset: 208)
!99 = !DILocalVariable(name: "prompt_once", scope: !66, file: !3, line: 209, type: !75)
!100 = !DILocalVariable(name: "c", scope: !66, file: !3, line: 210, type: !69)
!101 = !DILocalVariable(name: "i", scope: !102, file: !3, line: 258, type: !69)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 257, column: 11)
!103 = distinct !DILexicalBlock(scope: !104, file: !3, line: 228, column: 9)
!104 = distinct !DILexicalBlock(scope: !66, file: !3, line: 226, column: 5)
!105 = !DILocalVariable(name: "__s1_len", scope: !106, file: !3, line: 291, type: !54)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 291, column: 17)
!107 = distinct !DILexicalBlock(scope: !103, file: !3, line: 291, column: 15)
!108 = !DILocalVariable(name: "__s2_len", scope: !106, file: !3, line: 291, type: !54)
!109 = !DILocalVariable(name: "__s2", scope: !110, file: !3, line: 291, type: !58)
!110 = distinct !DILexicalBlock(scope: !106, file: !3, line: 291, column: 17)
!111 = !DILocalVariable(name: "__result", scope: !110, file: !3, line: 291, type: !69)
!112 = !DILocalVariable(name: "n_files", scope: !66, file: !3, line: 337, type: !42)
!113 = !DILocalVariable(name: "file", scope: !66, file: !3, line: 338, type: !70)
!114 = !DILocalVariable(name: "status", scope: !66, file: !3, line: 355, type: !30)
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "infomap", scope: !117, file: !37, line: 632, type: !141, isLocal: true, isDefinition: true)
!117 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !37, file: !37, line: 630, type: !118, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !51}
!120 = !{!121, !122, !123, !130, !132, !133, !134, !137, !138, !140}
!121 = !DILocalVariable(name: "program", arg: 1, scope: !117, file: !37, line: 630, type: !51)
!122 = !DILocalVariable(name: "node", scope: !117, file: !37, line: 642, type: !51)
!123 = !DILocalVariable(name: "map_prog", scope: !117, file: !37, line: 643, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !117, file: !37, line: 632, size: 128, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !126, file: !37, line: 632, baseType: !51, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !126, file: !37, line: 632, baseType: !51, size: 64, offset: 64)
!130 = !DILocalVariable(name: "__s1_len", scope: !131, file: !37, line: 645, type: !54)
!131 = distinct !DILexicalBlock(scope: !117, file: !37, line: 645, column: 33)
!132 = !DILocalVariable(name: "__s2_len", scope: !131, file: !37, line: 645, type: !54)
!133 = !DILocalVariable(name: "lc_messages", scope: !117, file: !37, line: 655, type: !51)
!134 = !DILocalVariable(name: "__s1_len", scope: !135, file: !37, line: 656, type: !54)
!135 = distinct !DILexicalBlock(scope: !136, file: !37, line: 656, column: 22)
!136 = distinct !DILexicalBlock(scope: !117, file: !37, line: 656, column: 7)
!137 = !DILocalVariable(name: "__s2_len", scope: !135, file: !37, line: 656, type: !54)
!138 = !DILocalVariable(name: "__s2", scope: !139, file: !37, line: 656, type: !58)
!139 = distinct !DILexicalBlock(scope: !135, file: !37, line: 656, column: 22)
!140 = !DILocalVariable(name: "__result", scope: !139, file: !37, line: 656, type: !69)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 896, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 7)
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 92, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 192, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!148 = !{!149}
!149 = !DISubrange(count: 6)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 86, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 448, elements: !142)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 3072, elements: !164)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !157, line: 104, size: 256, elements: !158)
!157 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = !{!159, !160, !161, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 106, baseType: !51, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !156, file: !157, line: 109, baseType: !69, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !156, file: !157, line: 110, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !156, file: !157, line: 111, baseType: !69, size: 32, offset: 192)
!164 = !{!165}
!165 = !DISubrange(count: 12)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "Version", scope: !168, file: !169, line: 2, type: !51, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !171)
!169 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!170 = !{}
!171 = !{!166}
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !174, file: !179, line: 69, type: !180, isLocal: false, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !177, globals: !178)
!175 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !{!16}
!177 = !{!54, !62, !60}
!178 = !{!172}
!179 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !181, line: 55, baseType: !182)
!181 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null}
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "file_name", scope: !187, file: !190, line: 37, type: !51, isLocal: true, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !189)
!188 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !{!185}
!190 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "file_name", scope: !193, file: !198, line: 36, type: !51, isLocal: true, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !195)
!194 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!195 = !{!191, !196}
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !193, file: !198, line: 46, type: !75, isLocal: true, isDefinition: true)
!198 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "exit_failure", scope: !201, file: !204, line: 24, type: !205, isLocal: false, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !203)
!202 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !{!199}
!204 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!205 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "program_name", scope: !208, file: !212, line: 33, type: !51, isLocal: false, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !210, globals: !211)
!209 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!210 = !{!62, !61}
!211 = !{!206}
!212 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !215, file: !243, line: 77, type: !279, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !217, retainedTypes: !238, globals: !240)
!216 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!217 = !{!16, !218, !223}
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !17, line: 242, size: 32, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!221 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!222 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !224, line: 46, size: 32, elements: !225)
!224 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!226 = !DIEnumerator(name: "_ISupper", value: 256)
!227 = !DIEnumerator(name: "_ISlower", value: 512)
!228 = !DIEnumerator(name: "_ISalpha", value: 1024)
!229 = !DIEnumerator(name: "_ISdigit", value: 2048)
!230 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!231 = !DIEnumerator(name: "_ISspace", value: 8192)
!232 = !DIEnumerator(name: "_ISprint", value: 16384)
!233 = !DIEnumerator(name: "_ISgraph", value: 32768)
!234 = !DIEnumerator(name: "_ISblank", value: 1)
!235 = !DIEnumerator(name: "_IScntrl", value: 2)
!236 = !DIEnumerator(name: "_ISpunct", value: 4)
!237 = !DIEnumerator(name: "_ISalnum", value: 8)
!238 = !{!69, !239, !54, !61}
!239 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!240 = !{!213, !241, !248, !261, !263, !268, !275, !277}
!241 = !DIGlobalVariableExpression(var: !242)
!242 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !215, file: !243, line: 93, type: !244, isLocal: false, isDefinition: true)
!243 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 320, elements: !246)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!246 = !{!247}
!247 = !DISubrange(count: 10)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !215, file: !243, line: 1043, type: !250, isLocal: false, isDefinition: true)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !243, line: 57, size: 448, elements: !251)
!251 = !{!252, !253, !254, !259, !260}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !250, file: !243, line: 60, baseType: !16, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !250, file: !243, line: 63, baseType: !69, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !250, file: !243, line: 67, baseType: !255, size: 256, offset: 64)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 256, elements: !257)
!256 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!257 = !{!258}
!258 = !DISubrange(count: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !250, file: !243, line: 70, baseType: !51, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !250, file: !243, line: 73, baseType: !51, size: 64, offset: 384)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !215, file: !243, line: 108, type: !250, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "slot0", scope: !215, file: !243, line: 834, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "slotvec", scope: !215, file: !243, line: 837, type: !270, isLocal: true, isDefinition: true)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !243, line: 826, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !243, line: 828, baseType: !54, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !243, line: 829, baseType: !61, size: 64, offset: 64)
!275 = !DIGlobalVariableExpression(var: !276)
!276 = distinct !DIGlobalVariable(name: "nslots", scope: !215, file: !243, line: 835, type: !69, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278)
!278 = distinct !DIGlobalVariable(name: "slotvec0", scope: !215, file: !243, line: 836, type: !271, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 704, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 11)
!282 = !DIGlobalVariableExpression(var: !283)
!283 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !284, file: !287, line: 26, type: !288, isLocal: false, isDefinition: true)
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !286)
!285 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!286 = !{!282}
!287 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 47)
!291 = !DIGlobalVariableExpression(var: !292)
!292 = distinct !DIGlobalVariable(name: "can_write", scope: !293, file: !294, line: 35, type: !75, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "can_write_any_file", scope: !294, file: !294, line: 32, type: !295, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !297, variables: !302)
!294 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!295 = !DISubroutineType(types: !296)
!296 = !{!75}
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !299)
!298 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!299 = !{!300, !291}
!300 = !DIGlobalVariableExpression(var: !301)
!301 = distinct !DIGlobalVariable(name: "initialized", scope: !293, file: !294, line: 34, type: !75, isLocal: true, isDefinition: true)
!302 = !{!303}
!303 = !DILocalVariable(name: "can", scope: !304, file: !294, line: 39, type: !75)
!304 = distinct !DILexicalBlock(scope: !305, file: !294, line: 38, column: 5)
!305 = distinct !DILexicalBlock(scope: !293, file: !294, line: 37, column: 7)
!306 = !DIGlobalVariableExpression(var: !307)
!307 = distinct !DIGlobalVariable(name: "default_tuning", scope: !308, file: !312, line: 130, type: !313, isLocal: true, isDefinition: true)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !310, globals: !311)
!309 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!310 = !{!41, !62, !54}
!311 = !{!306}
!312 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !315, line: 65, baseType: !316)
!315 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !315, line: 53, size: 160, elements: !317)
!317 = !{!318, !320, !321, !322, !323}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !316, file: !315, line: 58, baseType: !319, size: 32)
!319 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !316, file: !315, line: 59, baseType: !319, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !316, file: !315, line: 60, baseType: !319, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !316, file: !315, line: 61, baseType: !319, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !316, file: !315, line: 62, baseType: !75, size: 8, offset: 128)
!324 = !DIGlobalVariableExpression(var: !325)
!325 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !326, file: !670, line: 120, type: !671, isLocal: true, isDefinition: true)
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !328, retainedTypes: !667, globals: !669)
!327 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!328 = !{!329}
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !330, line: 41, size: 32, elements: !331)
!330 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!332 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!333 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!334 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!335 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!336 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!337 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!338 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!339 = !DIEnumerator(name: "DAY_1", value: 131079)
!340 = !DIEnumerator(name: "DAY_2", value: 131080)
!341 = !DIEnumerator(name: "DAY_3", value: 131081)
!342 = !DIEnumerator(name: "DAY_4", value: 131082)
!343 = !DIEnumerator(name: "DAY_5", value: 131083)
!344 = !DIEnumerator(name: "DAY_6", value: 131084)
!345 = !DIEnumerator(name: "DAY_7", value: 131085)
!346 = !DIEnumerator(name: "ABMON_1", value: 131086)
!347 = !DIEnumerator(name: "ABMON_2", value: 131087)
!348 = !DIEnumerator(name: "ABMON_3", value: 131088)
!349 = !DIEnumerator(name: "ABMON_4", value: 131089)
!350 = !DIEnumerator(name: "ABMON_5", value: 131090)
!351 = !DIEnumerator(name: "ABMON_6", value: 131091)
!352 = !DIEnumerator(name: "ABMON_7", value: 131092)
!353 = !DIEnumerator(name: "ABMON_8", value: 131093)
!354 = !DIEnumerator(name: "ABMON_9", value: 131094)
!355 = !DIEnumerator(name: "ABMON_10", value: 131095)
!356 = !DIEnumerator(name: "ABMON_11", value: 131096)
!357 = !DIEnumerator(name: "ABMON_12", value: 131097)
!358 = !DIEnumerator(name: "MON_1", value: 131098)
!359 = !DIEnumerator(name: "MON_2", value: 131099)
!360 = !DIEnumerator(name: "MON_3", value: 131100)
!361 = !DIEnumerator(name: "MON_4", value: 131101)
!362 = !DIEnumerator(name: "MON_5", value: 131102)
!363 = !DIEnumerator(name: "MON_6", value: 131103)
!364 = !DIEnumerator(name: "MON_7", value: 131104)
!365 = !DIEnumerator(name: "MON_8", value: 131105)
!366 = !DIEnumerator(name: "MON_9", value: 131106)
!367 = !DIEnumerator(name: "MON_10", value: 131107)
!368 = !DIEnumerator(name: "MON_11", value: 131108)
!369 = !DIEnumerator(name: "MON_12", value: 131109)
!370 = !DIEnumerator(name: "AM_STR", value: 131110)
!371 = !DIEnumerator(name: "PM_STR", value: 131111)
!372 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!373 = !DIEnumerator(name: "D_FMT", value: 131113)
!374 = !DIEnumerator(name: "T_FMT", value: 131114)
!375 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!376 = !DIEnumerator(name: "ERA", value: 131116)
!377 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!378 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!379 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!380 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!381 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!382 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!383 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!384 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!385 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!386 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!387 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!388 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!389 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!390 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!391 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!392 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!393 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!394 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!395 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!396 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!397 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!398 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!399 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!400 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!401 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!402 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!403 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!404 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!405 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!406 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!407 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!408 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!409 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!410 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!411 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!412 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!413 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!414 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!415 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!416 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!417 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!418 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!419 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!420 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!421 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!422 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!423 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!424 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!425 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!426 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!427 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!428 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!429 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!430 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!431 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!432 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!433 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!434 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!435 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!436 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!437 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!438 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!439 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!440 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!441 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!442 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!443 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!444 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!445 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!446 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!447 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!448 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!449 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!450 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!451 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!452 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!453 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!454 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!455 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!456 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!457 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!458 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!459 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!460 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!461 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!462 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!463 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!464 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!465 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!466 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!467 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!468 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!469 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!470 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!472 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!474 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!475 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!476 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!477 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!478 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!479 = !DIEnumerator(name: "CODESET", value: 14)
!480 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!481 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!482 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!483 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!535 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!536 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!551 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!552 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!553 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!554 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!555 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!556 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!557 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!558 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!559 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!560 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!561 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!562 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!563 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!564 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!565 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!566 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!567 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!568 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!569 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!570 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!571 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!572 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!573 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!590 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!591 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!594 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!595 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!596 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!597 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!598 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!599 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!600 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!601 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!602 = !DIEnumerator(name: "THOUSEP", value: 65537)
!603 = !DIEnumerator(name: "__GROUPING", value: 65538)
!604 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!605 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!606 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!607 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!608 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!609 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!610 = !DIEnumerator(name: "__YESSTR", value: 327682)
!611 = !DIEnumerator(name: "__NOSTR", value: 327683)
!612 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!613 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!614 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!615 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!616 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!617 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!618 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!619 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!620 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!624 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!625 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!626 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!628 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!629 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!634 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!635 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!636 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!637 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!638 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!639 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!640 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!641 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!642 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!643 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!644 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!645 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!646 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!647 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!648 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!665 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!666 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!667 = !{!62, !61, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!669 = !{!324}
!670 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!671 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!672 = !DIGlobalVariableExpression(var: !673)
!673 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !674, file: !675, line: 335, type: !69, isLocal: true, isDefinition: true)
!674 = distinct !DISubprogram(name: "rpl_fcntl", scope: !675, file: !675, line: 272, type: !676, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !678, variables: !681)
!675 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = !DISubroutineType(types: !677)
!677 = !{!69, !69, !69, null}
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, globals: !680)
!679 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!680 = !{!672}
!681 = !{!682, !683, !684, !697, !698, !701, !704, !707}
!682 = !DILocalVariable(name: "fd", arg: 1, scope: !674, file: !675, line: 272, type: !69)
!683 = !DILocalVariable(name: "action", arg: 2, scope: !674, file: !675, line: 272, type: !69)
!684 = !DILocalVariable(name: "arg", scope: !674, file: !675, line: 274, type: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !686, line: 30, baseType: !687)
!686 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !679, line: 274, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 192, elements: !695)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !679, line: 274, size: 192, elements: !690)
!690 = !{!691, !692, !693, !694}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !689, file: !679, line: 274, baseType: !256, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !689, file: !679, line: 274, baseType: !256, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !689, file: !679, line: 274, baseType: !62, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !689, file: !679, line: 274, baseType: !62, size: 64, offset: 128)
!695 = !{!696}
!696 = !DISubrange(count: 1)
!697 = !DILocalVariable(name: "result", scope: !674, file: !675, line: 275, type: !69)
!698 = !DILocalVariable(name: "target", scope: !699, file: !675, line: 322, type: !69)
!699 = distinct !DILexicalBlock(scope: !700, file: !675, line: 321, column: 7)
!700 = distinct !DILexicalBlock(scope: !674, file: !675, line: 278, column: 5)
!701 = !DILocalVariable(name: "flags", scope: !702, file: !675, line: 359, type: !69)
!702 = distinct !DILexicalBlock(scope: !703, file: !675, line: 358, column: 11)
!703 = distinct !DILexicalBlock(scope: !699, file: !675, line: 357, column: 13)
!704 = !DILocalVariable(name: "saved_errno", scope: !705, file: !675, line: 362, type: !69)
!705 = distinct !DILexicalBlock(scope: !706, file: !675, line: 361, column: 15)
!706 = distinct !DILexicalBlock(scope: !702, file: !675, line: 360, column: 17)
!707 = !DILocalVariable(name: "p", scope: !708, file: !675, line: 404, type: !62)
!708 = distinct !DILexicalBlock(scope: !700, file: !675, line: 402, column: 7)
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !711, retainedTypes: !733)
!710 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !{!30, !5, !16, !712, !717, !721}
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !710, line: 34, size: 32, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIEnumerator(name: "T_UNKNOWN", value: 2)
!715 = !DIEnumerator(name: "T_NO", value: 3)
!716 = !DIEnumerator(name: "T_YES", value: 4)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !710, line: 45, size: 32, elements: !718)
!718 = !{!719, !720}
!719 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!720 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 97, size: 32, elements: !723)
!722 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732}
!724 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!725 = !DIEnumerator(name: "DT_FIFO", value: 1)
!726 = !DIEnumerator(name: "DT_CHR", value: 2)
!727 = !DIEnumerator(name: "DT_DIR", value: 4)
!728 = !DIEnumerator(name: "DT_BLK", value: 6)
!729 = !DIEnumerator(name: "DT_REG", value: 8)
!730 = !DIEnumerator(name: "DT_LNK", value: 10)
!731 = !DIEnumerator(name: "DT_SOCK", value: 12)
!732 = !DIEnumerator(name: "DT_WHT", value: 14)
!733 = !{!62, !54, !56, !58, !51, !69}
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !736)
!735 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!736 = !{!61}
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!738 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!740 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !743, retainedTypes: !748)
!742 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!743 = !{!744}
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !745, line: 41, size: 32, elements: !746)
!745 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = !{!747}
!747 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!748 = !{!62}
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !751, retainedTypes: !765)
!750 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!751 = !{!752}
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !754, file: !753, line: 192, size: 32, elements: !763)
!753 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = distinct !DISubprogram(name: "x2nrealloc", scope: !753, file: !753, line: 180, type: !755, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !749, variables: !758)
!755 = !DISubroutineType(types: !756)
!756 = !{!62, !62, !757, !54}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!758 = !{!759, !760, !761, !762}
!759 = !DILocalVariable(name: "p", arg: 1, scope: !754, file: !753, line: 180, type: !62)
!760 = !DILocalVariable(name: "pn", arg: 2, scope: !754, file: !753, line: 180, type: !757)
!761 = !DILocalVariable(name: "s", arg: 3, scope: !754, file: !753, line: 180, type: !54)
!762 = !DILocalVariable(name: "n", scope: !754, file: !753, line: 182, type: !54)
!763 = !{!764}
!764 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!765 = !{!54, !61, !62}
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!767 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !748)
!769 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!771 = !DIFile(filename: "./lib/yesno.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !748)
!773 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !748)
!775 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!777 = !DIFile(filename: "./lib/freadahead.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !748)
!779 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !782, retainedTypes: !926)
!781 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!782 = !{!783, !788, !920, !721, !923}
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !784, line: 160, size: 32, elements: !785)
!784 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!785 = !{!786, !787}
!786 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!787 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !790, file: !789, line: 54, size: 32, elements: !918)
!789 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!790 = distinct !DISubprogram(name: "setup_dir", scope: !789, file: !789, line: 50, type: !791, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !780, variables: !916)
!791 = !DISubroutineType(types: !792)
!792 = !{!75, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !795, line: 199, baseType: !796)
!795 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 80, size: 1024, elements: !797)
!797 = !{!798, !867, !868, !870, !871, !872, !873, !874, !875, !876, !883, !884, !887, !903}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !796, file: !795, line: 81, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !795, line: 201, size: 2112, elements: !801)
!801 = !{!802, !803, !804, !805, !809, !811, !812, !813, !814, !815, !816, !817, !818, !820, !821, !824, !825, !826, !827, !863}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !800, file: !795, line: 202, baseType: !799, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !800, file: !795, line: 203, baseType: !799, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !800, file: !795, line: 204, baseType: !799, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !800, file: !795, line: 205, baseType: !806, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !722, line: 127, baseType: !808)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !722, line: 127, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !800, file: !795, line: 208, baseType: !810, size: 64, offset: 256)
!810 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !800, file: !795, line: 209, baseType: !62, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !800, file: !795, line: 210, baseType: !61, size: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !800, file: !795, line: 211, baseType: !61, size: 64, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !800, file: !795, line: 212, baseType: !69, size: 32, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !800, file: !795, line: 213, baseType: !69, size: 32, offset: 544)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !800, file: !795, line: 214, baseType: !54, size: 64, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !800, file: !795, line: 216, baseType: !793, size: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !800, file: !795, line: 220, baseType: !819, size: 64, offset: 704)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 51, baseType: !810)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !800, file: !795, line: 222, baseType: !54, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !800, file: !795, line: 223, baseType: !822, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !91, line: 75, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !45, line: 139, baseType: !41)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !800, file: !795, line: 239, baseType: !239, size: 16, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !800, file: !795, line: 243, baseType: !239, size: 16, offset: 912)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !800, file: !795, line: 249, baseType: !239, size: 16, offset: 928)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !800, file: !795, line: 251, baseType: !828, size: 1152, offset: 960)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 1152, elements: !695)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !830, line: 46, size: 1152, elements: !831)
!830 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!831 = !{!832, !833, !834, !835, !837, !839, !841, !842, !843, !845, !847, !849, !857, !858, !859}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !829, file: !830, line: 48, baseType: !95, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !829, file: !830, line: 53, baseType: !92, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !829, file: !830, line: 61, baseType: !823, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !829, file: !830, line: 62, baseType: !836, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !45, line: 138, baseType: !256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !829, file: !830, line: 64, baseType: !838, size: 32, offset: 224)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !45, line: 134, baseType: !256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !829, file: !830, line: 65, baseType: !840, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !45, line: 135, baseType: !256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !829, file: !830, line: 67, baseType: !69, size: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !829, file: !830, line: 69, baseType: !95, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !829, file: !830, line: 74, baseType: !844, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 140, baseType: !810)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !829, file: !830, line: 78, baseType: !846, size: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !45, line: 162, baseType: !810)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !829, file: !830, line: 80, baseType: !848, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !45, line: 167, baseType: !810)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !829, file: !830, line: 91, baseType: !850, size: 128, offset: 576)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !851, line: 8, size: 128, elements: !852)
!851 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!852 = !{!853, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !850, file: !851, line: 10, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 148, baseType: !810)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !850, file: !851, line: 11, baseType: !856, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !45, line: 184, baseType: !810)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !829, file: !830, line: 92, baseType: !850, size: 128, offset: 704)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !829, file: !830, line: 93, baseType: !850, size: 128, offset: 832)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !829, file: !830, line: 106, baseType: !860, size: 192, offset: 960)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 192, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 3)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !800, file: !795, line: 252, baseType: !864, offset: 2112)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: -1)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !796, file: !795, line: 82, baseType: !799, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !796, file: !795, line: 83, baseType: !869, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !796, file: !795, line: 84, baseType: !94, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !796, file: !795, line: 85, baseType: !61, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !796, file: !795, line: 86, baseType: !69, size: 32, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !796, file: !795, line: 87, baseType: !69, size: 32, offset: 352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !796, file: !795, line: 89, baseType: !54, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !796, file: !795, line: 90, baseType: !54, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !796, file: !795, line: 91, baseType: !877, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!69, !880, !880}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !796, file: !795, line: 162, baseType: !69, size: 32, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !796, file: !795, line: 171, baseType: !885, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !795, line: 171, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !796, file: !795, line: 193, baseType: !888, size: 64, offset: 704)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !796, file: !795, line: 173, size: 64, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !888, file: !795, line: 186, baseType: !885, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !888, file: !795, line: 192, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !894, line: 28, size: 256, elements: !895)
!894 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!895 = !{!896, !901, !902}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !893, file: !894, line: 30, baseType: !897, size: 128)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !87, line: 7, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !897, file: !87, line: 9, baseType: !90, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !897, file: !87, line: 10, baseType: !94, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !893, file: !894, line: 31, baseType: !42, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !893, file: !894, line: 32, baseType: !69, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !796, file: !795, line: 198, baseType: !904, size: 256, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !905, line: 39, baseType: !906)
!905 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !905, line: 31, size: 256, elements: !907)
!907 = !{!908, !912, !913, !914, !915}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !906, file: !905, line: 33, baseType: !909, size: 128)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 4)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !906, file: !905, line: 34, baseType: !69, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !906, file: !905, line: 35, baseType: !256, size: 32, offset: 160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !906, file: !905, line: 36, baseType: !256, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !906, file: !905, line: 37, baseType: !75, size: 8, offset: 224)
!916 = !{!917}
!917 = !DILocalVariable(name: "fts", arg: 1, scope: !790, file: !789, line: 50, type: !793)
!918 = !{!919}
!919 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !784, line: 763, size: 32, elements: !921)
!921 = !{!922}
!922 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !784, line: 155, size: 32, elements: !924)
!924 = !{!925}
!925 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!926 = !{!62, !42, !61, !810, !927, !930, !54, !56, !58, !51}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!69, !56, !56}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !795, line: 253, baseType: !800)
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !936)
!935 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!936 = !{!54}
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!938 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!940 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!942 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!944 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !947)
!946 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!947 = !{!54, !56, !58, !51}
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !950)
!949 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!950 = !{!951}
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 20, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!955 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!957 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!959 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170)
!961 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!962 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!963 = !{i32 2, !"Dwarf Version", i32 4}
!964 = !{i32 2, !"Debug Info Version", i32 3}
!965 = !{i32 1, !"PIC Level", i32 2}
!966 = !{i32 1, !"PIE Level", i32 2}
!967 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 128, type: !968, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !69}
!970 = !{!971}
!971 = !DILocalVariable(name: "status", arg: 1, scope: !967, file: !3, line: 128, type: !69)
!972 = !DIExpression()
!973 = !DILocation(line: 128, column: 12, scope: !967)
!974 = !DILocation(line: 130, column: 14, scope: !975)
!975 = distinct !DILexicalBlock(scope: !967, file: !3, line: 130, column: 7)
!976 = !DILocation(line: 130, column: 7, scope: !967)
!977 = !DILocation(line: 131, column: 5, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 1)
!979 = distinct !DILexicalBlock(scope: !975, file: !3, line: 131, column: 5)
!980 = !{!981, !981, i64 0}
!981 = !{!"any pointer", !982, i64 0}
!982 = !{!"omnipotent char", !983, i64 0}
!983 = !{!"Simple C/C++ TBAA"}
!984 = !DILocation(line: 131, column: 5, scope: !985)
!985 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 3)
!986 = !DILocation(line: 131, column: 5, scope: !987)
!987 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 2)
!988 = !DILocation(line: 134, column: 7, scope: !989)
!989 = distinct !DILexicalBlock(scope: !975, file: !3, line: 133, column: 5)
!990 = !DILocation(line: 134, column: 7, scope: !991)
!991 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 1)
!992 = !DILocation(line: 135, column: 7, scope: !989)
!993 = !DILocation(line: 135, column: 7, scope: !991)
!994 = !DILocation(line: 141, column: 7, scope: !989)
!995 = !DILocation(line: 141, column: 7, scope: !991)
!996 = !DILocation(line: 148, column: 7, scope: !989)
!997 = !DILocation(line: 148, column: 7, scope: !991)
!998 = !DILocation(line: 153, column: 7, scope: !989)
!999 = !DILocation(line: 153, column: 7, scope: !991)
!1000 = !DILocation(line: 160, column: 7, scope: !989)
!1001 = !DILocation(line: 160, column: 7, scope: !991)
!1002 = !DILocation(line: 161, column: 7, scope: !989)
!1003 = !DILocation(line: 161, column: 7, scope: !991)
!1004 = !DILocation(line: 162, column: 7, scope: !989)
!1005 = !DILocation(line: 162, column: 7, scope: !991)
!1006 = !DILocation(line: 167, column: 7, scope: !989)
!1007 = !DILocation(line: 167, column: 7, scope: !991)
!1008 = !DILocation(line: 176, column: 7, scope: !989)
!1009 = !DILocation(line: 176, column: 7, scope: !991)
!1010 = !DILocation(line: 642, column: 15, scope: !117, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 182, column: 7, scope: !989)
!1012 = !DILocation(line: 651, column: 3, scope: !117, inlinedAt: !1011)
!1013 = !DILocation(line: 651, column: 3, scope: !1014, inlinedAt: !1011)
!1014 = !DILexicalBlockFile(scope: !117, file: !37, discriminator: 1)
!1015 = !DILocation(line: 655, column: 29, scope: !117, inlinedAt: !1011)
!1016 = !DILocation(line: 655, column: 15, scope: !117, inlinedAt: !1011)
!1017 = !DILocation(line: 656, column: 7, scope: !136, inlinedAt: !1011)
!1018 = !DILocation(line: 656, column: 19, scope: !136, inlinedAt: !1011)
!1019 = !DILocation(line: 656, column: 22, scope: !1020, inlinedAt: !1011)
!1020 = !DILexicalBlockFile(scope: !136, file: !37, discriminator: 16)
!1021 = !DILocation(line: 656, column: 7, scope: !1022, inlinedAt: !1011)
!1022 = !DILexicalBlockFile(scope: !117, file: !37, discriminator: 16)
!1023 = !DILocation(line: 662, column: 7, scope: !1024, inlinedAt: !1011)
!1024 = distinct !DILexicalBlock(scope: !136, file: !37, line: 657, column: 5)
!1025 = !DILocation(line: 662, column: 7, scope: !1026, inlinedAt: !1011)
!1026 = !DILexicalBlockFile(scope: !1024, file: !37, discriminator: 1)
!1027 = !DILocation(line: 664, column: 5, scope: !1024, inlinedAt: !1011)
!1028 = !DILocation(line: 665, column: 3, scope: !117, inlinedAt: !1011)
!1029 = !DILocation(line: 665, column: 3, scope: !1014, inlinedAt: !1011)
!1030 = !DILocation(line: 667, column: 3, scope: !117, inlinedAt: !1011)
!1031 = !DILocation(line: 667, column: 3, scope: !1014, inlinedAt: !1011)
!1032 = !DILocation(line: 184, column: 3, scope: !967)
!1033 = !DILocation(line: 205, column: 11, scope: !66)
!1034 = !DILocation(line: 205, column: 24, scope: !66)
!1035 = !DILocation(line: 207, column: 8, scope: !66)
!1036 = !DILocation(line: 208, column: 3, scope: !66)
!1037 = !DILocation(line: 209, column: 8, scope: !66)
!1038 = !DILocation(line: 213, column: 21, scope: !66)
!1039 = !DILocation(line: 213, column: 3, scope: !66)
!1040 = !DILocation(line: 214, column: 3, scope: !66)
!1041 = !DILocation(line: 215, column: 3, scope: !66)
!1042 = !DILocation(line: 216, column: 3, scope: !66)
!1043 = !DILocation(line: 218, column: 3, scope: !66)
!1044 = !DIExpression(DW_OP_deref)
!1045 = !DILocation(line: 208, column: 21, scope: !66)
!1046 = !DILocalVariable(name: "x", arg: 1, scope: !1047, file: !3, line: 188, type: !1050)
!1047 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 188, type: !1048, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1051)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!1051 = !{!1046}
!1052 = !DILocation(line: 188, column: 36, scope: !1047, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 220, column: 3, scope: !66)
!1054 = !DILocation(line: 190, column: 27, scope: !1047, inlinedAt: !1053)
!1055 = !{!1056, !1057, i64 0}
!1056 = !{!"rm_options", !1057, i64 0, !982, i64 4, !1057, i64 8, !1057, i64 9, !1057, i64 10, !981, i64 16, !1057, i64 24, !1057, i64 25, !1057, i64 26}
!1057 = !{!"_Bool", !982, i64 0}
!1058 = !DILocation(line: 191, column: 6, scope: !1047, inlinedAt: !1053)
!1059 = !DILocation(line: 191, column: 18, scope: !1047, inlinedAt: !1053)
!1060 = !{!1056, !982, i64 4}
!1061 = !DILocation(line: 192, column: 6, scope: !1047, inlinedAt: !1053)
!1062 = !DILocation(line: 192, column: 22, scope: !1047, inlinedAt: !1053)
!1063 = !{!1056, !1057, i64 8}
!1064 = !DILocation(line: 193, column: 6, scope: !1047, inlinedAt: !1053)
!1065 = !DILocation(line: 193, column: 31, scope: !1047, inlinedAt: !1053)
!1066 = !{!1056, !1057, i64 10}
!1067 = !DILocation(line: 194, column: 6, scope: !1047, inlinedAt: !1053)
!1068 = !DILocation(line: 194, column: 16, scope: !1047, inlinedAt: !1053)
!1069 = !{!1056, !1057, i64 9}
!1070 = !DILocation(line: 195, column: 6, scope: !1047, inlinedAt: !1053)
!1071 = !DILocation(line: 195, column: 19, scope: !1047, inlinedAt: !1053)
!1072 = !{!1056, !981, i64 16}
!1073 = !DILocation(line: 196, column: 18, scope: !1047, inlinedAt: !1053)
!1074 = !DILocation(line: 196, column: 6, scope: !1047, inlinedAt: !1053)
!1075 = !DILocation(line: 196, column: 16, scope: !1047, inlinedAt: !1053)
!1076 = !{!1056, !1057, i64 24}
!1077 = !DILocation(line: 197, column: 6, scope: !1047, inlinedAt: !1053)
!1078 = !DILocation(line: 197, column: 14, scope: !1047, inlinedAt: !1053)
!1079 = !{!1056, !1057, i64 25}
!1080 = !DILocation(line: 201, column: 6, scope: !1047, inlinedAt: !1053)
!1081 = !DILocation(line: 201, column: 26, scope: !1047, inlinedAt: !1053)
!1082 = !{!1056, !1057, i64 26}
!1083 = !DILocation(line: 225, column: 3, scope: !66)
!1084 = !DILocation(line: 340, column: 25, scope: !1085)
!1085 = !DILexicalBlockFile(scope: !1086, file: !3, discriminator: 1)
!1086 = distinct !DILexicalBlock(scope: !66, file: !3, line: 340, column: 7)
!1087 = !DILocation(line: 319, column: 13, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 319, column: 11)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 318, column: 5)
!1090 = distinct !DILexicalBlock(scope: !66, file: !3, line: 317, column: 7)
!1091 = !DILocation(line: 225, column: 15, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !66, file: !3, discriminator: 1)
!1093 = !DILocation(line: 210, column: 7, scope: !66)
!1094 = !DILocation(line: 225, column: 3, scope: !1092)
!1095 = !DILocation(line: 230, column: 38, scope: !103)
!1096 = !DILocation(line: 231, column: 11, scope: !103)
!1097 = !DILocation(line: 234, column: 25, scope: !103)
!1098 = !DILocation(line: 235, column: 34, scope: !103)
!1099 = !DILocation(line: 237, column: 11, scope: !103)
!1100 = !DILocation(line: 240, column: 25, scope: !103)
!1101 = !DILocation(line: 241, column: 34, scope: !103)
!1102 = !DILocation(line: 243, column: 11, scope: !103)
!1103 = !DILocation(line: 246, column: 25, scope: !103)
!1104 = !DILocation(line: 247, column: 34, scope: !103)
!1105 = !DILocation(line: 249, column: 11, scope: !103)
!1106 = !DILocation(line: 253, column: 23, scope: !103)
!1107 = !DILocation(line: 254, column: 11, scope: !103)
!1108 = !DILocation(line: 259, column: 17, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !102, file: !3, line: 259, column: 17)
!1110 = !DILocation(line: 259, column: 17, scope: !102)
!1111 = !DILocation(line: 260, column: 19, scope: !1109)
!1112 = !{!982, !982, i64 0}
!1113 = !DILocation(line: 258, column: 17, scope: !102)
!1114 = !DILocation(line: 264, column: 13, scope: !102)
!1115 = !DILocation(line: 267, column: 31, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !102, file: !3, line: 265, column: 15)
!1117 = !DILocation(line: 269, column: 17, scope: !1116)
!1118 = !DILocation(line: 272, column: 31, scope: !1116)
!1119 = !DILocation(line: 273, column: 40, scope: !1116)
!1120 = !DILocation(line: 275, column: 17, scope: !1116)
!1121 = !DILocation(line: 278, column: 31, scope: !1116)
!1122 = !DILocation(line: 279, column: 40, scope: !1116)
!1123 = !DILocation(line: 281, column: 17, scope: !1116)
!1124 = !DILocation(line: 287, column: 29, scope: !103)
!1125 = !DILocation(line: 288, column: 11, scope: !103)
!1126 = !DILocation(line: 291, column: 17, scope: !106)
!1127 = !DILocation(line: 291, column: 17, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !106, file: !3, discriminator: 12)
!1129 = !{!1130, !1130, i64 0}
!1130 = !{!"int", !982, i64 0}
!1131 = !DILocation(line: 291, column: 17, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !107, file: !3, discriminator: 13)
!1133 = !DILocation(line: 291, column: 15, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !103, file: !3, discriminator: 13)
!1135 = !DILocation(line: 292, column: 13, scope: !107)
!1136 = !DILocation(line: 292, column: 13, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !107, file: !3, discriminator: 1)
!1138 = !DILocation(line: 302, column: 23, scope: !103)
!1139 = !DILocation(line: 303, column: 11, scope: !103)
!1140 = !DILocation(line: 306, column: 21, scope: !103)
!1141 = !DILocation(line: 307, column: 11, scope: !103)
!1142 = distinct !{!1142, !1083, !1143}
!1143 = !DILocation(line: 315, column: 5, scope: !66)
!1144 = !DILocation(line: 309, column: 9, scope: !103)
!1145 = !DILocation(line: 310, column: 9, scope: !103)
!1146 = !DILocation(line: 310, column: 9, scope: !1147)
!1147 = !DILexicalBlockFile(scope: !103, file: !3, discriminator: 1)
!1148 = !DILocalVariable(name: "argc", arg: 1, scope: !1149, file: !3, line: 104, type: !69)
!1149 = distinct !DISubprogram(name: "diagnose_leading_hyphen", scope: !3, file: !3, line: 104, type: !1150, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1152)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null, !69, !70}
!1152 = !{!1148, !1153, !1154, !1155, !1159}
!1153 = !DILocalVariable(name: "argv", arg: 2, scope: !1149, file: !3, line: 104, type: !70)
!1154 = !DILocalVariable(name: "i", scope: !1149, file: !3, line: 108, type: !69)
!1155 = !DILocalVariable(name: "arg", scope: !1156, file: !3, line: 112, type: !51)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 111, column: 5)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 110, column: 3)
!1158 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 110, column: 3)
!1159 = !DILocalVariable(name: "st", scope: !1156, file: !3, line: 113, type: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !830, line: 46, size: 1152, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1178, !1179, !1180}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1160, file: !830, line: 48, baseType: !95, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1160, file: !830, line: 53, baseType: !92, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1160, file: !830, line: 61, baseType: !823, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1160, file: !830, line: 62, baseType: !836, size: 32, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1160, file: !830, line: 64, baseType: !838, size: 32, offset: 224)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1160, file: !830, line: 65, baseType: !840, size: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1160, file: !830, line: 67, baseType: !69, size: 32, offset: 288)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1160, file: !830, line: 69, baseType: !95, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1160, file: !830, line: 74, baseType: !844, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1160, file: !830, line: 78, baseType: !846, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1160, file: !830, line: 80, baseType: !848, size: 64, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1160, file: !830, line: 91, baseType: !1174, size: 128, offset: 576)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !851, line: 8, size: 128, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1174, file: !851, line: 10, baseType: !854, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1174, file: !851, line: 11, baseType: !856, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1160, file: !830, line: 92, baseType: !1174, size: 128, offset: 704)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1160, file: !830, line: 93, baseType: !1174, size: 128, offset: 832)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1160, file: !830, line: 106, baseType: !860, size: 192, offset: 960)
!1181 = !DILocation(line: 104, column: 30, scope: !1149, inlinedAt: !1182)
!1182 = distinct !DILocation(line: 312, column: 11, scope: !103)
!1183 = !DILocation(line: 104, column: 43, scope: !1149, inlinedAt: !1182)
!1184 = !DILocation(line: 108, column: 7, scope: !1149, inlinedAt: !1182)
!1185 = !DILocation(line: 110, column: 17, scope: !1186, inlinedAt: !1182)
!1186 = !DILexicalBlockFile(scope: !1157, file: !3, discriminator: 1)
!1187 = !DILocation(line: 110, column: 3, scope: !1188, inlinedAt: !1182)
!1188 = !DILexicalBlockFile(scope: !1158, file: !3, discriminator: 1)
!1189 = !DILocation(line: 112, column: 25, scope: !1156, inlinedAt: !1182)
!1190 = !DILocation(line: 112, column: 19, scope: !1156, inlinedAt: !1182)
!1191 = !DILocation(line: 113, column: 7, scope: !1156, inlinedAt: !1182)
