; ModuleID = 'coreutils-8.27/src/stat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.saved_cwd = type { i32, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!33 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !54, !55, !56, !59, !60}
!39 = !DILocalVariable(name: "format", arg: 1, scope: !20, file: !3, line: 1216, type: !24)
!40 = !DILocalVariable(name: "fd", arg: 2, scope: !20, file: !3, line: 1216, type: !27)
!41 = !DILocalVariable(name: "filename", arg: 3, scope: !20, file: !3, line: 1216, type: !24)
!42 = !DILocalVariable(name: "print_func", arg: 4, scope: !20, file: !3, line: 1217, type: !28)
!43 = !DILocalVariable(name: "data", arg: 5, scope: !20, file: !3, line: 1219, type: !36)
!44 = !DILocalVariable(name: "fail", scope: !20, file: !3, line: 1221, type: !23)
!45 = !DILocalVariable(name: "n_alloc", scope: !20, file: !3, line: 1232, type: !32)
!46 = !DILocalVariable(name: "dest", scope: !20, file: !3, line: 1233, type: !31)
!47 = !DILocalVariable(name: "b", scope: !20, file: !3, line: 1234, type: !24)
!48 = !DILocalVariable(name: "len", scope: !49, file: !3, line: 1241, type: !32)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1240, column: 11)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 1238, column: 9)
!51 = distinct !DILexicalBlock(scope: !52, file: !3, line: 1236, column: 5)
!52 = distinct !DILexicalBlock(scope: !53, file: !3, line: 1235, column: 3)
!53 = distinct !DILexicalBlock(scope: !20, file: !3, line: 1235, column: 3)
!54 = !DILocalVariable(name: "fmt_char", scope: !49, file: !3, line: 1242, type: !24)
!55 = !DILocalVariable(name: "fmt_code", scope: !49, file: !3, line: 1247, type: !35)
!56 = !DILocalVariable(name: "esc_value", scope: !57, file: !3, line: 1283, type: !27)
!57 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1282, column: 13)
!58 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1281, column: 15)
!59 = !DILocalVariable(name: "esc_length", scope: !57, file: !3, line: 1284, type: !27)
!60 = !DILocalVariable(name: "esc_value", scope: !61, file: !3, line: 1295, type: !27)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1294, column: 13)
!62 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1293, column: 20)
!63 = !{!64}
!64 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 46, size: 32, elements: !67)
!66 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!68 = !DIEnumerator(name: "_ISupper", value: 256)
!69 = !DIEnumerator(name: "_ISlower", value: 512)
!70 = !DIEnumerator(name: "_ISalpha", value: 1024)
!71 = !DIEnumerator(name: "_ISdigit", value: 2048)
!72 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!73 = !DIEnumerator(name: "_ISspace", value: 8192)
!74 = !DIEnumerator(name: "_ISprint", value: 16384)
!75 = !DIEnumerator(name: "_ISgraph", value: 32768)
!76 = !DIEnumerator(name: "_ISblank", value: 1)
!77 = !DIEnumerator(name: "_IScntrl", value: 2)
!78 = !DIEnumerator(name: "_ISpunct", value: 4)
!79 = !DIEnumerator(name: "_ISalnum", value: 8)
!80 = !{!31, !81, !32, !36, !82, !24, !27, !85, !84, !86, !147, !152, !35}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !88, file: !3, line: 813, baseType: !35)
!88 = distinct !DISubprogram(name: "print_statfs", scope: !3, file: !3, line: 795, type: !29, isLocal: true, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !129, !130, !135, !139, !140, !141, !145}
!90 = !DILocalVariable(name: "pformat", arg: 1, scope: !88, file: !3, line: 795, type: !31)
!91 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !88, file: !3, line: 795, type: !32)
!92 = !DILocalVariable(name: "m", arg: 3, scope: !88, file: !3, line: 795, type: !35)
!93 = !DILocalVariable(name: "fd", arg: 4, scope: !88, file: !3, line: 796, type: !27)
!94 = !DILocalVariable(name: "filename", arg: 5, scope: !88, file: !3, line: 796, type: !24)
!95 = !DILocalVariable(name: "data", arg: 6, scope: !88, file: !3, line: 797, type: !36)
!96 = !DILocalVariable(name: "statfsbuf", scope: !88, file: !3, line: 799, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !100, line: 24, size: 960, elements: !101)
!100 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!101 = !{!102, !106, !107, !109, !110, !111, !113, !114, !122, !123, !124, !125}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !99, file: !100, line: 26, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !104, line: 179, baseType: !105)
!104 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !99, file: !100, line: 27, baseType: !103, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !99, file: !100, line: 29, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !104, line: 171, baseType: !34)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !99, file: !100, line: 30, baseType: !108, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !99, file: !100, line: 31, baseType: !108, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !99, file: !100, line: 32, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !104, line: 175, baseType: !34)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !99, file: !100, line: 33, baseType: !112, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !99, file: !100, line: 41, baseType: !115, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !104, line: 143, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 143, size: 64, elements: !117)
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !116, file: !104, line: 143, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 2)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !99, file: !100, line: 42, baseType: !103, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !99, file: !100, line: 43, baseType: !103, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !99, file: !100, line: 44, baseType: !103, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !99, file: !100, line: 45, baseType: !126, size: 256, offset: 704)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 256, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 4)
!129 = !DILocalVariable(name: "fail", scope: !88, file: !3, line: 800, type: !23)
!130 = !DILocalVariable(name: "p", scope: !131, file: !3, line: 817, type: !133)
!131 = distinct !DILexicalBlock(scope: !132, file: !3, line: 809, column: 7)
!132 = distinct !DILexicalBlock(scope: !88, file: !3, line: 803, column: 5)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!135 = !DILocalVariable(name: "fsid", scope: !131, file: !3, line: 821, type: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !137, line: 136, baseType: !138)
!137 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !104, line: 62, baseType: !34)
!139 = !DILocalVariable(name: "words", scope: !131, file: !3, line: 822, type: !27)
!140 = !DILocalVariable(name: "i", scope: !131, file: !3, line: 823, type: !27)
!141 = !DILocalVariable(name: "u", scope: !142, file: !3, line: 826, type: !136)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 825, column: 11)
!143 = distinct !DILexicalBlock(scope: !144, file: !3, line: 824, column: 9)
!144 = distinct !DILexicalBlock(scope: !131, file: !3, line: 824, column: 9)
!145 = !DILocalVariable(name: "frsize", scope: !146, file: !3, line: 861, type: !136)
!146 = distinct !DILexicalBlock(scope: !132, file: !3, line: 860, column: 7)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !149, line: 46, size: 1152, elements: !150)
!149 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!150 = !{!151, !153, !155, !157, !159, !161, !163, !164, !165, !167, !169, !171, !179, !180, !181}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !148, file: !149, line: 48, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !104, line: 133, baseType: !34)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !148, file: !149, line: 53, baseType: !154, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !104, line: 136, baseType: !34)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !148, file: !149, line: 61, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !104, line: 139, baseType: !34)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !148, file: !149, line: 62, baseType: !158, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !104, line: 138, baseType: !35)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !148, file: !149, line: 64, baseType: !160, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !104, line: 134, baseType: !35)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !148, file: !149, line: 65, baseType: !162, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !104, line: 135, baseType: !35)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !148, file: !149, line: 67, baseType: !27, size: 32, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !148, file: !149, line: 69, baseType: !152, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !148, file: !149, line: 74, baseType: !166, size: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 140, baseType: !105)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !148, file: !149, line: 78, baseType: !168, size: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !104, line: 162, baseType: !105)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !148, file: !149, line: 80, baseType: !170, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !104, line: 167, baseType: !105)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !148, file: !149, line: 91, baseType: !172, size: 128, offset: 576)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !173, line: 8, size: 128, elements: !174)
!173 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !172, file: !173, line: 10, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !104, line: 148, baseType: !105)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !172, file: !173, line: 11, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !104, line: 184, baseType: !105)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !148, file: !149, line: 92, baseType: !172, size: 128, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !148, file: !149, line: 93, baseType: !172, size: 128, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !148, file: !149, line: 106, baseType: !182, size: 192, offset: 960)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 3)
!185 = !{!186, !188, !0, !190, !192, !222, !236, !238, !241, !246, !259, !271, !305, !307, !339}
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "follow_links", scope: !2, file: !3, line: 200, type: !23, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !2, file: !3, line: 204, type: !23, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !2, file: !3, line: 212, type: !32, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "infomap", scope: !194, file: !195, line: 632, type: !219, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !195, file: !195, line: 630, type: !196, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !198)
!195 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!196 = !DISubroutineType(types: !197)
!197 = !{null, !24}
!198 = !{!199, !200, !201, !208, !210, !211, !212, !215, !216, !218}
!199 = !DILocalVariable(name: "program", arg: 1, scope: !194, file: !195, line: 630, type: !24)
!200 = !DILocalVariable(name: "node", scope: !194, file: !195, line: 642, type: !24)
!201 = !DILocalVariable(name: "map_prog", scope: !194, file: !195, line: 643, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !194, file: !195, line: 632, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !204, file: !195, line: 632, baseType: !24, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !204, file: !195, line: 632, baseType: !24, size: 64, offset: 64)
!208 = !DILocalVariable(name: "__s1_len", scope: !209, file: !195, line: 645, type: !32)
!209 = distinct !DILexicalBlock(scope: !194, file: !195, line: 645, column: 33)
!210 = !DILocalVariable(name: "__s2_len", scope: !209, file: !195, line: 645, type: !32)
!211 = !DILocalVariable(name: "lc_messages", scope: !194, file: !195, line: 655, type: !24)
!212 = !DILocalVariable(name: "__s1_len", scope: !213, file: !195, line: 656, type: !32)
!213 = distinct !DILexicalBlock(scope: !214, file: !195, line: 656, column: 22)
!214 = distinct !DILexicalBlock(scope: !194, file: !195, line: 656, column: 7)
!215 = !DILocalVariable(name: "__s2_len", scope: !213, file: !195, line: 656, type: !32)
!216 = !DILocalVariable(name: "__s2", scope: !217, file: !195, line: 656, type: !82)
!217 = distinct !DILexicalBlock(scope: !213, file: !195, line: 656, column: 22)
!218 = !DILocalVariable(name: "__result", scope: !217, file: !195, line: 656, type: !27)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 896, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 7)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 187, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 2048, elements: !234)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !227, line: 104, size: 256, elements: !228)
!227 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!229, !230, !231, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !227, line: 106, baseType: !24, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !226, file: !227, line: 109, baseType: !27, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !227, line: 110, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !226, file: !227, line: 111, baseType: !27, size: 32, offset: 192)
!234 = !{!235}
!235 = !DISubrange(count: 8)
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !2, file: !3, line: 208, type: !24, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "printf_flags", scope: !2, file: !3, line: 176, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !234)
!241 = !DIGlobalVariableExpression(var: !242)
!242 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 168, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 88, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "buf", scope: !248, file: !3, line: 560, type: !256, isLocal: true, isDefinition: true)
!248 = distinct !DISubprogram(name: "human_fstype", scope: !3, file: !3, line: 221, type: !249, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{!24, !97}
!251 = !{!252, !253}
!252 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !248, file: !3, line: 221, type: !97)
!253 = !DILocalVariable(name: "type", scope: !254, file: !3, line: 559, type: !34)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 558, column: 7)
!255 = distinct !DILexicalBlock(scope: !248, file: !3, line: 227, column: 5)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 232, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 29)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "modebuf", scope: !261, file: !3, line: 572, type: !268, isLocal: true, isDefinition: true)
!261 = distinct !DISubprogram(name: "human_access", scope: !3, file: !3, line: 570, type: !262, isLocal: true, isDefinition: true, scopeLine: 571, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !266)
!262 = !DISubroutineType(types: !263)
!263 = !{!31, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!266 = !{!267}
!267 = !DILocalVariable(name: "statbuf", arg: 1, scope: !261, file: !3, line: 570, type: !264)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 12)
!271 = !DIGlobalVariableExpression(var: !272)
!272 = distinct !DIGlobalVariable(name: "mount_list", scope: !273, file: !3, line: 888, type: !281, isLocal: true, isDefinition: true)
!273 = distinct !DISubprogram(name: "find_bind_mount", scope: !3, file: !3, line: 884, type: !274, isLocal: true, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !276)
!274 = !DISubroutineType(types: !275)
!275 = !{!24, !24}
!276 = !{!277, !278, !279, !280, !296, !302, !303}
!277 = !DILocalVariable(name: "name", arg: 1, scope: !273, file: !3, line: 884, type: !24)
!278 = !DILocalVariable(name: "bind_mount", scope: !273, file: !3, line: 886, type: !24)
!279 = !DILocalVariable(name: "name_stats", scope: !273, file: !3, line: 897, type: !148)
!280 = !DILocalVariable(name: "me", scope: !273, file: !3, line: 901, type: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !283, line: 26, size: 448, elements: !284)
!283 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!284 = !{!285, !286, !287, !288, !289, !292, !293, !294, !295}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !282, file: !283, line: 28, baseType: !31, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !282, file: !283, line: 29, baseType: !31, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !282, file: !283, line: 30, baseType: !31, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !282, file: !283, line: 32, baseType: !31, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !282, file: !283, line: 33, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !291, line: 60, baseType: !152)
!291 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !282, file: !283, line: 34, baseType: !35, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !282, file: !283, line: 35, baseType: !35, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !282, file: !283, line: 36, baseType: !35, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !282, file: !283, line: 37, baseType: !281, size: 64, offset: 384)
!296 = !DILocalVariable(name: "__s1_len", scope: !297, file: !3, line: 905, type: !32)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 905, column: 14)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 904, column: 11)
!299 = distinct !DILexicalBlock(scope: !300, file: !3, line: 903, column: 5)
!300 = distinct !DILexicalBlock(scope: !301, file: !3, line: 902, column: 3)
!301 = distinct !DILexicalBlock(scope: !273, file: !3, line: 902, column: 3)
!302 = !DILocalVariable(name: "__s2_len", scope: !297, file: !3, line: 905, type: !32)
!303 = !DILocalVariable(name: "dev_stats", scope: !304, file: !3, line: 907, type: !148)
!304 = distinct !DILexicalBlock(scope: !298, file: !3, line: 906, column: 9)
!305 = !DIGlobalVariableExpression(var: !306)
!306 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !273, file: !3, line: 889, type: !23, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308)
!308 = distinct !DIGlobalVariable(name: "str", scope: !309, file: !3, line: 586, type: !336, isLocal: true, isDefinition: true)
!309 = distinct !DISubprogram(name: "human_time", scope: !3, file: !3, line: 579, type: !310, isLocal: true, isDefinition: true, scopeLine: 580, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{!31, !172}
!312 = !{!313, !314, !329, !330}
!313 = !DILocalVariable(name: "t", arg: 1, scope: !309, file: !3, line: 579, type: !172)
!314 = !DILocalVariable(name: "tm", scope: !309, file: !3, line: 593, type: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !316, line: 8, size: 448, elements: !317)
!316 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !315, file: !316, line: 10, baseType: !27, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !315, file: !316, line: 11, baseType: !27, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !315, file: !316, line: 12, baseType: !27, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !315, file: !316, line: 13, baseType: !27, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !315, file: !316, line: 14, baseType: !27, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !315, file: !316, line: 15, baseType: !27, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !315, file: !316, line: 16, baseType: !27, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !315, file: !316, line: 17, baseType: !27, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !315, file: !316, line: 18, baseType: !27, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !315, file: !316, line: 21, baseType: !105, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !315, file: !316, line: 22, baseType: !24, size: 64, offset: 384)
!329 = !DILocalVariable(name: "ns", scope: !309, file: !3, line: 594, type: !27)
!330 = !DILocalVariable(name: "secbuf", scope: !331, file: !3, line: 599, type: !333)
!331 = distinct !DILexicalBlock(scope: !332, file: !3, line: 598, column: 5)
!332 = distinct !DILexicalBlock(scope: !309, file: !3, line: 595, column: 7)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 168, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 21)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 488, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 61)
!339 = !DIGlobalVariableExpression(var: !340)
!340 = distinct !DIGlobalVariable(name: "tz", scope: !309, file: !3, line: 590, type: !341, isLocal: true, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !342, line: 594, baseType: !343)
!342 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !342, line: 594, flags: DIFlagFwdDecl)
!345 = !DIGlobalVariableExpression(var: !346)
!346 = distinct !DIGlobalVariable(name: "Version", scope: !347, file: !348, line: 2, type: !24, isLocal: false, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, globals: !350)
!348 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!349 = !{}
!350 = !{!345}
!351 = !DIGlobalVariableExpression(var: !352)
!352 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !353, file: !358, line: 69, type: !359, isLocal: false, isDefinition: true)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !355, retainedTypes: !356, globals: !357)
!354 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!355 = !{!5}
!356 = !{!32, !81, !84}
!357 = !{!351}
!358 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !360, line: 55, baseType: !361)
!360 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{null}
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "file_name", scope: !366, file: !371, line: 36, type: !24, isLocal: true, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, globals: !368)
!367 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!368 = !{!364, !369}
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !366, file: !371, line: 46, type: !23, isLocal: true, isDefinition: true)
!371 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!372 = !DIGlobalVariableExpression(var: !373)
!373 = distinct !DIGlobalVariable(name: "exit_failure", scope: !374, file: !377, line: 24, type: !378, isLocal: false, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, globals: !376)
!375 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!376 = !{!372}
!377 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!378 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "program_name", scope: !381, file: !385, line: 33, type: !24, isLocal: false, isDefinition: true)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !383, globals: !384)
!382 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!383 = !{!81, !31}
!384 = !{!379}
!385 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!386 = !DIGlobalVariableExpression(var: !387)
!387 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !388, file: !400, line: 77, type: !433, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !390, retainedTypes: !396, globals: !397)
!389 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!390 = !{!5, !391, !65}
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!394 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!395 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!396 = !{!27, !85, !32, !31}
!397 = !{!386, !398, !405, !415, !417, !422, !429, !431}
!398 = !DIGlobalVariableExpression(var: !399)
!399 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !388, file: !400, line: 93, type: !401, isLocal: false, isDefinition: true)
!400 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 320, elements: !403)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!403 = !{!404}
!404 = !DISubrange(count: 10)
!405 = !DIGlobalVariableExpression(var: !406)
!406 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !388, file: !400, line: 1043, type: !407, isLocal: false, isDefinition: true)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !400, line: 57, size: 448, elements: !408)
!408 = !{!409, !410, !411, !413, !414}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !407, file: !400, line: 60, baseType: !5, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !407, file: !400, line: 63, baseType: !27, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !407, file: !400, line: 67, baseType: !412, size: 256, offset: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256, elements: !234)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !407, file: !400, line: 70, baseType: !24, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !407, file: !400, line: 73, baseType: !24, size: 64, offset: 384)
!415 = !DIGlobalVariableExpression(var: !416)
!416 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !388, file: !400, line: 108, type: !407, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418)
!418 = distinct !DIGlobalVariable(name: "slot0", scope: !388, file: !400, line: 834, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 256)
!422 = !DIGlobalVariableExpression(var: !423)
!423 = distinct !DIGlobalVariable(name: "slotvec", scope: !388, file: !400, line: 837, type: !424, isLocal: true, isDefinition: true)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !400, line: 826, size: 128, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !400, line: 828, baseType: !32, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !425, file: !400, line: 829, baseType: !31, size: 64, offset: 64)
!429 = !DIGlobalVariableExpression(var: !430)
!430 = distinct !DIGlobalVariable(name: "nslots", scope: !388, file: !400, line: 835, type: !27, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432)
!432 = distinct !DIGlobalVariable(name: "slotvec0", scope: !388, file: !400, line: 836, type: !425, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 704, elements: !244)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!435 = !DIGlobalVariableExpression(var: !436)
!436 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !437, file: !440, line: 26, type: !441, isLocal: false, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, globals: !439)
!438 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!439 = !{!435}
!440 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 376, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 47)
!444 = !DIGlobalVariableExpression(var: !445)
!445 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !446, file: !790, line: 120, type: !791, isLocal: true, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !448, retainedTypes: !787, globals: !789)
!447 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!448 = !{!449}
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 41, size: 32, elements: !451)
!450 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!452 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!453 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!454 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!455 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!456 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!457 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!458 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!459 = !DIEnumerator(name: "DAY_1", value: 131079)
!460 = !DIEnumerator(name: "DAY_2", value: 131080)
!461 = !DIEnumerator(name: "DAY_3", value: 131081)
!462 = !DIEnumerator(name: "DAY_4", value: 131082)
!463 = !DIEnumerator(name: "DAY_5", value: 131083)
!464 = !DIEnumerator(name: "DAY_6", value: 131084)
!465 = !DIEnumerator(name: "DAY_7", value: 131085)
!466 = !DIEnumerator(name: "ABMON_1", value: 131086)
!467 = !DIEnumerator(name: "ABMON_2", value: 131087)
!468 = !DIEnumerator(name: "ABMON_3", value: 131088)
!469 = !DIEnumerator(name: "ABMON_4", value: 131089)
!470 = !DIEnumerator(name: "ABMON_5", value: 131090)
!471 = !DIEnumerator(name: "ABMON_6", value: 131091)
!472 = !DIEnumerator(name: "ABMON_7", value: 131092)
!473 = !DIEnumerator(name: "ABMON_8", value: 131093)
!474 = !DIEnumerator(name: "ABMON_9", value: 131094)
!475 = !DIEnumerator(name: "ABMON_10", value: 131095)
!476 = !DIEnumerator(name: "ABMON_11", value: 131096)
!477 = !DIEnumerator(name: "ABMON_12", value: 131097)
!478 = !DIEnumerator(name: "MON_1", value: 131098)
!479 = !DIEnumerator(name: "MON_2", value: 131099)
!480 = !DIEnumerator(name: "MON_3", value: 131100)
!481 = !DIEnumerator(name: "MON_4", value: 131101)
!482 = !DIEnumerator(name: "MON_5", value: 131102)
!483 = !DIEnumerator(name: "MON_6", value: 131103)
!484 = !DIEnumerator(name: "MON_7", value: 131104)
!485 = !DIEnumerator(name: "MON_8", value: 131105)
!486 = !DIEnumerator(name: "MON_9", value: 131106)
!487 = !DIEnumerator(name: "MON_10", value: 131107)
!488 = !DIEnumerator(name: "MON_11", value: 131108)
!489 = !DIEnumerator(name: "MON_12", value: 131109)
!490 = !DIEnumerator(name: "AM_STR", value: 131110)
!491 = !DIEnumerator(name: "PM_STR", value: 131111)
!492 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!493 = !DIEnumerator(name: "D_FMT", value: 131113)
!494 = !DIEnumerator(name: "T_FMT", value: 131114)
!495 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!496 = !DIEnumerator(name: "ERA", value: 131116)
!497 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!498 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!499 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!500 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!501 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!502 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!503 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!504 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!505 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!506 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!507 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!508 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!509 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!510 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!511 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!512 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!513 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!514 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!515 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!516 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!517 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!518 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!519 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!520 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!521 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!522 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!523 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!524 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!525 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!526 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!527 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!528 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!529 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!530 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!531 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!532 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!533 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!534 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!535 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!536 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!537 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!538 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!539 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!540 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!541 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!542 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!543 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!544 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!545 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!546 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!547 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!548 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!549 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!550 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!551 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!552 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!553 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!554 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!555 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!556 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!557 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!558 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!559 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!560 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!561 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!562 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!563 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!564 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!565 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!566 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!567 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!568 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!569 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!570 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!571 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!572 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!573 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!574 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!575 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!576 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!577 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!578 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!579 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!580 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!581 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!582 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!583 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!584 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!585 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!586 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!587 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!588 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!589 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!590 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!591 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!592 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!593 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!594 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!595 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!596 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!597 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!598 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!599 = !DIEnumerator(name: "CODESET", value: 14)
!600 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!601 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!602 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!603 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!604 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!605 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!606 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!615 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!616 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!617 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!618 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!619 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!620 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!621 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!622 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!623 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!626 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!627 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!628 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!631 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!632 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!633 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!635 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!636 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!637 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!638 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!639 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!640 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!641 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!642 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!643 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!644 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!645 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!646 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!647 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!648 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!649 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!650 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!651 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!652 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!653 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!654 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!655 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!656 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!657 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!658 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!659 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!660 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!661 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!662 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!663 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!664 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!665 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!666 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!667 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!668 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!669 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!670 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!671 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!672 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!673 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!674 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!675 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!676 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!677 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!678 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!679 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!680 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!681 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!682 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!683 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!684 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!685 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!686 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!687 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!688 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!689 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!690 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!691 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!692 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!693 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!694 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!695 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!696 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!697 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!698 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!699 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!700 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!701 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!702 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!703 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!704 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!705 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!706 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!707 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!708 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!709 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!710 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!711 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!712 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!713 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!714 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!715 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!716 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!717 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!718 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!719 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!720 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!721 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!722 = !DIEnumerator(name: "THOUSEP", value: 65537)
!723 = !DIEnumerator(name: "__GROUPING", value: 65538)
!724 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!725 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!726 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!727 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!728 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!729 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!730 = !DIEnumerator(name: "__YESSTR", value: 327682)
!731 = !DIEnumerator(name: "__NOSTR", value: 327683)
!732 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!733 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!734 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!735 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!736 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!737 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!738 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!739 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!740 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!741 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!742 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!743 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!744 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!745 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!746 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!747 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!748 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!749 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!750 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!751 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!752 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!753 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!754 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!755 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!756 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!757 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!758 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!759 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!760 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!761 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!762 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!763 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!764 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!765 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!766 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!767 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!768 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!769 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!770 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!771 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!772 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!773 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!774 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!775 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!776 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!777 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!778 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!779 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!780 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!781 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!782 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!783 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!784 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!785 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!786 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!787 = !{!81, !31, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!789 = !{!444}
!790 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!791 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!792 = !DIGlobalVariableExpression(var: !793)
!793 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !794, file: !795, line: 335, type: !27, isLocal: true, isDefinition: true)
!794 = distinct !DISubprogram(name: "rpl_fcntl", scope: !795, file: !795, line: 272, type: !796, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !798, variables: !801)
!795 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!796 = !DISubroutineType(types: !797)
!797 = !{!27, !27, !27, null}
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, globals: !800)
!799 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!800 = !{!792}
!801 = !{!802, !803, !804, !817, !818, !821, !824, !827}
!802 = !DILocalVariable(name: "fd", arg: 1, scope: !794, file: !795, line: 272, type: !27)
!803 = !DILocalVariable(name: "action", arg: 2, scope: !794, file: !795, line: 272, type: !27)
!804 = !DILocalVariable(name: "arg", scope: !794, file: !795, line: 274, type: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !806, line: 30, baseType: !807)
!806 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !799, line: 274, baseType: !808)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 192, elements: !815)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !799, line: 274, size: 192, elements: !810)
!810 = !{!811, !812, !813, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !809, file: !799, line: 274, baseType: !35, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !809, file: !799, line: 274, baseType: !35, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !809, file: !799, line: 274, baseType: !81, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !809, file: !799, line: 274, baseType: !81, size: 64, offset: 128)
!815 = !{!816}
!816 = !DISubrange(count: 1)
!817 = !DILocalVariable(name: "result", scope: !794, file: !795, line: 275, type: !27)
!818 = !DILocalVariable(name: "target", scope: !819, file: !795, line: 322, type: !27)
!819 = distinct !DILexicalBlock(scope: !820, file: !795, line: 321, column: 7)
!820 = distinct !DILexicalBlock(scope: !794, file: !795, line: 278, column: 5)
!821 = !DILocalVariable(name: "flags", scope: !822, file: !795, line: 359, type: !27)
!822 = distinct !DILexicalBlock(scope: !823, file: !795, line: 358, column: 11)
!823 = distinct !DILexicalBlock(scope: !819, file: !795, line: 357, column: 13)
!824 = !DILocalVariable(name: "saved_errno", scope: !825, file: !795, line: 362, type: !27)
!825 = distinct !DILexicalBlock(scope: !826, file: !795, line: 361, column: 15)
!826 = distinct !DILexicalBlock(scope: !822, file: !795, line: 360, column: 17)
!827 = !DILocalVariable(name: "p", scope: !828, file: !795, line: 404, type: !81)
!828 = distinct !DILexicalBlock(scope: !820, file: !795, line: 402, column: 7)
!829 = !DIGlobalVariableExpression(var: !830)
!830 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !831, file: !841, line: 124, type: !854, isLocal: true, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !833, globals: !838)
!832 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!833 = !{!35, !27, !834, !84, !835, !85, !105, !34, !836, !837}
!834 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!835 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!836 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!837 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!838 = !{!839, !845, !848, !829}
!839 = !DIGlobalVariableExpression(var: !840, expr: !844)
!840 = distinct !DIGlobalVariable(name: "mktime_min", scope: !831, file: !841, line: 95, type: !842, isLocal: true, isDefinition: true)
!841 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !841, line: 68, baseType: !105)
!844 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!845 = !DIGlobalVariableExpression(var: !846, expr: !847)
!846 = distinct !DIGlobalVariable(name: "mktime_max", scope: !831, file: !841, line: 98, type: !842, isLocal: true, isDefinition: true)
!847 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!848 = !DIGlobalVariableExpression(var: !849)
!849 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !831, file: !841, line: 462, type: !850, isLocal: true, isDefinition: true)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !851, line: 30, baseType: !852)
!851 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !853, line: 8, baseType: !176)
!853 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 416, elements: !856)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!856 = !{!121, !857}
!857 = !DISubrange(count: 13)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !355, retainedTypes: !860)
!859 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!860 = !{!31}
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !863)
!862 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!863 = !{!81}
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!865 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!867 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !860)
!869 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!871 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!873 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !876)
!875 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !137, line: 135, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !104, line: 61, baseType: !105)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!880 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !883)
!882 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = !{!24, !35, !32, !81, !36, !27, !84}
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !886, retainedTypes: !863)
!885 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = !{!887}
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 41, size: 32, elements: !889)
!888 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!889 = !{!890}
!890 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !893, retainedTypes: !907)
!892 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!893 = !{!894}
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !896, file: !895, line: 192, size: 32, elements: !905)
!895 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!896 = distinct !DISubprogram(name: "x2nrealloc", scope: !895, file: !895, line: 180, type: !897, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !891, variables: !900)
!897 = !DISubroutineType(types: !898)
!898 = !{!81, !81, !899, !32}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!900 = !{!901, !902, !903, !904}
!901 = !DILocalVariable(name: "p", arg: 1, scope: !896, file: !895, line: 180, type: !81)
!902 = !DILocalVariable(name: "pn", arg: 2, scope: !896, file: !895, line: 180, type: !899)
!903 = !DILocalVariable(name: "s", arg: 3, scope: !896, file: !895, line: 180, type: !32)
!904 = !DILocalVariable(name: "n", scope: !896, file: !895, line: 182, type: !32)
!905 = !{!906}
!906 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!907 = !{!32, !31, !81}
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!909 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!911 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!913 = !DIFile(filename: "./lib/xasprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !863)
!915 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !383)
!917 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !920)
!919 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!920 = !{!32}
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !923)
!922 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = !{!81, !32, !36, !82, !24, !152}
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !926, retainedTypes: !860, globals: !931)
!925 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!926 = !{!927}
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !928, line: 49, size: 32, elements: !929)
!928 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!929 = !{!930}
!930 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!931 = !{!932}
!932 = !DIGlobalVariableExpression(var: !933)
!933 = distinct !DIGlobalVariable(name: "local_tz", scope: !924, file: !928, line: 54, type: !934, isLocal: true, isDefinition: true)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !342, line: 594, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !938, line: 21, size: 128, elements: !939)
!938 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !938, line: 25, baseType: !936, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !937, file: !938, line: 36, baseType: !26, size: 8, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !937, file: !938, line: 48, baseType: !943, offset: 72)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: -1)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!947 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!949 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!951 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !954)
!953 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!954 = !{!32, !36, !82, !24}
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!956 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !860)
!958 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!960 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !863)
!962 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !863)
!964 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349)
!966 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!967 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!968 = !{i32 2, !"Dwarf Version", i32 4}
!969 = !{i32 2, !"Debug Info Version", i32 3}
!970 = !{i32 1, !"PIC Level", i32 2}
!971 = !{i32 1, !"PIE Level", i32 2}
!972 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1482, type: !973, isLocal: false, isDefinition: true, scopeLine: 1483, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !27}
!975 = !{!976}
!976 = !DILocalVariable(name: "status", arg: 1, scope: !972, file: !3, line: 1482, type: !27)
!977 = !DIExpression()
!978 = !DILocation(line: 1482, column: 12, scope: !972)
!979 = !DILocation(line: 1484, column: 14, scope: !980)
!980 = distinct !DILexicalBlock(scope: !972, file: !3, line: 1484, column: 7)
!981 = !DILocation(line: 1484, column: 7, scope: !972)
!982 = !DILocation(line: 1485, column: 5, scope: !983)
!983 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 1)
!984 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1485, column: 5)
!985 = !{!986, !986, i64 0}
!986 = !{!"any pointer", !987, i64 0}
!987 = !{!"omnipotent char", !988, i64 0}
!988 = !{!"Simple C/C++ TBAA"}
!989 = !DILocation(line: 1485, column: 5, scope: !990)
!990 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 3)
!991 = !DILocation(line: 1485, column: 5, scope: !992)
!992 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 2)
!993 = !DILocation(line: 1488, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1487, column: 5)
!995 = !DILocation(line: 1488, column: 7, scope: !996)
!996 = !DILexicalBlockFile(scope: !994, file: !3, discriminator: 1)
!997 = !DILocation(line: 1489, column: 7, scope: !994)
!998 = !DILocation(line: 1489, column: 7, scope: !996)
!999 = !DILocation(line: 587, column: 3, scope: !1000, inlinedAt: !1001)
!1000 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !195, file: !195, line: 585, type: !362, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !349)
!1001 = distinct !DILocation(line: 1493, column: 7, scope: !994)
!1002 = !DILocation(line: 587, column: 3, scope: !1003, inlinedAt: !1001)
!1003 = !DILexicalBlockFile(scope: !1000, file: !195, discriminator: 1)
!1004 = !DILocation(line: 1495, column: 7, scope: !994)
!1005 = !DILocation(line: 1495, column: 7, scope: !996)
!1006 = !DILocation(line: 1499, column: 7, scope: !994)
!1007 = !DILocation(line: 1499, column: 7, scope: !996)
!1008 = !DILocation(line: 1507, column: 7, scope: !994)
!1009 = !DILocation(line: 1507, column: 7, scope: !996)
!1010 = !DILocation(line: 1508, column: 7, scope: !994)
!1011 = !DILocation(line: 1508, column: 7, scope: !996)
!1012 = !DILocation(line: 1510, column: 7, scope: !994)
!1013 = !DILocation(line: 1510, column: 7, scope: !996)
!1014 = !DILocation(line: 1519, column: 7, scope: !994)
!1015 = !DILocation(line: 1519, column: 7, scope: !996)
!1016 = !DILocation(line: 1527, column: 7, scope: !994)
!1017 = !DILocation(line: 1527, column: 7, scope: !996)
!1018 = !DILocation(line: 1538, column: 7, scope: !994)
!1019 = !DILocation(line: 1538, column: 7, scope: !996)
!1020 = !DILocation(line: 1552, column: 7, scope: !994)
!1021 = !DILocation(line: 1552, column: 7, scope: !996)
!1022 = !DILocation(line: 1561, column: 7, scope: !994)
!1023 = !DILocation(line: 1561, column: 7, scope: !996)
!1024 = !DILocation(line: 1570, column: 7, scope: !994)
!1025 = !DILocation(line: 1570, column: 7, scope: !996)
!1026 = !DILocation(line: 642, column: 15, scope: !194, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 1571, column: 7, scope: !994)
!1028 = !DILocation(line: 651, column: 3, scope: !194, inlinedAt: !1027)
!1029 = !DILocation(line: 651, column: 3, scope: !1030, inlinedAt: !1027)
!1030 = !DILexicalBlockFile(scope: !194, file: !195, discriminator: 1)
!1031 = !DILocation(line: 655, column: 29, scope: !194, inlinedAt: !1027)
!1032 = !DILocation(line: 655, column: 15, scope: !194, inlinedAt: !1027)
!1033 = !DILocation(line: 656, column: 7, scope: !214, inlinedAt: !1027)
!1034 = !DILocation(line: 656, column: 19, scope: !214, inlinedAt: !1027)
!1035 = !DILocation(line: 656, column: 22, scope: !1036, inlinedAt: !1027)
!1036 = !DILexicalBlockFile(scope: !214, file: !195, discriminator: 16)
!1037 = !DILocation(line: 656, column: 7, scope: !1038, inlinedAt: !1027)
!1038 = !DILexicalBlockFile(scope: !194, file: !195, discriminator: 16)
!1039 = !DILocation(line: 662, column: 7, scope: !1040, inlinedAt: !1027)
!1040 = distinct !DILexicalBlock(scope: !214, file: !195, line: 657, column: 5)
!1041 = !DILocation(line: 662, column: 7, scope: !1042, inlinedAt: !1027)
!1042 = !DILexicalBlockFile(scope: !1040, file: !195, discriminator: 1)
!1043 = !DILocation(line: 664, column: 5, scope: !1040, inlinedAt: !1027)
!1044 = !DILocation(line: 665, column: 3, scope: !194, inlinedAt: !1027)
!1045 = !DILocation(line: 665, column: 3, scope: !1030, inlinedAt: !1027)
!1046 = !DILocation(line: 667, column: 3, scope: !194, inlinedAt: !1027)
!1047 = !DILocation(line: 667, column: 3, scope: !1030, inlinedAt: !1027)
!1048 = !DILocation(line: 1573, column: 3, scope: !972)
!1049 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1577, type: !1050, isLocal: false, isDefinition: true, scopeLine: 1578, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1053)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!27, !27, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1054 = !DILocalVariable(name: "argc", arg: 1, scope: !1049, file: !3, line: 1577, type: !27)
!1055 = !DILocalVariable(name: "argv", arg: 2, scope: !1049, file: !3, line: 1577, type: !1052)
!1056 = !DILocalVariable(name: "c", scope: !1049, file: !3, line: 1579, type: !27)
!1057 = !DILocalVariable(name: "i", scope: !1049, file: !3, line: 1580, type: !27)
!1058 = !DILocalVariable(name: "fs", scope: !1049, file: !3, line: 1581, type: !23)
!1059 = !DILocalVariable(name: "terse", scope: !1049, file: !3, line: 1582, type: !23)
!1060 = !DILocalVariable(name: "format", scope: !1049, file: !3, line: 1583, type: !31)
!1061 = !DILocalVariable(name: "format2", scope: !1049, file: !3, line: 1584, type: !31)
!1062 = !DILocalVariable(name: "ok", scope: !1049, file: !3, line: 1585, type: !23)
!1063 = !DILocalVariable(name: "locale", scope: !1049, file: !3, line: 1593, type: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !1067, line: 53, size: 768, elements: !1068)
!1067 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !1066, file: !1067, line: 57, baseType: !31, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !1066, file: !1067, line: 58, baseType: !31, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !1066, file: !1067, line: 64, baseType: !31, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !1066, file: !1067, line: 70, baseType: !31, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !1066, file: !1067, line: 71, baseType: !31, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !1066, file: !1067, line: 72, baseType: !31, size: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !1066, file: !1067, line: 73, baseType: !31, size: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !1066, file: !1067, line: 74, baseType: !31, size: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !1066, file: !1067, line: 75, baseType: !31, size: 64, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !1066, file: !1067, line: 76, baseType: !31, size: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !1066, file: !1067, line: 77, baseType: !26, size: 8, offset: 640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !1066, file: !1067, line: 78, baseType: !26, size: 8, offset: 648)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !1066, file: !1067, line: 80, baseType: !26, size: 8, offset: 656)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !1066, file: !1067, line: 82, baseType: !26, size: 8, offset: 664)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !1066, file: !1067, line: 84, baseType: !26, size: 8, offset: 672)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !1066, file: !1067, line: 86, baseType: !26, size: 8, offset: 680)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !1066, file: !1067, line: 93, baseType: !26, size: 8, offset: 688)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !1066, file: !1067, line: 94, baseType: !26, size: 8, offset: 696)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !1066, file: !1067, line: 97, baseType: !26, size: 8, offset: 704)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !1066, file: !1067, line: 99, baseType: !26, size: 8, offset: 712)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !1066, file: !1067, line: 101, baseType: !26, size: 8, offset: 720)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !1066, file: !1067, line: 103, baseType: !26, size: 8, offset: 728)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !1066, file: !1067, line: 110, baseType: !26, size: 8, offset: 736)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !1066, file: !1067, line: 111, baseType: !26, size: 8, offset: 744)
!1093 = !DILocation(line: 1577, column: 11, scope: !1049)
!1094 = !DILocation(line: 1577, column: 23, scope: !1049)
!1095 = !DILocation(line: 1581, column: 8, scope: !1049)
!1096 = !DILocation(line: 1582, column: 8, scope: !1049)
!1097 = !DILocation(line: 1583, column: 9, scope: !1049)
!1098 = !DILocation(line: 1585, column: 8, scope: !1049)
!1099 = !DILocation(line: 1588, column: 21, scope: !1049)
!1100 = !DILocation(line: 1588, column: 3, scope: !1049)
!1101 = !DILocation(line: 1589, column: 3, scope: !1049)
!1102 = !DILocation(line: 1590, column: 3, scope: !1049)
!1103 = !DILocation(line: 1591, column: 3, scope: !1049)
!1104 = !DILocation(line: 1593, column: 32, scope: !1049)
!1105 = !DILocation(line: 1593, column: 23, scope: !1049)
!1106 = !DILocation(line: 1594, column: 28, scope: !1049)
!1107 = !{!1108, !986, i64 0}
!1108 = !{!"lconv", !986, i64 0, !986, i64 8, !986, i64 16, !986, i64 24, !986, i64 32, !986, i64 40, !986, i64 48, !986, i64 56, !986, i64 64, !986, i64 72, !987, i64 80, !987, i64 81, !987, i64 82, !987, i64 83, !987, i64 84, !987, i64 85, !987, i64 86, !987, i64 87, !987, i64 88, !987, i64 89, !987, i64 90, !987, i64 91, !987, i64 92, !987, i64 93}
!1109 = !DILocation(line: 1594, column: 20, scope: !1049)
!1110 = !{!987, !987, i64 0}
!1111 = !DILocation(line: 1594, column: 17, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1049, file: !3, discriminator: 3)
!1113 = !DILocation(line: 1595, column: 23, scope: !1049)
!1114 = !DILocation(line: 1595, column: 21, scope: !1049)
!1115 = !{!1116, !1116, i64 0}
!1116 = !{!"long", !987, i64 0}
!1117 = !DILocation(line: 1597, column: 3, scope: !1049)
!1118 = !DILocation(line: 1599, column: 3, scope: !1049)
!1119 = !DILocation(line: 1599, column: 15, scope: !1120)
!1120 = !DILexicalBlockFile(scope: !1049, file: !3, discriminator: 1)
!1121 = !DILocation(line: 1579, column: 7, scope: !1049)
!1122 = !DILocation(line: 1599, column: 3, scope: !1120)
!1123 = distinct !{!1123, !1118, !1124}
!1124 = !DILocation(line: 1634, column: 5, scope: !1049)
!1125 = !DILocation(line: 1617, column: 11, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 1602, column: 9)
!1127 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1600, column: 5)
!1128 = !DILocation(line: 1627, column: 9, scope: !1126)
!1129 = !DILocation(line: 1629, column: 9, scope: !1126)
!1130 = !DILocation(line: 1629, column: 9, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1126, file: !3, discriminator: 1)
!1132 = !DILocation(line: 1632, column: 11, scope: !1126)
!1133 = !DILocation(line: 1636, column: 15, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1636, column: 7)
!1135 = !{!1136, !1136, i64 0}
!1136 = !{!"int", !987, i64 0}
!1137 = !DILocation(line: 1636, column: 12, scope: !1134)
!1138 = !DILocation(line: 1636, column: 7, scope: !1049)
!1139 = !DILocation(line: 1638, column: 20, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 1637, column: 5)
!1141 = !DILocation(line: 1638, column: 7, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1140, file: !3, discriminator: 1)
!1143 = !DILocation(line: 1639, column: 7, scope: !1140)
!1144 = !DILocation(line: 1642, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1642, column: 7)
!1146 = !DILocation(line: 1642, column: 7, scope: !1049)
!1147 = !DILocation(line: 1644, column: 11, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 1644, column: 11)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 1643, column: 5)
!1150 = !DILocation(line: 1644, column: 11, scope: !1149)
!1151 = !DILocation(line: 1018, column: 25, scope: !1152, inlinedAt: !1158)
!1152 = distinct !DISubprogram(name: "getenv_quoting_style", scope: !3, file: !3, line: 1016, type: !362, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1153)
!1153 = !{!1154, !1155}
!1154 = !DILocalVariable(name: "q_style", scope: !1152, file: !3, line: 1018, type: !24)
!1155 = !DILocalVariable(name: "i", scope: !1156, file: !3, line: 1021, type: !27)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 1020, column: 5)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 1019, column: 7)
!1158 = distinct !DILocation(line: 1645, column: 9, scope: !1148)
!1159 = !DILocation(line: 1018, column: 15, scope: !1152, inlinedAt: !1158)
!1160 = !DILocation(line: 1019, column: 7, scope: !1157, inlinedAt: !1158)
!1161 = !DILocation(line: 1019, column: 7, scope: !1152, inlinedAt: !1158)
!1162 = !DILocation(line: 1021, column: 15, scope: !1156, inlinedAt: !1158)
!1163 = !DILocation(line: 1021, column: 11, scope: !1156, inlinedAt: !1158)
!1164 = !DILocation(line: 1022, column: 13, scope: !1165, inlinedAt: !1158)
!1165 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 1022, column: 11)
!1166 = !DILocation(line: 1022, column: 11, scope: !1156, inlinedAt: !1158)
!1167 = !DILocation(line: 1023, column: 34, scope: !1165, inlinedAt: !1158)
!1168 = !DILocation(line: 1023, column: 9, scope: !1165, inlinedAt: !1158)
!1169 = !DILocation(line: 1026, column: 11, scope: !1170, inlinedAt: !1158)
!1170 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 1025, column: 9)
!1171 = !DILocation(line: 1027, column: 24, scope: !1170, inlinedAt: !1158)
!1172 = !DILocation(line: 1028, column: 57, scope: !1170, inlinedAt: !1158)
!1173 = !DILocation(line: 1027, column: 11, scope: !1174, inlinedAt: !1158)
!1174 = !DILexicalBlockFile(scope: !1170, file: !3, discriminator: 1)
!1175 = !DILocation(line: 1032, column: 5, scope: !1157, inlinedAt: !1158)
!1176 = !DILocation(line: 1650, column: 32, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 1649, column: 5)
!1178 = !DILocation(line: 1650, column: 36, scope: !1177)
!1179 = !DILocation(line: 1650, column: 16, scope: !1177)
!1180 = !DILocation(line: 1651, column: 17, scope: !1177)
!1181 = !DILocation(line: 1584, column: 9, scope: !1049)
!1182 = !DILocation(line: 1654, column: 12, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1654, column: 3)
!1184 = !DILocation(line: 1580, column: 7, scope: !1049)
!1185 = !DILocation(line: 1654, column: 22, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1187, file: !3, discriminator: 1)
