; ModuleID = 'coreutils-8.27/src/sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Print checksum and block counts for each FILE.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.16 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 44, type: !91, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !41, globals: !56)
!3 = !DIFile(filename: "src/sum.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 43, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!31 = !DIEnumerator(name: "human_ceiling", value: 0)
!32 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!33 = !DIEnumerator(name: "human_floor", value: 2)
!34 = !DIEnumerator(name: "human_group_digits", value: 4)
!35 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!36 = !DIEnumerator(name: "human_autoscale", value: 16)
!37 = !DIEnumerator(name: "human_base_1024", value: 32)
!38 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!39 = !DIEnumerator(name: "human_SI", value: 128)
!40 = !DIEnumerator(name: "human_B", value: 256)
!41 = !{!42, !44, !45, !48, !50, !53, !55, !52}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 62, baseType: !47)
!46 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!56 = !{!57, !60, !0}
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 42, type: !59, isLocal: true, isDefinition: true)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DIGlobalVariableExpression(var: !61)
!61 = distinct !DIGlobalVariable(name: "infomap", scope: !62, file: !63, line: 632, type: !88, isLocal: true, isDefinition: true)
!62 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !63, file: !63, line: 630, type: !64, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !66)
!63 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !53}
!66 = !{!67, !68, !69, !76, !78, !79, !80, !83, !84, !86}
!67 = !DILocalVariable(name: "program", arg: 1, scope: !62, file: !63, line: 630, type: !53)
!68 = !DILocalVariable(name: "node", scope: !62, file: !63, line: 642, type: !53)
!69 = !DILocalVariable(name: "map_prog", scope: !62, file: !63, line: 643, type: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !62, file: !63, line: 632, size: 128, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !72, file: !63, line: 632, baseType: !53, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !72, file: !63, line: 632, baseType: !53, size: 64, offset: 64)
!76 = !DILocalVariable(name: "__s1_len", scope: !77, file: !63, line: 645, type: !45)
!77 = distinct !DILexicalBlock(scope: !62, file: !63, line: 645, column: 33)
!78 = !DILocalVariable(name: "__s2_len", scope: !77, file: !63, line: 645, type: !45)
!79 = !DILocalVariable(name: "lc_messages", scope: !62, file: !63, line: 655, type: !53)
!80 = !DILocalVariable(name: "__s1_len", scope: !81, file: !63, line: 656, type: !45)
!81 = distinct !DILexicalBlock(scope: !82, file: !63, line: 656, column: 22)
!82 = distinct !DILexicalBlock(scope: !62, file: !63, line: 656, column: 7)
!83 = !DILocalVariable(name: "__s2_len", scope: !81, file: !63, line: 656, type: !45)
!84 = !DILocalVariable(name: "__s2", scope: !85, file: !63, line: 656, type: !50)
!85 = distinct !DILexicalBlock(scope: !81, file: !63, line: 656, column: 22)
!86 = !DILocalVariable(name: "__result", scope: !85, file: !63, line: 656, type: !87)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 896, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 7)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1024, elements: !101)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !94, line: 104, size: 256, elements: !95)
!94 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!95 = !{!96, !97, !98, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !94, line: 106, baseType: !53, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !93, file: !94, line: 109, baseType: !87, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !93, file: !94, line: 110, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !93, file: !94, line: 111, baseType: !87, size: 32, offset: 192)
!101 = !{!102}
!102 = !DISubrange(count: 4)
!103 = !DIGlobalVariableExpression(var: !104)
!104 = distinct !DIGlobalVariable(name: "Version", scope: !105, file: !106, line: 2, type: !53, isLocal: false, isDefinition: true)
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !108)
!106 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!107 = !{}
!108 = !{!103}
!109 = !DIGlobalVariableExpression(var: !110)
!110 = distinct !DIGlobalVariable(name: "file_name", scope: !111, file: !116, line: 36, type: !53, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !113)
!112 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !{!109, !114}
!114 = !DIGlobalVariableExpression(var: !115)
!115 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !111, file: !116, line: 46, type: !59, isLocal: true, isDefinition: true)
!116 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "exit_failure", scope: !119, file: !122, line: 24, type: !123, isLocal: false, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !121)
!120 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{!117}
!122 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "power_letter", scope: !126, file: !141, line: 36, type: !152, isLocal: true, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !128, retainedTypes: !137, globals: !138)
!127 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !{!28, !129}
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !130, line: 26, size: 32, elements: !131)
!130 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !{!132, !133, !134, !135, !136}
!132 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!133 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!134 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!135 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!136 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!137 = !{!53}
!138 = !{!124, !139, !146}
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "block_size_args", scope: !126, file: !141, line: 398, type: !142, isLocal: true, isDefinition: true)
!141 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 192, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!144 = !{!145}
!145 = !DISubrange(count: 3)
!146 = !DIGlobalVariableExpression(var: !147)
!147 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !126, file: !141, line: 399, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !150)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!150 = !{!151}
!151 = !DISubrange(count: 2)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 72, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 9)
!155 = !DIGlobalVariableExpression(var: !156)
!156 = distinct !DIGlobalVariable(name: "program_name", scope: !157, file: !161, line: 33, type: !53, isLocal: false, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !159, globals: !160)
!158 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!159 = !{!44, !42}
!160 = !{!155}
!161 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !164, file: !192, line: 77, type: !228, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !187, globals: !189)
!165 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!166 = !{!5, !167, !172}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !168)
!168 = !{!169, !170, !171}
!169 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!170 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!171 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!172 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !173, line: 46, size: 32, elements: !174)
!173 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!175 = !DIEnumerator(name: "_ISupper", value: 256)
!176 = !DIEnumerator(name: "_ISlower", value: 512)
!177 = !DIEnumerator(name: "_ISalpha", value: 1024)
!178 = !DIEnumerator(name: "_ISdigit", value: 2048)
!179 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!180 = !DIEnumerator(name: "_ISspace", value: 8192)
!181 = !DIEnumerator(name: "_ISprint", value: 16384)
!182 = !DIEnumerator(name: "_ISgraph", value: 32768)
!183 = !DIEnumerator(name: "_ISblank", value: 1)
!184 = !DIEnumerator(name: "_IScntrl", value: 2)
!185 = !DIEnumerator(name: "_ISpunct", value: 4)
!186 = !DIEnumerator(name: "_ISalnum", value: 8)
!187 = !{!87, !188, !45, !42}
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !{!162, !190, !197, !210, !212, !217, !224, !226}
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !164, file: !192, line: 93, type: !193, isLocal: false, isDefinition: true)
!192 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 320, elements: !195)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!195 = !{!196}
!196 = !DISubrange(count: 10)
!197 = !DIGlobalVariableExpression(var: !198)
!198 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !164, file: !192, line: 1043, type: !199, isLocal: false, isDefinition: true)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !192, line: 57, size: 448, elements: !200)
!200 = !{!201, !202, !203, !208, !209}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !199, file: !192, line: 60, baseType: !5, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !199, file: !192, line: 63, baseType: !87, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !199, file: !192, line: 67, baseType: !204, size: 256, offset: 64)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 256, elements: !206)
!205 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!206 = !{!207}
!207 = !DISubrange(count: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !199, file: !192, line: 70, baseType: !53, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !199, file: !192, line: 73, baseType: !53, size: 64, offset: 384)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !164, file: !192, line: 108, type: !199, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "slot0", scope: !164, file: !192, line: 834, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 256)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "slotvec", scope: !164, file: !192, line: 837, type: !219, isLocal: true, isDefinition: true)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !192, line: 826, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !220, file: !192, line: 828, baseType: !45, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !220, file: !192, line: 829, baseType: !42, size: 64, offset: 64)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "nslots", scope: !164, file: !192, line: 835, type: !87, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "slotvec0", scope: !164, file: !192, line: 836, type: !220, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 704, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 11)
!231 = !DIGlobalVariableExpression(var: !232)
!232 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !233, file: !236, line: 26, type: !237, isLocal: false, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !235)
!234 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !{!231}
!236 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 376, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 47)
!240 = !DIGlobalVariableExpression(var: !241)
!241 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !242, file: !247, line: 69, type: !248, isLocal: false, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !244, retainedTypes: !245, globals: !246)
!243 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!244 = !{!5}
!245 = !{!45, !44, !52}
!246 = !{!240}
!247 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !249, line: 55, baseType: !250)
!249 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null}
!253 = !DIGlobalVariableExpression(var: !254)
!254 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !255, file: !598, line: 120, type: !599, isLocal: true, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !257, retainedTypes: !596, globals: !597)
!256 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!257 = !{!258}
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 41, size: 32, elements: !260)
!259 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!261 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!262 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!263 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!264 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!265 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!266 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!267 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!268 = !DIEnumerator(name: "DAY_1", value: 131079)
!269 = !DIEnumerator(name: "DAY_2", value: 131080)
!270 = !DIEnumerator(name: "DAY_3", value: 131081)
!271 = !DIEnumerator(name: "DAY_4", value: 131082)
!272 = !DIEnumerator(name: "DAY_5", value: 131083)
!273 = !DIEnumerator(name: "DAY_6", value: 131084)
!274 = !DIEnumerator(name: "DAY_7", value: 131085)
!275 = !DIEnumerator(name: "ABMON_1", value: 131086)
!276 = !DIEnumerator(name: "ABMON_2", value: 131087)
!277 = !DIEnumerator(name: "ABMON_3", value: 131088)
!278 = !DIEnumerator(name: "ABMON_4", value: 131089)
!279 = !DIEnumerator(name: "ABMON_5", value: 131090)
!280 = !DIEnumerator(name: "ABMON_6", value: 131091)
!281 = !DIEnumerator(name: "ABMON_7", value: 131092)
!282 = !DIEnumerator(name: "ABMON_8", value: 131093)
!283 = !DIEnumerator(name: "ABMON_9", value: 131094)
!284 = !DIEnumerator(name: "ABMON_10", value: 131095)
!285 = !DIEnumerator(name: "ABMON_11", value: 131096)
!286 = !DIEnumerator(name: "ABMON_12", value: 131097)
!287 = !DIEnumerator(name: "MON_1", value: 131098)
!288 = !DIEnumerator(name: "MON_2", value: 131099)
!289 = !DIEnumerator(name: "MON_3", value: 131100)
!290 = !DIEnumerator(name: "MON_4", value: 131101)
!291 = !DIEnumerator(name: "MON_5", value: 131102)
!292 = !DIEnumerator(name: "MON_6", value: 131103)
!293 = !DIEnumerator(name: "MON_7", value: 131104)
!294 = !DIEnumerator(name: "MON_8", value: 131105)
!295 = !DIEnumerator(name: "MON_9", value: 131106)
!296 = !DIEnumerator(name: "MON_10", value: 131107)
!297 = !DIEnumerator(name: "MON_11", value: 131108)
!298 = !DIEnumerator(name: "MON_12", value: 131109)
!299 = !DIEnumerator(name: "AM_STR", value: 131110)
!300 = !DIEnumerator(name: "PM_STR", value: 131111)
!301 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!302 = !DIEnumerator(name: "D_FMT", value: 131113)
!303 = !DIEnumerator(name: "T_FMT", value: 131114)
!304 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!305 = !DIEnumerator(name: "ERA", value: 131116)
!306 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!307 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!308 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!309 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!310 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!311 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!312 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!313 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!314 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!315 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!316 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!317 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!318 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!319 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!320 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!321 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!322 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!323 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!324 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!325 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!326 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!327 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!328 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!329 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!330 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!331 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!332 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!333 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!334 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!335 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!336 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!337 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!338 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!339 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!340 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!341 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!342 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!343 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!344 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!345 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!346 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!347 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!348 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!349 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!350 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!351 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!352 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!353 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!354 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!355 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!356 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!357 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!358 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!359 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!360 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!361 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!362 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!363 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!364 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!365 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!366 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!367 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!368 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!369 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!370 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!371 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!372 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!373 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!374 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!375 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!376 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!377 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!378 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!379 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!380 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!381 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!382 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!383 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!384 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!385 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!386 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!387 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!388 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!389 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!390 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!391 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!392 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!393 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!394 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!395 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!396 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!397 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!398 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!399 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!400 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!401 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!402 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!403 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!404 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!405 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!406 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!407 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!408 = !DIEnumerator(name: "CODESET", value: 14)
!409 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!410 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!411 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!412 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!455 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!456 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!457 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!458 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!459 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!460 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!461 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!462 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!463 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!464 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!465 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!471 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!472 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!473 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!474 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!475 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!478 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!479 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!480 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!481 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!482 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!483 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!484 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!485 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!486 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!487 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!488 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!489 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!490 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!491 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!492 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!493 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!494 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!495 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!496 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!497 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!498 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!499 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!500 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!501 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!502 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!511 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!519 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!520 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!523 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!524 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!525 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!526 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!527 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!528 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!529 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!530 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!531 = !DIEnumerator(name: "THOUSEP", value: 65537)
!532 = !DIEnumerator(name: "__GROUPING", value: 65538)
!533 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!534 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!535 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!536 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!537 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!538 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!539 = !DIEnumerator(name: "__YESSTR", value: 327682)
!540 = !DIEnumerator(name: "__NOSTR", value: 327683)
!541 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!542 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!543 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!544 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!545 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!546 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!547 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!548 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!549 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!550 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!551 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!552 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!553 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!554 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!555 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!556 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!557 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!558 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!559 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!560 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!561 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!562 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!563 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!564 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!565 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!566 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!567 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!568 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!569 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!570 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!571 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!572 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!573 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!574 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!575 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!576 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!577 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!586 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!587 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!594 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!595 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!596 = !{!44, !42, !55}
!597 = !{!253}
!598 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!599 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602)
!601 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!602 = !{!19}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !605)
!604 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = !{!606}
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !608, file: !607, line: 62, size: 32, elements: !624)
!607 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = distinct !DISubprogram(name: "safe_read", scope: !607, file: !607, line: 56, type: !609, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !603, variables: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{!45, !87, !44, !45}
!611 = !{!612, !613, !614, !615}
!612 = !DILocalVariable(name: "fd", arg: 1, scope: !608, file: !607, line: 56, type: !87)
!613 = !DILocalVariable(name: "buf", arg: 2, scope: !608, file: !607, line: 56, type: !44)
!614 = !DILocalVariable(name: "count", arg: 3, scope: !608, file: !607, line: 56, type: !45)
!615 = !DILocalVariable(name: "result", scope: !616, file: !607, line: 66, type: !619)
!616 = distinct !DILexicalBlock(scope: !617, file: !607, line: 65, column: 5)
!617 = distinct !DILexicalBlock(scope: !618, file: !607, line: 64, column: 3)
!618 = distinct !DILexicalBlock(scope: !608, file: !607, line: 64, column: 3)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !620, line: 109, baseType: !621)
!620 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !622, line: 181, baseType: !623)
!622 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!623 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!624 = !{!625}
!625 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !628, retainedTypes: !633)
!627 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!628 = !{!629}
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !630, line: 41, size: 32, elements: !631)
!630 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!631 = !{!632}
!632 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!633 = !{!44}
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !636, retainedTypes: !650)
!635 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!636 = !{!637}
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !639, file: !638, line: 192, size: 32, elements: !648)
!638 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!639 = distinct !DISubprogram(name: "x2nrealloc", scope: !638, file: !638, line: 180, type: !640, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !634, variables: !643)
!640 = !DISubroutineType(types: !641)
!641 = !{!44, !44, !642, !45}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!643 = !{!644, !645, !646, !647}
!644 = !DILocalVariable(name: "p", arg: 1, scope: !639, file: !638, line: 180, type: !44)
!645 = !DILocalVariable(name: "pn", arg: 2, scope: !639, file: !638, line: 180, type: !642)
!646 = !DILocalVariable(name: "s", arg: 3, scope: !639, file: !638, line: 180, type: !45)
!647 = !DILocalVariable(name: "n", scope: !639, file: !638, line: 182, type: !45)
!648 = !{!649}
!649 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!650 = !{!45, !42, !44}
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!652 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !655, retainedTypes: !656)
!654 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = !{!129, !172}
!656 = !{!87, !188, !42}
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !633)
!658 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!660 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !633)
!662 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !633)
!664 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !667)
!666 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!667 = !{!45}
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!669 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !672)
!671 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = !{!45, !48, !50, !53}
!673 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!674 = !{i32 2, !"Dwarf Version", i32 4}
!675 = !{i32 2, !"Debug Info Version", i32 3}
!676 = !{i32 1, !"PIC Level", i32 2}
!677 = !{i32 1, !"PIE Level", i32 2}
!678 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !679, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !87}
!681 = !{!682}
!682 = !DILocalVariable(name: "status", arg: 1, scope: !678, file: !3, line: 53, type: !87)
!683 = !DIExpression()
!684 = !DILocation(line: 53, column: 12, scope: !678)
!685 = !DILocation(line: 55, column: 14, scope: !686)
!686 = distinct !DILexicalBlock(scope: !678, file: !3, line: 55, column: 7)
!687 = !DILocation(line: 55, column: 7, scope: !678)
!688 = !DILocation(line: 56, column: 5, scope: !689)
!689 = !DILexicalBlockFile(scope: !690, file: !3, discriminator: 1)
!690 = distinct !DILexicalBlock(scope: !686, file: !3, line: 56, column: 5)
!691 = !{!692, !692, i64 0}
!692 = !{!"any pointer", !693, i64 0}
!693 = !{!"omnipotent char", !694, i64 0}
!694 = !{!"Simple C/C++ TBAA"}
!695 = !DILocation(line: 56, column: 5, scope: !696)
!696 = !DILexicalBlockFile(scope: !690, file: !3, discriminator: 3)
!697 = !DILocation(line: 56, column: 5, scope: !698)
!698 = !DILexicalBlockFile(scope: !690, file: !3, discriminator: 2)
!699 = !DILocation(line: 59, column: 7, scope: !700)
!700 = distinct !DILexicalBlock(scope: !686, file: !3, line: 58, column: 5)
!701 = !DILocation(line: 59, column: 7, scope: !702)
!702 = !DILexicalBlockFile(scope: !700, file: !3, discriminator: 1)
!703 = !DILocation(line: 63, column: 7, scope: !700)
!704 = !DILocation(line: 63, column: 7, scope: !702)
!705 = !DILocation(line: 580, column: 3, scope: !706, inlinedAt: !707)
!706 = distinct !DISubprogram(name: "emit_stdin_note", scope: !63, file: !63, line: 578, type: !251, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !107)
!707 = distinct !DILocation(line: 67, column: 7, scope: !700)
!708 = !DILocation(line: 580, column: 3, scope: !709, inlinedAt: !707)
!709 = !DILexicalBlockFile(scope: !706, file: !63, discriminator: 1)
!710 = !DILocation(line: 69, column: 7, scope: !700)
!711 = !DILocation(line: 69, column: 7, scope: !702)
!712 = !DILocation(line: 74, column: 7, scope: !700)
!713 = !DILocation(line: 74, column: 7, scope: !702)
!714 = !DILocation(line: 75, column: 7, scope: !700)
!715 = !DILocation(line: 75, column: 7, scope: !702)
!716 = !DILocation(line: 642, column: 15, scope: !62, inlinedAt: !717)
!717 = distinct !DILocation(line: 76, column: 7, scope: !700)
!718 = !DILocation(line: 651, column: 3, scope: !62, inlinedAt: !717)
!719 = !DILocation(line: 651, column: 3, scope: !720, inlinedAt: !717)
!720 = !DILexicalBlockFile(scope: !62, file: !63, discriminator: 1)
!721 = !DILocation(line: 655, column: 29, scope: !62, inlinedAt: !717)
!722 = !DILocation(line: 655, column: 15, scope: !62, inlinedAt: !717)
!723 = !DILocation(line: 656, column: 7, scope: !82, inlinedAt: !717)
!724 = !DILocation(line: 656, column: 19, scope: !82, inlinedAt: !717)
!725 = !DILocation(line: 656, column: 22, scope: !726, inlinedAt: !717)
!726 = !DILexicalBlockFile(scope: !82, file: !63, discriminator: 16)
!727 = !DILocation(line: 656, column: 7, scope: !728, inlinedAt: !717)
!728 = !DILexicalBlockFile(scope: !62, file: !63, discriminator: 16)
!729 = !DILocation(line: 662, column: 7, scope: !730, inlinedAt: !717)
!730 = distinct !DILexicalBlock(scope: !82, file: !63, line: 657, column: 5)
!731 = !DILocation(line: 662, column: 7, scope: !732, inlinedAt: !717)
!732 = !DILexicalBlockFile(scope: !730, file: !63, discriminator: 1)
!733 = !DILocation(line: 664, column: 5, scope: !730, inlinedAt: !717)
!734 = !DILocation(line: 665, column: 3, scope: !62, inlinedAt: !717)
!735 = !DILocation(line: 665, column: 3, scope: !720, inlinedAt: !717)
!736 = !DILocation(line: 667, column: 3, scope: !62, inlinedAt: !717)
!737 = !DILocation(line: 667, column: 3, scope: !720, inlinedAt: !717)
!738 = !DILocation(line: 78, column: 3, scope: !678)
!739 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 222, type: !740, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !743)
!740 = !DISubroutineType(types: !741)
!741 = !{!87, !87, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!743 = !{!744, !745, !746, !747, !748, !749}
!744 = !DILocalVariable(name: "argc", arg: 1, scope: !739, file: !3, line: 222, type: !87)
!745 = !DILocalVariable(name: "argv", arg: 2, scope: !739, file: !3, line: 222, type: !742)
!746 = !DILocalVariable(name: "ok", scope: !739, file: !3, line: 224, type: !59)
!747 = !DILocalVariable(name: "optc", scope: !739, file: !3, line: 225, type: !87)
!748 = !DILocalVariable(name: "files_given", scope: !739, file: !3, line: 226, type: !87)
!749 = !DILocalVariable(name: "sum_func", scope: !739, file: !3, line: 227, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!59, !53, !87}
!753 = !DILocation(line: 222, column: 11, scope: !739)
!754 = !DILocation(line: 222, column: 24, scope: !739)
!755 = !DILocation(line: 227, column: 10, scope: !739)
!756 = !DILocation(line: 230, column: 21, scope: !739)
!757 = !DILocation(line: 230, column: 3, scope: !739)
!758 = !DILocation(line: 231, column: 3, scope: !739)
!759 = !DILocation(line: 232, column: 3, scope: !739)
!760 = !DILocation(line: 233, column: 3, scope: !739)
!761 = !DILocation(line: 235, column: 3, scope: !739)
!762 = !DILocation(line: 239, column: 12, scope: !739)
!763 = !DILocation(line: 239, column: 3, scope: !739)
!764 = !DILocation(line: 243, column: 3, scope: !739)
!765 = !DILocation(line: 243, column: 18, scope: !766)
!766 = !DILexicalBlockFile(scope: !739, file: !3, discriminator: 1)
!767 = !DILocation(line: 225, column: 7, scope: !739)
!768 = !DILocation(line: 243, column: 3, scope: !766)
!769 = !DILocation(line: 253, column: 11, scope: !770)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 246, column: 9)
!771 = distinct !DILexicalBlock(scope: !739, file: !3, line: 244, column: 5)
!772 = distinct !{!772, !764, !773}
!773 = !DILocation(line: 262, column: 5, scope: !739)
!774 = !DILocation(line: 255, column: 9, scope: !770)
!775 = !DILocation(line: 257, column: 9, scope: !770)
!776 = !DILocation(line: 257, column: 9, scope: !777)
!777 = !DILexicalBlockFile(scope: !770, file: !3, discriminator: 1)
!778 = !DILocation(line: 260, column: 11, scope: !770)
!779 = !DILocation(line: 264, column: 24, scope: !739)
!780 = !{!781, !781, i64 0}
!781 = !{!"int", !693, i64 0}
!782 = !DILocation(line: 264, column: 22, scope: !739)
!783 = !DILocation(line: 226, column: 7, scope: !739)
!784 = !DILocation(line: 265, column: 19, scope: !785)
!785 = distinct !DILexicalBlock(scope: !739, file: !3, line: 265, column: 7)
!786 = !DILocation(line: 265, column: 7, scope: !739)
!787 = !DILocation(line: 224, column: 8, scope: !739)
!788 = !DILocation(line: 268, column: 28, scope: !789)
!789 = !DILexicalBlockFile(scope: !790, file: !3, discriminator: 1)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 268, column: 5)
!791 = distinct !DILexicalBlock(scope: !785, file: !3, line: 268, column: 5)
!792 = !DILocation(line: 268, column: 5, scope: !793)
!793 = !DILexicalBlockFile(scope: !791, file: !3, discriminator: 1)
!794 = !DILocation(line: 269, column: 23, scope: !790)
!795 = !DILocation(line: 266, column: 10, scope: !785)
!796 = !DILocation(line: 266, column: 8, scope: !785)
!797 = !DILocation(line: 266, column: 5, scope: !785)
!798 = !DILocation(line: 269, column: 13, scope: !790)
!799 = !DILocation(line: 269, column: 10, scope: !790)
!800 = !DILocation(line: 268, column: 42, scope: !801)
!801 = !DILexicalBlockFile(scope: !790, file: !3, discriminator: 2)
!802 = distinct !{!802, !803, !804}
!803 = !DILocation(line: 268, column: 5, scope: !791)
!804 = !DILocation(line: 269, column: 48, scope: !791)
!805 = !DILocation(line: 271, column: 23, scope: !806)
!806 = distinct !DILexicalBlock(scope: !739, file: !3, line: 271, column: 7)
!807 = !DILocation(line: 271, column: 34, scope: !808)
!808 = !DILexicalBlockFile(scope: !806, file: !3, discriminator: 1)
!809 = !DILocation(line: 271, column: 26, scope: !808)
!810 = !DILocation(line: 271, column: 41, scope: !808)
!811 = !DILocation(line: 271, column: 7, scope: !766)
!812 = !DILocation(line: 272, column: 5, scope: !806)
!813 = !DILocation(line: 272, column: 5, scope: !808)
!814 = !DILocation(line: 272, column: 5, scope: !815)
!815 = !DILexicalBlockFile(scope: !806, file: !3, discriminator: 2)
!816 = !DILocation(line: 273, column: 10, scope: !739)
!817 = !DILocation(line: 274, column: 1, scope: !739)
!818 = distinct !DISubprogram(name: "bsd_sum_file", scope: !3, file: !3, line: 88, type: !751, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !819)
!819 = !{!820, !821, !822, !876, !877, !881, !882, !886, !887, !889, !890, !892}
!820 = !DILocalVariable(name: "file", arg: 1, scope: !818, file: !3, line: 88, type: !53)
!821 = !DILocalVariable(name: "print_name", arg: 2, scope: !818, file: !3, line: 88, type: !87)
!822 = !DILocalVariable(name: "fp", scope: !818, file: !3, line: 90, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !825, line: 49, baseType: !826)
!825 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !827, line: 241, size: 1728, elements: !828)
!827 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !849, !850, !851, !852, !854, !855, !857, !861, !864, !866, !867, !868, !869, !870, !871, !872}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !826, file: !827, line: 242, baseType: !87, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !826, file: !827, line: 247, baseType: !42, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !826, file: !827, line: 248, baseType: !42, size: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !826, file: !827, line: 249, baseType: !42, size: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !826, file: !827, line: 250, baseType: !42, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !826, file: !827, line: 251, baseType: !42, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !826, file: !827, line: 252, baseType: !42, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !826, file: !827, line: 253, baseType: !42, size: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !826, file: !827, line: 254, baseType: !42, size: 64, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !826, file: !827, line: 256, baseType: !42, size: 64, offset: 576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !826, file: !827, line: 257, baseType: !42, size: 64, offset: 640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !826, file: !827, line: 258, baseType: !42, size: 64, offset: 704)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !826, file: !827, line: 260, baseType: !842, size: 64, offset: 768)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !827, line: 156, size: 192, elements: !844)
!844 = !{!845, !846, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !843, file: !827, line: 157, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !843, file: !827, line: 158, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !843, file: !827, line: 162, baseType: !87, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !826, file: !827, line: 262, baseType: !847, size: 64, offset: 832)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !826, file: !827, line: 264, baseType: !87, size: 32, offset: 896)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !826, file: !827, line: 268, baseType: !87, size: 32, offset: 928)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !826, file: !827, line: 270, baseType: !853, size: 64, offset: 960)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !622, line: 140, baseType: !623)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !826, file: !827, line: 274, baseType: !188, size: 16, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !826, file: !827, line: 275, baseType: !856, size: 8, offset: 1040)
!856 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !826, file: !827, line: 276, baseType: !858, size: 8, offset: 1048)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 1)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !826, file: !827, line: 280, baseType: !862, size: 64, offset: 1088)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !827, line: 150, baseType: null)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !826, file: !827, line: 289, baseType: !865, size: 64, offset: 1152)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !622, line: 141, baseType: !623)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !826, file: !827, line: 297, baseType: !44, size: 64, offset: 1216)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !826, file: !827, line: 298, baseType: !44, size: 64, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !826, file: !827, line: 299, baseType: !44, size: 64, offset: 1344)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !826, file: !827, line: 300, baseType: !44, size: 64, offset: 1408)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !826, file: !827, line: 302, baseType: !45, size: 64, offset: 1472)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !826, file: !827, line: 303, baseType: !87, size: 32, offset: 1536)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !826, file: !827, line: 305, baseType: !873, size: 160, offset: 1568)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 20)
!876 = !DILocalVariable(name: "checksum", scope: !818, file: !3, line: 91, type: !87)
!877 = !DILocalVariable(name: "total_bytes", scope: !818, file: !3, line: 92, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !879, line: 136, baseType: !880)
!879 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !622, line: 62, baseType: !47)
!881 = !DILocalVariable(name: "ch", scope: !818, file: !3, line: 93, type: !87)
!882 = !DILocalVariable(name: "hbuf", scope: !818, file: !3, line: 94, type: !883)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 5216, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 652)
!886 = !DILocalVariable(name: "is_stdin", scope: !818, file: !3, line: 95, type: !59)
!887 = !DILocalVariable(name: "__s1_len", scope: !888, file: !3, line: 95, type: !45)
!888 = distinct !DILexicalBlock(scope: !818, file: !3, line: 95, column: 19)
!889 = !DILocalVariable(name: "__s2_len", scope: !888, file: !3, line: 95, type: !45)
!890 = !DILocalVariable(name: "__s2", scope: !891, file: !3, line: 95, type: !50)
!891 = distinct !DILexicalBlock(scope: !888, file: !3, line: 95, column: 19)
!892 = !DILocalVariable(name: "__result", scope: !891, file: !3, line: 95, type: !87)
!893 = !DILocation(line: 88, column: 27, scope: !818)
!894 = !DILocation(line: 88, column: 37, scope: !818)
!895 = !DILocation(line: 91, column: 7, scope: !818)
!896 = !DILocation(line: 92, column: 13, scope: !818)
!897 = !DILocation(line: 94, column: 3, scope: !818)
!898 = !DILocation(line: 94, column: 8, scope: !818)
!899 = !DILocation(line: 95, column: 19, scope: !888)
!900 = !DILocation(line: 95, column: 19, scope: !891)
!901 = !DILocation(line: 95, column: 19, scope: !902)
!902 = !DILexicalBlockFile(scope: !891, file: !3, discriminator: 2)
!903 = !{!693, !693, i64 0}
!904 = !DILocation(line: 95, column: 19, scope: !905)
!905 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 3)
!906 = distinct !DILexicalBlock(scope: !891, file: !3, line: 95, column: 19)
!907 = !DILocation(line: 95, column: 19, scope: !908)
!908 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 2)
!909 = !DILocation(line: 95, column: 19, scope: !910)
!910 = !DILexicalBlockFile(scope: !911, file: !3, discriminator: 4)
!911 = distinct !DILexicalBlock(scope: !906, file: !3, line: 95, column: 19)
!912 = !DILocation(line: 95, column: 19, scope: !913)
!913 = !DILexicalBlockFile(scope: !888, file: !3, discriminator: 11)
!914 = !DILocation(line: 97, column: 7, scope: !818)
!915 = !DILocation(line: 99, column: 12, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 98, column: 5)
!917 = distinct !DILexicalBlock(scope: !818, file: !3, line: 97, column: 7)
!918 = !DILocation(line: 90, column: 9, scope: !818)
!919 = !DILocation(line: 102, column: 5, scope: !916)
!920 = !DILocation(line: 105, column: 12, scope: !921)
!921 = distinct !DILexicalBlock(scope: !917, file: !3, line: 104, column: 5)
!922 = !DILocation(line: 106, column: 14, scope: !923)
!923 = distinct !DILexicalBlock(scope: !921, file: !3, line: 106, column: 11)
!924 = !DILocation(line: 106, column: 11, scope: !921)
!925 = !DILocation(line: 108, column: 21, scope: !926)
!926 = distinct !DILexicalBlock(scope: !923, file: !3, line: 107, column: 9)
!927 = !DILocation(line: 108, column: 34, scope: !928)
!928 = !DILexicalBlockFile(scope: !926, file: !3, discriminator: 1)
!929 = !DILocation(line: 108, column: 11, scope: !930)
!930 = !DILexicalBlockFile(scope: !926, file: !3, discriminator: 2)
!931 = !DILocation(line: 109, column: 11, scope: !926)
!932 = !DILocation(line: 113, column: 3, scope: !818)
!933 = !DILocation(line: 115, column: 3, scope: !818)
!934 = !DILocalVariable(name: "__fp", arg: 1, scope: !935, file: !936, line: 63, type: !823)
!935 = distinct !DISubprogram(name: "getc_unlocked", scope: !936, file: !936, line: 63, type: !937, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !939)
!936 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!937 = !DISubroutineType(types: !938)
!938 = !{!87, !823}
!939 = !{!934}
!940 = !DILocation(line: 63, column: 22, scope: !935, inlinedAt: !941)
!941 = distinct !DILocation(line: 115, column: 16, scope: !942)
!942 = !DILexicalBlockFile(scope: !818, file: !3, discriminator: 1)
!943 = !DILocation(line: 65, column: 10, scope: !935, inlinedAt: !941)
!944 = !{!945, !692, i64 8}
!945 = !{!"_IO_FILE", !781, i64 0, !692, i64 8, !692, i64 16, !692, i64 24, !692, i64 32, !692, i64 40, !692, i64 48, !692, i64 56, !692, i64 64, !692, i64 72, !692, i64 80, !692, i64 88, !692, i64 96, !692, i64 104, !781, i64 112, !781, i64 116, !946, i64 120, !947, i64 128, !693, i64 130, !693, i64 131, !692, i64 136, !946, i64 144, !692, i64 152, !692, i64 160, !692, i64 168, !692, i64 176, !946, i64 184, !781, i64 192, !693, i64 196}
!946 = !{!"long", !693, i64 0}
!947 = !{!"short", !693, i64 0}
!948 = !{!945, !692, i64 16}
!949 = !{!"branch_weights", i32 2000, i32 1}
!950 = !DILocation(line: 65, column: 10, scope: !951, inlinedAt: !941)
!951 = !DILexicalBlockFile(scope: !935, file: !936, discriminator: 2)
!952 = !DILocation(line: 93, column: 7, scope: !818)
!953 = !DILocation(line: 115, column: 3, scope: !942)
!954 = !DILocation(line: 65, column: 10, scope: !955, inlinedAt: !941)
!955 = !DILexicalBlockFile(scope: !935, file: !936, discriminator: 1)
!956 = !DILocation(line: 115, column: 27, scope: !942)
!957 = !DILocation(line: 117, column: 18, scope: !958)
!958 = distinct !DILexicalBlock(scope: !818, file: !3, line: 116, column: 5)
!959 = !DILocation(line: 118, column: 28, scope: !958)
!960 = !DILocation(line: 118, column: 52, scope: !958)
!961 = !DILocation(line: 118, column: 34, scope: !958)
!962 = !DILocation(line: 119, column: 16, scope: !958)
!963 = !DILocation(line: 120, column: 16, scope: !958)
!964 = !DILocation(line: 115, column: 3, scope: !965)
!965 = !DILexicalBlockFile(scope: !818, file: !3, discriminator: 2)
!966 = distinct !{!966, !933, !967}
!967 = !DILocation(line: 121, column: 5, scope: !818)
!968 = !DILocalVariable(name: "__stream", arg: 1, scope: !969, file: !936, line: 132, type: !823)
!969 = distinct !DISubprogram(name: "ferror_unlocked", scope: !936, file: !936, line: 132, type: !937, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !970)
!970 = !{!968}
!971 = !DILocation(line: 132, column: 1, scope: !969, inlinedAt: !972)
!972 = distinct !DILocation(line: 123, column: 7, scope: !973)
!973 = distinct !DILexicalBlock(scope: !818, file: !3, line: 123, column: 7)
!974 = !DILocation(line: 134, column: 10, scope: !969, inlinedAt: !972)
!975 = !{!945, !781, i64 0}
!976 = !DILocation(line: 123, column: 7, scope: !973)
!977 = !DILocation(line: 123, column: 7, scope: !818)
!978 = !DILocation(line: 125, column: 17, scope: !979)
!979 = distinct !DILexicalBlock(scope: !973, file: !3, line: 124, column: 5)
!980 = !DILocation(line: 125, column: 30, scope: !981)
!981 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 1)
!982 = !DILocation(line: 125, column: 7, scope: !983)
!983 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 2)
!984 = !DILocation(line: 126, column: 11, scope: !979)
!985 = !DILocation(line: 127, column: 9, scope: !986)
!986 = distinct !DILexicalBlock(scope: !979, file: !3, line: 126, column: 11)
!987 = !DILocation(line: 131, column: 17, scope: !988)
!988 = distinct !DILexicalBlock(scope: !818, file: !3, line: 131, column: 7)
!989 = !DILocation(line: 131, column: 20, scope: !990)
!990 = !DILexicalBlockFile(scope: !988, file: !3, discriminator: 1)
!991 = !DILocation(line: 131, column: 32, scope: !990)
!992 = !DILocation(line: 131, column: 7, scope: !942)
!993 = !DILocation(line: 133, column: 17, scope: !994)
!994 = distinct !DILexicalBlock(scope: !988, file: !3, line: 132, column: 5)
!995 = !DILocation(line: 133, column: 30, scope: !996)
!996 = !DILexicalBlockFile(scope: !994, file: !3, discriminator: 1)
!997 = !DILocation(line: 133, column: 7, scope: !998)
!998 = !DILexicalBlockFile(scope: !994, file: !3, discriminator: 2)
!999 = !DILocation(line: 134, column: 7, scope: !994)
!1000 = !DILocation(line: 137, column: 3, scope: !818)
!1001 = !DILocation(line: 137, column: 3, scope: !942)
!1002 = !DILocation(line: 139, column: 18, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !818, file: !3, line: 139, column: 7)
!1004 = !DILocation(line: 139, column: 7, scope: !818)
!1005 = !DILocation(line: 140, column: 5, scope: !1003)
!1006 = !DILocalVariable(name: "__c", arg: 1, scope: !1007, file: !936, line: 105, type: !87)
!1007 = distinct !DISubprogram(name: "putchar_unlocked", scope: !936, file: !936, line: 105, type: !1008, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1010)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!87, !87}
!1010 = !{!1006}
!1011 = !DILocation(line: 105, column: 23, scope: !1007, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 141, column: 3, scope: !818)
!1013 = !DILocation(line: 107, column: 10, scope: !1007, inlinedAt: !1012)
!1014 = !{!945, !692, i64 40}
!1015 = !{!945, !692, i64 48}
!1016 = !DILocation(line: 107, column: 10, scope: !1017, inlinedAt: !1012)
!1017 = !DILexicalBlockFile(scope: !1007, file: !936, discriminator: 1)
!1018 = !DILocation(line: 107, column: 10, scope: !1019, inlinedAt: !1012)
!1019 = !DILexicalBlockFile(scope: !1007, file: !936, discriminator: 2)
!1020 = !DILocation(line: 144, column: 1, scope: !818)
!1021 = distinct !DISubprogram(name: "sysv_sum_file", scope: !3, file: !3, line: 152, type: !751, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1038, !1039, !1041, !1042, !1044}
!1023 = !DILocalVariable(name: "file", arg: 1, scope: !1021, file: !3, line: 152, type: !53)
!1024 = !DILocalVariable(name: "print_name", arg: 2, scope: !1021, file: !3, line: 152, type: !87)
!1025 = !DILocalVariable(name: "fd", scope: !1021, file: !3, line: 154, type: !87)
!1026 = !DILocalVariable(name: "buf", scope: !1021, file: !3, line: 155, type: !1027)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 65536, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 8192)
!1030 = !DILocalVariable(name: "total_bytes", scope: !1021, file: !3, line: 156, type: !878)
!1031 = !DILocalVariable(name: "hbuf", scope: !1021, file: !3, line: 157, type: !883)
!1032 = !DILocalVariable(name: "r", scope: !1021, file: !3, line: 158, type: !87)
!1033 = !DILocalVariable(name: "checksum", scope: !1021, file: !3, line: 159, type: !87)
!1034 = !DILocalVariable(name: "s", scope: !1021, file: !3, line: 162, type: !205)
!1035 = !DILocalVariable(name: "is_stdin", scope: !1021, file: !3, line: 164, type: !59)
!1036 = !DILocalVariable(name: "__s1_len", scope: !1037, file: !3, line: 164, type: !45)
!1037 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 164, column: 19)
!1038 = !DILocalVariable(name: "__s2_len", scope: !1037, file: !3, line: 164, type: !45)
!1039 = !DILocalVariable(name: "__s2", scope: !1040, file: !3, line: 164, type: !50)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 164, column: 19)
!1041 = !DILocalVariable(name: "__result", scope: !1040, file: !3, line: 164, type: !87)
!1042 = !DILocalVariable(name: "i", scope: !1043, file: !3, line: 184, type: !45)
!1043 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 183, column: 5)
!1044 = !DILocalVariable(name: "bytes_read", scope: !1043, file: !3, line: 185, type: !45)
!1045 = !DILocation(line: 152, column: 28, scope: !1021)
!1046 = !DILocation(line: 152, column: 38, scope: !1021)
!1047 = !DILocation(line: 155, column: 3, scope: !1021)
!1048 = !DILocation(line: 155, column: 17, scope: !1021)
!1049 = !DILocation(line: 156, column: 13, scope: !1021)
!1050 = !DILocation(line: 157, column: 3, scope: !1021)
!1051 = !DILocation(line: 157, column: 8, scope: !1021)
!1052 = !DILocation(line: 162, column: 16, scope: !1021)
!1053 = !DILocation(line: 164, column: 19, scope: !1037)
!1054 = !DILocation(line: 164, column: 19, scope: !1040)
!1055 = !DILocation(line: 164, column: 19, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !1040, file: !3, discriminator: 2)
!1057 = !DILocation(line: 164, column: 19, scope: !1058)
!1058 = !DILexicalBlockFile(scope: !1059, file: !3, discriminator: 3)
!1059 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 164, column: 19)
!1060 = !DILocation(line: 164, column: 19, scope: !1061)
!1061 = !DILexicalBlockFile(scope: !1059, file: !3, discriminator: 2)
!1062 = !DILocation(line: 164, column: 19, scope: !1063)
!1063 = !DILexicalBlockFile(scope: !1064, file: !3, discriminator: 4)
!1064 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 164, column: 19)
!1065 = !DILocation(line: 164, column: 19, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1037, file: !3, discriminator: 11)
!1067 = !DILocation(line: 166, column: 7, scope: !1021)
!1068 = !DILocation(line: 154, column: 7, scope: !1021)
!1069 = !DILocation(line: 171, column: 5, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 167, column: 5)
!1071 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 166, column: 7)
!1072 = !DILocation(line: 174, column: 12, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 173, column: 5)
!1074 = !DILocation(line: 175, column: 14, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 175, column: 11)
!1076 = !DILocation(line: 175, column: 11, scope: !1073)
!1077 = !DILocation(line: 177, column: 21, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 176, column: 9)
!1079 = !DILocation(line: 177, column: 34, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1078, file: !3, discriminator: 1)
!1081 = !DILocation(line: 177, column: 11, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1078, file: !3, discriminator: 2)
!1083 = !DILocation(line: 178, column: 11, scope: !1078)
!1084 = !DILocation(line: 185, column: 27, scope: !1043)
!1085 = !DILocation(line: 185, column: 14, scope: !1043)
!1086 = !DILocation(line: 187, column: 11, scope: !1043)
!1087 = !DILocation(line: 199, column: 14, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 198, column: 7)
!1089 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 198, column: 7)
!1090 = !DILocation(line: 199, column: 11, scope: !1088)
!1091 = !DILocation(line: 198, column: 36, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1088, file: !3, discriminator: 2)
!1093 = distinct !{!1093, !1094, !1095, !1096, !1097}
!1094 = !DILocation(line: 198, column: 7, scope: !1089)
!1095 = !DILocation(line: 199, column: 19, scope: !1089)
!1096 = !{!"llvm.loop.vectorize.width", i32 1}
!1097 = !{!"llvm.loop.interleave.count", i32 1}
!1098 = !DILocation(line: 192, column: 21, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 191, column: 9)
!1100 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 190, column: 11)
!1101 = !DILocation(line: 192, column: 34, scope: !1102)
!1102 = !DILexicalBlockFile(scope: !1099, file: !3, discriminator: 1)
!1103 = !DILocation(line: 192, column: 11, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1099, file: !3, discriminator: 2)
!1105 = !DILocation(line: 193, column: 15, scope: !1099)
!1106 = !DILocation(line: 194, column: 13, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 193, column: 15)
!1108 = !DILocation(line: 184, column: 14, scope: !1043)
!1109 = !DILocation(line: 198, column: 21, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1088, file: !3, discriminator: 1)
!1111 = !DILocation(line: 198, column: 7, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1089, file: !3, discriminator: 1)
!1113 = distinct !{!1113, !1094, !1095, !1114, !1096, !1097}
!1114 = !{!"llvm.loop.unroll.runtime.disable"}
!1115 = !DILocation(line: 200, column: 19, scope: !1043)
!1116 = !DILocation(line: 203, column: 17, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 203, column: 7)
!1118 = !DILocation(line: 203, column: 20, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1117, file: !3, discriminator: 1)
!1120 = !DILocation(line: 203, column: 31, scope: !1119)
!1121 = !DILocation(line: 203, column: 7, scope: !1122)
!1122 = !DILexicalBlockFile(scope: !1021, file: !3, discriminator: 1)
!1123 = !DILocation(line: 205, column: 17, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 204, column: 5)
!1125 = !DILocation(line: 205, column: 30, scope: !1126)
!1126 = !DILexicalBlockFile(scope: !1124, file: !3, discriminator: 1)
!1127 = !DILocation(line: 205, column: 7, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1124, file: !3, discriminator: 2)
!1129 = !DILocation(line: 206, column: 7, scope: !1124)
!1130 = !DILocation(line: 209, column: 10, scope: !1021)
!1131 = !DILocation(line: 209, column: 40, scope: !1021)
!1132 = !DILocation(line: 209, column: 20, scope: !1021)
!1133 = !DILocation(line: 158, column: 7, scope: !1021)
!1134 = !DILocation(line: 210, column: 17, scope: !1021)
!1135 = !DILocation(line: 210, column: 32, scope: !1021)
!1136 = !DILocation(line: 210, column: 27, scope: !1021)
!1137 = !DILocation(line: 159, column: 7, scope: !1021)
!1138 = !DILocation(line: 212, column: 3, scope: !1021)
!1139 = !DILocation(line: 212, column: 3, scope: !1122)
!1140 = !DILocation(line: 214, column: 7, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 214, column: 7)
!1142 = !DILocation(line: 214, column: 7, scope: !1021)
!1143 = !DILocation(line: 215, column: 5, scope: !1141)
!1144 = !DILocation(line: 105, column: 23, scope: !1007, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 216, column: 3, scope: !1021)
!1146 = !DILocation(line: 107, column: 10, scope: !1007, inlinedAt: !1145)
!1147 = !DILocation(line: 107, column: 10, scope: !1017, inlinedAt: !1145)
!1148 = !DILocation(line: 107, column: 10, scope: !1019, inlinedAt: !1145)
!1149 = !DILocation(line: 219, column: 1, scope: !1021)
!1150 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !116, file: !116, line: 41, type: !64, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !111, variables: !1151)
!1151 = !{!1152}
!1152 = !DILocalVariable(name: "file", arg: 1, scope: !1150, file: !116, line: 41, type: !53)
!1153 = !DILocation(line: 41, column: 41, scope: !1150)
!1154 = !DILocation(line: 43, column: 13, scope: !1150)
!1155 = !DILocation(line: 44, column: 1, scope: !1150)
!1156 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !116, file: !116, line: 78, type: !1157, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !111, variables: !1159)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !59}
!1159 = !{!1160}
!1160 = !DILocalVariable(name: "ignore", arg: 1, scope: !1156, file: !116, line: 78, type: !59)
!1161 = !DIExpression(DW_OP_LLVM_fragment, 0, 1)
!1162 = !DILocation(line: 78, column: 37, scope: !1156)
!1163 = !DILocation(line: 80, column: 16, scope: !1156)
!1164 = !{!1165, !1165, i64 0}
!1165 = !{!"_Bool", !693, i64 0}
!1166 = !DILocation(line: 81, column: 1, scope: !1156)
!1167 = distinct !DISubprogram(name: "close_stdout", scope: !116, file: !116, line: 107, type: !251, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !111, variables: !1168)
!1168 = !{!1169}
!1169 = !DILocalVariable(name: "write_error", scope: !1170, file: !116, line: 112, type: !53)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !116, line: 111, column: 5)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !116, line: 109, column: 7)
!1172 = !DILocation(line: 109, column: 21, scope: !1171)
!1173 = !DILocation(line: 109, column: 7, scope: !1171)
!1174 = !DILocation(line: 109, column: 29, scope: !1171)
!1175 = !DILocation(line: 110, column: 7, scope: !1171)
!1176 = !DILocation(line: 110, column: 12, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1171, file: !116, discriminator: 1)
!1178 = !{i8 0, i8 2}
!1179 = !DILocation(line: 114, column: 19, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1170, file: !116, line: 113, column: 11)
!1181 = !DILocation(line: 110, column: 25, scope: !1177)
!1182 = !DILocation(line: 110, column: 28, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1171, file: !116, discriminator: 2)
!1184 = !DILocation(line: 110, column: 34, scope: !1183)
!1185 = !DILocation(line: 109, column: 7, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1167, file: !116, discriminator: 1)
!1187 = !DILocation(line: 112, column: 33, scope: !1170)
!1188 = !DILocation(line: 112, column: 19, scope: !1170)
!1189 = !DILocation(line: 113, column: 11, scope: !1180)
!1190 = !DILocation(line: 113, column: 11, scope: !1170)
!1191 = !DILocation(line: 114, column: 36, scope: !1192)
!1192 = !DILexicalBlockFile(scope: !1180, file: !116, discriminator: 1)
!1193 = !DILocation(line: 114, column: 9, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1180, file: !116, discriminator: 2)
!1195 = !DILocation(line: 114, column: 9, scope: !1180)
!1196 = !DILocation(line: 117, column: 9, scope: !1192)
!1197 = !DILocation(line: 119, column: 14, scope: !1170)
!1198 = !DILocation(line: 119, column: 7, scope: !1170)
!1199 = !DILocation(line: 122, column: 22, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1167, file: !116, line: 122, column: 8)
!1201 = !DILocation(line: 122, column: 8, scope: !1200)
!1202 = !DILocation(line: 122, column: 30, scope: !1200)
!1203 = !DILocation(line: 122, column: 8, scope: !1167)
!1204 = !DILocation(line: 123, column: 13, scope: !1200)
!1205 = !DILocation(line: 123, column: 6, scope: !1200)
!1206 = !DILocation(line: 124, column: 1, scope: !1167)
!1207 = distinct !DISubprogram(name: "fdadvise", scope: !1208, file: !1208, line: 31, type: !1209, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !600, variables: !1213)
!1208 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !87, !1211, !1211, !1212}
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !825, line: 91, baseType: !853)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !20, line: 52, baseType: !19)
!1213 = !{!1214, !1215, !1216, !1217, !1218}
!1214 = !DILocalVariable(name: "fd", arg: 1, scope: !1207, file: !1208, line: 31, type: !87)
!1215 = !DILocalVariable(name: "offset", arg: 2, scope: !1207, file: !1208, line: 31, type: !1211)
!1216 = !DILocalVariable(name: "len", arg: 3, scope: !1207, file: !1208, line: 31, type: !1211)
!1217 = !DILocalVariable(name: "advice", arg: 4, scope: !1207, file: !1208, line: 31, type: !1212)
!1218 = !DILocalVariable(name: "__x", scope: !1219, file: !1208, line: 34, type: !87)
!1219 = distinct !DILexicalBlock(scope: !1207, file: !1208, line: 34, column: 3)
!1220 = !DILocation(line: 31, column: 15, scope: !1207)
!1221 = !DILocation(line: 31, column: 25, scope: !1207)
!1222 = !DILocation(line: 31, column: 39, scope: !1207)
!1223 = !DILocation(line: 31, column: 54, scope: !1207)
!1224 = !DILocation(line: 34, column: 3, scope: !1219)
!1225 = !DILocation(line: 36, column: 1, scope: !1207)
!1226 = distinct !DISubprogram(name: "fadvise", scope: !1208, file: !1208, line: 39, type: !1227, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !600, variables: !1269)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null, !1229, !1212}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !825, line: 49, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !827, line: 241, size: 1728, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1231, file: !827, line: 242, baseType: !87, size: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1231, file: !827, line: 247, baseType: !42, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1231, file: !827, line: 248, baseType: !42, size: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1231, file: !827, line: 249, baseType: !42, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1231, file: !827, line: 250, baseType: !42, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1231, file: !827, line: 251, baseType: !42, size: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1231, file: !827, line: 252, baseType: !42, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1231, file: !827, line: 253, baseType: !42, size: 64, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1231, file: !827, line: 254, baseType: !42, size: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1231, file: !827, line: 256, baseType: !42, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1231, file: !827, line: 257, baseType: !42, size: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1231, file: !827, line: 258, baseType: !42, size: 64, offset: 704)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1231, file: !827, line: 260, baseType: !1246, size: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !827, line: 156, size: 192, elements: !1248)
!1248 = !{!1249, !1250, !1252}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1247, file: !827, line: 157, baseType: !1246, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1247, file: !827, line: 158, baseType: !1251, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1247, file: !827, line: 162, baseType: !87, size: 32, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1231, file: !827, line: 262, baseType: !1251, size: 64, offset: 832)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1231, file: !827, line: 264, baseType: !87, size: 32, offset: 896)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1231, file: !827, line: 268, baseType: !87, size: 32, offset: 928)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1231, file: !827, line: 270, baseType: !853, size: 64, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1231, file: !827, line: 274, baseType: !188, size: 16, offset: 1024)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1231, file: !827, line: 275, baseType: !856, size: 8, offset: 1040)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1231, file: !827, line: 276, baseType: !858, size: 8, offset: 1048)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1231, file: !827, line: 280, baseType: !862, size: 64, offset: 1088)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1231, file: !827, line: 289, baseType: !865, size: 64, offset: 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1231, file: !827, line: 297, baseType: !44, size: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1231, file: !827, line: 298, baseType: !44, size: 64, offset: 1280)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1231, file: !827, line: 299, baseType: !44, size: 64, offset: 1344)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1231, file: !827, line: 300, baseType: !44, size: 64, offset: 1408)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1231, file: !827, line: 302, baseType: !45, size: 64, offset: 1472)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1231, file: !827, line: 303, baseType: !87, size: 32, offset: 1536)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1231, file: !827, line: 305, baseType: !873, size: 160, offset: 1568)
!1269 = !{!1270, !1271}
!1270 = !DILocalVariable(name: "fp", arg: 1, scope: !1226, file: !1208, line: 39, type: !1229)
!1271 = !DILocalVariable(name: "advice", arg: 2, scope: !1226, file: !1208, line: 39, type: !1212)
!1272 = !DILocation(line: 39, column: 16, scope: !1226)
!1273 = !DILocation(line: 39, column: 30, scope: !1226)
!1274 = !DILocation(line: 41, column: 7, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1226, file: !1208, line: 41, column: 7)
!1276 = !DILocation(line: 41, column: 7, scope: !1226)
!1277 = !DILocation(line: 42, column: 15, scope: !1275)
!1278 = !DILocation(line: 31, column: 15, scope: !1207, inlinedAt: !1279)
!1279 = distinct !DILocation(line: 42, column: 5, scope: !1280)
!1280 = !DILexicalBlockFile(scope: !1275, file: !1208, discriminator: 1)
!1281 = !DILocation(line: 31, column: 25, scope: !1207, inlinedAt: !1279)
!1282 = !DILocation(line: 31, column: 39, scope: !1207, inlinedAt: !1279)
!1283 = !DILocation(line: 31, column: 54, scope: !1207, inlinedAt: !1279)
!1284 = !DILocation(line: 34, column: 3, scope: !1219, inlinedAt: !1279)
!1285 = !DILocation(line: 42, column: 5, scope: !1275)
