; ModuleID = 'coreutils-8.27/src/touch.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.table = type { i8*, i32, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.timezone = type { i32, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i64, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "change_times", scope: !2, file: !3, line: 53, type: !86, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !33)
!3 = !DIFile(filename: "src/touch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !{!20, !23, !24, !25, !28, !30}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 62, baseType: !27)
!26 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!0, !34, !37, !39, !41, !43, !57, !59, !90, !104, !110}
!34 = !DIGlobalVariableExpression(var: !35)
!35 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 56, type: !36, isLocal: true, isDefinition: true)
!36 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!37 = !DIGlobalVariableExpression(var: !38)
!38 = distinct !DIGlobalVariable(name: "use_ref", scope: !2, file: !3, line: 59, type: !36, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40)
!40 = distinct !DIGlobalVariable(name: "no_dereference", scope: !2, file: !3, line: 62, type: !36, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42)
!42 = distinct !DIGlobalVariable(name: "amtime_now", scope: !2, file: !3, line: 69, type: !36, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44)
!44 = distinct !DIGlobalVariable(name: "newtime", scope: !2, file: !3, line: 72, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !55)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !47, line: 8, size: 128, elements: !48)
!47 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!48 = !{!49, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !46, file: !47, line: 10, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !51, line: 148, baseType: !52)
!51 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !46, file: !47, line: 11, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !51, line: 184, baseType: !52)
!55 = !{!56}
!56 = !DISubrange(count: 2)
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 75, type: !23, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60)
!60 = distinct !DIGlobalVariable(name: "infomap", scope: !61, file: !62, line: 632, type: !87, isLocal: true, isDefinition: true)
!61 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !62, file: !62, line: 630, type: !63, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !65)
!62 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!63 = !DISubroutineType(types: !64)
!64 = !{null, !20}
!65 = !{!66, !67, !68, !75, !77, !78, !79, !82, !83, !85}
!66 = !DILocalVariable(name: "program", arg: 1, scope: !61, file: !62, line: 630, type: !20)
!67 = !DILocalVariable(name: "node", scope: !61, file: !62, line: 642, type: !20)
!68 = !DILocalVariable(name: "map_prog", scope: !61, file: !62, line: 643, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !61, file: !62, line: 632, size: 128, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !71, file: !62, line: 632, baseType: !20, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !71, file: !62, line: 632, baseType: !20, size: 64, offset: 64)
!75 = !DILocalVariable(name: "__s1_len", scope: !76, file: !62, line: 645, type: !25)
!76 = distinct !DILexicalBlock(scope: !61, file: !62, line: 645, column: 33)
!77 = !DILocalVariable(name: "__s2_len", scope: !76, file: !62, line: 645, type: !25)
!78 = !DILocalVariable(name: "lc_messages", scope: !61, file: !62, line: 655, type: !20)
!79 = !DILocalVariable(name: "__s1_len", scope: !80, file: !62, line: 656, type: !25)
!80 = distinct !DILexicalBlock(scope: !81, file: !62, line: 656, column: 22)
!81 = distinct !DILexicalBlock(scope: !61, file: !62, line: 656, column: 7)
!82 = !DILocalVariable(name: "__s2_len", scope: !80, file: !62, line: 656, type: !25)
!83 = !DILocalVariable(name: "__s2", scope: !84, file: !62, line: 656, type: !30)
!84 = distinct !DILexicalBlock(scope: !80, file: !62, line: 656, column: 22)
!85 = !DILocalVariable(name: "__result", scope: !84, file: !62, line: 656, type: !86)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 896, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 7)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 84, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !102)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !95, line: 104, size: 256, elements: !96)
!95 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!96 = !{!97, !98, !99, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !95, line: 106, baseType: !20, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !94, file: !95, line: 109, baseType: !86, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !95, line: 110, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !94, file: !95, line: 111, baseType: !86, size: 32, offset: 192)
!102 = !{!103}
!103 = !DISubrange(count: 8)
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "time_masks", scope: !2, file: !3, line: 103, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 160, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!108 = !{!109}
!109 = !DISubrange(count: 5)
!110 = !DIGlobalVariableExpression(var: !111)
!111 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 97, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 384, elements: !114)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!114 = !{!115}
!115 = !DISubrange(count: 6)
!116 = !DIGlobalVariableExpression(var: !117)
!117 = distinct !DIGlobalVariable(name: "Version", scope: !118, file: !119, line: 2, type: !20, isLocal: false, isDefinition: true)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, globals: !121)
!119 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!120 = !{}
!121 = !{!116}
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !124, file: !128, line: 69, type: !129, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !126, globals: !127)
!125 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!126 = !{!25, !24, !32}
!127 = !{!122}
!128 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !130, line: 55, baseType: !131)
!130 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DIGlobalVariableExpression(var: !135)
!135 = distinct !DIGlobalVariable(name: "file_name", scope: !136, file: !141, line: 36, type: !20, isLocal: true, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, globals: !138)
!137 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!138 = !{!134, !139}
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !136, file: !141, line: 46, type: !36, isLocal: true, isDefinition: true)
!141 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !DIGlobalVariableExpression(var: !143)
!143 = distinct !DIGlobalVariable(name: "exit_failure", scope: !144, file: !147, line: 24, type: !148, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, globals: !146)
!145 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !{!142}
!147 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!149 = !DIGlobalVariableExpression(var: !150)
!150 = distinct !DIGlobalVariable(name: "yypact", scope: !151, file: !170, line: 1069, type: !388, isLocal: true, isDefinition: true)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153, retainedTypes: !167, globals: !207)
!152 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!153 = !{!154, !160, !163}
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 167, size: 32, elements: !156)
!155 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!156 = !{!157, !158, !159}
!157 = !DIEnumerator(name: "MERam", value: 0)
!158 = !DIEnumerator(name: "MERpm", value: 1)
!159 = !DIEnumerator(name: "MER24", value: 2)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 1562, size: 32, elements: !161)
!161 = !{!162}
!162 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 169, size: 32, elements: !164)
!164 = !{!165, !166}
!165 = !DIEnumerator(name: "BILLION", value: 1000000000)
!166 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!167 = !{!168, !204, !25, !28, !30, !20, !86, !205, !24}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !170, line: 900, size: 448, elements: !171)
!170 = !DIFile(filename: "parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!171 = !{!172, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !169, file: !170, line: 902, baseType: !173, size: 16)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !170, line: 743, baseType: !174)
!174 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !169, file: !170, line: 903, baseType: !176, size: 448)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !170, line: 703, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !170, line: 691, size: 448, elements: !178)
!178 = !{!179, !180, !187, !192}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !177, file: !155, line: 559, baseType: !52, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !177, file: !155, line: 560, baseType: !181, size: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !155, line: 156, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 151, size: 192, elements: !183)
!183 = !{!184, !185, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !182, file: !155, line: 153, baseType: !36, size: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !182, file: !155, line: 154, baseType: !52, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !182, file: !155, line: 155, baseType: !25, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !177, file: !155, line: 561, baseType: !188, size: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !47, line: 8, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !188, file: !47, line: 10, baseType: !50, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !188, file: !47, line: 11, baseType: !54, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !177, file: !155, line: 562, baseType: !193, size: 448)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !155, line: 182, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 172, size: 448, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !194, file: !155, line: 175, baseType: !52, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !194, file: !155, line: 176, baseType: !52, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !194, file: !155, line: 177, baseType: !52, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !194, file: !155, line: 178, baseType: !52, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !194, file: !155, line: 179, baseType: !52, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !194, file: !155, line: 180, baseType: !202, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_time_t", file: !155, line: 117, baseType: !52)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !194, file: !155, line: 181, baseType: !52, size: 64, offset: 384)
!204 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !206, line: 8, baseType: !50)
!206 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!207 = !{!208, !149, !294, !301, !309, !312, !317, !322, !324, !329, !331, !333, !337, !342, !347, !352, !357, !362, !367, !370, !385}
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "yyval_default", scope: !210, file: !170, line: 1644, type: !176, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "yyparse", scope: !170, file: !170, line: 1635, type: !211, isLocal: false, isDefinition: true, scopeLine: 1636, flags: DIFlagPrototyped, isOptimized: true, unit: !151, variables: !259)
!211 = !DISubroutineType(types: !212)
!212 = !{!86, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !155, line: 253, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 191, size: 2880, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !215, file: !155, line: 194, baseType: !20, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !215, file: !155, line: 197, baseType: !52, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !215, file: !155, line: 200, baseType: !86, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !215, file: !155, line: 203, baseType: !86, size: 32, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !215, file: !155, line: 206, baseType: !52, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !215, file: !155, line: 209, baseType: !86, size: 32, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !215, file: !155, line: 212, baseType: !181, size: 192, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !215, file: !155, line: 213, baseType: !52, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !215, file: !155, line: 214, baseType: !52, size: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !215, file: !155, line: 215, baseType: !52, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !215, file: !155, line: 216, baseType: !52, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !215, file: !155, line: 217, baseType: !188, size: 128, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !215, file: !155, line: 220, baseType: !193, size: 448, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !215, file: !155, line: 223, baseType: !36, size: 8, offset: 1344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !215, file: !155, line: 224, baseType: !36, size: 8, offset: 1352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !215, file: !155, line: 225, baseType: !25, size: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !215, file: !155, line: 226, baseType: !25, size: 64, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !215, file: !155, line: 227, baseType: !25, size: 64, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !215, file: !155, line: 228, baseType: !25, size: 64, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !215, file: !155, line: 229, baseType: !25, size: 64, offset: 1664)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !215, file: !155, line: 230, baseType: !25, size: 64, offset: 1728)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !215, file: !155, line: 231, baseType: !25, size: 64, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !215, file: !155, line: 234, baseType: !36, size: 8, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !215, file: !155, line: 237, baseType: !25, size: 64, offset: 1920)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !215, file: !155, line: 238, baseType: !25, size: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !215, file: !155, line: 239, baseType: !25, size: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dsts_seen", scope: !215, file: !155, line: 240, baseType: !25, size: 64, offset: 2112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !215, file: !155, line: 241, baseType: !25, size: 64, offset: 2176)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !215, file: !155, line: 242, baseType: !25, size: 64, offset: 2240)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !215, file: !155, line: 243, baseType: !25, size: 64, offset: 2304)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !215, file: !155, line: 246, baseType: !36, size: 8, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "debug_default_input_timezone", scope: !215, file: !155, line: 249, baseType: !52, size: 64, offset: 2432)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !215, file: !155, line: 252, baseType: !250, size: 384, offset: 2496)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 384, elements: !257)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !155, line: 164, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 159, size: 128, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !155, line: 161, baseType: !20, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !252, file: !155, line: 162, baseType: !86, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !252, file: !155, line: 163, baseType: !86, size: 32, offset: 96)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !270, !272, !273, !275, !277, !278, !279, !280, !281, !282, !283, !284, !287, !289, !290, !292}
!260 = !DILocalVariable(name: "pc", arg: 1, scope: !210, file: !170, line: 1635, type: !213)
!261 = !DILocalVariable(name: "yychar", scope: !210, file: !170, line: 1638, type: !86)
!262 = !DILocalVariable(name: "yylval", scope: !210, file: !170, line: 1645, type: !176)
!263 = !DILocalVariable(name: "yynerrs", scope: !210, file: !170, line: 1648, type: !86)
!264 = !DILocalVariable(name: "yystate", scope: !210, file: !170, line: 1650, type: !86)
!265 = !DILocalVariable(name: "yyerrstatus", scope: !210, file: !170, line: 1652, type: !86)
!266 = !DILocalVariable(name: "yyssa", scope: !210, file: !170, line: 1662, type: !267)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 320, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 20)
!270 = !DILocalVariable(name: "yyss", scope: !210, file: !170, line: 1663, type: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!272 = !DILocalVariable(name: "yyssp", scope: !210, file: !170, line: 1664, type: !271)
!273 = !DILocalVariable(name: "yyvsa", scope: !210, file: !170, line: 1667, type: !274)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 8960, elements: !268)
!275 = !DILocalVariable(name: "yyvs", scope: !210, file: !170, line: 1668, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!277 = !DILocalVariable(name: "yyvsp", scope: !210, file: !170, line: 1669, type: !276)
!278 = !DILocalVariable(name: "yystacksize", scope: !210, file: !170, line: 1671, type: !27)
!279 = !DILocalVariable(name: "yyn", scope: !210, file: !170, line: 1673, type: !86)
!280 = !DILocalVariable(name: "yyresult", scope: !210, file: !170, line: 1674, type: !86)
!281 = !DILocalVariable(name: "yytoken", scope: !210, file: !170, line: 1676, type: !86)
!282 = !DILocalVariable(name: "yyval", scope: !210, file: !170, line: 1679, type: !176)
!283 = !DILocalVariable(name: "yylen", scope: !210, file: !170, line: 1692, type: !86)
!284 = !DILocalVariable(name: "yysize", scope: !285, file: !170, line: 1720, type: !27)
!285 = distinct !DILexicalBlock(scope: !286, file: !170, line: 1718, column: 5)
!286 = distinct !DILexicalBlock(scope: !210, file: !170, line: 1717, column: 7)
!287 = !DILocalVariable(name: "yyss1", scope: !288, file: !170, line: 1754, type: !271)
!288 = distinct !DILexicalBlock(scope: !285, file: !170, line: 1753, column: 7)
!289 = !DILocalVariable(name: "yyptr", scope: !288, file: !170, line: 1755, type: !168)
!290 = !DILocalVariable(name: "yynewbytes", scope: !291, file: !170, line: 1759, type: !27)
!291 = distinct !DILexicalBlock(scope: !288, file: !170, line: 1759, column: 9)
!292 = !DILocalVariable(name: "yynewbytes", scope: !293, file: !170, line: 1760, type: !27)
!293 = distinct !DILexicalBlock(scope: !288, file: !170, line: 1760, column: 9)
!294 = !DIGlobalVariableExpression(var: !295)
!295 = distinct !DIGlobalVariable(name: "yytranslate", scope: !151, file: !170, line: 979, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 2224, elements: !299)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !170, line: 725, baseType: !32)
!299 = !{!300}
!300 = !DISubrange(count: 278)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "yycheck", scope: !151, file: !170, line: 1139, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 904, elements: !307)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !170, line: 731, baseType: !306)
!306 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!307 = !{!308}
!308 = !DISubrange(count: 113)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "yytable", scope: !151, file: !170, line: 1123, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 904, elements: !307)
!312 = !DIGlobalVariableExpression(var: !313)
!313 = distinct !DIGlobalVariable(name: "yydefact", scope: !151, file: !170, line: 1088, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 912, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 114)
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "yyr2", scope: !151, file: !170, line: 1189, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 736, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 92)
!322 = !DIGlobalVariableExpression(var: !323)
!323 = distinct !DIGlobalVariable(name: "yyr1", scope: !151, file: !170, line: 1174, type: !319, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325)
!325 = distinct !DIGlobalVariable(name: "yypgoto", scope: !151, file: !170, line: 1105, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 208, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 26)
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !151, file: !170, line: 1113, type: !326, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332)
!332 = distinct !DIGlobalVariable(name: "yystos", scope: !151, file: !170, line: 1157, type: !314, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334)
!334 = distinct !DIGlobalVariable(name: "meridian_table", scope: !151, file: !155, line: 982, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 640, elements: !108)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!337 = !DIGlobalVariableExpression(var: !338)
!338 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !151, file: !155, line: 996, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 3200, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 25)
!342 = !DIGlobalVariableExpression(var: !343)
!343 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !151, file: !155, line: 1070, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 512, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 4)
!347 = !DIGlobalVariableExpression(var: !348)
!348 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !151, file: !155, line: 1083, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 6144, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 48)
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "dst_table", scope: !151, file: !155, line: 991, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 128, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 1)
!357 = !DIGlobalVariableExpression(var: !358)
!358 = distinct !DIGlobalVariable(name: "time_units_table", scope: !151, file: !155, line: 1025, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 1408, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 11)
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !151, file: !155, line: 1041, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 2688, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 21)
!367 = !DIGlobalVariableExpression(var: !368)
!368 = distinct !DIGlobalVariable(name: "military_table", scope: !151, file: !155, line: 1139, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 3328, elements: !327)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !372, file: !155, line: 333, type: !382, isLocal: true, isDefinition: true)
!372 = distinct !DISubprogram(name: "str_days", scope: !155, file: !155, line: 330, type: !373, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, unit: !151, variables: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{!20, !213, !23, !25}
!375 = !{!376, !377, !378, !379}
!376 = !DILocalVariable(name: "pc", arg: 1, scope: !372, file: !155, line: 330, type: !213)
!377 = !DILocalVariable(name: "buffer", arg: 2, scope: !372, file: !155, line: 330, type: !23)
!378 = !DILocalVariable(name: "n", arg: 3, scope: !372, file: !155, line: 330, type: !25)
!379 = !DILocalVariable(name: "l", scope: !380, file: !155, line: 382, type: !25)
!380 = distinct !DILexicalBlock(scope: !381, file: !155, line: 381, column: 5)
!381 = distinct !DILexicalBlock(scope: !372, file: !155, line: 380, column: 7)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 896, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 14)
!385 = !DIGlobalVariableExpression(var: !386)
!386 = distinct !DIGlobalVariable(name: "days_values", scope: !372, file: !155, line: 349, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 448, elements: !88)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 912, elements: !315)
!389 = !DIGlobalVariableExpression(var: !390)
!390 = distinct !DIGlobalVariable(name: "program_name", scope: !391, file: !395, line: 33, type: !20, isLocal: false, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !393, globals: !394)
!392 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!393 = !{!24, !23}
!394 = !{!389}
!395 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!396 = !DIGlobalVariableExpression(var: !397)
!397 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !398, file: !426, line: 77, type: !459, isLocal: false, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !400, retainedTypes: !421, globals: !423)
!399 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!400 = !{!5, !401, !406}
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!404 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!405 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !407, line: 46, size: 32, elements: !408)
!407 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!409 = !DIEnumerator(name: "_ISupper", value: 256)
!410 = !DIEnumerator(name: "_ISlower", value: 512)
!411 = !DIEnumerator(name: "_ISalpha", value: 1024)
!412 = !DIEnumerator(name: "_ISdigit", value: 2048)
!413 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!414 = !DIEnumerator(name: "_ISspace", value: 8192)
!415 = !DIEnumerator(name: "_ISprint", value: 16384)
!416 = !DIEnumerator(name: "_ISgraph", value: 32768)
!417 = !DIEnumerator(name: "_ISblank", value: 1)
!418 = !DIEnumerator(name: "_IScntrl", value: 2)
!419 = !DIEnumerator(name: "_ISpunct", value: 4)
!420 = !DIEnumerator(name: "_ISalnum", value: 8)
!421 = !{!86, !422, !25, !23}
!422 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!423 = !{!396, !424, !431, !441, !443, !448, !455, !457}
!424 = !DIGlobalVariableExpression(var: !425)
!425 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !398, file: !426, line: 93, type: !427, isLocal: false, isDefinition: true)
!426 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 320, elements: !429)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!429 = !{!430}
!430 = !DISubrange(count: 10)
!431 = !DIGlobalVariableExpression(var: !432)
!432 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !398, file: !426, line: 1043, type: !433, isLocal: false, isDefinition: true)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !426, line: 57, size: 448, elements: !434)
!434 = !{!435, !436, !437, !439, !440}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !433, file: !426, line: 60, baseType: !5, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !433, file: !426, line: 63, baseType: !86, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !433, file: !426, line: 67, baseType: !438, size: 256, offset: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 256, elements: !102)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !433, file: !426, line: 70, baseType: !20, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !433, file: !426, line: 73, baseType: !20, size: 64, offset: 384)
!441 = !DIGlobalVariableExpression(var: !442)
!442 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !398, file: !426, line: 108, type: !433, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "slot0", scope: !398, file: !426, line: 834, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 256)
!448 = !DIGlobalVariableExpression(var: !449)
!449 = distinct !DIGlobalVariable(name: "slotvec", scope: !398, file: !426, line: 837, type: !450, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !426, line: 826, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !426, line: 828, baseType: !25, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !451, file: !426, line: 829, baseType: !23, size: 64, offset: 64)
!455 = !DIGlobalVariableExpression(var: !456)
!456 = distinct !DIGlobalVariable(name: "nslots", scope: !398, file: !426, line: 835, type: !86, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "slotvec0", scope: !398, file: !426, line: 836, type: !451, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 704, elements: !360)
!460 = !DIGlobalVariableExpression(var: !461)
!461 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !462, file: !465, line: 26, type: !466, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, globals: !464)
!463 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!464 = !{!460}
!465 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 376, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 47)
!469 = !DIGlobalVariableExpression(var: !470)
!470 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !471, file: !479, line: 124, type: !490, isLocal: true, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !473, globals: !476)
!472 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!473 = !{!204, !86, !306, !32, !174, !422, !52, !27, !474, !475}
!474 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!475 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!476 = !{!477, !483, !486, !469}
!477 = !DIGlobalVariableExpression(var: !478, expr: !482)
!478 = distinct !DIGlobalVariable(name: "mktime_min", scope: !471, file: !479, line: 95, type: !480, isLocal: true, isDefinition: true)
!479 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !479, line: 68, baseType: !52)
!482 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!483 = !DIGlobalVariableExpression(var: !484, expr: !485)
!484 = distinct !DIGlobalVariable(name: "mktime_max", scope: !471, file: !479, line: 98, type: !480, isLocal: true, isDefinition: true)
!485 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!486 = !DIGlobalVariableExpression(var: !487)
!487 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !471, file: !479, line: 462, type: !488, isLocal: true, isDefinition: true)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !489, line: 30, baseType: !205)
!489 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 416, elements: !492)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!492 = !{!56, !493}
!493 = !DISubrange(count: 13)
!494 = !DIGlobalVariableExpression(var: !495)
!495 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !496, file: !840, line: 120, type: !841, isLocal: true, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !498, retainedTypes: !837, globals: !839)
!497 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!498 = !{!499}
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !500, line: 41, size: 32, elements: !501)
!500 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836}
!502 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!503 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!504 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!505 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!506 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!507 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!508 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!509 = !DIEnumerator(name: "DAY_1", value: 131079)
!510 = !DIEnumerator(name: "DAY_2", value: 131080)
!511 = !DIEnumerator(name: "DAY_3", value: 131081)
!512 = !DIEnumerator(name: "DAY_4", value: 131082)
!513 = !DIEnumerator(name: "DAY_5", value: 131083)
!514 = !DIEnumerator(name: "DAY_6", value: 131084)
!515 = !DIEnumerator(name: "DAY_7", value: 131085)
!516 = !DIEnumerator(name: "ABMON_1", value: 131086)
!517 = !DIEnumerator(name: "ABMON_2", value: 131087)
!518 = !DIEnumerator(name: "ABMON_3", value: 131088)
!519 = !DIEnumerator(name: "ABMON_4", value: 131089)
!520 = !DIEnumerator(name: "ABMON_5", value: 131090)
!521 = !DIEnumerator(name: "ABMON_6", value: 131091)
!522 = !DIEnumerator(name: "ABMON_7", value: 131092)
!523 = !DIEnumerator(name: "ABMON_8", value: 131093)
!524 = !DIEnumerator(name: "ABMON_9", value: 131094)
!525 = !DIEnumerator(name: "ABMON_10", value: 131095)
!526 = !DIEnumerator(name: "ABMON_11", value: 131096)
!527 = !DIEnumerator(name: "ABMON_12", value: 131097)
!528 = !DIEnumerator(name: "MON_1", value: 131098)
!529 = !DIEnumerator(name: "MON_2", value: 131099)
!530 = !DIEnumerator(name: "MON_3", value: 131100)
!531 = !DIEnumerator(name: "MON_4", value: 131101)
!532 = !DIEnumerator(name: "MON_5", value: 131102)
!533 = !DIEnumerator(name: "MON_6", value: 131103)
!534 = !DIEnumerator(name: "MON_7", value: 131104)
!535 = !DIEnumerator(name: "MON_8", value: 131105)
!536 = !DIEnumerator(name: "MON_9", value: 131106)
!537 = !DIEnumerator(name: "MON_10", value: 131107)
!538 = !DIEnumerator(name: "MON_11", value: 131108)
!539 = !DIEnumerator(name: "MON_12", value: 131109)
!540 = !DIEnumerator(name: "AM_STR", value: 131110)
!541 = !DIEnumerator(name: "PM_STR", value: 131111)
!542 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!543 = !DIEnumerator(name: "D_FMT", value: 131113)
!544 = !DIEnumerator(name: "T_FMT", value: 131114)
!545 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!546 = !DIEnumerator(name: "ERA", value: 131116)
!547 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!548 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!549 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!550 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!551 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!552 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!553 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!554 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!555 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!556 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!557 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!558 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!559 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!560 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!561 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!562 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!563 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!564 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!565 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!566 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!567 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!568 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!569 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!570 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!571 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!572 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!573 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!574 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!575 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!576 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!577 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!578 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!579 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!580 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!581 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!582 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!583 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!584 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!585 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!586 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!587 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!588 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!589 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!590 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!591 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!592 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!593 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!594 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!595 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!596 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!597 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!598 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!599 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!600 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!601 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!602 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!603 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!604 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!605 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!606 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!607 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!608 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!609 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!610 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!611 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!612 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!613 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!614 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!615 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!616 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!617 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!618 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!619 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!620 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!621 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!622 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!623 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!624 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!625 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!626 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!627 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!628 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!629 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!630 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!631 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!632 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!633 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!634 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!635 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!636 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!637 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!638 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!639 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!640 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!641 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!642 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!643 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!644 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!645 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!646 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!647 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!648 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!649 = !DIEnumerator(name: "CODESET", value: 14)
!650 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!651 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!652 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!653 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!662 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!663 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!664 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!665 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!666 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!667 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!668 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!669 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!670 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!671 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!672 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!673 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!674 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!675 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!682 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!683 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!684 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!685 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!686 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!687 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!688 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!689 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!690 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!691 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!692 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!693 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!694 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!695 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!696 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!697 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!698 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!699 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!700 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!701 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!702 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!703 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!704 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!705 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!706 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!707 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!708 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!709 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!710 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!711 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!712 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!713 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!714 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!715 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!716 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!717 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!718 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!719 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!720 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!721 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!722 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!723 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!724 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!725 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!726 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!727 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!728 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!729 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!730 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!731 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!732 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!733 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!734 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!735 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!736 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!737 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!738 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!739 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!740 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!741 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!742 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!743 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!746 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!747 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!748 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!749 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!750 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!751 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!752 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!753 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!754 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!755 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!756 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!757 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!758 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!759 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!760 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!761 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!762 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!763 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!764 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!765 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!766 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!767 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!768 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!769 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!770 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!771 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!772 = !DIEnumerator(name: "THOUSEP", value: 65537)
!773 = !DIEnumerator(name: "__GROUPING", value: 65538)
!774 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!775 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!776 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!777 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!778 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!779 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!780 = !DIEnumerator(name: "__YESSTR", value: 327682)
!781 = !DIEnumerator(name: "__NOSTR", value: 327683)
!782 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!783 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!784 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!785 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!786 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!787 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!788 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!789 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!790 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!791 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!792 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!793 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!794 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!795 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!796 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!797 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!798 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!799 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!800 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!801 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!802 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!803 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!804 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!805 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!806 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!807 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!808 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!809 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!810 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!811 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!812 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!813 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!814 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!815 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!816 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!817 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!818 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!821 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!822 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!823 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!824 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!825 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!826 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!827 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!828 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!829 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!830 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!831 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!832 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!833 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!834 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!835 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!836 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!837 = !{!24, !23, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!839 = !{!494}
!840 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!843 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!845 = !DIFile(filename: "./lib/fdutimensat.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!847 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !850)
!849 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!850 = !{!205, !204}
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!852 = !DIFile(filename: "./lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !855)
!854 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!855 = !{!20, !204, !25, !24, !28, !86, !32}
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !858, retainedTypes: !863)
!857 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!858 = !{!859}
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !860, line: 41, size: 32, elements: !861)
!860 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = !{!862}
!862 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!863 = !{!24}
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !866, retainedTypes: !880)
!865 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!866 = !{!867}
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !869, file: !868, line: 192, size: 32, elements: !878)
!868 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!869 = distinct !DISubprogram(name: "x2nrealloc", scope: !868, file: !868, line: 180, type: !870, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !864, variables: !873)
!870 = !DISubroutineType(types: !871)
!871 = !{!24, !24, !872, !25}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!873 = !{!874, !875, !876, !877}
!874 = !DILocalVariable(name: "p", arg: 1, scope: !869, file: !868, line: 180, type: !24)
!875 = !DILocalVariable(name: "pn", arg: 2, scope: !869, file: !868, line: 180, type: !872)
!876 = !DILocalVariable(name: "s", arg: 3, scope: !869, file: !868, line: 180, type: !25)
!877 = !DILocalVariable(name: "n", scope: !869, file: !868, line: 182, type: !25)
!878 = !{!879}
!879 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!880 = !{!25, !23, !24}
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!882 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !863)
!884 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !887)
!886 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!887 = !{!25}
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !890, retainedTypes: !895, globals: !896)
!889 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = !{!891}
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !892, line: 49, size: 32, elements: !893)
!892 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!893 = !{!894}
!894 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!895 = !{!23}
!896 = !{!897}
!897 = !DIGlobalVariableExpression(var: !898)
!898 = distinct !DIGlobalVariable(name: "local_tz", scope: !888, file: !892, line: 54, type: !899, isLocal: true, isDefinition: true)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !901, line: 594, baseType: !902)
!901 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !904, line: 21, size: 128, elements: !905)
!904 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !904, line: 25, baseType: !902, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !903, file: !904, line: 36, baseType: !22, size: 8, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !903, file: !904, line: 48, baseType: !909, offset: 72)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: -1)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!913 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !916)
!915 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!916 = !{!25, !28, !30, !20}
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120)
!918 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !863)
!920 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !863)
!922 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!924 = !{i32 2, !"Dwarf Version", i32 4}
!925 = !{i32 2, !"Debug Info Version", i32 3}
!926 = !{i32 1, !"PIC Level", i32 2}
!927 = !{i32 1, !"PIE Level", i32 2}
!928 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 207, type: !929, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !931)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !86}
!931 = !{!932}
!932 = !DILocalVariable(name: "status", arg: 1, scope: !928, file: !3, line: 207, type: !86)
!933 = !DIExpression()
!934 = !DILocation(line: 207, column: 12, scope: !928)
!935 = !DILocation(line: 209, column: 14, scope: !936)
!936 = distinct !DILexicalBlock(scope: !928, file: !3, line: 209, column: 7)
!937 = !DILocation(line: 209, column: 7, scope: !928)
!938 = !DILocation(line: 210, column: 5, scope: !939)
!939 = !DILexicalBlockFile(scope: !940, file: !3, discriminator: 1)
!940 = distinct !DILexicalBlock(scope: !936, file: !3, line: 210, column: 5)
!941 = !{!942, !942, i64 0}
!942 = !{!"any pointer", !943, i64 0}
!943 = !{!"omnipotent char", !944, i64 0}
!944 = !{!"Simple C/C++ TBAA"}
!945 = !DILocation(line: 210, column: 5, scope: !946)
!946 = !DILexicalBlockFile(scope: !940, file: !3, discriminator: 3)
!947 = !DILocation(line: 210, column: 5, scope: !948)
!948 = !DILexicalBlockFile(scope: !940, file: !3, discriminator: 2)
!949 = !DILocation(line: 213, column: 7, scope: !950)
!950 = distinct !DILexicalBlock(scope: !936, file: !3, line: 212, column: 5)
!951 = !DILocation(line: 213, column: 7, scope: !952)
!952 = !DILexicalBlockFile(scope: !950, file: !3, discriminator: 1)
!953 = !DILocation(line: 214, column: 7, scope: !950)
!954 = !DILocation(line: 214, column: 7, scope: !952)
!955 = !DILocation(line: 587, column: 3, scope: !956, inlinedAt: !957)
!956 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !62, file: !62, line: 585, type: !132, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !120)
!957 = distinct !DILocation(line: 224, column: 7, scope: !950)
!958 = !DILocation(line: 587, column: 3, scope: !959, inlinedAt: !957)
!959 = !DILexicalBlockFile(scope: !956, file: !62, discriminator: 1)
!960 = !DILocation(line: 226, column: 7, scope: !950)
!961 = !DILocation(line: 226, column: 7, scope: !952)
!962 = !DILocation(line: 232, column: 7, scope: !950)
!963 = !DILocation(line: 232, column: 7, scope: !952)
!964 = !DILocation(line: 238, column: 7, scope: !950)
!965 = !DILocation(line: 238, column: 7, scope: !952)
!966 = !DILocation(line: 245, column: 7, scope: !950)
!967 = !DILocation(line: 245, column: 7, scope: !952)
!968 = !DILocation(line: 246, column: 7, scope: !950)
!969 = !DILocation(line: 246, column: 7, scope: !952)
!970 = !DILocation(line: 247, column: 7, scope: !950)
!971 = !DILocation(line: 247, column: 7, scope: !952)
!972 = !DILocation(line: 642, column: 15, scope: !61, inlinedAt: !973)
!973 = distinct !DILocation(line: 251, column: 7, scope: !950)
!974 = !DILocation(line: 651, column: 3, scope: !61, inlinedAt: !973)
!975 = !DILocation(line: 651, column: 3, scope: !976, inlinedAt: !973)
!976 = !DILexicalBlockFile(scope: !61, file: !62, discriminator: 1)
!977 = !DILocation(line: 655, column: 29, scope: !61, inlinedAt: !973)
!978 = !DILocation(line: 655, column: 15, scope: !61, inlinedAt: !973)
!979 = !DILocation(line: 656, column: 7, scope: !81, inlinedAt: !973)
!980 = !DILocation(line: 656, column: 19, scope: !81, inlinedAt: !973)
!981 = !DILocation(line: 656, column: 22, scope: !982, inlinedAt: !973)
!982 = !DILexicalBlockFile(scope: !81, file: !62, discriminator: 16)
!983 = !DILocation(line: 656, column: 7, scope: !984, inlinedAt: !973)
!984 = !DILexicalBlockFile(scope: !61, file: !62, discriminator: 16)
!985 = !DILocation(line: 662, column: 7, scope: !986, inlinedAt: !973)
!986 = distinct !DILexicalBlock(scope: !81, file: !62, line: 657, column: 5)
!987 = !DILocation(line: 662, column: 7, scope: !988, inlinedAt: !973)
!988 = !DILexicalBlockFile(scope: !986, file: !62, discriminator: 1)
!989 = !DILocation(line: 664, column: 5, scope: !986, inlinedAt: !973)
!990 = !DILocation(line: 665, column: 3, scope: !61, inlinedAt: !973)
!991 = !DILocation(line: 665, column: 3, scope: !976, inlinedAt: !973)
!992 = !DILocation(line: 667, column: 3, scope: !61, inlinedAt: !973)
!993 = !DILocation(line: 667, column: 3, scope: !976, inlinedAt: !973)
!994 = !DILocation(line: 253, column: 3, scope: !928)
!995 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 257, type: !996, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !999)
!996 = !DISubroutineType(types: !997)
!997 = !{!86, !86, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1037, !1041, !1044, !1045}
!1000 = !DILocalVariable(name: "argc", arg: 1, scope: !995, file: !3, line: 257, type: !86)
!1001 = !DILocalVariable(name: "argv", arg: 2, scope: !995, file: !3, line: 257, type: !998)
!1002 = !DILocalVariable(name: "c", scope: !995, file: !3, line: 259, type: !86)
!1003 = !DILocalVariable(name: "date_set", scope: !995, file: !3, line: 260, type: !36)
!1004 = !DILocalVariable(name: "ok", scope: !995, file: !3, line: 261, type: !36)
!1005 = !DILocalVariable(name: "flex_date", scope: !995, file: !3, line: 262, type: !20)
!1006 = !DILocalVariable(name: "ref_stats", scope: !1007, file: !3, line: 342, type: !1009)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 341, column: 5)
!1008 = distinct !DILexicalBlock(scope: !995, file: !3, line: 340, column: 7)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1010, line: 46, size: 1152, elements: !1011)
!1010 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1011 = !{!1012, !1014, !1016, !1018, !1020, !1022, !1024, !1025, !1026, !1028, !1030, !1032, !1033, !1034, !1035}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1009, file: !1010, line: 48, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !51, line: 133, baseType: !27)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1009, file: !1010, line: 53, baseType: !1015, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !51, line: 136, baseType: !27)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1009, file: !1010, line: 61, baseType: !1017, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !51, line: 139, baseType: !27)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1009, file: !1010, line: 62, baseType: !1019, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !51, line: 138, baseType: !204)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1009, file: !1010, line: 64, baseType: !1021, size: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !51, line: 134, baseType: !204)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1009, file: !1010, line: 65, baseType: !1023, size: 32, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !51, line: 135, baseType: !204)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1009, file: !1010, line: 67, baseType: !86, size: 32, offset: 288)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1009, file: !1010, line: 69, baseType: !1013, size: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1009, file: !1010, line: 74, baseType: !1027, size: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !51, line: 140, baseType: !52)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1009, file: !1010, line: 78, baseType: !1029, size: 64, offset: 448)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !51, line: 162, baseType: !52)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1009, file: !1010, line: 80, baseType: !1031, size: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !51, line: 167, baseType: !52)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1009, file: !1010, line: 91, baseType: !46, size: 128, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1009, file: !1010, line: 92, baseType: !46, size: 128, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1009, file: !1010, line: 93, baseType: !46, size: 128, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1009, file: !1010, line: 106, baseType: !1036, size: 192, offset: 960)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 192, elements: !257)
!1037 = !DILocalVariable(name: "now", scope: !1038, file: !3, line: 364, type: !46)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 363, column: 9)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 362, column: 11)
!1040 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 361, column: 5)
!1041 = !DILocalVariable(name: "notnow", scope: !1042, file: !3, line: 379, type: !46)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 376, column: 13)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 373, column: 15)
!1044 = !DILocalVariable(name: "notnow1", scope: !1042, file: !3, line: 379, type: !46)
!1045 = !DILocalVariable(name: "tm", scope: !1046, file: !3, line: 402, type: !1050)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 401, column: 9)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 400, column: 11)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 395, column: 5)
!1049 = distinct !DILexicalBlock(scope: !995, file: !3, line: 392, column: 7)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1053, line: 8, size: 448, elements: !1054)
!1053 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1052, file: !1053, line: 10, baseType: !86, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1052, file: !1053, line: 11, baseType: !86, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1052, file: !1053, line: 12, baseType: !86, size: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1052, file: !1053, line: 13, baseType: !86, size: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1052, file: !1053, line: 14, baseType: !86, size: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1052, file: !1053, line: 15, baseType: !86, size: 32, offset: 160)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1052, file: !1053, line: 16, baseType: !86, size: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1052, file: !1053, line: 17, baseType: !86, size: 32, offset: 224)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1052, file: !1053, line: 18, baseType: !86, size: 32, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1052, file: !1053, line: 21, baseType: !52, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1052, file: !1053, line: 22, baseType: !20, size: 64, offset: 384)
!1066 = !DILocation(line: 257, column: 11, scope: !995)
!1067 = !DILocation(line: 257, column: 24, scope: !995)
!1068 = !DILocation(line: 260, column: 8, scope: !995)
!1069 = !DILocation(line: 261, column: 8, scope: !995)
!1070 = !DILocation(line: 262, column: 15, scope: !995)
!1071 = !DILocation(line: 265, column: 21, scope: !995)
!1072 = !DILocation(line: 265, column: 3, scope: !995)
!1073 = !DILocation(line: 266, column: 3, scope: !995)
!1074 = !DILocation(line: 267, column: 3, scope: !995)
!1075 = !DILocation(line: 268, column: 3, scope: !995)
!1076 = !DILocation(line: 270, column: 3, scope: !995)
!1077 = !DILocation(line: 272, column: 16, scope: !995)
!1078 = !{!1079, !1079, i64 0}
!1079 = !{!"int", !943, i64 0}
!1080 = !DILocation(line: 275, column: 3, scope: !995)
!1081 = !DILocation(line: 275, column: 15, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !995, file: !3, discriminator: 1)
!1083 = !DILocation(line: 259, column: 7, scope: !995)
!1084 = !DILocation(line: 275, column: 3, scope: !1082)
!1085 = !DILocation(line: 280, column: 24, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 278, column: 9)
!1087 = distinct !DILexicalBlock(scope: !995, file: !3, line: 276, column: 5)
!1088 = !DILocation(line: 281, column: 11, scope: !1086)
!1089 = !DILocation(line: 285, column: 11, scope: !1086)
!1090 = !DILocation(line: 288, column: 23, scope: !1086)
!1091 = !DILocation(line: 289, column: 11, scope: !1086)
!1092 = !DILocation(line: 296, column: 11, scope: !1086)
!1093 = !DILocation(line: 299, column: 24, scope: !1086)
!1094 = !DILocation(line: 300, column: 11, scope: !1086)
!1095 = !DILocation(line: 304, column: 22, scope: !1086)
!1096 = !DILocation(line: 304, column: 20, scope: !1086)
!1097 = !DILocation(line: 305, column: 11, scope: !1086)
!1098 = !DILocation(line: 308, column: 48, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 308, column: 15)
!1100 = !DILocation(line: 308, column: 17, scope: !1099)
!1101 = !DILocation(line: 308, column: 15, scope: !1086)
!1102 = !DILocation(line: 310, column: 13, scope: !1099)
!1103 = !DILocation(line: 310, column: 13, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1099, file: !3, discriminator: 1)
!1105 = !DILocation(line: 310, column: 13, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1099, file: !3, discriminator: 2)
!1107 = !DILocation(line: 312, column: 30, scope: !1086)
!1108 = !{!1109, !1110, i64 8}
!1109 = !{!"timespec", !1110, i64 0, !1110, i64 8}
!1110 = !{!"long", !943, i64 0}
!1111 = !DILocation(line: 313, column: 24, scope: !1086)
!1112 = !{i64 0, i64 8, !1113, i64 8, i64 8, !1113}
!1113 = !{!1110, !1110, i64 0}
!1114 = !DILocation(line: 315, column: 11, scope: !1086)
!1115 = !DILocation(line: 318, column: 27, scope: !1086)
!1116 = !DILocation(line: 318, column: 24, scope: !1086)
!1117 = !DILocation(line: 320, column: 11, scope: !1086)
!1118 = distinct !{!1118, !1080, !1119}
!1119 = !DILocation(line: 329, column: 5, scope: !995)
!1120 = !DILocation(line: 322, column: 9, scope: !1086)
!1121 = !DILocation(line: 324, column: 9, scope: !1086)
!1122 = !DILocation(line: 324, column: 9, scope: !1123)
!1123 = !DILexicalBlockFile(scope: !1086, file: !3, discriminator: 1)
!1124 = !DILocation(line: 327, column: 11, scope: !1086)
!1125 = !DILocation(line: 331, column: 7, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !995, file: !3, line: 331, column: 7)
!1127 = !DILocation(line: 331, column: 20, scope: !1126)
!1128 = !DILocation(line: 331, column: 7, scope: !995)
!1129 = !DILocation(line: 332, column: 18, scope: !1126)
!1130 = !DILocation(line: 332, column: 5, scope: !1126)
!1131 = !DILocation(line: 334, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !995, file: !3, line: 334, column: 7)
!1133 = !DILocation(line: 334, column: 16, scope: !1132)
!1134 = !DILocation(line: 334, column: 31, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1132, file: !3, discriminator: 2)
!1136 = !DILocation(line: 334, column: 28, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1132, file: !3, discriminator: 1)
!1138 = !DILocation(line: 336, column: 20, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 335, column: 5)
!1140 = !DILocation(line: 336, column: 7, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1139, file: !3, discriminator: 1)
!1142 = !DILocation(line: 337, column: 7, scope: !1139)
!1143 = !DILocation(line: 340, column: 7, scope: !995)
!1144 = !DILocation(line: 342, column: 7, scope: !1007)
!1145 = !DIExpression(DW_OP_deref)
!1146 = !DILocation(line: 342, column: 19, scope: !1007)
!1147 = !DILocation(line: 345, column: 11, scope: !1007)
!1148 = !DILocalVariable(name: "__path", arg: 1, scope: !1149, file: !1150, line: 456, type: !20)
!1149 = distinct !DISubprogram(name: "lstat", scope: !1150, file: !1150, line: 456, type: !1151, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1154)
!1150 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!86, !20, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1154 = !{!1148, !1155}
!1155 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1149, file: !1150, line: 456, type: !1153)
!1156 = !DILocation(line: 456, column: 1, scope: !1149, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 345, column: 28, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1159, file: !3, discriminator: 1)
!1159 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 345, column: 11)
!1160 = !DILocation(line: 458, column: 10, scope: !1149, inlinedAt: !1157)
!1161 = !DILocation(line: 345, column: 28, scope: !1158)
!1162 = !DILocation(line: 345, column: 11, scope: !1158)
!1163 = !DILocalVariable(name: "__path", arg: 1, scope: !1164, file: !1150, line: 449, type: !20)
!1164 = distinct !DISubprogram(name: "stat", scope: !1150, file: !1150, line: 449, type: !1151, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1165)
!1165 = !{!1163, !1166}
!1166 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1164, file: !1150, line: 449, type: !1153)
!1167 = !DILocation(line: 449, column: 1, scope: !1164, inlinedAt: !1168)
!1168 = distinct !DILocation(line: 346, column: 13, scope: !1159)
!1169 = !DILocation(line: 451, column: 10, scope: !1164, inlinedAt: !1168)
!1170 = !DILocation(line: 346, column: 13, scope: !1159)
!1171 = !DILocation(line: 345, column: 11, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1007, file: !3, discriminator: 2)
!1173 = !DILocation(line: 347, column: 9, scope: !1159)
!1174 = !DILocation(line: 347, column: 9, scope: !1158)
!1175 = !DILocation(line: 347, column: 9, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1159, file: !3, discriminator: 2)
!1177 = !DILocation(line: 347, column: 9, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1159, file: !3, discriminator: 3)
!1179 = !DILocalVariable(name: "st", arg: 1, scope: !1180, file: !1181, line: 112, type: !1184)
!1180 = distinct !DISubprogram(name: "get_stat_atime", scope: !1181, file: !1181, line: 112, type: !1182, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1186)
!1181 = !DIFile(filename: "./lib/stat-time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!46, !1184}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1186 = !{!1179}
!1187 = !DILocation(line: 112, column: 36, scope: !1180, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 349, column: 20, scope: !1007)
!1189 = !DILocation(line: 115, column: 10, scope: !1180, inlinedAt: !1188)
!1190 = !DILocation(line: 349, column: 20, scope: !1007)
!1191 = !DILocalVariable(name: "st", arg: 1, scope: !1192, file: !1181, line: 140, type: !1184)
!1192 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1181, file: !1181, line: 140, type: !1182, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1193)
!1193 = !{!1191}
!1194 = !DILocation(line: 140, column: 36, scope: !1192, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 350, column: 20, scope: !1007)
!1196 = !DILocation(line: 143, column: 10, scope: !1192, inlinedAt: !1195)
!1197 = !DILocation(line: 350, column: 20, scope: !1007)
!1198 = !DILocation(line: 352, column: 11, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 352, column: 11)
!1200 = !DILocation(line: 352, column: 11, scope: !1007)
!1201 = !DILocation(line: 354, column: 15, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 354, column: 15)
!1203 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 353, column: 9)
!1204 = !DILocation(line: 354, column: 28, scope: !1202)
!1205 = !DILocation(line: 354, column: 15, scope: !1203)
!1206 = !DILocalVariable(name: "result", arg: 1, scope: !1207, file: !3, line: 112, type: !1210)
