; ModuleID = 'coreutils-8.27/src/vdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.timespec = type { i64, i64 }
%struct.ignore_pattern = type { i8*, %struct.ignore_pattern* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, %struct.color_ext_type* }
%struct.bin_str = type { i64, i8* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }

!32 = !DIEnumerator(name: "C_CAP", value: 21)
!33 = !DIEnumerator(name: "C_MULTIHARDLINK", value: 22)
!34 = !DIEnumerator(name: "C_CLR_TO_EOL", value: 23)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "format", file: !3, line: 409, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "long_format", value: 0)
!38 = !DIEnumerator(name: "one_per_line", value: 1)
!39 = !DIEnumerator(name: "many_per_line", value: 2)
!40 = !DIEnumerator(name: "horizontal", value: 3)
!41 = !DIEnumerator(name: "with_commas", value: 4)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !3, line: 564, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!45 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!46 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!47 = !DIEnumerator(name: "DEREF_COMMAND_LINE_SYMLINK_TO_DIR", value: 4)
!48 = !DIEnumerator(name: "DEREF_ALWAYS", value: 5)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "indicator_style", file: !3, line: 524, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "none", value: 0)
!52 = !DIEnumerator(name: "slash", value: 1)
!53 = !DIEnumerator(name: "file_type", value: 2)
!54 = !DIEnumerator(name: "classify", value: 3)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sort_type", file: !3, line: 460, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63}
!57 = !DIEnumerator(name: "sort_none", value: -1)
!58 = !DIEnumerator(name: "sort_name", value: 0)
!59 = !DIEnumerator(name: "sort_extension", value: 1)
!60 = !DIEnumerator(name: "sort_size", value: 2)
!61 = !DIEnumerator(name: "sort_version", value: 3)
!62 = !DIEnumerator(name: "sort_time", value: 4)
!63 = !DIEnumerator(name: "sort_numtypes", value: 5)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !3, line: 160, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!66 = !DIEnumerator(name: "unknown", value: 0)
!67 = !DIEnumerator(name: "fifo", value: 1)
!68 = !DIEnumerator(name: "chardev", value: 2)
!69 = !DIEnumerator(name: "directory", value: 3)
!70 = !DIEnumerator(name: "blockdev", value: 4)
!71 = !DIEnumerator(name: "normal", value: 5)
!72 = !DIEnumerator(name: "symbolic_link", value: 6)
!73 = !DIEnumerator(name: "sock", value: 7)
!74 = !DIEnumerator(name: "whiteout", value: 8)
!75 = !DIEnumerator(name: "arg_directory", value: 9)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 112, size: 32, elements: !78)
!77 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!78 = !{!79}
!79 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !3, line: 188, size: 32, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIEnumerator(name: "ACL_T_NONE", value: 0)
!83 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 1)
!84 = !DIEnumerator(name: "ACL_T_YES", value: 2)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !86, file: !3, line: 1357, size: 32, elements: !203)
!86 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1331, type: !87, isLocal: true, isDefinition: true, scopeLine: 1332, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !90)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89}
!89 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!90 = !{!91, !92, !94}
!91 = !DILocalVariable(name: "init", arg: 1, scope: !86, file: !3, line: 1331, type: !89)
!92 = !DILocalVariable(name: "j", scope: !86, file: !3, line: 1363, type: !93)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DILocalVariable(name: "act", scope: !95, file: !3, line: 1368, type: !97)
!95 = distinct !DILexicalBlock(scope: !96, file: !3, line: 1366, column: 5)
!96 = distinct !DILexicalBlock(scope: !86, file: !3, line: 1365, column: 7)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !98, line: 24, size: 1216, elements: !99)
!98 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !{!100, !188, !198, !199}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !97, file: !98, line: 35, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !97, file: !98, line: 28, size: 64, elements: !102)
!102 = !{!103, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !101, file: !98, line: 31, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !105, line: 84, baseType: !106)
!105 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !93}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !101, file: !98, line: 33, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !93, !113, !148}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !115, line: 133, baseType: !116)
!115 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 62, size: 1024, elements: !117)
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !116, file: !115, line: 64, baseType: !93, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !116, file: !115, line: 65, baseType: !93, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !116, file: !115, line: 67, baseType: !93, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !116, file: !115, line: 132, baseType: !122, size: 896, offset: 128)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !115, line: 69, size: 896, elements: !123)
!123 = !{!124, !128, !137, !149, !155, !166, !177, !182}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !122, file: !115, line: 71, baseType: !125, size: 896)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 896, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 28)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !122, file: !115, line: 78, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 74, size: 64, elements: !130)
!130 = !{!131, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !129, file: !115, line: 76, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !133, line: 142, baseType: !93)
!133 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !129, file: !115, line: 77, baseType: !135, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !133, line: 134, baseType: !136)
!136 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !122, file: !115, line: 86, baseType: !138, size: 128)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 81, size: 128, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !138, file: !115, line: 83, baseType: !93, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !138, file: !115, line: 84, baseType: !93, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !138, file: !115, line: 85, baseType: !143, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !115, line: 36, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !115, line: 32, size: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !144, file: !115, line: 34, baseType: !93, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !144, file: !115, line: 35, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !122, file: !115, line: 94, baseType: !150, size: 128)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 89, size: 128, elements: !151)
!151 = !{!152, !153, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !150, file: !115, line: 91, baseType: !132, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !150, file: !115, line: 92, baseType: !135, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !150, file: !115, line: 93, baseType: !143, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !122, file: !115, line: 104, baseType: !156, size: 256)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 97, size: 256, elements: !157)
!157 = !{!158, !159, !160, !161, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !156, file: !115, line: 99, baseType: !132, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !156, file: !115, line: 100, baseType: !135, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !156, file: !115, line: 101, baseType: !93, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !156, file: !115, line: 102, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !115, line: 58, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !133, line: 144, baseType: !164)
!164 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !156, file: !115, line: 103, baseType: !162, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !122, file: !115, line: 116, baseType: !167, size: 256)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 107, size: 256, elements: !168)
!168 = !{!169, !170, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !167, file: !115, line: 109, baseType: !148, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !167, file: !115, line: 110, baseType: !171, size: 16, offset: 64)
!171 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !167, file: !115, line: 115, baseType: !173, size: 128, offset: 128)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !167, file: !115, line: 111, size: 128, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !173, file: !115, line: 113, baseType: !148, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !173, file: !115, line: 114, baseType: !148, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !122, file: !115, line: 123, baseType: !178, size: 128)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 119, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !178, file: !115, line: 121, baseType: !164, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !178, file: !115, line: 122, baseType: !93, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !122, file: !115, line: 131, baseType: !183, size: 128)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !115, line: 126, size: 128, elements: !184)
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !183, file: !115, line: 128, baseType: !148, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !183, file: !115, line: 129, baseType: !93, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !183, file: !115, line: 130, baseType: !136, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !97, file: !98, line: 43, baseType: !189, size: 1024, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !190, line: 30, baseType: !191)
!190 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 27, size: 1024, elements: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !191, file: !190, line: 29, baseType: !194, size: 1024)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1024, elements: !196)
!195 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!196 = !{!197}
!197 = !DISubrange(count: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !97, file: !98, line: 46, baseType: !93, size: 32, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !97, file: !98, line: 49, baseType: !200, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !{!204}
!204 = !DIEnumerator(name: "nsigs", value: 12)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !206, line: 32, size: 32, elements: !207)
!206 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!208 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!209 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!210 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!211 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!212 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!213 = !DIEnumerator(name: "c_quoting_style", value: 5)
!214 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!215 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!216 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!217 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!218 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !3, line: 446, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIEnumerator(name: "time_mtime", value: 0)
!222 = !DIEnumerator(name: "time_ctime", value: 1)
!223 = !DIEnumerator(name: "time_atime", value: 2)
!224 = !DIEnumerator(name: "time_numtypes", value: 3)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 660, size: 32, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0)
!228 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1)
!229 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !231, line: 26, size: 32, elements: !232)
!231 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!232 = !{!233, !234, !235, !236, !237}
!233 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!234 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!235 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!236 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!237 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 43, size: 32, elements: !240)
!239 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!241 = !DIEnumerator(name: "human_ceiling", value: 0)
!242 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!243 = !DIEnumerator(name: "human_floor", value: 2)
!244 = !DIEnumerator(name: "human_group_digits", value: 4)
!245 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!246 = !DIEnumerator(name: "human_autoscale", value: 16)
!247 = !DIEnumerator(name: "human_base_1024", value: 32)
!248 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!249 = !DIEnumerator(name: "human_SI", value: 128)
!250 = !DIEnumerator(name: "human_B", value: 256)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "color_type", file: !3, line: 557, size: 32, elements: !252)
!252 = !{!253, !254, !255}
!253 = !DIEnumerator(name: "color_never", value: 0)
!254 = !DIEnumerator(name: "color_always", value: 1)
!255 = !DIEnumerator(name: "color_if_tty", value: 2)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !3, line: 423, size: 32, elements: !257)
!257 = !{!258, !259, !260, !261}
!258 = !DIEnumerator(name: "full_iso_time_style", value: 0)
!259 = !DIEnumerator(name: "long_iso_time_style", value: 1)
!260 = !DIEnumerator(name: "iso_time_style", value: 2)
!261 = !DIEnumerator(name: "locale_time_style", value: 3)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1084, size: 32, elements: !263)
!263 = !{!264}
!264 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1081, size: 32, elements: !266)
!266 = !{!267}
!267 = !DIEnumerator(name: "MAX_MON_WIDTH", value: 5)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !269, line: 41, size: 32, elements: !270)
!269 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!271 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!272 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!273 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!274 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!275 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!276 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!277 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!278 = !DIEnumerator(name: "DAY_1", value: 131079)
!279 = !DIEnumerator(name: "DAY_2", value: 131080)
!280 = !DIEnumerator(name: "DAY_3", value: 131081)
!281 = !DIEnumerator(name: "DAY_4", value: 131082)
!282 = !DIEnumerator(name: "DAY_5", value: 131083)
!283 = !DIEnumerator(name: "DAY_6", value: 131084)
!284 = !DIEnumerator(name: "DAY_7", value: 131085)
!285 = !DIEnumerator(name: "ABMON_1", value: 131086)
!286 = !DIEnumerator(name: "ABMON_2", value: 131087)
!287 = !DIEnumerator(name: "ABMON_3", value: 131088)
!288 = !DIEnumerator(name: "ABMON_4", value: 131089)
!289 = !DIEnumerator(name: "ABMON_5", value: 131090)
!290 = !DIEnumerator(name: "ABMON_6", value: 131091)
!291 = !DIEnumerator(name: "ABMON_7", value: 131092)
!292 = !DIEnumerator(name: "ABMON_8", value: 131093)
!293 = !DIEnumerator(name: "ABMON_9", value: 131094)
!294 = !DIEnumerator(name: "ABMON_10", value: 131095)
!295 = !DIEnumerator(name: "ABMON_11", value: 131096)
!296 = !DIEnumerator(name: "ABMON_12", value: 131097)
!297 = !DIEnumerator(name: "MON_1", value: 131098)
!298 = !DIEnumerator(name: "MON_2", value: 131099)
!299 = !DIEnumerator(name: "MON_3", value: 131100)
!300 = !DIEnumerator(name: "MON_4", value: 131101)
!301 = !DIEnumerator(name: "MON_5", value: 131102)
!302 = !DIEnumerator(name: "MON_6", value: 131103)
!303 = !DIEnumerator(name: "MON_7", value: 131104)
!304 = !DIEnumerator(name: "MON_8", value: 131105)
!305 = !DIEnumerator(name: "MON_9", value: 131106)
!306 = !DIEnumerator(name: "MON_10", value: 131107)
!307 = !DIEnumerator(name: "MON_11", value: 131108)
!308 = !DIEnumerator(name: "MON_12", value: 131109)
!309 = !DIEnumerator(name: "AM_STR", value: 131110)
!310 = !DIEnumerator(name: "PM_STR", value: 131111)
!311 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!312 = !DIEnumerator(name: "D_FMT", value: 131113)
!313 = !DIEnumerator(name: "T_FMT", value: 131114)
!314 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!315 = !DIEnumerator(name: "ERA", value: 131116)
!316 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!317 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!318 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!319 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!320 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!321 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!322 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!323 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!324 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!325 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!326 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!327 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!328 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!329 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!330 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!331 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!332 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!333 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!334 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!335 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!336 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!337 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!338 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!339 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!340 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!341 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!342 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!343 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!344 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!345 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!346 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!347 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!348 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!349 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!350 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!351 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!352 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!353 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!354 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!355 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!356 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!357 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!358 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!359 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!360 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!361 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!362 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!363 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!364 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!365 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!366 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!367 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!368 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!369 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!370 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!371 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!372 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!373 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!374 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!375 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!376 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!377 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!378 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!379 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!380 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!381 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!382 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!383 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!384 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!385 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!386 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!387 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!388 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!389 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!390 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!391 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!392 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!393 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!394 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!395 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!396 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!397 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!398 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!399 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!400 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!401 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!402 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!403 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!404 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!405 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!406 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!407 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!408 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!409 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!410 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!411 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!412 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!413 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!414 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!415 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!416 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!417 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!418 = !DIEnumerator(name: "CODESET", value: 14)
!419 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!420 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!421 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!422 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!465 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!466 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!467 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!468 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!469 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!470 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!471 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!472 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!473 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!474 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!475 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!478 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!479 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!480 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!481 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!490 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!491 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!492 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!493 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!494 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!495 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!496 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!497 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!498 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!499 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!500 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!501 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!502 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!503 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!504 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!505 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!506 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!507 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!508 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!509 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!510 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!511 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!512 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!529 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!530 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!533 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!534 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!535 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!536 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!537 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!538 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!539 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!540 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!541 = !DIEnumerator(name: "THOUSEP", value: 65537)
!542 = !DIEnumerator(name: "__GROUPING", value: 65538)
!543 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!544 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!545 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!546 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!547 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!548 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!549 = !DIEnumerator(name: "__YESSTR", value: 327682)
!550 = !DIEnumerator(name: "__NOSTR", value: 327683)
!551 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!552 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!553 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!554 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!555 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!556 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!557 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!558 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!559 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!560 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!561 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!562 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!563 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!564 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!565 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!566 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!567 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!568 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!569 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!570 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!571 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!572 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!573 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!574 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!575 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!576 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!577 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!578 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!579 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!580 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!581 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!582 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!583 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!584 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!585 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!586 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!587 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!604 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!605 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 19, size: 32, elements: !608)
!607 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = !{!609, !610, !611}
!609 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0)
!610 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1)
!611 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2423, size: 32, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619}
!614 = !DIEnumerator(name: "PS_START", value: 1)
!615 = !DIEnumerator(name: "PS_2", value: 2)
!616 = !DIEnumerator(name: "PS_3", value: 3)
!617 = !DIEnumerator(name: "PS_4", value: 4)
!618 = !DIEnumerator(name: "PS_DONE", value: 5)
!619 = !DIEnumerator(name: "PS_FAIL", value: 6)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !621, file: !3, line: 2234, size: 32, elements: !643)
!621 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2229, type: !622, isLocal: true, isDefinition: true, scopeLine: 2231, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !633)
!622 = !DISubroutineType(types: !623)
!623 = !{!89, !624, !627, !89, !630}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !632, line: 62, baseType: !195)
!632 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642}
!634 = !DILocalVariable(name: "dest", arg: 1, scope: !621, file: !3, line: 2229, type: !624)
!635 = !DILocalVariable(name: "src", arg: 2, scope: !621, file: !3, line: 2229, type: !627)
!636 = !DILocalVariable(name: "equals_end", arg: 3, scope: !621, file: !3, line: 2229, type: !89)
!637 = !DILocalVariable(name: "output_count", arg: 4, scope: !621, file: !3, line: 2230, type: !630)
!638 = !DILocalVariable(name: "num", scope: !621, file: !3, line: 2232, type: !626)
!639 = !DILocalVariable(name: "count", scope: !621, file: !3, line: 2233, type: !631)
!640 = !DILocalVariable(name: "state", scope: !621, file: !3, line: 2236, type: !620)
!641 = !DILocalVariable(name: "p", scope: !621, file: !3, line: 2237, type: !628)
!642 = !DILocalVariable(name: "q", scope: !621, file: !3, line: 2238, type: !625)
!643 = !{!644, !645, !646, !647, !648, !649, !650}
!644 = !DIEnumerator(name: "ST_GND", value: 0)
!645 = !DIEnumerator(name: "ST_BACKSLASH", value: 1)
!646 = !DIEnumerator(name: "ST_OCTAL", value: 2)
!647 = !DIEnumerator(name: "ST_HEX", value: 3)
!648 = !DIEnumerator(name: "ST_CARET", value: 4)
!649 = !DIEnumerator(name: "ST_END", value: 5)
!650 = !DIEnumerator(name: "ST_ERROR", value: 6)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !652, line: 46, size: 32, elements: !653)
!652 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!654 = !DIEnumerator(name: "_ISupper", value: 256)
!655 = !DIEnumerator(name: "_ISlower", value: 512)
!656 = !DIEnumerator(name: "_ISalpha", value: 1024)
!657 = !DIEnumerator(name: "_ISdigit", value: 2048)
!658 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!659 = !DIEnumerator(name: "_ISspace", value: 8192)
!660 = !DIEnumerator(name: "_ISprint", value: 16384)
!661 = !DIEnumerator(name: "_ISgraph", value: 32768)
!662 = !DIEnumerator(name: "_ISblank", value: 1)
!663 = !DIEnumerator(name: "_IScntrl", value: 2)
!664 = !DIEnumerator(name: "_ISpunct", value: 4)
!665 = !DIEnumerator(name: "_ISalnum", value: 8)
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 739, size: 32, elements: !667)
!667 = !{!668}
!668 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000)
!669 = !{!670, !148, !673, !631, !676, !104, !630, !625, !195, !628, !677, !679, !93, !681, !682, !683, !686, !687}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !671, line: 8, baseType: !672)
!671 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !133, line: 148, baseType: !164)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !674, line: 136, baseType: !675)
!674 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !133, line: 62, baseType: !195)
!676 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!681 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !133, line: 133, baseType: !195)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !684, line: 86, baseType: !685)
!684 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !133, line: 140, baseType: !164)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 195, size: 1536, elements: !690)
!690 = !{!691, !692, !693, !727, !728, !730, !731, !732, !733, !734, !735}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !3, line: 198, baseType: !625, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !689, file: !3, line: 201, baseType: !625, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !689, file: !3, line: 203, baseType: !694, size: 1152, offset: 128)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !695, line: 46, size: 1152, elements: !696)
!695 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!696 = !{!697, !698, !700, !702, !704, !705, !707, !708, !709, !710, !712, !714, !721, !722, !723}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !694, file: !695, line: 48, baseType: !682, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !694, file: !695, line: 53, baseType: !699, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !133, line: 136, baseType: !195)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !694, file: !695, line: 61, baseType: !701, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !133, line: 139, baseType: !195)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !694, file: !695, line: 62, baseType: !703, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !133, line: 138, baseType: !136)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !694, file: !695, line: 64, baseType: !135, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !694, file: !695, line: 65, baseType: !706, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !133, line: 135, baseType: !136)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !694, file: !695, line: 67, baseType: !93, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !694, file: !695, line: 69, baseType: !682, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !694, file: !695, line: 74, baseType: !685, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !694, file: !695, line: 78, baseType: !711, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !133, line: 162, baseType: !164)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !694, file: !695, line: 80, baseType: !713, size: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !133, line: 167, baseType: !164)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !694, file: !695, line: 91, baseType: !715, size: 128, offset: 576)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !716, line: 8, size: 128, elements: !717)
!716 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !715, file: !716, line: 10, baseType: !672, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !715, file: !716, line: 11, baseType: !720, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !133, line: 184, baseType: !164)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !694, file: !695, line: 92, baseType: !715, size: 128, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !694, file: !695, line: 93, baseType: !715, size: 128, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !694, file: !695, line: 106, baseType: !724, size: 192, offset: 960)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 192, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 3)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !689, file: !3, line: 205, baseType: !64, size: 32, offset: 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !689, file: !3, line: 209, baseType: !729, size: 32, offset: 1312)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !684, line: 70, baseType: !703)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !689, file: !3, line: 212, baseType: !625, size: 64, offset: 1344)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !689, file: !3, line: 214, baseType: !89, size: 8, offset: 1408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !689, file: !3, line: 218, baseType: !89, size: 8, offset: 1416)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !689, file: !3, line: 222, baseType: !80, size: 32, offset: 1440)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !689, file: !3, line: 225, baseType: !89, size: 8, offset: 1472)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !689, file: !3, line: 228, baseType: !93, size: 32, offset: 1504)
!736 = !{!737, !743, !746, !748, !750, !752, !761, !763, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !791, !793, !799, !801, !803, !808, !0, !810, !812, !863, !865, !867, !869, !878, !884, !888, !959, !961, !963, !965, !967, !969, !971, !973, !975, !977, !979, !993, !995, !997, !999, !1001, !1003, !1005, !1007, !1013, !1018, !1022, !1024, !1028, !1033, !1039, !1044, !1050, !1053, !1055, !1057, !1059, !1064, !1066, !1070, !1075, !1077, !1083, !1085, !1093, !1098, !1143, !1145, !1148, !1151, !1153, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1183, !1193, !1202, !1204, !1219, !1229, !1248, !1266, !1274, !1279, !1310}
!737 = !DIGlobalVariableExpression(var: !738)
!738 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 311, type: !739, isLocal: true, isDefinition: true)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !741, line: 69, baseType: !742)
!741 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !741, line: 67, flags: DIFlagFwdDecl)
!743 = !DIGlobalVariableExpression(var: !744)
!744 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 322, type: !745, isLocal: true, isDefinition: true)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!746 = !DIGlobalVariableExpression(var: !747)
!747 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 325, type: !631, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749)
!749 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 328, type: !631, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751)
!751 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 347, type: !89, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753)
!753 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 368, type: !754, isLocal: true, isDefinition: true)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 357, size: 256, elements: !756)
!756 = !{!757, !758, !759, !760}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !3, line: 359, baseType: !625, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !755, file: !3, line: 363, baseType: !625, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !755, file: !3, line: 364, baseType: !89, size: 8, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !3, line: 365, baseType: !754, size: 64, offset: 192)
!761 = !DIGlobalVariableExpression(var: !762)
!762 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 373, type: !715, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764)
!764 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 375, type: !89, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766)
!766 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 418, type: !35, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768)
!768 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 471, type: !55, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770)
!770 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 500, type: !89, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772)
!772 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 515, type: !89, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774)
!774 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 532, type: !49, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776)
!776 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 549, type: !89, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778)
!778 = distinct !DIGlobalVariable(name: "check_symlink_color", scope: !2, file: !3, line: 633, type: !89, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780)
!780 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 642, type: !42, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782)
!782 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 647, type: !89, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784)
!784 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 652, type: !89, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786)
!786 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 656, type: !89, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788)
!788 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 703, type: !789, isLocal: true, isDefinition: true)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !206, line: 270, flags: DIFlagFwdDecl)
!791 = !DIGlobalVariableExpression(var: !792)
!792 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 712, type: !89, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794)
!794 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 721, type: !795, isLocal: true, isDefinition: true)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !796, line: 594, baseType: !797)
!796 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !796, line: 594, flags: DIFlagFwdDecl)
!799 = !DIGlobalVariableExpression(var: !800)
!800 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 726, type: !89, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802)
!802 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 731, type: !89, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804)
!804 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 780, type: !805, isLocal: true, isDefinition: true)
!805 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !105, line: 40, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !190, line: 22, baseType: !93)
!808 = !DIGlobalVariableExpression(var: !809)
!809 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 784, type: !805, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811)
!811 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 946, type: !631, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813)
!813 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 967, type: !814, isLocal: true, isDefinition: true)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !815, line: 174, size: 704, elements: !816)
!815 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!816 = !{!817, !818, !828, !829, !830, !831, !836, !837, !848, !859, !860, !861, !862}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !814, file: !815, line: 176, baseType: !631, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !814, file: !815, line: 177, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !815, line: 167, size: 128, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !820, file: !815, line: 169, baseType: !625, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !820, file: !815, line: 170, baseType: !819, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !820, file: !815, line: 171, baseType: !825, offset: 128)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: -1)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !814, file: !815, line: 178, baseType: !625, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !814, file: !815, line: 179, baseType: !625, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !814, file: !815, line: 180, baseType: !625, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !814, file: !815, line: 185, baseType: !832, size: 64, offset: 320)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !814, file: !815, line: 181, size: 64, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !832, file: !815, line: 183, baseType: !631, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !832, file: !815, line: 184, baseType: !148, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !814, file: !815, line: 186, baseType: !631, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !814, file: !815, line: 193, baseType: !838, size: 64, offset: 448)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !814, file: !815, line: 189, size: 64, elements: !839)
!839 = !{!840, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !838, file: !815, line: 191, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!148, !631}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !838, file: !815, line: 192, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!148, !148, !631}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !814, file: !815, line: 198, baseType: !849, size: 64, offset: 512)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !814, file: !815, line: 194, size: 64, elements: !850)
!850 = !{!851, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !849, file: !815, line: 196, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !148}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !849, file: !815, line: 197, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !148, !148}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !814, file: !815, line: 200, baseType: !148, size: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !814, file: !815, line: 201, baseType: !136, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !814, file: !815, line: 202, baseType: !136, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !814, file: !815, line: 206, baseType: !136, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!863 = !DIGlobalVariableExpression(var: !864)
!864 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 974, type: !814, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866)
!866 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 988, type: !814, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868)
!868 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 555, type: !89, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870)
!870 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 596, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 3072, elements: !876)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 237, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !872, file: !3, line: 239, baseType: !631, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !872, file: !3, line: 240, baseType: !628, size: 64, offset: 64)
!876 = !{!877}
!877 = !DISubrange(count: 24)
!878 = !DIGlobalVariableExpression(var: !879)
!879 = distinct !DIGlobalVariable(name: "sig", scope: !86, file: !3, line: 1334, type: !880, isLocal: true, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 384, elements: !882)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!882 = !{!883}
!883 = !DISubrange(count: 12)
!884 = !DIGlobalVariableExpression(var: !885)
!885 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 776, type: !886, isLocal: true, isDefinition: true)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !887, line: 37, baseType: !189)
!887 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!888 = !DIGlobalVariableExpression(var: !889)
!889 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !890, file: !3, line: 2128, type: !956, isLocal: true, isDefinition: true)
!890 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1651, type: !891, isLocal: true, isDefinition: true, scopeLine: 1652, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{!93, !93, !624}
!893 = !{!894, !895, !896, !897, !898, !899, !901, !910, !912, !915, !917, !918, !926, !928, !930, !933, !934, !937, !940, !943, !944, !947, !952}
!894 = !DILocalVariable(name: "argc", arg: 1, scope: !890, file: !3, line: 1651, type: !93)
!895 = !DILocalVariable(name: "argv", arg: 2, scope: !890, file: !3, line: 1651, type: !624)
!896 = !DILocalVariable(name: "time_style_option", scope: !890, file: !3, line: 1653, type: !625)
!897 = !DILocalVariable(name: "sort_type_specified", scope: !890, file: !3, line: 1655, type: !89)
!898 = !DILocalVariable(name: "kibibytes_specified", scope: !890, file: !3, line: 1656, type: !89)
!899 = !DILocalVariable(name: "p", scope: !900, file: !3, line: 1715, type: !628)
!900 = distinct !DILexicalBlock(scope: !890, file: !3, line: 1714, column: 3)
!901 = !DILocalVariable(name: "ws", scope: !902, file: !3, line: 1724, type: !903)
!902 = distinct !DILexicalBlock(scope: !890, file: !3, line: 1723, column: 3)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !904, line: 27, size: 64, elements: !905)
!904 = !DIFile(filename: "/usr/include/bits/ioctl-types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = !{!906, !907, !908, !909}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !903, file: !904, line: 29, baseType: !681, size: 16)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !903, file: !904, line: 30, baseType: !681, size: 16, offset: 16)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !903, file: !904, line: 31, baseType: !681, size: 16, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !903, file: !904, line: 32, baseType: !681, size: 16, offset: 48)
!910 = !DILocalVariable(name: "p", scope: !911, file: !3, line: 1733, type: !628)
!911 = distinct !DILexicalBlock(scope: !890, file: !3, line: 1732, column: 3)
!912 = !DILocalVariable(name: "tmp_ulong", scope: !913, file: !3, line: 1737, type: !195)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 1736, column: 7)
!914 = distinct !DILexicalBlock(scope: !911, file: !3, line: 1735, column: 9)
!915 = !DILocalVariable(name: "oi", scope: !916, file: !3, line: 1754, type: !93)
!916 = distinct !DILexicalBlock(scope: !890, file: !3, line: 1753, column: 5)
!917 = !DILocalVariable(name: "c", scope: !916, file: !3, line: 1755, type: !93)
!918 = !DILocalVariable(name: "hide", scope: !919, file: !3, line: 1958, type: !921)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1957, column: 11)
!920 = distinct !DILexicalBlock(scope: !916, file: !3, line: 1762, column: 9)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 678, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !922, file: !3, line: 680, baseType: !628, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !3, line: 681, baseType: !921, size: 64, offset: 64)
!926 = !DILocalVariable(name: "i", scope: !927, file: !3, line: 1989, type: !93)
!927 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1988, column: 11)
!928 = !DILocalVariable(name: "e", scope: !929, file: !3, line: 2034, type: !230)
!929 = distinct !DILexicalBlock(scope: !920, file: !3, line: 2033, column: 11)
!930 = !DILocalVariable(name: "ls_block_size", scope: !931, file: !3, line: 2064, type: !628)
!931 = distinct !DILexicalBlock(scope: !932, file: !3, line: 2063, column: 5)
!932 = distinct !DILexicalBlock(scope: !890, file: !3, line: 2062, column: 7)
!933 = !DILocalVariable(name: "qs", scope: !890, file: !3, line: 2085, type: !205)
!934 = !DILocalVariable(name: "p", scope: !935, file: !3, line: 2097, type: !628)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 2096, column: 5)
!936 = distinct !DILexicalBlock(scope: !890, file: !3, line: 2095, column: 7)
!937 = !DILocalVariable(name: "style", scope: !938, file: !3, line: 2127, type: !625)
!938 = distinct !DILexicalBlock(scope: !939, file: !3, line: 2126, column: 5)
!939 = distinct !DILexicalBlock(scope: !890, file: !3, line: 2125, column: 7)
!940 = !DILocalVariable(name: "p0", scope: !941, file: !3, line: 2143, type: !625)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 2142, column: 9)
!942 = distinct !DILexicalBlock(scope: !938, file: !3, line: 2141, column: 11)
!943 = !DILocalVariable(name: "p1", scope: !941, file: !3, line: 2144, type: !625)
!944 = !DILocalVariable(name: "res", scope: !945, file: !3, line: 2159, type: !946)
!945 = distinct !DILexicalBlock(scope: !942, file: !3, line: 2158, column: 9)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !632, line: 51, baseType: !164)
!947 = !DILocalVariable(name: "p", scope: !948, file: !3, line: 2175, type: !950)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 2163, column: 13)
!949 = distinct !DILexicalBlock(scope: !945, file: !3, line: 2162, column: 15)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!952 = !DILocalVariable(name: "i", scope: !953, file: !3, line: 2201, type: !93)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 2200, column: 17)
!954 = distinct !DILexicalBlock(scope: !955, file: !3, line: 2199, column: 19)
!955 = distinct !DILexicalBlock(scope: !945, file: !3, line: 2183, column: 13)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 56, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 7)
!959 = !DIGlobalVariableExpression(var: !960)
!960 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 699, type: !89, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962)
!962 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 454, type: !219, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964)
!964 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 479, type: !89, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966)
!966 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 496, type: !89, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968)
!968 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 637, type: !89, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970)
!970 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 671, type: !225, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972)
!972 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 684, type: !921, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974)
!974 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 688, type: !921, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976)
!976 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 717, type: !631, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978)
!978 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 708, type: !631, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980)
!980 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 826, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 11008, elements: !991)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !984, line: 104, size: 256, elements: !985)
!984 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!985 = !{!986, !987, !988, !990}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !984, line: 106, baseType: !628, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !983, file: !984, line: 109, baseType: !93, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !983, file: !984, line: 110, baseType: !989, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !983, file: !984, line: 111, baseType: !93, size: 32, offset: 192)
!991 = !{!992}
!992 = !DISubrange(count: 43)
!993 = !DIGlobalVariableExpression(var: !994)
!994 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 483, type: !89, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996)
!996 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 503, type: !93, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998)
!998 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 509, type: !93, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000)
!1000 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 506, type: !673, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002)
!1002 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 510, type: !673, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004)
!1004 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 491, type: !89, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006)
!1006 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 487, type: !89, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008)
!1008 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 891, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 160, elements: !1011)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!1011 = !{!1012}
!1012 = !DISubrange(count: 5)
!1013 = !DIGlobalVariableExpression(var: !1014)
!1014 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 887, type: !1015, isLocal: true, isDefinition: true)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 384, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 6)
!1018 = !DIGlobalVariableExpression(var: !1019)
!1019 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 901, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 160, elements: !1011)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!1022 = !DIGlobalVariableExpression(var: !1023)
!1023 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 897, type: !1015, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025)
!1025 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 880, type: !1026, isLocal: true, isDefinition: true)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 224, elements: !957)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!1028 = !DIGlobalVariableExpression(var: !1029)
!1029 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 875, type: !1030, isLocal: true, isDefinition: true)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 512, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 8)
!1033 = !DIGlobalVariableExpression(var: !1034)
!1034 = distinct !DIGlobalVariable(name: "color_types", scope: !2, file: !3, line: 914, type: !1035, isLocal: true, isDefinition: true)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 288, elements: !1037)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!1037 = !{!1038}
!1038 = !DISubrange(count: 9)
!1039 = !DIGlobalVariableExpression(var: !1040)
!1040 = distinct !DIGlobalVariable(name: "color_args", scope: !2, file: !3, line: 907, type: !1041, isLocal: true, isDefinition: true)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 640, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 10)
!1044 = !DIGlobalVariableExpression(var: !1045)
!1045 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 539, type: !1046, isLocal: true, isDefinition: true)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 128, elements: !1048)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1048 = !{!1049}
!1049 = !DISubrange(count: 4)
!1050 = !DIGlobalVariableExpression(var: !1051)
!1051 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 535, type: !1052, isLocal: true, isDefinition: true)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 320, elements: !1011)
!1053 = !DIGlobalVariableExpression(var: !1054)
!1054 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 934, type: !631, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056)
!1056 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 335, type: !89, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058)
!1058 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 704, type: !789, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060)
!1060 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 744, type: !1061, isLocal: true, isDefinition: true)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 128, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 2)
!1064 = !DIGlobalVariableExpression(var: !1065)
!1065 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 431, type: !1052, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067)
!1067 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 435, type: !1068, isLocal: true, isDefinition: true)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 128, elements: !1048)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!1070 = !DIGlobalVariableExpression(var: !1071)
!1071 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1085, type: !1072, isLocal: true, isDefinition: true)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 24576, elements: !1073)
!1073 = !{!1063, !883, !1074}
!1074 = !DISubrange(count: 128)
!1075 = !DIGlobalVariableExpression(var: !1076)
!1076 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1089, type: !89, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078)
!1078 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !1079, line: 1, type: !1080, isLocal: true, isDefinition: true)
!1079 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 33384, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 4173)
!1083 = !DIGlobalVariableExpression(var: !1084)
!1084 = distinct !DIGlobalVariable(name: "color_buf", scope: !2, file: !3, line: 628, type: !625, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086)
!1086 = distinct !DIGlobalVariable(name: "color_ext_list", scope: !2, file: !3, line: 625, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_ext_type", file: !3, line: 589, size: 320, elements: !1089)
!1089 = !{!1090, !1091, !1092}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1088, file: !3, line: 591, baseType: !872, size: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1088, file: !3, line: 592, baseType: !872, size: 128, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !3, line: 593, baseType: !1087, size: 64, offset: 256)
!1093 = !DIGlobalVariableExpression(var: !1094)
!1094 = distinct !DIGlobalVariable(name: "indicator_name", scope: !2, file: !3, line: 582, type: !1095, isLocal: true, isDefinition: true)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 1600, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 25)
!1098 = !DIGlobalVariableExpression(var: !1099)
!1099 = distinct !DIGlobalVariable(name: "first", scope: !1100, file: !3, line: 2673, type: !89, isLocal: true, isDefinition: true)
!1100 = distinct !DISubprogram(name: "print_dir", scope: !3, file: !3, line: 2668, type: !1101, isLocal: true, isDefinition: true, scopeLine: 2669, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1103)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !628, !628, !89}
!1103 = !{!1104, !1105, !1106, !1107, !1112, !1125, !1126, !1129, !1130, !1136, !1139}
!1104 = !DILocalVariable(name: "name", arg: 1, scope: !1100, file: !3, line: 2668, type: !628)
!1105 = !DILocalVariable(name: "realname", arg: 2, scope: !1100, file: !3, line: 2668, type: !628)
!1106 = !DILocalVariable(name: "command_line_arg", arg: 3, scope: !1100, file: !3, line: 2668, type: !89)
!1107 = !DILocalVariable(name: "dirp", scope: !1100, file: !3, line: 2670, type: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1110, line: 127, baseType: !1111)
!1110 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1110, line: 127, flags: DIFlagFwdDecl)
!1112 = !DILocalVariable(name: "next", scope: !1100, file: !3, line: 2671, type: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1115, line: 22, size: 2240, elements: !1116)
!1115 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1116 = !{!1117, !1118, !1119, !1120, !1121}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1114, file: !1115, line: 25, baseType: !699, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1114, file: !1115, line: 26, baseType: !685, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1114, file: !1115, line: 31, baseType: !681, size: 16, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1114, file: !1115, line: 32, baseType: !676, size: 8, offset: 144)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1114, file: !1115, line: 33, baseType: !1122, size: 2048, offset: 152)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 2048, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 256)
!1125 = !DILocalVariable(name: "total_blocks", scope: !1100, file: !3, line: 2672, type: !673)
!1126 = !DILocalVariable(name: "dir_stat", scope: !1127, file: !3, line: 2685, type: !694)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 2684, column: 5)
!1128 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 2683, column: 7)
!1129 = !DILocalVariable(name: "fd", scope: !1127, file: !3, line: 2686, type: !93)
!1130 = !DILocalVariable(name: "type", scope: !1131, file: !3, line: 2741, type: !64)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 2740, column: 13)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 2739, column: 15)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 2738, column: 9)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 2737, column: 11)
!1135 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 2732, column: 5)
!1136 = !DILocalVariable(name: "p", scope: !1137, file: !3, line: 2810, type: !628)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 2809, column: 5)
!1138 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 2808, column: 7)
!1139 = !DILocalVariable(name: "buf", scope: !1137, file: !3, line: 2811, type: !1140)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 5216, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 652)
!1143 = !DIGlobalVariableExpression(var: !1144)
!1144 = distinct !DIGlobalVariable(name: "cwd_some_quoted", scope: !2, file: !3, line: 331, type: !89, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146)
!1146 = distinct !DIGlobalVariable(name: "sorted_file", scope: !2, file: !3, line: 339, type: !1147, isLocal: true, isDefinition: true)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!1148 = !DIGlobalVariableExpression(var: !1149)
!1149 = distinct !DIGlobalVariable(name: "UNKNOWN_SECURITY_CONTEXT", scope: !2, file: !3, line: 376, type: !1150, isLocal: true, isDefinition: true)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 16, elements: !1062)
!1151 = !DIGlobalVariableExpression(var: !1152)
!1152 = distinct !DIGlobalVariable(name: "any_has_acl", scope: !2, file: !3, line: 381, type: !89, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154)
!1154 = distinct !DIGlobalVariable(name: "inode_number_width", scope: !2, file: !3, line: 387, type: !93, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156)
!1156 = distinct !DIGlobalVariable(name: "block_size_width", scope: !2, file: !3, line: 388, type: !93, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158)
!1158 = distinct !DIGlobalVariable(name: "nlink_width", scope: !2, file: !3, line: 389, type: !93, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160)
!1160 = distinct !DIGlobalVariable(name: "owner_width", scope: !2, file: !3, line: 391, type: !93, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162)
!1162 = distinct !DIGlobalVariable(name: "group_width", scope: !2, file: !3, line: 392, type: !93, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164)
!1164 = distinct !DIGlobalVariable(name: "author_width", scope: !2, file: !3, line: 393, type: !93, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166)
!1166 = distinct !DIGlobalVariable(name: "scontext_width", scope: !2, file: !3, line: 390, type: !93, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168)
!1168 = distinct !DIGlobalVariable(name: "major_device_number_width", scope: !2, file: !3, line: 394, type: !93, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170)
!1170 = distinct !DIGlobalVariable(name: "minor_device_number_width", scope: !2, file: !3, line: 395, type: !93, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172)
!1172 = distinct !DIGlobalVariable(name: "file_size_width", scope: !2, file: !3, line: 396, type: !93, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174)
!1174 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1175, file: !3, line: 3023, type: !1182, isLocal: true, isDefinition: true)
!1175 = distinct !DISubprogram(name: "has_capability_cache", scope: !3, file: !3, line: 3019, type: !1176, isLocal: true, isDefinition: true, scopeLine: 3020, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1178)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!89, !628, !745}
!1178 = !{!1179, !1180, !1181}
!1179 = !DILocalVariable(name: "file", arg: 1, scope: !1175, file: !3, line: 3019, type: !628)
!1180 = !DILocalVariable(name: "f", arg: 2, scope: !1175, file: !3, line: 3019, type: !745)
!1181 = !DILocalVariable(name: "b", scope: !1175, file: !3, line: 3031, type: !89)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !684, line: 60, baseType: !682)
!1183 = !DIGlobalVariableExpression(var: !1184)
!1184 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1185, file: !3, line: 2968, type: !1182, isLocal: true, isDefinition: true)
!1185 = distinct !DISubprogram(name: "getfilecon_cache", scope: !3, file: !3, line: 2964, type: !1186, isLocal: true, isDefinition: true, scopeLine: 2965, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1188)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!93, !628, !745, !89}
!1188 = !{!1189, !1190, !1191, !1192}
!1189 = !DILocalVariable(name: "file", arg: 1, scope: !1185, file: !3, line: 2964, type: !628)
!1190 = !DILocalVariable(name: "f", arg: 2, scope: !1185, file: !3, line: 2964, type: !745)
!1191 = !DILocalVariable(name: "deref", arg: 3, scope: !1185, file: !3, line: 2964, type: !89)
!1192 = !DILocalVariable(name: "r", scope: !1185, file: !3, line: 2975, type: !93)
!1193 = !DIGlobalVariableExpression(var: !1194)
!1194 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1195, file: !3, line: 2998, type: !1182, isLocal: true, isDefinition: true)
!1195 = distinct !DISubprogram(name: "file_has_acl_cache", scope: !3, file: !3, line: 2994, type: !1196, isLocal: true, isDefinition: true, scopeLine: 2995, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1198)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!93, !628, !745}
!1198 = !{!1199, !1200, !1201}
!1199 = !DILocalVariable(name: "file", arg: 1, scope: !1195, file: !3, line: 2994, type: !628)
!1200 = !DILocalVariable(name: "f", arg: 2, scope: !1195, file: !3, line: 2994, type: !745)
!1201 = !DILocalVariable(name: "n", scope: !1195, file: !3, line: 3009, type: !93)
!1202 = !DIGlobalVariableExpression(var: !1203)
!1203 = distinct !DIGlobalVariable(name: "sorted_file_alloc", scope: !2, file: !3, line: 340, type: !631, isLocal: true, isDefinition: true)
!1204 = !DIGlobalVariableExpression(var: !1205)
!1205 = distinct !DIGlobalVariable(name: "failed_strcoll", scope: !2, file: !3, line: 3490, type: !1206, isLocal: true, isDefinition: true)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !1207, line: 48, baseType: !1208)
!1207 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 1600, elements: !1217)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !1207, line: 34, size: 1600, elements: !1210)
!1210 = !{!1211, !1215, !1216}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !1209, file: !1207, line: 40, baseType: !1212, size: 512)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !1213, line: 31, baseType: !1214)
!1213 = !DIFile(filename: "/usr/include/bits/setjmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 512, elements: !1031)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !1209, file: !1207, line: 41, baseType: !93, size: 32, offset: 512)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !1209, file: !1207, line: 42, baseType: !189, size: 1024, offset: 576)
!1217 = !{!1218}
!1218 = !DISubrange(count: 1)
!1219 = !DIGlobalVariableExpression(var: !1220)
!1220 = distinct !DIGlobalVariable(name: "sort_functions", scope: !2, file: !3, line: 3667, type: !1221, isLocal: true, isDefinition: true)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 3584, elements: !1228)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "qsortFunc", file: !3, line: 3511, baseType: !1224)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!93, !1227, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "V", file: !3, line: 3510, baseType: !677)
!1228 = !{!958, !1063, !1063, !1063}
!1229 = !DIGlobalVariableExpression(var: !1230)
!1230 = distinct !DIGlobalVariable(name: "filetype_indicator", scope: !1231, file: !3, line: 4584, type: !1247, isLocal: true, isDefinition: true)
!1231 = distinct !DISubprogram(name: "get_color_indicator", scope: !3, file: !3, line: 4556, type: !1232, isLocal: true, isDefinition: true, scopeLine: 4557, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1236)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!1234, !687, !89}
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!1236 = !{!1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245}
!1237 = !DILocalVariable(name: "f", arg: 1, scope: !1231, file: !3, line: 4556, type: !687)
