!llvm.dbg.cu = !{!2, !683, !176, !182, !190, !700, !197, !204, !706, !708, !790, !273, !798, !815, !817, !819, !823, !825, !976, !979, !981, !983, !985, !987, !282, !990, !300, !996, !998, !1000, !1002, !652, !1004, !1006}
!llvm.ident = !{!1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008, !1008}
!llvm.module.flags = !{!1009, !1010, !1011, !1012}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 55, type: !162, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !25, globals: !39)
!3 = !DIFile(filename: "src/chown.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, size: 32, elements: !7)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0)
!9 = !DIEnumerator(name: "V_changes_only", value: 1)
!10 = !DIEnumerator(name: "V_off", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!25 = !{!26, !28, !29, !32, !34, !37}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 62, baseType: !31)
!30 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!39 = !{!40, !130, !132, !0}
!40 = !DIGlobalVariableExpression(var: !41)
!41 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !42, file: !3, line: 316, type: !72, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 157, type: !43, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !47)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !45, !46}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!47 = !{!48, !49, !50, !52, !58, !61, !62, !63, !64, !65, !85, !86, !87, !91, !128}
!48 = !DILocalVariable(name: "argc", arg: 1, scope: !42, file: !3, line: 157, type: !45)
!49 = !DILocalVariable(name: "argv", arg: 2, scope: !42, file: !3, line: 157, type: !46)
!50 = !DILocalVariable(name: "preserve_root", scope: !42, file: !3, line: 159, type: !51)
!51 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!52 = !DILocalVariable(name: "uid", scope: !42, file: !3, line: 161, type: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !54, line: 80, baseType: !55)
!54 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !56, line: 134, baseType: !57)
!56 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!57 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!58 = !DILocalVariable(name: "gid", scope: !42, file: !3, line: 162, type: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !54, line: 65, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !56, line: 135, baseType: !57)
!61 = !DILocalVariable(name: "required_uid", scope: !42, file: !3, line: 166, type: !53)
!62 = !DILocalVariable(name: "required_gid", scope: !42, file: !3, line: 167, type: !59)
!63 = !DILocalVariable(name: "bit_flags", scope: !42, file: !3, line: 170, type: !45)
!64 = !DILocalVariable(name: "dereference", scope: !42, file: !3, line: 174, type: !45)
!65 = !DILocalVariable(name: "chopt", scope: !42, file: !3, line: 176, type: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !67)
!67 = !{!68, !69, !70, !81, !82, !83, !84}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !66, file: !6, line: 46, baseType: !5, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !66, file: !6, line: 49, baseType: !51, size: 8, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !66, file: !6, line: 53, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !73, line: 7, size: 128, elements: !74)
!73 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !{!75, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !72, file: !73, line: 9, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !54, line: 48, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !56, line: 136, baseType: !31)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !72, file: !73, line: 10, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !54, line: 60, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !56, line: 133, baseType: !31)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !66, file: !6, line: 56, baseType: !51, size: 8, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !66, file: !6, line: 59, baseType: !51, size: 8, offset: 136)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !66, file: !6, line: 62, baseType: !26, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !66, file: !6, line: 65, baseType: !26, size: 64, offset: 256)
!85 = !DILocalVariable(name: "ok", scope: !42, file: !3, line: 177, type: !51)
!86 = !DILocalVariable(name: "optc", scope: !42, file: !3, line: 178, type: !45)
!87 = !DILocalVariable(name: "e", scope: !88, file: !3, line: 230, type: !37)
!88 = distinct !DILexicalBlock(scope: !89, file: !3, line: 229, column: 11)
!89 = distinct !DILexicalBlock(scope: !90, file: !3, line: 194, column: 9)
!90 = distinct !DILexicalBlock(scope: !42, file: !3, line: 192, column: 5)
!91 = !DILocalVariable(name: "ref_stats", scope: !92, file: !3, line: 288, type: !94)
!92 = distinct !DILexicalBlock(scope: !93, file: !3, line: 287, column: 5)
!93 = distinct !DILexicalBlock(scope: !42, file: !3, line: 286, column: 7)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !95, line: 46, size: 1152, elements: !96)
!95 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!96 = !{!97, !98, !99, !101, !103, !104, !105, !106, !107, !110, !112, !114, !122, !123, !124}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !94, file: !95, line: 48, baseType: !80, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !94, file: !95, line: 53, baseType: !77, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !94, file: !95, line: 61, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !56, line: 139, baseType: !31)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !94, file: !95, line: 62, baseType: !102, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !56, line: 138, baseType: !57)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !94, file: !95, line: 64, baseType: !55, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !94, file: !95, line: 65, baseType: !60, size: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !94, file: !95, line: 67, baseType: !45, size: 32, offset: 288)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !94, file: !95, line: 69, baseType: !80, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !94, file: !95, line: 74, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 140, baseType: !109)
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !94, file: !95, line: 78, baseType: !111, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !56, line: 162, baseType: !109)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !94, file: !95, line: 80, baseType: !113, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !56, line: 167, baseType: !109)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !94, file: !95, line: 91, baseType: !115, size: 128, offset: 576)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !116, line: 8, size: 128, elements: !117)
!116 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !{!118, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !115, file: !116, line: 10, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !56, line: 148, baseType: !109)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !115, file: !116, line: 11, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !56, line: 184, baseType: !109)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !94, file: !95, line: 92, baseType: !115, size: 128, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !94, file: !95, line: 93, baseType: !115, size: 128, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !94, file: !95, line: 106, baseType: !125, size: 192, offset: 960)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 3)
!128 = !DILocalVariable(name: "e", scope: !129, file: !3, line: 300, type: !37)
!129 = distinct !DILexicalBlock(scope: !93, file: !3, line: 299, column: 5)
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 42, type: !26, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "infomap", scope: !134, file: !135, line: 632, type: !159, isLocal: true, isDefinition: true)
!134 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !135, file: !135, line: 630, type: !136, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !138)
!135 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !DISubroutineType(types: !137)
!137 = !{null, !37}
!138 = !{!139, !140, !141, !148, !150, !151, !152, !155, !156, !158}
!139 = !DILocalVariable(name: "program", arg: 1, scope: !134, file: !135, line: 630, type: !37)
!140 = !DILocalVariable(name: "node", scope: !134, file: !135, line: 642, type: !37)
!141 = !DILocalVariable(name: "map_prog", scope: !134, file: !135, line: 643, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !134, file: !135, line: 632, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !144, file: !135, line: 632, baseType: !37, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !144, file: !135, line: 632, baseType: !37, size: 64, offset: 64)
!148 = !DILocalVariable(name: "__s1_len", scope: !149, file: !135, line: 645, type: !29)
!149 = distinct !DILexicalBlock(scope: !134, file: !135, line: 645, column: 33)
!150 = !DILocalVariable(name: "__s2_len", scope: !149, file: !135, line: 645, type: !29)
!151 = !DILocalVariable(name: "lc_messages", scope: !134, file: !135, line: 655, type: !37)
!152 = !DILocalVariable(name: "__s1_len", scope: !153, file: !135, line: 656, type: !29)
!153 = distinct !DILexicalBlock(scope: !154, file: !135, line: 656, column: 22)
!154 = distinct !DILexicalBlock(scope: !134, file: !135, line: 656, column: 7)
!155 = !DILocalVariable(name: "__s2_len", scope: !153, file: !135, line: 656, type: !29)
!156 = !DILocalVariable(name: "__s2", scope: !157, file: !135, line: 656, type: !34)
!157 = distinct !DILexicalBlock(scope: !153, file: !135, line: 656, column: 22)
!158 = !DILocalVariable(name: "__result", scope: !157, file: !135, line: 656, type: !45)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 896, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 7)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 3584, elements: !172)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !165, line: 104, size: 256, elements: !166)
!165 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!166 = !{!167, !168, !169, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 106, baseType: !37, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !164, file: !165, line: 109, baseType: !45, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 110, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !164, file: !165, line: 111, baseType: !45, size: 32, offset: 192)
!172 = !{!173}
!173 = !DISubrange(count: 14)
!174 = !DIGlobalVariableExpression(var: !175)
!175 = distinct !DIGlobalVariable(name: "Version", scope: !176, file: !177, line: 2, type: !37, isDefinition: true)
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !179)
!177 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!178 = !{}
!179 = !{!174}
!180 = !DIGlobalVariableExpression(var: !181)
!181 = distinct !DIGlobalVariable(name: "file_name", scope: !182, file: !187, line: 36, type: !37, isLocal: true, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !184)
!183 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!184 = !{!180, !185}
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !182, file: !187, line: 46, type: !51, isLocal: true, isDefinition: true)
!187 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "exit_failure", scope: !190, file: !193, line: 24, type: !194, isDefinition: true)
!190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !191, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !192)
!191 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!192 = !{!188}
!193 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!194 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "program_name", scope: !197, file: !201, line: 33, type: !37, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !199, globals: !200)
!198 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!199 = !{!28, !26}
!200 = !{!195}
!201 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !204, file: !232, line: 77, type: !267, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !206, retainedTypes: !227, globals: !229)
!205 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = !{!11, !207, !212}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, size: 32, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!210 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!211 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !213, line: 46, size: 32, elements: !214)
!213 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!215 = !DIEnumerator(name: "_ISupper", value: 256)
!216 = !DIEnumerator(name: "_ISlower", value: 512)
!217 = !DIEnumerator(name: "_ISalpha", value: 1024)
!218 = !DIEnumerator(name: "_ISdigit", value: 2048)
!219 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!220 = !DIEnumerator(name: "_ISspace", value: 8192)
!221 = !DIEnumerator(name: "_ISprint", value: 16384)
!222 = !DIEnumerator(name: "_ISgraph", value: 32768)
!223 = !DIEnumerator(name: "_ISblank", value: 1)
!224 = !DIEnumerator(name: "_IScntrl", value: 2)
!225 = !DIEnumerator(name: "_ISpunct", value: 4)
!226 = !DIEnumerator(name: "_ISalnum", value: 8)
!227 = !{!45, !228, !29, !26}
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !{!202, !230, !237, !249, !251, !256, !263, !265}
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !204, file: !232, line: 93, type: !233, isDefinition: true)
!232 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!235 = !{!236}
!236 = !DISubrange(count: 10)
!237 = !DIGlobalVariableExpression(var: !238)
!238 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !204, file: !232, line: 1043, type: !239, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !232, line: 57, size: 448, elements: !240)
!240 = !{!241, !242, !243, !247, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !239, file: !232, line: 60, baseType: !11, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !239, file: !232, line: 63, baseType: !45, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !239, file: !232, line: 67, baseType: !244, size: 256, offset: 64)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 256, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !239, file: !232, line: 70, baseType: !37, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !239, file: !232, line: 73, baseType: !37, size: 64, offset: 384)
!249 = !DIGlobalVariableExpression(var: !250)
!250 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !204, file: !232, line: 108, type: !239, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "slot0", scope: !204, file: !232, line: 834, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 256)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "slotvec", scope: !204, file: !232, line: 837, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !232, line: 826, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !232, line: 828, baseType: !29, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !232, line: 829, baseType: !26, size: 64, offset: 64)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "nslots", scope: !204, file: !232, line: 835, type: !45, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "slotvec0", scope: !204, file: !232, line: 836, type: !259, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 704, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!269 = !{!270}
!270 = !DISubrange(count: 11)
!271 = !DIGlobalVariableExpression(var: !272)
!272 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !273, file: !276, line: 26, type: !277, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !275)
!274 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!275 = !{!271}
!276 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 376, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 47)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "default_tuning", scope: !282, file: !286, line: 130, type: !287, isLocal: true, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !284, globals: !285)
!283 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!284 = !{!31, !28, !29}
!285 = !{!280}
!286 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !289, line: 65, baseType: !290)
!289 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !289, line: 53, size: 160, elements: !291)
!291 = !{!292, !294, !295, !296, !297}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !290, file: !289, line: 58, baseType: !293, size: 32)
!293 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !290, file: !289, line: 59, baseType: !293, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !290, file: !289, line: 60, baseType: !293, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !290, file: !289, line: 61, baseType: !293, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !290, file: !289, line: 62, baseType: !51, size: 8, offset: 128)
!298 = !DIGlobalVariableExpression(var: !299)
!299 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !300, file: !644, line: 120, type: !645, isLocal: true, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !302, retainedTypes: !641, globals: !643)
!301 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!302 = !{!303}
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 41, size: 32, elements: !305)
!304 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!306 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!307 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!308 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!309 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!310 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!311 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!312 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!313 = !DIEnumerator(name: "DAY_1", value: 131079)
!314 = !DIEnumerator(name: "DAY_2", value: 131080)
!315 = !DIEnumerator(name: "DAY_3", value: 131081)
!316 = !DIEnumerator(name: "DAY_4", value: 131082)
!317 = !DIEnumerator(name: "DAY_5", value: 131083)
!318 = !DIEnumerator(name: "DAY_6", value: 131084)
!319 = !DIEnumerator(name: "DAY_7", value: 131085)
!320 = !DIEnumerator(name: "ABMON_1", value: 131086)
!321 = !DIEnumerator(name: "ABMON_2", value: 131087)
!322 = !DIEnumerator(name: "ABMON_3", value: 131088)
!323 = !DIEnumerator(name: "ABMON_4", value: 131089)
!324 = !DIEnumerator(name: "ABMON_5", value: 131090)
!325 = !DIEnumerator(name: "ABMON_6", value: 131091)
!326 = !DIEnumerator(name: "ABMON_7", value: 131092)
!327 = !DIEnumerator(name: "ABMON_8", value: 131093)
!328 = !DIEnumerator(name: "ABMON_9", value: 131094)
!329 = !DIEnumerator(name: "ABMON_10", value: 131095)
!330 = !DIEnumerator(name: "ABMON_11", value: 131096)
!331 = !DIEnumerator(name: "ABMON_12", value: 131097)
!332 = !DIEnumerator(name: "MON_1", value: 131098)
!333 = !DIEnumerator(name: "MON_2", value: 131099)
!334 = !DIEnumerator(name: "MON_3", value: 131100)
!335 = !DIEnumerator(name: "MON_4", value: 131101)
!336 = !DIEnumerator(name: "MON_5", value: 131102)
!337 = !DIEnumerator(name: "MON_6", value: 131103)
!338 = !DIEnumerator(name: "MON_7", value: 131104)
!339 = !DIEnumerator(name: "MON_8", value: 131105)
!340 = !DIEnumerator(name: "MON_9", value: 131106)
!341 = !DIEnumerator(name: "MON_10", value: 131107)
!342 = !DIEnumerator(name: "MON_11", value: 131108)
!343 = !DIEnumerator(name: "MON_12", value: 131109)
!344 = !DIEnumerator(name: "AM_STR", value: 131110)
!345 = !DIEnumerator(name: "PM_STR", value: 131111)
!346 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!347 = !DIEnumerator(name: "D_FMT", value: 131113)
!348 = !DIEnumerator(name: "T_FMT", value: 131114)
!349 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!350 = !DIEnumerator(name: "ERA", value: 131116)
!351 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!352 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!353 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!354 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!355 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!356 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!357 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!358 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!359 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!360 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!361 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!362 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!363 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!364 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!365 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!366 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!367 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!368 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!369 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!370 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!371 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!372 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!373 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!374 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!375 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!376 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!377 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!378 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!379 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!380 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!381 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!382 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!383 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!384 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!385 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!386 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!387 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!388 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!389 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!390 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!391 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!392 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!393 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!394 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!395 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!396 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!397 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!398 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!399 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!400 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!401 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!402 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!403 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!404 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!405 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!406 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!407 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!408 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!409 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!410 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!411 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!412 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!413 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!414 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!415 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!416 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!417 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!418 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!419 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!420 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!421 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!422 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!423 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!424 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!425 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!426 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!427 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!428 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!429 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!430 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!431 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!432 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!433 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!434 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!435 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!436 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!437 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!438 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!439 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!440 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!441 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!442 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!443 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!444 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!445 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!446 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!447 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!448 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!449 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!450 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!451 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!452 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!453 = !DIEnumerator(name: "CODESET", value: 14)
!454 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!455 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!456 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!457 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!500 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!501 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!502 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!503 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!504 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!505 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!506 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!507 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!508 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!509 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!510 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!511 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!512 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!513 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!514 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!515 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!516 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!519 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!520 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!521 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!524 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!525 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!526 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!527 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!528 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!529 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!530 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!531 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!532 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!533 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!534 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!535 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!536 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!537 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!538 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!539 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!540 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!541 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!542 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!543 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!544 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!545 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!546 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!547 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!548 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!550 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!551 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!558 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!563 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!564 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!565 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!568 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!569 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!570 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!571 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!572 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!573 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!574 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!575 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!576 = !DIEnumerator(name: "THOUSEP", value: 65537)
!577 = !DIEnumerator(name: "__GROUPING", value: 65538)
!578 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!579 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!580 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!581 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!582 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!583 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!584 = !DIEnumerator(name: "__YESSTR", value: 327682)
!585 = !DIEnumerator(name: "__NOSTR", value: 327683)
!586 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!587 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!588 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!589 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!590 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!591 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!592 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!593 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!594 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!595 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!596 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!597 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!598 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!599 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!600 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!601 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!602 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!603 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!604 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!605 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!606 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!607 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!608 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!609 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!610 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!611 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!612 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!613 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!614 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!615 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!616 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!617 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!618 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!619 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!620 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!621 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!622 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!623 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!624 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!625 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!626 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!627 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!628 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!633 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!638 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!639 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!640 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!641 = !{!28, !26, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!643 = !{!298}
!644 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!645 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!646 = !DIGlobalVariableExpression(var: !647)
!647 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !648, file: !649, line: 335, type: !45, isLocal: true, isDefinition: true)
!648 = distinct !DISubprogram(name: "rpl_fcntl", scope: !649, file: !649, line: 272, type: !650, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !652, variables: !655)
!649 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!650 = !DISubroutineType(types: !651)
!651 = !{!45, !45, !45, null}
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !654)
!653 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = !{!646}
!655 = !{!656, !657, !658, !671, !672, !675, !678, !681}
!656 = !DILocalVariable(name: "fd", arg: 1, scope: !648, file: !649, line: 272, type: !45)
!657 = !DILocalVariable(name: "action", arg: 2, scope: !648, file: !649, line: 272, type: !45)
!658 = !DILocalVariable(name: "arg", scope: !648, file: !649, line: 274, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !660, line: 30, baseType: !661)
!660 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !653, line: 274, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 192, elements: !669)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !653, line: 274, size: 192, elements: !664)
!664 = !{!665, !666, !667, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !663, file: !653, line: 274, baseType: !57, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !663, file: !653, line: 274, baseType: !57, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !663, file: !653, line: 274, baseType: !28, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !663, file: !653, line: 274, baseType: !28, size: 64, offset: 128)
!669 = !{!670}
!670 = !DISubrange(count: 1)
!671 = !DILocalVariable(name: "result", scope: !648, file: !649, line: 275, type: !45)
!672 = !DILocalVariable(name: "target", scope: !673, file: !649, line: 322, type: !45)
!673 = distinct !DILexicalBlock(scope: !674, file: !649, line: 321, column: 7)
!674 = distinct !DILexicalBlock(scope: !648, file: !649, line: 278, column: 5)
!675 = !DILocalVariable(name: "flags", scope: !676, file: !649, line: 359, type: !45)
!676 = distinct !DILexicalBlock(scope: !677, file: !649, line: 358, column: 11)
!677 = distinct !DILexicalBlock(scope: !673, file: !649, line: 357, column: 13)
!678 = !DILocalVariable(name: "saved_errno", scope: !679, file: !649, line: 362, type: !45)
!679 = distinct !DILexicalBlock(scope: !680, file: !649, line: 361, column: 15)
!680 = distinct !DILexicalBlock(scope: !676, file: !649, line: 360, column: 17)
!681 = !DILocalVariable(name: "p", scope: !682, file: !649, line: 404, type: !28)
!682 = distinct !DILexicalBlock(scope: !674, file: !649, line: 402, column: 7)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !685, retainedTypes: !699)
!684 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!685 = !{!5, !11, !686, !693}
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !684, line: 38, size: 32, elements: !687)
!687 = !{!688, !689, !690, !691, !692}
!688 = !DIEnumerator(name: "RC_ok", value: 2)
!689 = !DIEnumerator(name: "RC_excluded", value: 3)
!690 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!691 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!692 = !DIEnumerator(name: "RC_error", value: 6)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, size: 32, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!696 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!697 = !DIEnumerator(name: "CH_FAILED", value: 3)
!698 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!699 = !{!53, !59, !28, !29, !32, !34, !37}
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !702)
!701 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !704, line: 136, baseType: !705)
!704 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !56, line: 62, baseType: !31)
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!707 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !710, retainedTypes: !719, globals: !720)
!709 = !DIFile(filename: "./lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!710 = !{!711}
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !712, line: 26, size: 32, elements: !713)
!712 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!713 = !{!714, !715, !716, !717, !718}
!714 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!715 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!716 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!717 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!718 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!719 = !{!28, !53, !59}
!720 = !{!721, !786, !788}
!721 = !DIGlobalVariableExpression(var: !722)
!722 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !723, file: !724, line: 106, type: !37, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "parse_with_separator", scope: !724, file: !724, line: 102, type: !725, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !708, variables: !729)
!724 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!725 = !DISubroutineType(types: !726)
!726 = !{!37, !37, !37, !727, !728, !46, !46}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !749, !758, !759, !760, !761, !762, !763, !766, !771, !774, !781}
!730 = !DILocalVariable(name: "spec", arg: 1, scope: !723, file: !724, line: 102, type: !37)
!731 = !DILocalVariable(name: "separator", arg: 2, scope: !723, file: !724, line: 102, type: !37)
!732 = !DILocalVariable(name: "uid", arg: 3, scope: !723, file: !724, line: 103, type: !727)
!733 = !DILocalVariable(name: "gid", arg: 4, scope: !723, file: !724, line: 103, type: !728)
!734 = !DILocalVariable(name: "username", arg: 5, scope: !723, file: !724, line: 104, type: !46)
!735 = !DILocalVariable(name: "groupname", arg: 6, scope: !723, file: !724, line: 104, type: !46)
!736 = !DILocalVariable(name: "error_msg", scope: !723, file: !724, line: 110, type: !37)
!737 = !DILocalVariable(name: "pwd", scope: !723, file: !724, line: 111, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !740, line: 49, size: 384, elements: !741)
!740 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!741 = !{!742, !743, !744, !745, !746, !747, !748}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !739, file: !740, line: 51, baseType: !26, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !739, file: !740, line: 52, baseType: !26, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !739, file: !740, line: 53, baseType: !55, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !739, file: !740, line: 54, baseType: !60, size: 32, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !739, file: !740, line: 55, baseType: !26, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !739, file: !740, line: 56, baseType: !26, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !739, file: !740, line: 57, baseType: !26, size: 64, offset: 320)
!749 = !DILocalVariable(name: "grp", scope: !723, file: !724, line: 112, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !752, line: 42, size: 256, elements: !753)
!752 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!753 = !{!754, !755, !756, !757}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !751, file: !752, line: 44, baseType: !26, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !751, file: !752, line: 45, baseType: !26, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !751, file: !752, line: 46, baseType: !60, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !751, file: !752, line: 47, baseType: !46, size: 64, offset: 192)
!758 = !DILocalVariable(name: "u", scope: !723, file: !724, line: 113, type: !26)
!759 = !DILocalVariable(name: "g", scope: !723, file: !724, line: 114, type: !37)
!760 = !DILocalVariable(name: "gname", scope: !723, file: !724, line: 115, type: !26)
!761 = !DILocalVariable(name: "unum", scope: !723, file: !724, line: 116, type: !53)
!762 = !DILocalVariable(name: "gnum", scope: !723, file: !724, line: 117, type: !59)
!763 = !DILocalVariable(name: "ulen", scope: !764, file: !724, line: 137, type: !29)
!764 = distinct !DILexicalBlock(scope: !765, file: !724, line: 136, column: 5)
!765 = distinct !DILexicalBlock(scope: !723, file: !724, line: 130, column: 7)
!766 = !DILocalVariable(name: "use_login_group", scope: !767, file: !724, line: 164, type: !51)
!767 = distinct !DILexicalBlock(scope: !768, file: !724, line: 163, column: 9)
!768 = distinct !DILexicalBlock(scope: !769, file: !724, line: 162, column: 11)
!769 = distinct !DILexicalBlock(scope: !770, file: !724, line: 159, column: 5)
!770 = distinct !DILexicalBlock(scope: !723, file: !724, line: 158, column: 7)
!771 = !DILocalVariable(name: "tmp", scope: !772, file: !724, line: 173, type: !31)
!772 = distinct !DILexicalBlock(scope: !773, file: !724, line: 172, column: 13)
!773 = distinct !DILexicalBlock(scope: !767, file: !724, line: 165, column: 15)
!774 = !DILocalVariable(name: "buf", scope: !775, file: !724, line: 188, type: !778)
!775 = distinct !DILexicalBlock(scope: !776, file: !724, line: 185, column: 13)
!776 = distinct !DILexicalBlock(scope: !777, file: !724, line: 184, column: 15)
!777 = distinct !DILexicalBlock(scope: !768, file: !724, line: 182, column: 9)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 21)
!781 = !DILocalVariable(name: "tmp", scope: !782, file: !724, line: 205, type: !31)
!782 = distinct !DILexicalBlock(scope: !783, file: !724, line: 204, column: 9)
!783 = distinct !DILexicalBlock(scope: !784, file: !724, line: 203, column: 11)
!784 = distinct !DILexicalBlock(scope: !785, file: !724, line: 199, column: 5)
!785 = distinct !DILexicalBlock(scope: !723, file: !724, line: 198, column: 7)
!786 = !DIGlobalVariableExpression(var: !787)
!787 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !723, file: !724, line: 107, type: !37, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789)
!789 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !723, file: !724, line: 108, type: !37, isLocal: true, isDefinition: true)
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !792, retainedTypes: !797)
!791 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!792 = !{!793}
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !794, line: 41, size: 32, elements: !795)
!794 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!795 = !{!796}
!796 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!797 = !{!28}
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !800, retainedTypes: !814)
!799 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!800 = !{!801}
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !803, file: !802, line: 192, size: 32, elements: !812)
!802 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!803 = distinct !DISubprogram(name: "x2nrealloc", scope: !802, file: !802, line: 180, type: !804, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !798, variables: !807)
!804 = !DISubroutineType(types: !805)
!805 = !{!28, !28, !806, !29}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!807 = !{!808, !809, !810, !811}
!808 = !DILocalVariable(name: "p", arg: 1, scope: !803, file: !802, line: 180, type: !28)
!809 = !DILocalVariable(name: "pn", arg: 2, scope: !803, file: !802, line: 180, type: !806)
!810 = !DILocalVariable(name: "s", arg: 3, scope: !803, file: !802, line: 180, type: !29)
!811 = !DILocalVariable(name: "n", scope: !803, file: !802, line: 182, type: !29)
!812 = !{!813}
!813 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!814 = !{!29, !26, !28}
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!816 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !797)
!818 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !821, retainedTypes: !822)
!820 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = !{!711, !212}
!822 = !{!45, !228, !26}
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !797)
!824 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !827, retainedTypes: !968)
!826 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = !{!828, !833, !951, !954, !965}
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !829, line: 160, size: 32, elements: !830)
!829 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!830 = !{!831, !832}
!831 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!832 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !835, file: !834, line: 54, size: 32, elements: !949)
!834 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!835 = distinct !DISubprogram(name: "setup_dir", scope: !834, file: !834, line: 50, type: !836, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !825, variables: !947)
!836 = !DISubroutineType(types: !837)
!837 = !{!51, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !840, line: 199, baseType: !841)
!840 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !840, line: 80, size: 1024, elements: !842)
!842 = !{!843, !898, !899, !901, !902, !903, !904, !905, !906, !907, !914, !915, !918, !934}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !841, file: !840, line: 81, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !840, line: 201, size: 2112, elements: !846)
!846 = !{!847, !848, !849, !850, !855, !856, !857, !858, !859, !860, !861, !862, !863, !865, !866, !868, !869, !870, !871, !894}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !845, file: !840, line: 202, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !845, file: !840, line: 203, baseType: !844, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !845, file: !840, line: 204, baseType: !844, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !845, file: !840, line: 205, baseType: !851, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !853, line: 127, baseType: !854)
!853 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !853, line: 127, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !845, file: !840, line: 208, baseType: !109, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !845, file: !840, line: 209, baseType: !28, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !845, file: !840, line: 210, baseType: !26, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !845, file: !840, line: 211, baseType: !26, size: 64, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !845, file: !840, line: 212, baseType: !45, size: 32, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !845, file: !840, line: 213, baseType: !45, size: 32, offset: 544)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !845, file: !840, line: 214, baseType: !29, size: 64, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !845, file: !840, line: 216, baseType: !838, size: 64, offset: 640)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !845, file: !840, line: 220, baseType: !864, size: 64, offset: 704)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !30, line: 51, baseType: !109)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !845, file: !840, line: 222, baseType: !29, size: 64, offset: 768)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !845, file: !840, line: 223, baseType: !867, size: 64, offset: 832)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !54, line: 75, baseType: !100)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !845, file: !840, line: 239, baseType: !228, size: 16, offset: 896)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !845, file: !840, line: 243, baseType: !228, size: 16, offset: 912)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !845, file: !840, line: 249, baseType: !228, size: 16, offset: 928)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !845, file: !840, line: 251, baseType: !872, size: 1152, offset: 960)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 1152, elements: !669)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !95, line: 46, size: 1152, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !891, !892, !893}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !873, file: !95, line: 48, baseType: !80, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !873, file: !95, line: 53, baseType: !77, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !873, file: !95, line: 61, baseType: !100, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !873, file: !95, line: 62, baseType: !102, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !873, file: !95, line: 64, baseType: !55, size: 32, offset: 224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !873, file: !95, line: 65, baseType: !60, size: 32, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !873, file: !95, line: 67, baseType: !45, size: 32, offset: 288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !873, file: !95, line: 69, baseType: !80, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !873, file: !95, line: 74, baseType: !108, size: 64, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !873, file: !95, line: 78, baseType: !111, size: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !873, file: !95, line: 80, baseType: !113, size: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !873, file: !95, line: 91, baseType: !887, size: 128, offset: 576)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !116, line: 8, size: 128, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !887, file: !116, line: 10, baseType: !119, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !887, file: !116, line: 11, baseType: !121, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !873, file: !95, line: 92, baseType: !887, size: 128, offset: 704)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !873, file: !95, line: 93, baseType: !887, size: 128, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !873, file: !95, line: 106, baseType: !125, size: 192, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !845, file: !840, line: 252, baseType: !895, offset: 2112)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: -1)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !841, file: !840, line: 82, baseType: !844, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !841, file: !840, line: 83, baseType: !900, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !841, file: !840, line: 84, baseType: !79, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !841, file: !840, line: 85, baseType: !26, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !841, file: !840, line: 86, baseType: !45, size: 32, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !841, file: !840, line: 87, baseType: !45, size: 32, offset: 352)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !841, file: !840, line: 89, baseType: !29, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !841, file: !840, line: 90, baseType: !29, size: 64, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !841, file: !840, line: 91, baseType: !908, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!45, !911, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !841, file: !840, line: 162, baseType: !45, size: 32, offset: 576)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !841, file: !840, line: 171, baseType: !916, size: 64, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !840, line: 171, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !841, file: !840, line: 193, baseType: !919, size: 64, offset: 704)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !840, line: 173, size: 64, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !919, file: !840, line: 186, baseType: !916, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !919, file: !840, line: 192, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !925, line: 28, size: 256, elements: !926)
!925 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!926 = !{!927, !932, !933}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !924, file: !925, line: 30, baseType: !928, size: 128)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !73, line: 7, size: 128, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !928, file: !73, line: 9, baseType: !76, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !928, file: !73, line: 10, baseType: !79, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !924, file: !925, line: 31, baseType: !703, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !924, file: !925, line: 32, baseType: !45, size: 32, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !841, file: !840, line: 198, baseType: !935, size: 256, offset: 768)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !936, line: 39, baseType: !937)
!936 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !936, line: 31, size: 256, elements: !938)
!938 = !{!939, !943, !944, !945, !946}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !937, file: !936, line: 33, baseType: !940, size: 128)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 4)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !937, file: !936, line: 34, baseType: !45, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !937, file: !936, line: 35, baseType: !57, size: 32, offset: 160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !937, file: !936, line: 36, baseType: !57, size: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !937, file: !936, line: 37, baseType: !51, size: 8, offset: 224)
!947 = !{!948}
!948 = !DILocalVariable(name: "fts", arg: 1, scope: !835, file: !834, line: 50, type: !838)
!949 = !{!950}
!950 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !829, line: 763, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !853, line: 97, size: 32, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961, !962, !963, !964}
!956 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!957 = !DIEnumerator(name: "DT_FIFO", value: 1)
!958 = !DIEnumerator(name: "DT_CHR", value: 2)
!959 = !DIEnumerator(name: "DT_DIR", value: 4)
!960 = !DIEnumerator(name: "DT_BLK", value: 6)
!961 = !DIEnumerator(name: "DT_REG", value: 8)
!962 = !DIEnumerator(name: "DT_LNK", value: 10)
!963 = !DIEnumerator(name: "DT_SOCK", value: 12)
!964 = !DIEnumerator(name: "DT_WHT", value: 14)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !829, line: 155, size: 32, elements: !966)
!966 = !{!967}
!967 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!968 = !{!28, !703, !26, !109, !969, !972, !29, !32, !34, !37}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!45, !32, !32}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !840, line: 253, baseType: !845)
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !978)
!977 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!978 = !{!29}
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!980 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!982 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!984 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !986, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!986 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!987 = distinct !DICompileUnit(language: DW_LANG_C99, file: !988, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !989)
!988 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!989 = !{!29, !32, !34, !37}
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !992)
!991 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!992 = !{!993}
!993 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 20, size: 32, elements: !994)
!994 = !{!995}
!995 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!997 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!999 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1000 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1001, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!1001 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!1003 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1005, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !797)
!1005 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !797)
!1007 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1008 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!1009 = !{i32 2, !"Dwarf Version", i32 4}
!1010 = !{i32 2, !"Debug Info Version", i32 3}
!1011 = !{i32 1, !"PIC Level", i32 2}
!1012 = !{i32 1, !"PIE Level", i32 2}
!1013 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 74, type: !1014, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !1016)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !45}
!1016 = !{!1017}
!1017 = !DILocalVariable(name: "status", arg: 1, scope: !1013, file: !3, line: 74, type: !45)
!1018 = !DIExpression()
!1019 = !DILocation(line: 74, column: 12, scope: !1013)
!1020 = !DILocation(line: 76, column: 14, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 76, column: 7)
!1022 = !DILocation(line: 76, column: 7, scope: !1013)
!1023 = !DILocation(line: 77, column: 5, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1025, file: !3, discriminator: 1)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 77, column: 5)
!1026 = !{!1027, !1027, i64 0}
!1027 = !{!"any pointer", !1028, i64 0}
!1028 = !{!"omnipotent char", !1029, i64 0}
!1029 = !{!"Simple C/C++ TBAA"}
!1030 = !DILocation(line: 77, column: 5, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1025, file: !3, discriminator: 3)
!1032 = !DILocation(line: 77, column: 5, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1025, file: !3, discriminator: 2)
!1034 = !DILocation(line: 80, column: 7, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 79, column: 5)
!1036 = !DILocation(line: 80, column: 7, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1035, file: !3, discriminator: 1)
!1038 = !DILocation(line: 85, column: 7, scope: !1035)
!1039 = !DILocation(line: 85, column: 7, scope: !1037)
!1040 = !DILocation(line: 90, column: 7, scope: !1035)
!1041 = !DILocation(line: 90, column: 7, scope: !1037)
!1042 = !DILocation(line: 95, column: 7, scope: !1035)
!1043 = !DILocation(line: 95, column: 7, scope: !1037)
!1044 = !DILocation(line: 100, column: 7, scope: !1035)
!1045 = !DILocation(line: 100, column: 7, scope: !1037)
!1046 = !DILocation(line: 104, column: 7, scope: !1035)
!1047 = !DILocation(line: 104, column: 7, scope: !1037)
!1048 = !DILocation(line: 111, column: 7, scope: !1035)
!1049 = !DILocation(line: 111, column: 7, scope: !1037)
!1050 = !DILocation(line: 115, column: 7, scope: !1035)
!1051 = !DILocation(line: 115, column: 7, scope: !1037)
!1052 = !DILocation(line: 119, column: 7, scope: !1035)
!1053 = !DILocation(line: 119, column: 7, scope: !1037)
!1054 = !DILocation(line: 122, column: 7, scope: !1035)
!1055 = !DILocation(line: 122, column: 7, scope: !1037)
!1056 = !DILocation(line: 135, column: 7, scope: !1035)
!1057 = !DILocation(line: 135, column: 7, scope: !1037)
!1058 = !DILocation(line: 136, column: 7, scope: !1035)
!1059 = !DILocation(line: 136, column: 7, scope: !1037)
!1060 = !DILocation(line: 137, column: 7, scope: !1035)
!1061 = !DILocation(line: 137, column: 7, scope: !1037)
!1062 = !DILocation(line: 143, column: 7, scope: !1035)
!1063 = !DILocation(line: 143, column: 7, scope: !1037)
!1064 = !DILocation(line: 642, column: 15, scope: !134, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 151, column: 7, scope: !1035)
!1066 = !DILocation(line: 651, column: 3, scope: !134, inlinedAt: !1065)
!1067 = !DILocation(line: 651, column: 3, scope: !1068, inlinedAt: !1065)
!1068 = !DILexicalBlockFile(scope: !134, file: !135, discriminator: 1)
!1069 = !DILocation(line: 655, column: 29, scope: !134, inlinedAt: !1065)
!1070 = !DILocation(line: 655, column: 15, scope: !134, inlinedAt: !1065)
!1071 = !DILocation(line: 656, column: 7, scope: !154, inlinedAt: !1065)
!1072 = !DILocation(line: 656, column: 19, scope: !154, inlinedAt: !1065)
!1073 = !DILocation(line: 656, column: 22, scope: !1074, inlinedAt: !1065)
!1074 = !DILexicalBlockFile(scope: !154, file: !135, discriminator: 16)
!1075 = !DILocation(line: 656, column: 7, scope: !1076, inlinedAt: !1065)
!1076 = !DILexicalBlockFile(scope: !134, file: !135, discriminator: 16)
!1077 = !DILocation(line: 662, column: 7, scope: !1078, inlinedAt: !1065)
!1078 = distinct !DILexicalBlock(scope: !154, file: !135, line: 657, column: 5)
!1079 = !DILocation(line: 662, column: 7, scope: !1080, inlinedAt: !1065)
!1080 = !DILexicalBlockFile(scope: !1078, file: !135, discriminator: 1)
!1081 = !DILocation(line: 664, column: 5, scope: !1078, inlinedAt: !1065)
!1082 = !DILocation(line: 665, column: 3, scope: !134, inlinedAt: !1065)
!1083 = !DILocation(line: 665, column: 3, scope: !1068, inlinedAt: !1065)
!1084 = !DILocation(line: 667, column: 3, scope: !134, inlinedAt: !1065)
!1085 = !DILocation(line: 667, column: 3, scope: !1068, inlinedAt: !1065)
!1086 = !DILocation(line: 153, column: 3, scope: !1013)
!1087 = !DILocation(line: 157, column: 11, scope: !42)
!1088 = !DILocation(line: 157, column: 24, scope: !42)
!1089 = !DILocation(line: 159, column: 8, scope: !42)
!1090 = !DILocation(line: 161, column: 3, scope: !42)
!1091 = !DILocation(line: 161, column: 9, scope: !42)
!1092 = !{!1093, !1093, i64 0}
!1093 = !{!"int", !1028, i64 0}
!1094 = !DILocation(line: 162, column: 3, scope: !42)
!1095 = !DILocation(line: 162, column: 9, scope: !42)
!1096 = !DILocation(line: 166, column: 3, scope: !42)
!1097 = !DILocation(line: 166, column: 9, scope: !42)
!1098 = !DILocation(line: 167, column: 3, scope: !42)
!1099 = !DILocation(line: 167, column: 9, scope: !42)
!1100 = !DILocation(line: 170, column: 7, scope: !42)
!1101 = !DILocation(line: 174, column: 7, scope: !42)
!1102 = !DILocation(line: 176, column: 3, scope: !42)
!1103 = !DILocation(line: 181, column: 21, scope: !42)
!1104 = !DILocation(line: 181, column: 3, scope: !42)
!1105 = !DILocation(line: 182, column: 3, scope: !42)
!1106 = !DILocation(line: 183, column: 3, scope: !42)
!1107 = !DILocation(line: 184, column: 3, scope: !42)
!1108 = !DILocation(line: 186, column: 3, scope: !42)
!1109 = !DIExpression(DW_OP_deref)
!1110 = !DILocation(line: 176, column: 23, scope: !42)
!1111 = !DILocation(line: 188, column: 3, scope: !42)
!1112 = !DILocation(line: 190, column: 3, scope: !42)
!1113 = !DILocation(line: 190, column: 18, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !42, file: !3, discriminator: 1)
!1115 = !DILocation(line: 178, column: 7, scope: !42)
!1116 = !DILocation(line: 190, column: 3, scope: !1114)
!1117 = !DILocation(line: 201, column: 11, scope: !89)
!1118 = !DILocation(line: 205, column: 11, scope: !89)
!1119 = !DILocation(line: 209, column: 11, scope: !89)
!1120 = !DILocation(line: 214, column: 11, scope: !89)
!1121 = !DILocation(line: 218, column: 11, scope: !89)
!1122 = !DILocation(line: 222, column: 11, scope: !89)
!1123 = !DILocation(line: 225, column: 28, scope: !89)
!1124 = !DILocation(line: 225, column: 26, scope: !89)
!1125 = !DILocation(line: 226, column: 11, scope: !89)
!1126 = !DILocation(line: 230, column: 46, scope: !88)
!1127 = !DILocation(line: 230, column: 29, scope: !88)
!1128 = !DILocation(line: 230, column: 25, scope: !88)
!1129 = !DILocation(line: 233, column: 17, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !88, file: !3, line: 233, column: 17)
!1131 = !DILocation(line: 233, column: 17, scope: !88)
!1132 = !DILocation(line: 234, column: 15, scope: !1130)
!1133 = !DILocation(line: 234, column: 15, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1130, file: !3, discriminator: 1)
!1135 = !DILocation(line: 239, column: 25, scope: !89)
!1136 = !{!1137, !1138, i64 4}
!1137 = !{!"Chown_option", !1028, i64 0, !1138, i64 4, !1027, i64 8, !1138, i64 16, !1138, i64 17, !1027, i64 24, !1027, i64 32}
!1138 = !{!"_Bool", !1028, i64 0}
!1139 = !DILocation(line: 240, column: 11, scope: !89)
!1140 = !DILocation(line: 243, column: 27, scope: !89)
!1141 = !{!1137, !1028, i64 0}
!1142 = !DILocation(line: 244, column: 11, scope: !89)
!1143 = !DILocation(line: 247, column: 30, scope: !89)
!1144 = !{!1137, !1138, i64 17}
!1145 = !DILocation(line: 248, column: 11, scope: !89)
!1146 = !DILocation(line: 251, column: 27, scope: !89)
!1147 = !DILocation(line: 252, column: 11, scope: !89)
!1148 = distinct !{!1148, !1112, !1149}
!1149 = !DILocation(line: 259, column: 5, scope: !42)
!1150 = !DILocation(line: 254, column: 9, scope: !89)
!1151 = !DILocation(line: 255, column: 9, scope: !89)
!1152 = !DILocation(line: 255, column: 9, scope: !1153)
!1153 = !DILexicalBlockFile(scope: !89, file: !3, discriminator: 1)
!1154 = !DILocation(line: 257, column: 11, scope: !89)
!1155 = !DILocation(line: 261, column: 13, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !42, file: !3, line: 261, column: 7)
!1157 = !{i8 0, i8 2}
!1158 = !DILocation(line: 261, column: 7, scope: !42)
!1159 = !DILocation(line: 263, column: 21, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 263, column: 11)
!1161 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 262, column: 5)
!1162 = !DILocation(line: 263, column: 11, scope: !1161)
!1163 = !DILocation(line: 265, column: 27, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 265, column: 15)
!1165 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 264, column: 9)
!1166 = !DILocation(line: 265, column: 15, scope: !1165)
!1167 = !DILocation(line: 266, column: 13, scope: !1164)
!1168 = !DILocation(line: 266, column: 13, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1164, file: !3, discriminator: 1)
!1170 = !DILocation(line: 275, column: 48, scope: !42)
!1171 = !DILocation(line: 275, column: 9, scope: !42)
!1172 = !DILocation(line: 275, column: 33, scope: !42)
!1173 = !{!1137, !1138, i64 16}
!1174 = !DILocation(line: 277, column: 14, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !42, file: !3, line: 277, column: 7)
!1176 = !DILocation(line: 277, column: 12, scope: !1175)
!1177 = !DILocation(line: 277, column: 24, scope: !1175)
!1178 = !DILocation(line: 277, column: 21, scope: !1175)
!1179 = !DILocation(line: 277, column: 7, scope: !42)
!1180 = !DILocation(line: 279, column: 16, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 279, column: 11)
!1182 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 278, column: 5)
!1183 = !DILocation(line: 279, column: 11, scope: !1182)
!1184 = !DILocation(line: 280, column: 22, scope: !1181)
!1185 = !DILocation(line: 280, column: 9, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1181, file: !3, discriminator: 1)
!1187 = !DILocation(line: 280, column: 9, scope: !1181)
!1188 = !DILocation(line: 282, column: 22, scope: !1181)
!1189 = !DILocation(line: 282, column: 70, scope: !1181)
!1190 = !DILocation(line: 282, column: 60, scope: !1181)
!1191 = !DILocation(line: 282, column: 53, scope: !1186)
!1192 = !DILocation(line: 282, column: 9, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !1181, file: !3, discriminator: 2)
!1194 = !DILocation(line: 283, column: 7, scope: !1182)
!1195 = !DILocation(line: 286, column: 7, scope: !42)
!1196 = !DILocation(line: 288, column: 7, scope: !92)
!1197 = !DILocation(line: 288, column: 19, scope: !92)
!1198 = !DILocalVariable(name: "__path", arg: 1, scope: !1199, file: !1200, line: 449, type: !37)
!1199 = distinct !DISubprogram(name: "stat", scope: !1200, file: !1200, line: 449, type: !1201, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1204)
!1200 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!45, !37, !1203}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!1204 = !{!1198, !1205}
!1205 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1199, file: !1200, line: 449, type: !1203)
!1206 = !DILocation(line: 449, column: 1, scope: !1199, inlinedAt: !1207)
!1207 = distinct !DILocation(line: 289, column: 11, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !92, file: !3, line: 289, column: 11)
!1209 = !DILocation(line: 451, column: 10, scope: !1199, inlinedAt: !1207)
!1210 = !DILocation(line: 289, column: 11, scope: !1208)
!1211 = !DILocation(line: 289, column: 11, scope: !92)
!1212 = !DILocation(line: 290, column: 9, scope: !1208)
!1213 = !DILocation(line: 290, column: 9, scope: !1214)
!1214 = !DILexicalBlockFile(scope: !1208, file: !3, discriminator: 1)
!1215 = !DILocation(line: 290, column: 9, scope: !1216)
