!llvm.dbg.cu = !{!2, !453, !459, !467, !919, !921, !923, !473, !480, !926, !947, !949, !531, !957, !968, !971, !974, !978, !980, !544, !982, !984, !986, !989, !991, !575}
!llvm.ident = !{!994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994, !994}
!llvm.module.flags = !{!995, !996, !997, !998}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 183, type: !449, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !186, globals: !195)
!3 = !DIFile(filename: "src/csplit.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !132, !146, !150, !165, !173}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 1448, size: 32, elements: !130)
!6 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1343, type: !7, isDefinition: true, scopeLine: 1344, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !13)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !15, !16, !17, !21, !22, !24}
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !6, file: !3, line: 1343, type: !9)
!15 = !DILocalVariable(name: "argv", arg: 2, scope: !6, file: !3, line: 1343, type: !10)
!16 = !DILocalVariable(name: "optc", scope: !6, file: !3, line: 1345, type: !9)
!17 = !DILocalVariable(name: "prefix_len", scope: !6, file: !3, line: 1413, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 62, baseType: !20)
!19 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DILocalVariable(name: "max_digit_string_len", scope: !6, file: !3, line: 1414, type: !18)
!22 = !DILocalVariable(name: "i", scope: !23, file: !3, line: 1427, type: !9)
!23 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1426, column: 3)
!24 = !DILocalVariable(name: "act", scope: !23, file: !3, line: 1450, type: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !26, line: 24, size: 1216, elements: !27)
!26 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !{!28, !116, !125, !126}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !25, file: !26, line: 35, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !26, line: 28, size: 64, elements: !30)
!30 = !{!31, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !29, file: !26, line: 31, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !33, line: 84, baseType: !34)
!33 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !9}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !29, file: !26, line: 33, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !9, !41, !76}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !43, line: 133, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 62, size: 1024, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !44, file: !43, line: 64, baseType: !9, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !44, file: !43, line: 65, baseType: !9, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !44, file: !43, line: 67, baseType: !9, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !44, file: !43, line: 132, baseType: !50, size: 896, offset: 128)
!50 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !43, line: 69, size: 896, elements: !51)
!51 = !{!52, !56, !65, !77, !83, !94, !105, !110}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !50, file: !43, line: 71, baseType: !53, size: 896)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 896, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 28)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !50, file: !43, line: 78, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 74, size: 64, elements: !58)
!58 = !{!59, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !57, file: !43, line: 76, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !61, line: 142, baseType: !9)
!61 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !57, file: !43, line: 77, baseType: !63, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !61, line: 134, baseType: !64)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !50, file: !43, line: 86, baseType: !66, size: 128)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 81, size: 128, elements: !67)
!67 = !{!68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !66, file: !43, line: 83, baseType: !9, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !66, file: !43, line: 84, baseType: !9, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !66, file: !43, line: 85, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !43, line: 36, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !43, line: 32, size: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !72, file: !43, line: 34, baseType: !9, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !72, file: !43, line: 35, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !50, file: !43, line: 94, baseType: !78, size: 128)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 89, size: 128, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !78, file: !43, line: 91, baseType: !60, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !78, file: !43, line: 92, baseType: !63, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !78, file: !43, line: 93, baseType: !71, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !50, file: !43, line: 104, baseType: !84, size: 256)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 97, size: 256, elements: !85)
!85 = !{!86, !87, !88, !89, !93}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !84, file: !43, line: 99, baseType: !60, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !84, file: !43, line: 100, baseType: !63, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !84, file: !43, line: 101, baseType: !9, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !84, file: !43, line: 102, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !43, line: 58, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !61, line: 144, baseType: !92)
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !84, file: !43, line: 103, baseType: !90, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !50, file: !43, line: 116, baseType: !95, size: 256)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 107, size: 256, elements: !96)
!96 = !{!97, !98, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !95, file: !43, line: 109, baseType: !76, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !95, file: !43, line: 110, baseType: !99, size: 16, offset: 64)
!99 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !95, file: !43, line: 115, baseType: !101, size: 128, offset: 128)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !95, file: !43, line: 111, size: 128, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !101, file: !43, line: 113, baseType: !76, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !101, file: !43, line: 114, baseType: !76, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !50, file: !43, line: 123, baseType: !106, size: 128)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 119, size: 128, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !106, file: !43, line: 121, baseType: !92, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !106, file: !43, line: 122, baseType: !9, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !50, file: !43, line: 131, baseType: !111, size: 128)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 126, size: 128, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !111, file: !43, line: 128, baseType: !76, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !111, file: !43, line: 129, baseType: !9, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !111, file: !43, line: 130, baseType: !64, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !25, file: !26, line: 43, baseType: !117, size: 1024, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !118, line: 30, baseType: !119)
!118 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 27, size: 1024, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !119, file: !118, line: 29, baseType: !122, size: 1024)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !25, file: !26, line: 46, baseType: !9, size: 32, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !25, file: !26, line: 49, baseType: !127, size: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null}
!130 = !{!131}
!131 = !DIEnumerator(name: "nsigs", value: 11)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !133, line: 32, size: 32, elements: !134)
!133 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!135 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!136 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!137 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!138 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!139 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!140 = !DIEnumerator(name: "c_quoting_style", value: 5)
!141 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!142 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!143 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!144 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!145 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1232, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1)
!149 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 46, size: 32, elements: !152)
!151 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!153 = !DIEnumerator(name: "_ISupper", value: 256)
!154 = !DIEnumerator(name: "_ISlower", value: 512)
!155 = !DIEnumerator(name: "_ISalpha", value: 1024)
!156 = !DIEnumerator(name: "_ISdigit", value: 2048)
!157 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!158 = !DIEnumerator(name: "_ISspace", value: 8192)
!159 = !DIEnumerator(name: "_ISprint", value: 16384)
!160 = !DIEnumerator(name: "_ISgraph", value: 32768)
!161 = !DIEnumerator(name: "_ISblank", value: 1)
!162 = !DIEnumerator(name: "_IScntrl", value: 2)
!163 = !DIEnumerator(name: "_ISpunct", value: 4)
!164 = !DIEnumerator(name: "_ISalnum", value: 8)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !166, line: 26, size: 32, elements: !167)
!166 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!169 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!170 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!171 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!172 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !175, file: !174, line: 192, size: 32, elements: !184)
!174 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!175 = distinct !DISubprogram(name: "x2nrealloc", scope: !174, file: !174, line: 180, type: !176, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !179)
!176 = !DISubroutineType(types: !177)
!177 = !{!76, !76, !178, !18}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!179 = !{!180, !181, !182, !183}
!180 = !DILocalVariable(name: "p", arg: 1, scope: !175, file: !174, line: 180, type: !76)
!181 = !DILocalVariable(name: "pn", arg: 2, scope: !175, file: !174, line: 180, type: !178)
!182 = !DILocalVariable(name: "s", arg: 3, scope: !175, file: !174, line: 180, type: !18)
!183 = !DILocalVariable(name: "n", scope: !175, file: !174, line: 182, type: !18)
!184 = !{!185}
!185 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!186 = !{!11, !76, !64, !32, !9, !187, !18, !188, !190, !193, !20}
!187 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!195 = !{!196, !202, !204, !207, !210, !212, !214, !254, !0, !256, !311, !313, !315, !318, !321, !333, !336, !339, !341, !364, !371, !373, !409, !411, !413, !415, !417, !419}
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "sig", scope: !6, file: !3, line: 1428, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 352, elements: !200)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!200 = !{!201}
!201 = !DISubrange(count: 11)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "global_argv", scope: !2, file: !3, line: 161, type: !10, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "suppress_count", scope: !2, file: !3, line: 164, type: !206, isLocal: true, isDefinition: true)
!206 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!207 = !DIGlobalVariableExpression(var: !208)
!208 = distinct !DIGlobalVariable(name: "remove_files", scope: !2, file: !3, line: 167, type: !209, isLocal: true, isDefinition: true)
!209 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !206)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 170, type: !206, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !2, file: !3, line: 173, type: !206, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "controls", scope: !2, file: !3, line: 177, type: !216, isLocal: true, isDefinition: true)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !3, line: 51, size: 768, elements: !218)
!218 = !{!219, !223, !226, !227, !228, !229, !230, !231}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !217, file: !3, line: 53, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !221, line: 135, baseType: !222)
!221 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !61, line: 61, baseType: !92)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !217, file: !3, line: 54, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !221, line: 136, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !61, line: 62, baseType: !20)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !217, file: !3, line: 55, baseType: !224, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !217, file: !3, line: 56, baseType: !9, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !217, file: !3, line: 57, baseType: !206, size: 8, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !217, file: !3, line: 58, baseType: !206, size: 8, offset: 232)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !217, file: !3, line: 59, baseType: !206, size: 8, offset: 240)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !217, file: !3, line: 60, baseType: !232, size: 512, offset: 256)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !233, line: 414, size: 512, elements: !234)
!233 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!234 = !{!235, !238, !240, !241, !243, !244, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !232, file: !233, line: 418, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !233, line: 418, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !232, file: !233, line: 421, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !233, line: 57, baseType: !20)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !232, file: !233, line: 424, baseType: !239, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !232, file: !233, line: 427, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !233, line: 73, baseType: !20)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !232, file: !233, line: 432, baseType: !11, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !232, file: !233, line: 438, baseType: !245, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !232, file: !233, line: 441, baseType: !18, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !232, file: !233, line: 447, baseType: !64, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !232, file: !233, line: 458, baseType: !64, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !232, file: !233, line: 462, baseType: !64, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !232, file: !233, line: 466, baseType: !64, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !232, file: !233, line: 470, baseType: !64, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !232, file: !233, line: 473, baseType: !64, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !232, file: !233, line: 476, baseType: !64, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "control_used", scope: !2, file: !3, line: 180, type: !18, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "output_stream", scope: !2, file: !3, line: 155, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !260, line: 49, baseType: !261)
!260 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !262, line: 241, size: 1728, elements: !263)
!262 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !284, !285, !286, !287, !289, !290, !292, !296, !299, !301, !302, !303, !304, !305, !306, !307}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !261, file: !262, line: 242, baseType: !9, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !261, file: !262, line: 247, baseType: !11, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !261, file: !262, line: 248, baseType: !11, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !261, file: !262, line: 249, baseType: !11, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !261, file: !262, line: 250, baseType: !11, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !261, file: !262, line: 251, baseType: !11, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !261, file: !262, line: 252, baseType: !11, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !261, file: !262, line: 253, baseType: !11, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !261, file: !262, line: 254, baseType: !11, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !261, file: !262, line: 256, baseType: !11, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !261, file: !262, line: 257, baseType: !11, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !261, file: !262, line: 258, baseType: !11, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !261, file: !262, line: 260, baseType: !277, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !262, line: 156, size: 192, elements: !279)
!279 = !{!280, !281, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !278, file: !262, line: 157, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !278, file: !262, line: 158, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !278, file: !262, line: 162, baseType: !9, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !261, file: !262, line: 262, baseType: !282, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !261, file: !262, line: 264, baseType: !9, size: 32, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !261, file: !262, line: 268, baseType: !9, size: 32, offset: 928)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !261, file: !262, line: 270, baseType: !288, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 140, baseType: !92)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !261, file: !262, line: 274, baseType: !187, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !261, file: !262, line: 275, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !261, file: !262, line: 276, baseType: !293, size: 8, offset: 1048)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 1)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !261, file: !262, line: 280, baseType: !297, size: 64, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !262, line: 150, baseType: null)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !261, file: !262, line: 289, baseType: !300, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 141, baseType: !92)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !261, file: !262, line: 297, baseType: !76, size: 64, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !261, file: !262, line: 298, baseType: !76, size: 64, offset: 1280)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !261, file: !262, line: 299, baseType: !76, size: 64, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !261, file: !262, line: 300, baseType: !76, size: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !261, file: !262, line: 302, baseType: !18, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !261, file: !262, line: 303, baseType: !9, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !261, file: !262, line: 305, baseType: !308, size: 160, offset: 1568)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 20)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "output_filename", scope: !2, file: !3, line: 158, type: !11, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314)
!314 = distinct !DIGlobalVariable(name: "bytes_written", scope: !2, file: !3, line: 152, type: !224, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "files_created", scope: !2, file: !3, line: 149, type: !317, isLocal: true, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!318 = !DIGlobalVariableExpression(var: !319)
!319 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 140, type: !320, isLocal: true, isDefinition: true)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !193)
!321 = !DIGlobalVariableExpression(var: !322)
!322 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 192, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 2816, elements: !200)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !326, line: 104, size: 256, elements: !327)
!326 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!327 = !{!328, !329, !330, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !326, line: 106, baseType: !193, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !325, file: !326, line: 109, baseType: !9, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !326, line: 110, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !325, file: !326, line: 111, baseType: !9, size: 32, offset: 192)
!333 = !DIGlobalVariableExpression(var: !334)
!334 = distinct !DIGlobalVariable(name: "suffix", scope: !2, file: !3, line: 143, type: !335, isLocal: true, isDefinition: true)
!335 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!336 = !DIGlobalVariableExpression(var: !337)
!337 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 146, type: !338, isLocal: true, isDefinition: true)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !9)
!339 = !DIGlobalVariableExpression(var: !340)
!340 = distinct !DIGlobalVariable(name: "filename_space", scope: !2, file: !3, line: 137, type: !335, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342)
!342 = distinct !DIGlobalVariable(name: "last_val", scope: !343, file: !3, line: 1184, type: !224, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "parse_patterns", scope: !3, file: !3, line: 1179, type: !344, isLocal: true, isDefinition: true, scopeLine: 1180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !9, !9, !10}
!346 = !{!347, !348, !349, !350, !351, !352, !353}
!347 = !DILocalVariable(name: "argc", arg: 1, scope: !343, file: !3, line: 1179, type: !9)
!348 = !DILocalVariable(name: "start", arg: 2, scope: !343, file: !3, line: 1179, type: !9)
!349 = !DILocalVariable(name: "argv", arg: 3, scope: !343, file: !3, line: 1179, type: !10)
!350 = !DILocalVariable(name: "i", scope: !343, file: !3, line: 1181, type: !9)
!351 = !DILocalVariable(name: "p", scope: !343, file: !3, line: 1182, type: !216)
!352 = !DILocalVariable(name: "val", scope: !343, file: !3, line: 1183, type: !224)
!353 = !DILocalVariable(name: "buf", scope: !354, file: !3, line: 1204, type: !361)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 1203, column: 13)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 1202, column: 15)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 1193, column: 9)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 1188, column: 11)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 1187, column: 5)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 1186, column: 3)
!360 = distinct !DILexicalBlock(scope: !343, file: !3, line: 1186, column: 3)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 168, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 21)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "control_allocated", scope: !366, file: !3, line: 1070, type: !18, isLocal: true, isDefinition: true)
!366 = distinct !DISubprogram(name: "new_control_record", scope: !3, file: !3, line: 1068, type: !367, isLocal: true, isDefinition: true, scopeLine: 1069, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!216}
!369 = !{!370}
!370 = !DILocalVariable(name: "p", scope: !366, file: !3, line: 1071, type: !216)
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "current_line", scope: !2, file: !3, line: 131, type: !224, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "prev_buf", scope: !375, file: !3, line: 560, type: !397, isLocal: true, isDefinition: true)
!375 = distinct !DISubprogram(name: "remove_line", scope: !3, file: !3, line: 555, type: !376, isLocal: true, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !383)
!376 = !DISubroutineType(types: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !3, line: 80, size: 128, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !379, file: !3, line: 82, baseType: !18, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !379, file: !3, line: 83, baseType: !11, size: 64, offset: 64)
!383 = !{!384, !385}
!384 = !DILocalVariable(name: "line", scope: !375, file: !3, line: 562, type: !378)
!385 = !DILocalVariable(name: "l", scope: !375, file: !3, line: 563, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 88, size: 10496, elements: !388)
!388 = !{!389, !390, !391, !392, !396}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !387, file: !3, line: 90, baseType: !18, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !387, file: !3, line: 91, baseType: !18, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !387, file: !3, line: 92, baseType: !18, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !387, file: !3, line: 93, baseType: !393, size: 10240, offset: 192)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 10240, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !3, line: 94, baseType: !386, size: 64, offset: 10432)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !3, line: 100, size: 576, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !398, file: !3, line: 102, baseType: !18, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !398, file: !3, line: 103, baseType: !18, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !398, file: !3, line: 104, baseType: !224, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !398, file: !3, line: 105, baseType: !224, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !398, file: !3, line: 106, baseType: !18, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !398, file: !3, line: 107, baseType: !11, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !398, file: !3, line: 108, baseType: !386, size: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !398, file: !3, line: 109, baseType: !386, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !3, line: 110, baseType: !397, size: 64, offset: 512)
!409 = !DIGlobalVariableExpression(var: !410)
!410 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 119, type: !397, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412)
!412 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !2, file: !3, line: 134, type: !206, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414)
!414 = distinct !DIGlobalVariable(name: "hold_count", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416)
!416 = distinct !DIGlobalVariable(name: "last_line_number", scope: !2, file: !3, line: 128, type: !224, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418)
!418 = distinct !DIGlobalVariable(name: "hold_area", scope: !2, file: !3, line: 122, type: !11, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420)
!420 = distinct !DIGlobalVariable(name: "infomap", scope: !421, file: !422, line: 632, type: !446, isLocal: true, isDefinition: true)
!421 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !422, file: !422, line: 630, type: !423, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !425)
!422 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!423 = !DISubroutineType(types: !424)
!424 = !{null, !193}
!425 = !{!426, !427, !428, !435, !437, !438, !439, !442, !443, !445}
!426 = !DILocalVariable(name: "program", arg: 1, scope: !421, file: !422, line: 630, type: !193)
!427 = !DILocalVariable(name: "node", scope: !421, file: !422, line: 642, type: !193)
!428 = !DILocalVariable(name: "map_prog", scope: !421, file: !422, line: 643, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !421, file: !422, line: 632, size: 128, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !431, file: !422, line: 632, baseType: !193, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !431, file: !422, line: 632, baseType: !193, size: 64, offset: 64)
!435 = !DILocalVariable(name: "__s1_len", scope: !436, file: !422, line: 645, type: !18)
!436 = distinct !DILexicalBlock(scope: !421, file: !422, line: 645, column: 33)
!437 = !DILocalVariable(name: "__s2_len", scope: !436, file: !422, line: 645, type: !18)
!438 = !DILocalVariable(name: "lc_messages", scope: !421, file: !422, line: 655, type: !193)
!439 = !DILocalVariable(name: "__s1_len", scope: !440, file: !422, line: 656, type: !18)
!440 = distinct !DILexicalBlock(scope: !441, file: !422, line: 656, column: 22)
!441 = distinct !DILexicalBlock(scope: !421, file: !422, line: 656, column: 7)
!442 = !DILocalVariable(name: "__s2_len", scope: !440, file: !422, line: 656, type: !18)
!443 = !DILocalVariable(name: "__s2", scope: !444, file: !422, line: 656, type: !190)
!444 = distinct !DILexicalBlock(scope: !440, file: !422, line: 656, column: 22)
!445 = !DILocalVariable(name: "__result", scope: !444, file: !422, line: 656, type: !9)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 896, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 7)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !450, line: 37, baseType: !117)
!450 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!451 = !DIGlobalVariableExpression(var: !452)
!452 = distinct !DIGlobalVariable(name: "Version", scope: !453, file: !454, line: 2, type: !193, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, globals: !456)
!454 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!455 = !{}
!456 = !{!451}
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "file_name", scope: !459, file: !464, line: 36, type: !193, isLocal: true, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, globals: !461)
!460 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !{!457, !462}
!462 = !DIGlobalVariableExpression(var: !463)
!463 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !459, file: !464, line: 46, type: !206, isLocal: true, isDefinition: true)
!464 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!465 = !DIGlobalVariableExpression(var: !466)
!466 = distinct !DIGlobalVariable(name: "exit_failure", scope: !467, file: !470, line: 24, type: !338, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, globals: !469)
!468 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!469 = !{!465}
!470 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!471 = !DIGlobalVariableExpression(var: !472)
!472 = distinct !DIGlobalVariable(name: "program_name", scope: !473, file: !477, line: 33, type: !193, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !475, globals: !476)
!474 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!475 = !{!76, !11}
!476 = !{!471}
!477 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!478 = !DIGlobalVariableExpression(var: !479)
!479 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !480, file: !492, line: 77, type: !527, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !482, retainedTypes: !488, globals: !489)
!481 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!482 = !{!132, !483, !150}
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !133, line: 242, size: 32, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!486 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!487 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!488 = !{!9, !187, !18, !11}
!489 = !{!478, !490, !497, !509, !511, !516, !523, !525}
!490 = !DIGlobalVariableExpression(var: !491)
!491 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !480, file: !492, line: 93, type: !493, isDefinition: true)
!492 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 320, elements: !495)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!495 = !{!496}
!496 = !DISubrange(count: 10)
!497 = !DIGlobalVariableExpression(var: !498)
!498 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !480, file: !492, line: 1043, type: !499, isDefinition: true)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !492, line: 57, size: 448, elements: !500)
!500 = !{!501, !502, !503, !507, !508}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !499, file: !492, line: 60, baseType: !132, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !499, file: !492, line: 63, baseType: !9, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !499, file: !492, line: 67, baseType: !504, size: 256, offset: 64)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 8)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !499, file: !492, line: 70, baseType: !193, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !499, file: !492, line: 73, baseType: !193, size: 64, offset: 384)
!509 = !DIGlobalVariableExpression(var: !510)
!510 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !480, file: !492, line: 108, type: !499, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512)
!512 = distinct !DIGlobalVariable(name: "slot0", scope: !480, file: !492, line: 834, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 256)
!516 = !DIGlobalVariableExpression(var: !517)
!517 = distinct !DIGlobalVariable(name: "slotvec", scope: !480, file: !492, line: 837, type: !518, isLocal: true, isDefinition: true)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !492, line: 826, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !492, line: 828, baseType: !18, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !519, file: !492, line: 829, baseType: !11, size: 64, offset: 64)
!523 = !DIGlobalVariableExpression(var: !524)
!524 = distinct !DIGlobalVariable(name: "nslots", scope: !480, file: !492, line: 835, type: !9, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526)
!526 = distinct !DIGlobalVariable(name: "slotvec0", scope: !480, file: !492, line: 836, type: !519, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 704, elements: !200)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!529 = !DIGlobalVariableExpression(var: !530)
!530 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !531, file: !534, line: 26, type: !535, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, globals: !533)
!532 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!533 = !{!529}
!534 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 376, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 47)
!538 = !DIGlobalVariableExpression(var: !539)
!539 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !540, file: !541, line: 335, type: !9, isLocal: true, isDefinition: true)
!540 = distinct !DISubprogram(name: "rpl_fcntl", scope: !541, file: !541, line: 272, type: !542, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !544, variables: !547)
!541 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!542 = !DISubroutineType(types: !543)
!543 = !{!9, !9, !9, null}
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, globals: !546)
!545 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!546 = !{!538}
!547 = !{!548, !549, !550, !561, !562, !565, !568, !571}
!548 = !DILocalVariable(name: "fd", arg: 1, scope: !540, file: !541, line: 272, type: !9)
!549 = !DILocalVariable(name: "action", arg: 2, scope: !540, file: !541, line: 272, type: !9)
!550 = !DILocalVariable(name: "arg", scope: !540, file: !541, line: 274, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !552, line: 30, baseType: !553)
!552 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !545, line: 274, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, elements: !294)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !545, line: 274, size: 192, elements: !556)
!556 = !{!557, !558, !559, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !555, file: !545, line: 274, baseType: !64, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !555, file: !545, line: 274, baseType: !64, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !555, file: !545, line: 274, baseType: !76, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !555, file: !545, line: 274, baseType: !76, size: 64, offset: 128)
!561 = !DILocalVariable(name: "result", scope: !540, file: !541, line: 275, type: !9)
!562 = !DILocalVariable(name: "target", scope: !563, file: !541, line: 322, type: !9)
!563 = distinct !DILexicalBlock(scope: !564, file: !541, line: 321, column: 7)
!564 = distinct !DILexicalBlock(scope: !540, file: !541, line: 278, column: 5)
!565 = !DILocalVariable(name: "flags", scope: !566, file: !541, line: 359, type: !9)
!566 = distinct !DILexicalBlock(scope: !567, file: !541, line: 358, column: 11)
!567 = distinct !DILexicalBlock(scope: !563, file: !541, line: 357, column: 13)
!568 = !DILocalVariable(name: "saved_errno", scope: !569, file: !541, line: 362, type: !9)
!569 = distinct !DILexicalBlock(scope: !570, file: !541, line: 361, column: 15)
!570 = distinct !DILexicalBlock(scope: !566, file: !541, line: 360, column: 17)
!571 = !DILocalVariable(name: "p", scope: !572, file: !541, line: 404, type: !76)
!572 = distinct !DILexicalBlock(scope: !564, file: !541, line: 402, column: 7)
!573 = !DIGlobalVariableExpression(var: !574)
!574 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !575, file: !918, line: 120, type: !320, isLocal: true, isDefinition: true)
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !577, retainedTypes: !916, globals: !917)
!576 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !579, line: 41, size: 32, elements: !580)
!579 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!581 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!582 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!583 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!584 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!585 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!586 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!587 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!588 = !DIEnumerator(name: "DAY_1", value: 131079)
!589 = !DIEnumerator(name: "DAY_2", value: 131080)
!590 = !DIEnumerator(name: "DAY_3", value: 131081)
!591 = !DIEnumerator(name: "DAY_4", value: 131082)
!592 = !DIEnumerator(name: "DAY_5", value: 131083)
!593 = !DIEnumerator(name: "DAY_6", value: 131084)
!594 = !DIEnumerator(name: "DAY_7", value: 131085)
!595 = !DIEnumerator(name: "ABMON_1", value: 131086)
!596 = !DIEnumerator(name: "ABMON_2", value: 131087)
!597 = !DIEnumerator(name: "ABMON_3", value: 131088)
!598 = !DIEnumerator(name: "ABMON_4", value: 131089)
!599 = !DIEnumerator(name: "ABMON_5", value: 131090)
!600 = !DIEnumerator(name: "ABMON_6", value: 131091)
!601 = !DIEnumerator(name: "ABMON_7", value: 131092)
!602 = !DIEnumerator(name: "ABMON_8", value: 131093)
!603 = !DIEnumerator(name: "ABMON_9", value: 131094)
!604 = !DIEnumerator(name: "ABMON_10", value: 131095)
!605 = !DIEnumerator(name: "ABMON_11", value: 131096)
!606 = !DIEnumerator(name: "ABMON_12", value: 131097)
!607 = !DIEnumerator(name: "MON_1", value: 131098)
!608 = !DIEnumerator(name: "MON_2", value: 131099)
!609 = !DIEnumerator(name: "MON_3", value: 131100)
!610 = !DIEnumerator(name: "MON_4", value: 131101)
!611 = !DIEnumerator(name: "MON_5", value: 131102)
!612 = !DIEnumerator(name: "MON_6", value: 131103)
!613 = !DIEnumerator(name: "MON_7", value: 131104)
!614 = !DIEnumerator(name: "MON_8", value: 131105)
!615 = !DIEnumerator(name: "MON_9", value: 131106)
!616 = !DIEnumerator(name: "MON_10", value: 131107)
!617 = !DIEnumerator(name: "MON_11", value: 131108)
!618 = !DIEnumerator(name: "MON_12", value: 131109)
!619 = !DIEnumerator(name: "AM_STR", value: 131110)
!620 = !DIEnumerator(name: "PM_STR", value: 131111)
!621 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!622 = !DIEnumerator(name: "D_FMT", value: 131113)
!623 = !DIEnumerator(name: "T_FMT", value: 131114)
!624 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!625 = !DIEnumerator(name: "ERA", value: 131116)
!626 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!627 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!628 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!629 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!630 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!631 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!632 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!633 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!634 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!635 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!636 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!637 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!638 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!639 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!640 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!641 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!642 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!643 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!644 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!645 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!646 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!647 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!648 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!649 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!650 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!651 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!652 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!653 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!654 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!655 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!656 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!657 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!658 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!659 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!660 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!661 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!662 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!663 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!664 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!665 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!666 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!667 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!668 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!669 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!670 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!671 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!672 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!673 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!674 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!675 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!676 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!677 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!678 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!679 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!680 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!681 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!682 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!683 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!684 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!685 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!686 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!687 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!688 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!689 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!690 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!691 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!692 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!693 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!694 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!695 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!696 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!697 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!698 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!699 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!700 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!701 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!702 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!703 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!704 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!705 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!706 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!707 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!708 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!709 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!710 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!711 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!712 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!713 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!714 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!715 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!716 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!717 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!718 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!719 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!720 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!721 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!722 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!723 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!724 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!725 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!726 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!727 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!728 = !DIEnumerator(name: "CODESET", value: 14)
!729 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!730 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!731 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!732 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!770 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!775 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!776 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!777 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!778 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!779 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!780 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!781 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!782 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!783 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!784 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!785 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!786 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!787 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!788 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!792 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!793 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!794 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!795 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!796 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!797 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!798 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!799 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!800 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!801 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!802 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!803 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!804 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!805 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!806 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!807 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!808 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!809 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!810 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!811 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!812 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!813 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!814 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!815 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!816 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!817 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!818 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!819 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!820 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!821 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!822 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!824 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!831 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!832 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!835 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!838 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!839 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!840 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!841 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!842 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!843 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!844 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!845 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!846 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!847 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!848 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!849 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!850 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!851 = !DIEnumerator(name: "THOUSEP", value: 65537)
!852 = !DIEnumerator(name: "__GROUPING", value: 65538)
!853 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!854 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!855 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!856 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!857 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!858 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!859 = !DIEnumerator(name: "__YESSTR", value: 327682)
!860 = !DIEnumerator(name: "__NOSTR", value: 327683)
!861 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!862 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!863 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!864 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!865 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!866 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!867 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!868 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!869 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!870 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!871 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!872 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!873 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!874 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!875 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!876 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!877 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!878 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!879 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!880 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!881 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!882 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!883 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!884 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!885 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!886 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!887 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!888 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!889 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!890 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!891 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!892 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!893 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!894 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!895 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!896 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!897 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!898 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!899 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!906 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!907 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!908 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!909 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!910 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!911 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!912 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!913 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!914 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!915 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!916 = !{!76, !11, !245}
!917 = !{!573}
!918 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455)
!920 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455)
!922 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !925)
!924 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!925 = !{!224}
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !928)
!927 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!928 = !{!929}
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !931, file: !930, line: 62, size: 32, elements: !945)
!930 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!931 = distinct !DISubprogram(name: "safe_read", scope: !930, file: !930, line: 56, type: !932, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !926, variables: !934)
!932 = !DISubroutineType(types: !933)
!933 = !{!18, !9, !76, !18}
!934 = !{!935, !936, !937, !938}
!935 = !DILocalVariable(name: "fd", arg: 1, scope: !931, file: !930, line: 56, type: !9)
!936 = !DILocalVariable(name: "buf", arg: 2, scope: !931, file: !930, line: 56, type: !76)
!937 = !DILocalVariable(name: "count", arg: 3, scope: !931, file: !930, line: 56, type: !18)
!938 = !DILocalVariable(name: "result", scope: !939, file: !930, line: 66, type: !942)
!939 = distinct !DILexicalBlock(scope: !940, file: !930, line: 65, column: 5)
!940 = distinct !DILexicalBlock(scope: !941, file: !930, line: 64, column: 3)
!941 = distinct !DILexicalBlock(scope: !931, file: !930, line: 64, column: 3)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !943, line: 109, baseType: !944)
!943 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !61, line: 181, baseType: !92)
!945 = !{!946}
!946 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455)
!948 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !951, retainedTypes: !956)
!950 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!951 = !{!952}
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !953, line: 41, size: 32, elements: !954)
!953 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!954 = !{!955}
!955 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!956 = !{!76}
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !959, retainedTypes: !967)
!958 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!959 = !{!960}
!960 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !961, file: !174, line: 192, size: 32, elements: !184)
!961 = distinct !DISubprogram(name: "x2nrealloc", scope: !174, file: !174, line: 180, type: !176, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !957, variables: !962)
!962 = !{!963, !964, !965, !966}
!963 = !DILocalVariable(name: "p", arg: 1, scope: !961, file: !174, line: 180, type: !76)
!964 = !DILocalVariable(name: "pn", arg: 2, scope: !961, file: !174, line: 180, type: !178)
!965 = !DILocalVariable(name: "s", arg: 3, scope: !961, file: !174, line: 180, type: !18)
!966 = !DILocalVariable(name: "n", scope: !961, file: !174, line: 182, type: !18)
!967 = !{!18, !11, !76}
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !970)
!969 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!970 = !{!165}
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !970, retainedTypes: !973)
!972 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!973 = !{!11}
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !976, retainedTypes: !977)
!975 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!976 = !{!165, !150}
!977 = !{!9, !187, !11}
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !956)
!979 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455)
!981 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !956)
!983 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !956)
!985 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !988)
!987 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!988 = !{!18}
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455)
!990 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !993)
!992 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!993 = !{!18, !188, !190, !193}
!994 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!995 = !{i32 2, !"Dwarf Version", i32 4}
!996 = !{i32 2, !"Debug Info Version", i32 3}
!997 = !{i32 1, !"PIC Level", i32 2}
!998 = !{i32 1, !"PIE Level", i32 2}
!999 = distinct !DISubprogram(name: "xalloc_die", scope: !3, file: !3, line: 231, type: !128, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !455)
!1000 = !DILocation(line: 233, column: 22, scope: !999)
!1001 = !DILocation(line: 233, column: 3, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !999, file: !3, discriminator: 1)
!1003 = !DILocation(line: 234, column: 3, scope: !999)
!1004 = distinct !DISubprogram(name: "cleanup_fatal", scope: !3, file: !3, line: 224, type: !128, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !455)
!1005 = !DILocation(line: 213, column: 3, scope: !1006, inlinedAt: !1009)
!1006 = distinct !DISubprogram(name: "cleanup", scope: !3, file: !3, line: 211, type: !128, isLocal: true, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1007)
!1007 = !{!1008}
!1008 = !DILocalVariable(name: "oldset", scope: !1006, file: !3, line: 213, type: !449)
!1009 = distinct !DILocation(line: 226, column: 3, scope: !1004)
!1010 = !DILocation(line: 215, column: 3, scope: !1006, inlinedAt: !1009)
!1011 = !DIExpression(DW_OP_deref)
!1012 = !DILocation(line: 213, column: 12, scope: !1006, inlinedAt: !1009)
!1013 = !DILocation(line: 217, column: 3, scope: !1006, inlinedAt: !1009)
!1014 = !DILocation(line: 218, column: 3, scope: !1006, inlinedAt: !1009)
!1015 = !DILocation(line: 219, column: 3, scope: !1006, inlinedAt: !1009)
!1016 = !DILocation(line: 220, column: 1, scope: !1006, inlinedAt: !1009)
!1017 = !DILocation(line: 227, column: 3, scope: !1004)
!1018 = distinct !DISubprogram(name: "close_output_file", scope: !3, file: !3, line: 1005, type: !128, isLocal: true, isDefinition: true, scopeLine: 1006, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1019)
!1019 = !{!1020, !1025, !1026, !1027}
!1020 = !DILocalVariable(name: "oldset", scope: !1021, file: !3, line: 1023, type: !449)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 1022, column: 9)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1021, column: 11)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1008, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 1007, column: 7)
!1025 = !DILocalVariable(name: "unlink_ok", scope: !1021, file: !3, line: 1024, type: !206)
!1026 = !DILocalVariable(name: "unlink_errno", scope: !1021, file: !3, line: 1025, type: !9)
!1027 = !DILocalVariable(name: "buf", scope: !1028, file: !3, line: 1041, type: !361)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 1040, column: 13)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1039, column: 15)
!1030 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 1038, column: 9)
!1031 = !DILocation(line: 1007, column: 7, scope: !1024)
!1032 = !{!1033, !1033, i64 0}
!1033 = !{!"any pointer", !1034, i64 0}
!1034 = !{!"omnipotent char", !1035, i64 0}
!1035 = !{!"Simple C/C++ TBAA"}
!1036 = !DILocation(line: 1007, column: 7, scope: !1018)
!1037 = !DILocalVariable(name: "__stream", arg: 1, scope: !1038, file: !1039, line: 132, type: !258)
!1038 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1039, file: !1039, line: 132, type: !1040, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1042)
!1039 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!9, !258}
!1042 = !{!1037}
!1043 = !DIExpression()
!1044 = !DILocation(line: 132, column: 1, scope: !1038, inlinedAt: !1045)
!1045 = distinct !DILocation(line: 1009, column: 11, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1009, column: 11)
!1047 = !DILocation(line: 134, column: 10, scope: !1038, inlinedAt: !1045)
!1048 = !{!1049, !1050, i64 0}
!1049 = !{!"_IO_FILE", !1050, i64 0, !1033, i64 8, !1033, i64 16, !1033, i64 24, !1033, i64 32, !1033, i64 40, !1033, i64 48, !1033, i64 56, !1033, i64 64, !1033, i64 72, !1033, i64 80, !1033, i64 88, !1033, i64 96, !1033, i64 104, !1050, i64 112, !1050, i64 116, !1051, i64 120, !1052, i64 128, !1034, i64 130, !1034, i64 131, !1033, i64 136, !1051, i64 144, !1033, i64 152, !1033, i64 160, !1033, i64 168, !1033, i64 176, !1051, i64 184, !1050, i64 192, !1034, i64 196}
!1050 = !{!"int", !1034, i64 0}
!1051 = !{!"long", !1034, i64 0}
!1052 = !{!"short", !1034, i64 0}
!1053 = !DILocation(line: 1009, column: 11, scope: !1046)
!1054 = !DILocation(line: 1009, column: 11, scope: !1023)
!1055 = !DILocation(line: 1011, column: 24, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 1010, column: 9)
!1057 = !DILocation(line: 1011, column: 49, scope: !1056)
!1058 = !DILocation(line: 1011, column: 49, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1056, file: !3, discriminator: 1)
!1060 = !DILocation(line: 1011, column: 11, scope: !1061)
!1061 = !DILexicalBlockFile(scope: !1056, file: !3, discriminator: 2)
!1062 = !DILocation(line: 1012, column: 25, scope: !1056)
!1063 = !DILocation(line: 1013, column: 11, scope: !1056)
!1064 = !DILocation(line: 1015, column: 11, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1015, column: 11)
!1066 = !DILocation(line: 1015, column: 34, scope: !1065)
!1067 = !DILocation(line: 1015, column: 11, scope: !1023)
!1068 = !DILocation(line: 1017, column: 21, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1016, column: 9)
!1070 = !{!1050, !1050, i64 0}
!1071 = !DILocation(line: 1017, column: 34, scope: !1069)
!1072 = !DILocation(line: 1017, column: 34, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 1)
!1074 = !DILocation(line: 1017, column: 11, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 2)
!1076 = !DILocation(line: 1018, column: 25, scope: !1069)
!1077 = !DILocation(line: 1019, column: 11, scope: !1069)
!1078 = !DILocation(line: 1021, column: 11, scope: !1022)
!1079 = !{!1051, !1051, i64 0}
!1080 = !DILocation(line: 1021, column: 25, scope: !1022)
!1081 = !DILocation(line: 1021, column: 30, scope: !1022)
!1082 = !DILocation(line: 1021, column: 11, scope: !1083)
!1083 = !DILexicalBlockFile(scope: !1023, file: !3, discriminator: 1)
!1084 = !DILocation(line: 1023, column: 11, scope: !1021)
!1085 = !DILocation(line: 1023, column: 20, scope: !1021)
!1086 = !DILocation(line: 1028, column: 11, scope: !1021)
!1087 = !DILocation(line: 1029, column: 32, scope: !1021)
!1088 = !DILocation(line: 1029, column: 24, scope: !1021)
!1089 = !DILocation(line: 1029, column: 49, scope: !1021)
!1090 = !DILocation(line: 1030, column: 26, scope: !1021)
!1091 = !DILocation(line: 1025, column: 15, scope: !1021)
!1092 = !DILocation(line: 1031, column: 28, scope: !1021)
!1093 = !DILocation(line: 1031, column: 25, scope: !1021)
!1094 = !DILocation(line: 1032, column: 11, scope: !1021)
!1095 = !DILocation(line: 1034, column: 15, scope: !1021)
!1096 = !DILocation(line: 1035, column: 43, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 1034, column: 15)
!1098 = !DILocation(line: 1035, column: 13, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !1097, file: !3, discriminator: 1)
!1100 = !DILocation(line: 1035, column: 13, scope: !1097)
!1101 = !DILocation(line: 1036, column: 9, scope: !1022)
!1102 = !DILocation(line: 1036, column: 9, scope: !1021)
!1103 = !DILocation(line: 1039, column: 15, scope: !1030)
!1104 = !DILocation(line: 1041, column: 15, scope: !1028)
!1105 = !DILocation(line: 1041, column: 20, scope: !1028)
!1106 = !DILocation(line: 1042, column: 15, scope: !1028)
!1107 = !DILocation(line: 1042, column: 15, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1028, file: !3, discriminator: 1)
!1109 = !DILocation(line: 1043, column: 13, scope: !1029)
!1110 = !DILocation(line: 1043, column: 13, scope: !1028)
!1111 = !DILocation(line: 1045, column: 21, scope: !1023)
!1112 = !DILocation(line: 1046, column: 5, scope: !1023)
!1113 = !DILocation(line: 1047, column: 1, scope: !1018)
!1114 = distinct !DISubprogram(name: "delete_all_files", scope: !3, file: !3, line: 984, type: !1115, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1117)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !206}
!1117 = !{!1118, !1119, !1120}
!1118 = !DILocalVariable(name: "in_signal_handler", arg: 1, scope: !1114, file: !3, line: 984, type: !206)
!1119 = !DILocalVariable(name: "i", scope: !1114, file: !3, line: 986, type: !64)
!1120 = !DILocalVariable(name: "name", scope: !1121, file: !3, line: 993, type: !193)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 992, column: 5)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 991, column: 3)
!1123 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 991, column: 3)
!1124 = !DIExpression(DW_OP_LLVM_fragment, 0, 1)
!1125 = !DILocation(line: 984, column: 24, scope: !1114)
!1126 = !DILocation(line: 988, column: 9, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 988, column: 7)
!1128 = !{!1129, !1129, i64 0}
!1129 = !{!"_Bool", !1034, i64 0}
!1130 = !{i8 0, i8 2}
!1131 = !DILocation(line: 988, column: 7, scope: !1114)
!1132 = !DILocation(line: 986, column: 16, scope: !1114)
!1133 = !DILocation(line: 991, column: 19, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1122, file: !3, discriminator: 1)
!1135 = !DILocation(line: 991, column: 17, scope: !1134)
!1136 = !DILocation(line: 991, column: 3, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1123, file: !3, discriminator: 1)
!1138 = !DILocation(line: 993, column: 26, scope: !1121)
!1139 = !DILocation(line: 993, column: 19, scope: !1121)
!1140 = !DILocation(line: 994, column: 11, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 994, column: 11)
!1142 = !DILocation(line: 994, column: 25, scope: !1141)
!1143 = !DILocation(line: 994, column: 30, scope: !1141)
!1144 = !DILocation(line: 995, column: 19, scope: !1141)
!1145 = !DILocation(line: 995, column: 32, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1141, file: !3, discriminator: 1)
!1147 = !DILocation(line: 995, column: 9, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1141, file: !3, discriminator: 2)
!1149 = !DILocation(line: 995, column: 9, scope: !1141)
!1150 = !DILocation(line: 991, column: 35, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1122, file: !3, discriminator: 2)
!1152 = distinct !{!1152, !1153, !1154}
!1153 = !DILocation(line: 991, column: 3, scope: !1123)
!1154 = !DILocation(line: 996, column: 5, scope: !1123)
!1155 = !DILocation(line: 998, column: 17, scope: !1114)
!1156 = !DILocation(line: 999, column: 1, scope: !1114)
!1157 = !DILocation(line: 999, column: 1, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1114, file: !3, discriminator: 2)
!1159 = distinct !DISubprogram(name: "make_filename", scope: !3, file: !3, line: 935, type: !1160, isLocal: true, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1162)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!11, !64}
!1162 = !{!1163}
!1163 = !DILocalVariable(name: "num", arg: 1, scope: !1159, file: !3, line: 935, type: !64)
!1164 = !DILocation(line: 935, column: 29, scope: !1159)
!1165 = !DILocation(line: 937, column: 11, scope: !1159)
!1166 = !DILocation(line: 937, column: 27, scope: !1159)
!1167 = !DILocalVariable(name: "__dest", arg: 1, scope: !1168, file: !1169, line: 107, type: !1172)
!1168 = distinct !DISubprogram(name: "strcpy", scope: !1169, file: !1169, line: 107, type: !1170, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1174)
!1169 = !DIFile(filename: "/usr/include/bits/string3.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!11, !1172, !1173}
!1172 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!1173 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !193)
!1174 = !{!1167, !1175}
!1175 = !DILocalVariable(name: "__src", arg: 2, scope: !1168, file: !1169, line: 107, type: !1173)
!1176 = !DILocation(line: 107, column: 1, scope: !1168, inlinedAt: !1177)
!1177 = distinct !DILocation(line: 937, column: 3, scope: !1159)
!1178 = !DILocation(line: 109, column: 49, scope: !1168, inlinedAt: !1177)
!1179 = !DILocation(line: 109, column: 10, scope: !1168, inlinedAt: !1177)
!1180 = !DILocation(line: 938, column: 7, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 938, column: 7)
!1182 = !DILocation(line: 939, column: 5, scope: !1181)
!1183 = !DILocation(line: 938, column: 7, scope: !1159)
!1184 = !DILocation(line: 939, column: 5, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1181, file: !3, discriminator: 1)
!1186 = !DILocation(line: 941, column: 5, scope: !1181)
!1187 = !DILocation(line: 941, column: 5, scope: !1185)
!1188 = !DILocation(line: 942, column: 10, scope: !1159)
!1189 = !DILocation(line: 942, column: 3, scope: !1159)
!1190 = !DILocation(line: 1204, column: 20, scope: !354, inlinedAt: !1191)
!1191 = distinct !DILocation(line: 1424, column: 3, scope: !6)
