!llvm.dbg.cu = !{!2, !466, !472, !1036, !485, !1040, !1081, !493, !1103, !1106, !500, !518, !1108, !1134, !1137, !1141, !536, !543, !1144, !1147, !610, !1154, !1165, !1167, !1169, !1173, !1177, !1179, !1181, !1183, !1185, !1187, !1189, !1191, !1327, !1329, !1332, !1351, !1353, !1355, !1357, !1359, !1362, !619, !967, !1368, !1370, !1372, !980, !1011}
!llvm.ident = !{!1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374, !1374}
!llvm.module.flags = !{!1375, !1376, !1377, !1378}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "exclude", scope: !2, file: !3, line: 193, type: !461, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !80)
!3 = !DIFile(filename: "src/du.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !18, !26, !40, !45, !52}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 43, size: 32, elements: !7)

!126 = distinct !DILexicalBlock(scope: !127, file: !3, line: 973, column: 13)
!127 = distinct !DILexicalBlock(scope: !116, file: !3, line: 972, column: 20)
!128 = !DILocalVariable(name: "ai", scope: !83, file: !3, line: 1012, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !46, line: 23, flags: DIFlagFwdDecl)
!131 = !DILocalVariable(name: "__s1_len", scope: !132, file: !3, line: 1025, type: !63)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 1025, column: 14)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1025, column: 11)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 1014, column: 5)
!135 = distinct !DILexicalBlock(scope: !83, file: !3, line: 1013, column: 7)
!136 = !DILocalVariable(name: "__s2_len", scope: !132, file: !3, line: 1025, type: !63)
!137 = !DILocalVariable(name: "__s2", scope: !138, file: !3, line: 1025, type: !68)
!138 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1025, column: 14)
!139 = !DILocalVariable(name: "__result", scope: !138, file: !3, line: 1025, type: !79)
!140 = !DILocalVariable(name: "files", scope: !141, file: !3, line: 1037, type: !86)
!141 = distinct !DILexicalBlock(scope: !135, file: !3, line: 1036, column: 5)
!142 = !DILocalVariable(name: "skip_file", scope: !143, file: !3, line: 1064, type: !95)
!143 = distinct !DILexicalBlock(scope: !83, file: !3, line: 1063, column: 5)
!144 = !DILocalVariable(name: "ai_err", scope: !143, file: !3, line: 1065, type: !45)
!145 = !DILocalVariable(name: "file_name", scope: !143, file: !3, line: 1066, type: !61)
!146 = !DILocalVariable(name: "__s1_len", scope: !147, file: !3, line: 1084, type: !63)
!147 = distinct !DILexicalBlock(scope: !148, file: !3, line: 1084, column: 25)
!148 = distinct !DILexicalBlock(scope: !143, file: !3, line: 1084, column: 11)
!149 = !DILocalVariable(name: "__s2_len", scope: !147, file: !3, line: 1084, type: !63)
!150 = !DILocalVariable(name: "__s2", scope: !151, file: !3, line: 1084, type: !68)
!151 = distinct !DILexicalBlock(scope: !147, file: !3, line: 1084, column: 25)
!152 = !DILocalVariable(name: "__result", scope: !151, file: !3, line: 1084, type: !79)
!153 = !DILocalVariable(name: "__s1_len", scope: !154, file: !3, line: 1084, type: !63)
!154 = distinct !DILexicalBlock(scope: !148, file: !3, line: 1084, column: 52)
!155 = !DILocalVariable(name: "__s2_len", scope: !154, file: !3, line: 1084, type: !63)
!156 = !DILocalVariable(name: "__s2", scope: !157, file: !3, line: 1084, type: !68)
!157 = distinct !DILexicalBlock(scope: !154, file: !3, line: 1084, column: 52)
!158 = !DILocalVariable(name: "__result", scope: !157, file: !3, line: 1084, type: !79)
!159 = !DILocalVariable(name: "file_number", scope: !160, file: !3, line: 1111, type: !65)
!160 = distinct !DILexicalBlock(scope: !161, file: !3, line: 1107, column: 13)
!161 = distinct !DILexicalBlock(scope: !162, file: !3, line: 1104, column: 15)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 1099, column: 9)
!163 = distinct !DILexicalBlock(scope: !143, file: !3, line: 1098, column: 11)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 56, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 7)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "prefix_len", scope: !83, file: !3, line: 984, type: !169, isLocal: true, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "temp_argv", scope: !83, file: !3, line: 1060, type: !91, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "di_files", scope: !2, file: !3, line: 66, type: !174, isLocal: true, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !176, line: 13, flags: DIFlagFwdDecl)
!176 = !DIFile(filename: "./lib/di-set.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!177 = !DIGlobalVariableExpression(var: !178)
!178 = distinct !DIGlobalVariable(name: "di_mnt", scope: !2, file: !3, line: 69, type: !174, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "hash_all", scope: !2, file: !3, line: 140, type: !95, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 161, type: !79, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 187, type: !185, isLocal: true, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !186, line: 594, baseType: !187)
!186 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !186, line: 594, flags: DIFlagFwdDecl)
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 190, type: !71, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "tot_dui", scope: !2, file: !3, line: 196, type: !193, isLocal: true, isDefinition: true)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !3, line: 76, size: 256, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !3, line: 79, baseType: !71, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !193, file: !3, line: 82, baseType: !71, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !193, file: !3, line: 86, baseType: !198, size: 128, offset: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !199, line: 8, size: 128, elements: !200)
!199 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !198, file: !199, line: 10, baseType: !77, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !198, file: !199, line: 11, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !74, line: 184, baseType: !78)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "infomap", scope: !206, file: !207, line: 632, type: !231, isLocal: true, isDefinition: true)
!206 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !207, file: !207, line: 630, type: !208, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !210)
!207 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!208 = !DISubroutineType(types: !209)
!209 = !{null, !58}
!210 = !{!211, !212, !213, !220, !222, !223, !224, !227, !228, !230}
!211 = !DILocalVariable(name: "program", arg: 1, scope: !206, file: !207, line: 630, type: !58)
!212 = !DILocalVariable(name: "node", scope: !206, file: !207, line: 642, type: !58)
!213 = !DILocalVariable(name: "map_prog", scope: !206, file: !207, line: 643, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !206, file: !207, line: 632, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !216, file: !207, line: 632, baseType: !58, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !216, file: !207, line: 632, baseType: !58, size: 64, offset: 64)
!220 = !DILocalVariable(name: "__s1_len", scope: !221, file: !207, line: 645, type: !63)
!221 = distinct !DILexicalBlock(scope: !206, file: !207, line: 645, column: 33)
!222 = !DILocalVariable(name: "__s2_len", scope: !221, file: !207, line: 645, type: !63)
!223 = !DILocalVariable(name: "lc_messages", scope: !206, file: !207, line: 655, type: !58)
!224 = !DILocalVariable(name: "__s1_len", scope: !225, file: !207, line: 656, type: !63)
!225 = distinct !DILexicalBlock(scope: !226, file: !207, line: 656, column: 22)
!226 = distinct !DILexicalBlock(scope: !206, file: !207, line: 656, column: 7)
!227 = !DILocalVariable(name: "__s2_len", scope: !225, file: !207, line: 656, type: !63)
!228 = !DILocalVariable(name: "__s2", scope: !229, file: !207, line: 656, type: !68)
!229 = distinct !DILexicalBlock(scope: !225, file: !207, line: 656, column: 22)
!230 = !DILocalVariable(name: "__result", scope: !229, file: !207, line: 656, type: !79)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 896, elements: !165)
!232 = !DIGlobalVariableExpression(var: !233)
!233 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 216, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 6656, elements: !244)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !237, line: 104, size: 256, elements: !238)
!237 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!238 = !{!239, !240, !241, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !237, line: 106, baseType: !58, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !236, file: !237, line: 109, baseType: !79, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !237, line: 110, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !236, file: !237, line: 111, baseType: !79, size: 32, offset: 192)
!244 = !{!245}
!245 = !DISubrange(count: 26)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !2, file: !3, line: 143, type: !95, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "opt_all", scope: !2, file: !3, line: 130, type: !95, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "apparent_size", scope: !2, file: !3, line: 134, type: !95, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 146, type: !95, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "max_depth", scope: !2, file: !3, line: 154, type: !63, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !2, file: !3, line: 137, type: !95, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !2, file: !3, line: 158, type: !260, isLocal: true, isDefinition: true)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !72, line: 135, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !74, line: 61, baseType: !78)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !2, file: !3, line: 149, type: !95, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !2, file: !3, line: 164, type: !95, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "opt_time", scope: !2, file: !3, line: 167, type: !95, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 251, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 160, elements: !272)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!272 = !{!273}
!273 = !DISubrange(count: 5)
!274 = !DIGlobalVariableExpression(var: !275)
!275 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 247, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 384, elements: !278)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!278 = !{!279}
!279 = !DISubrange(count: 6)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 178, type: !40, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283)
!283 = distinct !DIGlobalVariable(name: "time_style", scope: !2, file: !3, line: 181, type: !58, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285)
!285 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 184, type: !58, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 271, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 96, elements: !290)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!290 = !{!291}
!291 = !DISubrange(count: 3)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 267, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 256, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 4)
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "prev_level", scope: !2, file: !3, line: 73, type: !63, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300)
!300 = distinct !DIGlobalVariable(name: "n_alloc", scope: !301, file: !3, line: 494, type: !63, isLocal: true, isDefinition: true)
!301 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 488, type: !302, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !417)
!302 = !DISubroutineType(types: !303)
!303 = !{!95, !304, !415}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !306, line: 199, baseType: !307)
!306 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 80, size: 1024, elements: !308)
!308 = !{!309, !376, !377, !379, !381, !382, !383, !384, !385, !386, !393, !394, !397, !404}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !307, file: !306, line: 81, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !306, line: 201, size: 2112, elements: !312)
!312 = !{!313, !314, !315, !316, !321, !322, !323, !324, !325, !326, !327, !328, !329, !331, !332, !336, !338, !339, !340, !372}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !311, file: !306, line: 202, baseType: !310, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !311, file: !306, line: 203, baseType: !310, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !311, file: !306, line: 204, baseType: !310, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !311, file: !306, line: 205, baseType: !317, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !319, line: 127, baseType: !320)
!319 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !319, line: 127, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !311, file: !306, line: 208, baseType: !78, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !311, file: !306, line: 209, baseType: !62, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !311, file: !306, line: 210, baseType: !61, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !311, file: !306, line: 211, baseType: !61, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !311, file: !306, line: 212, baseType: !79, size: 32, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !311, file: !306, line: 213, baseType: !79, size: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !311, file: !306, line: 214, baseType: !63, size: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !311, file: !306, line: 216, baseType: !304, size: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !311, file: !306, line: 220, baseType: !330, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !64, line: 51, baseType: !78)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !311, file: !306, line: 222, baseType: !63, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !311, file: !306, line: 223, baseType: !333, size: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !334, line: 75, baseType: !335)
!334 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !74, line: 139, baseType: !65)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !311, file: !306, line: 239, baseType: !337, size: 16, offset: 896)
!337 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !311, file: !306, line: 243, baseType: !337, size: 16, offset: 912)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !311, file: !306, line: 249, baseType: !337, size: 16, offset: 928)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !311, file: !306, line: 251, baseType: !341, size: 1152, offset: 960)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 1152, elements: !370)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !343, line: 46, size: 1152, elements: !344)
!343 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !{!345, !347, !349, !350, !353, !355, !357, !358, !359, !361, !363, !365, !366, !367, !368}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !342, file: !343, line: 48, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !74, line: 133, baseType: !65)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !342, file: !343, line: 53, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !74, line: 136, baseType: !65)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !342, file: !343, line: 61, baseType: !335, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !342, file: !343, line: 62, baseType: !351, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !74, line: 138, baseType: !352)
!352 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !342, file: !343, line: 64, baseType: !354, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !74, line: 134, baseType: !352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !342, file: !343, line: 65, baseType: !356, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !74, line: 135, baseType: !352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !342, file: !343, line: 67, baseType: !79, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !342, file: !343, line: 69, baseType: !346, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !342, file: !343, line: 74, baseType: !360, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 140, baseType: !78)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !342, file: !343, line: 78, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !74, line: 162, baseType: !78)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !342, file: !343, line: 80, baseType: !364, size: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !74, line: 167, baseType: !78)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !342, file: !343, line: 91, baseType: !198, size: 128, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !342, file: !343, line: 92, baseType: !198, size: 128, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !342, file: !343, line: 93, baseType: !198, size: 128, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !342, file: !343, line: 106, baseType: !369, size: 192, offset: 960)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 192, elements: !290)
!370 = !{!371}
!371 = !DISubrange(count: 1)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !311, file: !306, line: 252, baseType: !373, offset: 2112)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: -1)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !307, file: !306, line: 82, baseType: !310, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !307, file: !306, line: 83, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !307, file: !306, line: 84, baseType: !380, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !334, line: 60, baseType: !346)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !307, file: !306, line: 85, baseType: !61, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !307, file: !306, line: 86, baseType: !79, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !307, file: !306, line: 87, baseType: !79, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !307, file: !306, line: 89, baseType: !63, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !307, file: !306, line: 90, baseType: !63, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !307, file: !306, line: 91, baseType: !387, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!79, !390, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !307, file: !306, line: 162, baseType: !79, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !307, file: !306, line: 171, baseType: !395, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !306, line: 171, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !307, file: !306, line: 193, baseType: !398, size: 64, offset: 704)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !307, file: !306, line: 173, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !398, file: !306, line: 186, baseType: !395, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !398, file: !306, line: 192, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !306, line: 192, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !307, file: !306, line: 198, baseType: !405, size: 256, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !406, line: 39, baseType: !407)
!406 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !406, line: 31, size: 256, elements: !408)
!408 = !{!409, !411, !412, !413, !414}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !407, file: !406, line: 33, baseType: !410, size: 128)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !295)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !407, file: !406, line: 34, baseType: !79, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !407, file: !406, line: 35, baseType: !352, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !407, file: !406, line: 36, baseType: !352, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !407, file: !406, line: 37, baseType: !95, size: 8, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !306, line: 253, baseType: !311)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !428, !429, !433, !440, !445, !451}
!418 = !DILocalVariable(name: "fts", arg: 1, scope: !301, file: !3, line: 488, type: !304)
!419 = !DILocalVariable(name: "ent", arg: 2, scope: !301, file: !3, line: 488, type: !415)
!420 = !DILocalVariable(name: "ok", scope: !301, file: !3, line: 490, type: !95)
!421 = !DILocalVariable(name: "dui", scope: !301, file: !3, line: 491, type: !193)
!422 = !DILocalVariable(name: "dui_to_print", scope: !301, file: !3, line: 492, type: !193)
!423 = !DILocalVariable(name: "level", scope: !301, file: !3, line: 493, type: !63)
!424 = !DILocalVariable(name: "file", scope: !301, file: !3, line: 505, type: !58)
!425 = !DILocalVariable(name: "sb", scope: !301, file: !3, line: 506, type: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!428 = !DILocalVariable(name: "info", scope: !301, file: !3, line: 507, type: !79)
!429 = !DILocalVariable(name: "excluded", scope: !430, file: !3, line: 517, type: !95)
!430 = distinct !DILexicalBlock(scope: !431, file: !3, line: 516, column: 5)
!431 = distinct !DILexicalBlock(scope: !432, file: !3, line: 515, column: 12)
!432 = distinct !DILexicalBlock(scope: !301, file: !3, line: 509, column: 7)
!433 = !DILocalVariable(name: "e", scope: !434, file: !3, line: 525, type: !438)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 523, column: 13)
!435 = distinct !DILexicalBlock(scope: !436, file: !3, line: 522, column: 15)
!436 = distinct !DILexicalBlock(scope: !437, file: !3, line: 519, column: 9)
!437 = distinct !DILexicalBlock(scope: !430, file: !3, line: 518, column: 11)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!440 = !DILocalVariable(name: "e", scope: !441, file: !3, line: 558, type: !438)
!441 = distinct !DILexicalBlock(scope: !442, file: !3, line: 556, column: 13)
!442 = distinct !DILexicalBlock(scope: !443, file: !3, line: 555, column: 15)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 551, column: 9)
!444 = distinct !DILexicalBlock(scope: !430, file: !3, line: 547, column: 11)
!445 = !DILocalVariable(name: "i", scope: !446, file: !3, line: 616, type: !63)
!446 = distinct !DILexicalBlock(scope: !447, file: !3, line: 611, column: 9)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 610, column: 16)
!448 = distinct !DILexicalBlock(scope: !449, file: !3, line: 606, column: 11)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 605, column: 5)
!450 = distinct !DILexicalBlock(scope: !301, file: !3, line: 599, column: 7)
!451 = !DILocalVariable(name: "v", scope: !452, file: !3, line: 663, type: !71)
!452 = distinct !DILexicalBlock(scope: !453, file: !3, line: 661, column: 5)
!453 = distinct !DILexicalBlock(scope: !301, file: !3, line: 658, column: 7)
!454 = !DIGlobalVariableExpression(var: !455)
!455 = distinct !DIGlobalVariable(name: "dulvl", scope: !301, file: !3, line: 503, type: !456, isLocal: true, isDefinition: true)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !3, line: 120, size: 512, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !457, file: !3, line: 123, baseType: !193, size: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !457, file: !3, line: 126, baseType: !193, size: 256, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !463, line: 47, flags: DIFlagFwdDecl)
!463 = !DIFile(filename: "./lib/exclude.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!464 = !DIGlobalVariableExpression(var: !465)
!465 = distinct !DIGlobalVariable(name: "Version", scope: !466, file: !467, line: 2, type: !58, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, globals: !469)
!467 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!468 = !{}
!469 = !{!464}
!470 = !DIGlobalVariableExpression(var: !471)
!471 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !472, file: !477, line: 69, type: !478, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !474, retainedTypes: !475, globals: !476)
!473 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!474 = !{!26}
!475 = !{!63, !62, !70}
!476 = !{!470}
!477 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !479, line: 55, baseType: !480)
!479 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{null}
!483 = !DIGlobalVariableExpression(var: !484)
!484 = distinct !DIGlobalVariable(name: "file_name", scope: !485, file: !490, line: 36, type: !58, isLocal: true, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, globals: !487)
!486 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!487 = !{!483, !488}
!488 = !DIGlobalVariableExpression(var: !489)
!489 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !485, file: !490, line: 46, type: !95, isLocal: true, isDefinition: true)
!490 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!491 = !DIGlobalVariableExpression(var: !492)
!492 = distinct !DIGlobalVariable(name: "exit_failure", scope: !493, file: !496, line: 24, type: !497, isDefinition: true)
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, globals: !495)
!494 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!495 = !{!491}
!496 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !79)
!498 = !DIGlobalVariableExpression(var: !499)
!499 = distinct !DIGlobalVariable(name: "default_tuning", scope: !500, file: !504, line: 130, type: !505, isLocal: true, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !502, globals: !503)
!501 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!502 = !{!65, !62, !63}
!503 = !{!498}
!504 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !507, line: 65, baseType: !508)
!507 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !507, line: 53, size: 160, elements: !509)
!509 = !{!510, !512, !513, !514, !515}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !508, file: !507, line: 58, baseType: !511, size: 32)
!511 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !508, file: !507, line: 59, baseType: !511, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !508, file: !507, line: 60, baseType: !511, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !508, file: !507, line: 61, baseType: !511, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !508, file: !507, line: 62, baseType: !95, size: 8, offset: 128)
!516 = !DIGlobalVariableExpression(var: !517)
!517 = distinct !DIGlobalVariable(name: "power_letter", scope: !518, file: !525, line: 36, type: !531, isLocal: true, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !520, retainedTypes: !521, globals: !522)
!519 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!520 = !{!5, !18}
!521 = !{!58}
!522 = !{!516, !523, !527}
!523 = !DIGlobalVariableExpression(var: !524)
!524 = distinct !DIGlobalVariable(name: "block_size_args", scope: !518, file: !525, line: 398, type: !526, isLocal: true, isDefinition: true)
!525 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 192, elements: !290)
!527 = !DIGlobalVariableExpression(var: !528)
!528 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !518, file: !525, line: 399, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 64, elements: !92)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 72, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 9)
!534 = !DIGlobalVariableExpression(var: !535)
!535 = distinct !DIGlobalVariable(name: "program_name", scope: !536, file: !540, line: 33, type: !58, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !538, globals: !539)
!537 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!538 = !{!62, !61}
!539 = !{!534}
!540 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!541 = !DIGlobalVariableExpression(var: !542)
!542 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !543, file: !570, line: 77, type: !605, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !545, retainedTypes: !566, globals: !567)
!544 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!545 = !{!26, !546, !551}
!546 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !27, line: 242, size: 32, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!549 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!550 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !552, line: 46, size: 32, elements: !553)
!552 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!554 = !DIEnumerator(name: "_ISupper", value: 256)
!555 = !DIEnumerator(name: "_ISlower", value: 512)
!556 = !DIEnumerator(name: "_ISalpha", value: 1024)
!557 = !DIEnumerator(name: "_ISdigit", value: 2048)
!558 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!559 = !DIEnumerator(name: "_ISspace", value: 8192)
!560 = !DIEnumerator(name: "_ISprint", value: 16384)
!561 = !DIEnumerator(name: "_ISgraph", value: 32768)
!562 = !DIEnumerator(name: "_ISblank", value: 1)
!563 = !DIEnumerator(name: "_IScntrl", value: 2)
!564 = !DIEnumerator(name: "_ISpunct", value: 4)
!565 = !DIEnumerator(name: "_ISalnum", value: 8)
!566 = !{!79, !337, !63, !61}
!567 = !{!541, !568, !575, !587, !589, !594, !601, !603}
!568 = !DIGlobalVariableExpression(var: !569)
!569 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !543, file: !570, line: 93, type: !571, isDefinition: true)
!570 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 320, elements: !573)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!573 = !{!574}
!574 = !DISubrange(count: 10)
!575 = !DIGlobalVariableExpression(var: !576)
!576 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !543, file: !570, line: 1043, type: !577, isDefinition: true)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !570, line: 57, size: 448, elements: !578)
!578 = !{!579, !580, !581, !585, !586}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !577, file: !570, line: 60, baseType: !26, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !577, file: !570, line: 63, baseType: !79, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !577, file: !570, line: 67, baseType: !582, size: 256, offset: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 256, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !577, file: !570, line: 70, baseType: !58, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !577, file: !570, line: 73, baseType: !58, size: 64, offset: 384)
!587 = !DIGlobalVariableExpression(var: !588)
!588 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !543, file: !570, line: 108, type: !577, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590)
!590 = distinct !DIGlobalVariable(name: "slot0", scope: !543, file: !570, line: 834, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 256)
!594 = !DIGlobalVariableExpression(var: !595)
!595 = distinct !DIGlobalVariable(name: "slotvec", scope: !543, file: !570, line: 837, type: !596, isLocal: true, isDefinition: true)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !570, line: 826, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !597, file: !570, line: 828, baseType: !63, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !597, file: !570, line: 829, baseType: !61, size: 64, offset: 64)
!601 = !DIGlobalVariableExpression(var: !602)
!602 = distinct !DIGlobalVariable(name: "nslots", scope: !543, file: !570, line: 835, type: !79, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604)
!604 = distinct !DIGlobalVariable(name: "slotvec0", scope: !543, file: !570, line: 836, type: !597, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 704, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 11)
!608 = !DIGlobalVariableExpression(var: !609)
!609 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !610, file: !613, line: 26, type: !614, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, globals: !612)
!611 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!612 = !{!608}
!613 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 47)
!617 = !DIGlobalVariableExpression(var: !618)
!618 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !619, file: !963, line: 120, type: !964, isLocal: true, isDefinition: true)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !621, retainedTypes: !960, globals: !962)
!620 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = !{!622}
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !623, line: 41, size: 32, elements: !624)
!623 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959}
!625 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!626 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!627 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!628 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!629 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!630 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!631 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!632 = !DIEnumerator(name: "DAY_1", value: 131079)
!633 = !DIEnumerator(name: "DAY_2", value: 131080)
!634 = !DIEnumerator(name: "DAY_3", value: 131081)
!635 = !DIEnumerator(name: "DAY_4", value: 131082)
!636 = !DIEnumerator(name: "DAY_5", value: 131083)
!637 = !DIEnumerator(name: "DAY_6", value: 131084)
!638 = !DIEnumerator(name: "DAY_7", value: 131085)
!639 = !DIEnumerator(name: "ABMON_1", value: 131086)
!640 = !DIEnumerator(name: "ABMON_2", value: 131087)
!641 = !DIEnumerator(name: "ABMON_3", value: 131088)
!642 = !DIEnumerator(name: "ABMON_4", value: 131089)
!643 = !DIEnumerator(name: "ABMON_5", value: 131090)
!644 = !DIEnumerator(name: "ABMON_6", value: 131091)
!645 = !DIEnumerator(name: "ABMON_7", value: 131092)
!646 = !DIEnumerator(name: "ABMON_8", value: 131093)
!647 = !DIEnumerator(name: "ABMON_9", value: 131094)
!648 = !DIEnumerator(name: "ABMON_10", value: 131095)
!649 = !DIEnumerator(name: "ABMON_11", value: 131096)
!650 = !DIEnumerator(name: "ABMON_12", value: 131097)
!651 = !DIEnumerator(name: "MON_1", value: 131098)
!652 = !DIEnumerator(name: "MON_2", value: 131099)
!653 = !DIEnumerator(name: "MON_3", value: 131100)
!654 = !DIEnumerator(name: "MON_4", value: 131101)
!655 = !DIEnumerator(name: "MON_5", value: 131102)
!656 = !DIEnumerator(name: "MON_6", value: 131103)
!657 = !DIEnumerator(name: "MON_7", value: 131104)
!658 = !DIEnumerator(name: "MON_8", value: 131105)
!659 = !DIEnumerator(name: "MON_9", value: 131106)
!660 = !DIEnumerator(name: "MON_10", value: 131107)
!661 = !DIEnumerator(name: "MON_11", value: 131108)
!662 = !DIEnumerator(name: "MON_12", value: 131109)
!663 = !DIEnumerator(name: "AM_STR", value: 131110)
!664 = !DIEnumerator(name: "PM_STR", value: 131111)
!665 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!666 = !DIEnumerator(name: "D_FMT", value: 131113)
!667 = !DIEnumerator(name: "T_FMT", value: 131114)
!668 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!669 = !DIEnumerator(name: "ERA", value: 131116)
!670 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!671 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!672 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!673 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!674 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!675 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!676 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!677 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!678 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!679 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!680 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!681 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!682 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!683 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!684 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!685 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!686 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!687 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!688 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!689 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!690 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!691 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!692 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!693 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!694 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!695 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!696 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!697 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!698 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!699 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!700 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!701 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!702 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!703 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!704 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!705 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!706 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!707 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!708 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!709 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!710 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!711 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!712 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!713 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!714 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!715 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!716 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!717 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!718 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!719 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!720 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!721 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!722 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!723 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!724 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!725 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!726 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!727 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!728 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!729 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!730 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!731 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!732 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!733 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!734 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!735 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!736 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!737 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!738 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!739 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!740 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!741 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!742 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!743 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!744 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!745 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!746 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!747 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!748 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!749 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!750 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!751 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!752 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!753 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!754 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!755 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!756 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!757 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!758 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!759 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!760 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!761 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!762 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!763 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!764 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!765 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!766 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!767 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!768 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!769 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!770 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!771 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!772 = !DIEnumerator(name: "CODESET", value: 14)
!773 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!774 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!775 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!776 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!819 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!820 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!821 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!822 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!823 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!824 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!825 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!826 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!827 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!828 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!829 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!830 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!831 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!844 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!845 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!846 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!847 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!848 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!849 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!850 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!851 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!852 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!853 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!854 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!855 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!856 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!857 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!858 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!859 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!860 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!861 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!862 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!863 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!864 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!865 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!866 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!883 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!884 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!887 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!888 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!889 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!890 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!891 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!892 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!893 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!894 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!895 = !DIEnumerator(name: "THOUSEP", value: 65537)
!896 = !DIEnumerator(name: "__GROUPING", value: 65538)
!897 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!898 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!899 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!900 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!901 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!902 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!903 = !DIEnumerator(name: "__YESSTR", value: 327682)
!904 = !DIEnumerator(name: "__NOSTR", value: 327683)
!905 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!906 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!907 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!908 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!909 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!910 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!911 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!912 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!913 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!914 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!915 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!916 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!917 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!918 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!919 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!920 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!921 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!922 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!923 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!924 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!925 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!926 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!927 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!928 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!929 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!930 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!931 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!932 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!933 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!934 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!935 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!936 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!937 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!938 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!939 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!940 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!941 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!942 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!943 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!958 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!959 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!960 = !{!62, !61, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!962 = !{!617}
!963 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!964 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!965 = !DIGlobalVariableExpression(var: !966)
!966 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !967, file: !971, line: 28, type: !972, isDefinition: true)
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !969, globals: !970)
!968 = !DIFile(filename: "./lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!969 = !{!70}
!970 = !{!965}
!971 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 256, elements: !583)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!974 = !DIGlobalVariableExpression(var: !975)
!975 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !976, file: !977, line: 335, type: !79, isLocal: true, isDefinition: true)
!976 = distinct !DISubprogram(name: "rpl_fcntl", scope: !977, file: !977, line: 272, type: !978, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !980, variables: !983)
!977 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!978 = !DISubroutineType(types: !979)
!979 = !{!79, !79, !79, null}
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, globals: !982)
!981 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!982 = !{!974}
!983 = !{!984, !985, !986, !997, !998, !1001, !1004, !1007}
!984 = !DILocalVariable(name: "fd", arg: 1, scope: !976, file: !977, line: 272, type: !79)
!985 = !DILocalVariable(name: "action", arg: 2, scope: !976, file: !977, line: 272, type: !79)
!986 = !DILocalVariable(name: "arg", scope: !976, file: !977, line: 274, type: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !988, line: 30, baseType: !989)
!988 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !981, line: 274, baseType: !990)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 192, elements: !370)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !981, line: 274, size: 192, elements: !992)
!992 = !{!993, !994, !995, !996}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !991, file: !981, line: 274, baseType: !352, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !991, file: !981, line: 274, baseType: !352, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !991, file: !981, line: 274, baseType: !62, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !991, file: !981, line: 274, baseType: !62, size: 64, offset: 128)
!997 = !DILocalVariable(name: "result", scope: !976, file: !977, line: 275, type: !79)
!998 = !DILocalVariable(name: "target", scope: !999, file: !977, line: 322, type: !79)
!999 = distinct !DILexicalBlock(scope: !1000, file: !977, line: 321, column: 7)
!1000 = distinct !DILexicalBlock(scope: !976, file: !977, line: 278, column: 5)
!1001 = !DILocalVariable(name: "flags", scope: !1002, file: !977, line: 359, type: !79)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !977, line: 358, column: 11)
!1003 = distinct !DILexicalBlock(scope: !999, file: !977, line: 357, column: 13)
!1004 = !DILocalVariable(name: "saved_errno", scope: !1005, file: !977, line: 362, type: !79)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !977, line: 361, column: 15)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !977, line: 360, column: 17)
!1007 = !DILocalVariable(name: "p", scope: !1008, file: !977, line: 404, type: !62)
!1008 = distinct !DILexicalBlock(scope: !1000, file: !977, line: 402, column: 7)
!1009 = !DIGlobalVariableExpression(var: !1010)
!1010 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !1011, file: !1021, line: 124, type: !1032, isLocal: true, isDefinition: true)
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1013, globals: !1018)
!1012 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1013 = !{!352, !79, !1014, !70, !1015, !337, !78, !65, !1016, !1017}
!1014 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1015 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1016 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1017 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1018 = !{!1019, !1025, !1028, !1009}
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !1024)
!1020 = distinct !DIGlobalVariable(name: "mktime_min", scope: !1011, file: !1021, line: 95, type: !1022, isLocal: true, isDefinition: true)
!1021 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !1021, line: 68, baseType: !78)
!1024 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !1027)
!1026 = distinct !DIGlobalVariable(name: "mktime_max", scope: !1011, file: !1021, line: 98, type: !1022, isLocal: true, isDefinition: true)
!1027 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!1028 = !DIGlobalVariableExpression(var: !1029)
!1029 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !1011, file: !1021, line: 462, type: !1030, isLocal: true, isDefinition: true)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !1031, line: 30, baseType: !75)
!1031 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 416, elements: !1034)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!1034 = !{!93, !1035}
!1035 = !DISubrange(count: 13)
!1036 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1037, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1038, retainedTypes: !1039)
!1037 = !DIFile(filename: "./lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1038 = !{!45}
!1039 = !{!62}
!1040 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1041, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1042, retainedTypes: !1079)
!1041 = !DIFile(filename: "./lib/di-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1042 = !{!1043, !1068}
!1043 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1045, file: !1044, line: 118, size: 32, elements: !1066)
!1044 = !DIFile(filename: "lib/di-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1045 = distinct !DISubprogram(name: "di_set_alloc", scope: !1044, file: !1044, line: 113, type: !1046, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !1040, variables: !1064)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !1044, line: 59, size: 192, elements: !1050)
!1050 = !{!1051, !1054, !1058}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dev_map", scope: !1049, file: !1044, line: 62, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !507, line: 67, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ino_map", scope: !1049, file: !1044, line: 67, baseType: !1055, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !1057, line: 15, flags: DIFlagFwdDecl)
!1057 = !DIFile(filename: "./lib/ino-map.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !1049, file: !1044, line: 71, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_ent", file: !1044, line: 52, size: 128, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1060, file: !1044, line: 54, baseType: !380, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ino_set", scope: !1060, file: !1044, line: 55, baseType: !1052, size: 64, offset: 64)
!1064 = !{!1065}
!1065 = !DILocalVariable(name: "dis", scope: !1045, file: !1044, line: 115, type: !1048)
!1066 = !{!1067}
!1067 = !DIEnumerator(name: "INITIAL_DEV_MAP_SIZE", value: 11)
!1068 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1069, file: !1044, line: 185, size: 32, elements: !1077)
!1069 = distinct !DISubprogram(name: "map_device", scope: !1044, file: !1044, line: 154, type: !1070, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !1040, variables: !1072)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!1052, !1048, !380}
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DILocalVariable(name: "dis", arg: 1, scope: !1069, file: !1044, line: 154, type: !1048)
!1074 = !DILocalVariable(name: "dev", arg: 2, scope: !1069, file: !1044, line: 154, type: !380)
!1075 = !DILocalVariable(name: "ent", scope: !1069, file: !1044, line: 157, type: !1059)
!1076 = !DILocalVariable(name: "probe", scope: !1069, file: !1044, line: 158, type: !1059)
!1077 = !{!1078}
!1078 = !DIEnumerator(name: "INITIAL_INO_SET_SIZE", value: 1021)
!1079 = !{!63, !66, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashint", file: !1044, line: 33, baseType: !63)
!1081 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1082, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1083, retainedTypes: !1102)
!1082 = !DIFile(filename: "./lib/exclude.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1083 = !{!1084, !551, !1089}
!1084 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !1085, line: 95, size: 32, elements: !1086)
!1085 = !DIFile(filename: "lib/exclude.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1086 = !{!1087, !1088}
!1087 = !DIEnumerator(name: "exclude_hash", value: 0)
!1088 = !DIEnumerator(name: "exclude_pattern", value: 1)
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1091, file: !1090, line: 192, size: 32, elements: !1100)
!1090 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1091 = distinct !DISubprogram(name: "x2nrealloc", scope: !1090, file: !1090, line: 180, type: !1092, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !1081, variables: !1095)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!62, !62, !1094, !63}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!1095 = !{!1096, !1097, !1098, !1099}
!1096 = !DILocalVariable(name: "p", arg: 1, scope: !1091, file: !1090, line: 180, type: !62)
!1097 = !DILocalVariable(name: "pn", arg: 2, scope: !1091, file: !1090, line: 180, type: !1094)
!1098 = !DILocalVariable(name: "s", arg: 3, scope: !1091, file: !1090, line: 180, type: !63)
!1099 = !DILocalVariable(name: "n", scope: !1091, file: !1090, line: 182, type: !63)
!1100 = !{!1101}
!1101 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1102 = !{!61, !79, !70, !337, !63, !961}
!1103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1104, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1105)
!1104 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1105 = !{!63, !58, !352, !79, !70}
!1106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1107, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468)
!1107 = !DIFile(filename: "./lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1109, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1110, retainedTypes: !1133)
!1109 = !DIFile(filename: "./lib/ino-map.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1110 = !{!1111}
!1111 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1113, file: !1112, line: 89, size: 32, elements: !1131)
!1112 = !DIFile(filename: "lib/ino-map.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1113 = distinct !DISubprogram(name: "ino_map_alloc", scope: !1112, file: !1112, line: 83, type: !1114, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !1108, variables: !1128)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!1116, !63}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !1112, line: 38, size: 192, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1117, file: !1112, line: 42, baseType: !1052, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "next_mapped_ino", scope: !1117, file: !1112, line: 45, baseType: !63, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !1117, file: !1112, line: 49, baseType: !1122, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map_ent", file: !1112, line: 31, size: 128, elements: !1124)
!1124 = !{!1125, !1127}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1123, file: !1112, line: 33, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !334, line: 48, baseType: !348)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_ino", scope: !1123, file: !1112, line: 34, baseType: !63, size: 64, offset: 64)
!1128 = !{!1129, !1130}
!1129 = !DILocalVariable(name: "next_mapped_ino", arg: 1, scope: !1113, file: !1112, line: 83, type: !63)
!1130 = !DILocalVariable(name: "im", scope: !1113, file: !1112, line: 85, type: !1116)
!1131 = !{!1132}
!1132 = !DIEnumerator(name: "INITIAL_INO_MAP_TABLE_SIZE", value: 1021)
!1133 = !{!63}
!1134 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1135, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1136)
!1135 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1136 = !{!260}
!1137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1138, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1139, retainedTypes: !1140)
!1138 = !DIFile(filename: "./lib/mbscasecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1139 = !{!551}
!1140 = !{!79, !68, !337, !63, !70}
!1141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1142, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1143)
!1142 = !DIFile(filename: "./lib/mbuiter.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1143 = !{!63, !70}
!1144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1145, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1146)
!1145 = !DIFile(filename: "./lib/strnlen1.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1146 = !{!58, !62}
!1147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1148, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1149, retainedTypes: !1039)
!1148 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1149 = !{!1150}
!1150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1151, line: 41, size: 32, elements: !1152)
!1151 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1152 = !{!1153}
!1153 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!1154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1155, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1156, retainedTypes: !1164)
!1155 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1156 = !{!1157}
!1157 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1158, file: !1090, line: 192, size: 32, elements: !1100)
!1158 = distinct !DISubprogram(name: "x2nrealloc", scope: !1090, file: !1090, line: 180, type: !1092, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !1154, variables: !1159)
!1159 = !{!1160, !1161, !1162, !1163}
!1160 = !DILocalVariable(name: "p", arg: 1, scope: !1158, file: !1090, line: 180, type: !62)
!1161 = !DILocalVariable(name: "pn", arg: 2, scope: !1158, file: !1090, line: 180, type: !1094)
!1162 = !DILocalVariable(name: "s", arg: 3, scope: !1158, file: !1090, line: 180, type: !63)
!1163 = !DILocalVariable(name: "n", scope: !1158, file: !1090, line: 182, type: !63)
!1164 = !{!63, !61, !62}
!1165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1166, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468)
!1166 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1168, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1039)
!1168 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1170, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1171, retainedTypes: !1172)
!1170 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1171 = !{!18}
!1172 = !{!61}
!1173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1174, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1175, retainedTypes: !1176)
!1174 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1175 = !{!18, !551}
!1176 = !{!79, !337, !61}
!1177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1178, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1171)
!1178 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1180, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1175, retainedTypes: !1176)
!1180 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1182, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1039)
!1182 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1184, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468)
!1184 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1186, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1039)
!1186 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1188, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468)
!1188 = !DIFile(filename: "./lib/freopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1190, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !1039)
!1190 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1192, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !1193, retainedTypes: !1319)
!1192 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1193 = !{!1194, !1199, !1302, !1305, !1316}
!1194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !1195, line: 160, size: 32, elements: !1196)
!1195 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1196 = !{!1197, !1198}
!1197 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1198 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1199 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1201, file: !1200, line: 54, size: 32, elements: !1300)
!1200 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1201 = distinct !DISubprogram(name: "setup_dir", scope: !1200, file: !1200, line: 50, type: !1202, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !1191, variables: !1298)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!95, !1204}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !306, line: 199, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 80, size: 1024, elements: !1207)
!1207 = !{!1208, !1254, !1255, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1270, !1271, !1272, !1289}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1206, file: !306, line: 81, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !306, line: 201, size: 2112, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1253}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1210, file: !306, line: 202, baseType: !1209, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1210, file: !306, line: 203, baseType: !1209, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1210, file: !306, line: 204, baseType: !1209, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1210, file: !306, line: 205, baseType: !317, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1210, file: !306, line: 208, baseType: !78, size: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1210, file: !306, line: 209, baseType: !62, size: 64, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1210, file: !306, line: 210, baseType: !61, size: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1210, file: !306, line: 211, baseType: !61, size: 64, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1210, file: !306, line: 212, baseType: !79, size: 32, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1210, file: !306, line: 213, baseType: !79, size: 32, offset: 544)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1210, file: !306, line: 214, baseType: !63, size: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1210, file: !306, line: 216, baseType: !1204, size: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1210, file: !306, line: 220, baseType: !330, size: 64, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1210, file: !306, line: 222, baseType: !63, size: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !1210, file: !306, line: 223, baseType: !333, size: 64, offset: 832)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1210, file: !306, line: 239, baseType: !337, size: 16, offset: 896)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1210, file: !306, line: 243, baseType: !337, size: 16, offset: 912)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1210, file: !306, line: 249, baseType: !337, size: 16, offset: 928)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1210, file: !306, line: 251, baseType: !1231, size: 1152, offset: 960)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1232, size: 1152, elements: !370)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !343, line: 46, size: 1152, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1250, !1251, !1252}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1232, file: !343, line: 48, baseType: !346, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1232, file: !343, line: 53, baseType: !348, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1232, file: !343, line: 61, baseType: !335, size: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1232, file: !343, line: 62, baseType: !351, size: 32, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1232, file: !343, line: 64, baseType: !354, size: 32, offset: 224)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1232, file: !343, line: 65, baseType: !356, size: 32, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1232, file: !343, line: 67, baseType: !79, size: 32, offset: 288)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1232, file: !343, line: 69, baseType: !346, size: 64, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1232, file: !343, line: 74, baseType: !360, size: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1232, file: !343, line: 78, baseType: !362, size: 64, offset: 448)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1232, file: !343, line: 80, baseType: !364, size: 64, offset: 512)
