!llvm.dbg.cu = !{!2, !87, !240, !246, !254, !675, !261, !268, !678, !321, !686, !697, !699, !701, !703, !705, !707, !709, !712, !714, !330}
!llvm.ident = !{!717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717}
!llvm.module.flags = !{!718, !719, !720, !721}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 51, type: !82, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !37)
!3 = !DIFile(filename: "src/expand.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!8 = !DIEnumerator(name: "_ISupper", value: 256)
!9 = !DIEnumerator(name: "_ISlower", value: 512)
!10 = !DIEnumerator(name: "_ISalpha", value: 1024)
!11 = !DIEnumerator(name: "_ISdigit", value: 2048)
!12 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!13 = !DIEnumerator(name: "_ISspace", value: 8192)
!14 = !DIEnumerator(name: "_ISprint", value: 16384)
!15 = !DIEnumerator(name: "_ISgraph", value: 32768)
!16 = !DIEnumerator(name: "_ISblank", value: 1)
!17 = !DIEnumerator(name: "_IScntrl", value: 2)
!18 = !DIEnumerator(name: "_ISpunct", value: 4)
!19 = !DIEnumerator(name: "_ISalnum", value: 8)
!20 = !{!21, !23, !24, !27, !29, !32, !34, !35, !36, !31}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 62, baseType: !26)
!25 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!26 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!37 = !{!38, !0, !68}
!38 = !DIGlobalVariableExpression(var: !39)
!39 = distinct !DIGlobalVariable(name: "infomap", scope: !40, file: !41, line: 632, type: !65, isLocal: true, isDefinition: true)
!40 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !41, file: !41, line: 630, type: !42, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !44)
!41 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!42 = !DISubroutineType(types: !43)
!43 = !{null, !32}
!44 = !{!45, !46, !47, !54, !56, !57, !58, !61, !62, !64}
!45 = !DILocalVariable(name: "program", arg: 1, scope: !40, file: !41, line: 630, type: !32)
!46 = !DILocalVariable(name: "node", scope: !40, file: !41, line: 642, type: !32)
!47 = !DILocalVariable(name: "map_prog", scope: !40, file: !41, line: 643, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !40, file: !41, line: 632, size: 128, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !50, file: !41, line: 632, baseType: !32, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !50, file: !41, line: 632, baseType: !32, size: 64, offset: 64)
!54 = !DILocalVariable(name: "__s1_len", scope: !55, file: !41, line: 645, type: !24)
!55 = distinct !DILexicalBlock(scope: !40, file: !41, line: 645, column: 33)
!56 = !DILocalVariable(name: "__s2_len", scope: !55, file: !41, line: 645, type: !24)
!57 = !DILocalVariable(name: "lc_messages", scope: !40, file: !41, line: 655, type: !32)
!58 = !DILocalVariable(name: "__s1_len", scope: !59, file: !41, line: 656, type: !24)
!59 = distinct !DILexicalBlock(scope: !60, file: !41, line: 656, column: 22)
!60 = distinct !DILexicalBlock(scope: !40, file: !41, line: 656, column: 7)
!61 = !DILocalVariable(name: "__s2_len", scope: !59, file: !41, line: 656, type: !24)
!62 = !DILocalVariable(name: "__s2", scope: !63, file: !41, line: 656, type: !29)
!63 = distinct !DILexicalBlock(scope: !59, file: !41, line: 656, column: 22)
!64 = !DILocalVariable(name: "__result", scope: !63, file: !41, line: 656, type: !34)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 896, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 7)
!68 = !DIGlobalVariableExpression(var: !69)
!69 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 53, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1280, elements: !80)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !73, line: 104, size: 256, elements: !74)
!73 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !{!75, !76, !77, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 106, baseType: !32, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !72, file: !73, line: 109, baseType: !34, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !73, line: 110, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !72, file: !73, line: 111, baseType: !34, size: 32, offset: 192)
!80 = !{!81}
!81 = !DISubrange(count: 5)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 272, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 34)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !87, file: !88, line: 32, type: !229, isDefinition: true)
!87 = distinct !DICompileUnit(language: DW_LANG_C99, file: !88, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !126, globals: !133)
!88 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!89 = !{!5, !90, !104, !113}
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !91, line: 32, size: 32, elements: !92)
!91 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!93 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!94 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!95 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!96 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!97 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!98 = !DIEnumerator(name: "c_quoting_style", value: 5)
!99 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!100 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!101 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!102 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!103 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 45, size: 32, elements: !106)
!105 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !{!107, !108, !109, !110, !111, !112}
!107 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!108 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!109 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!110 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!111 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!112 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !115, file: !114, line: 192, size: 32, elements: !124)
!114 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!115 = distinct !DISubprogram(name: "x2nrealloc", scope: !114, file: !114, line: 180, type: !116, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !119)
!116 = !DISubroutineType(types: !117)
!117 = !{!23, !23, !118, !24}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(name: "p", arg: 1, scope: !115, file: !114, line: 180, type: !23)
!121 = !DILocalVariable(name: "pn", arg: 2, scope: !115, file: !114, line: 180, type: !118)
!122 = !DILocalVariable(name: "s", arg: 3, scope: !115, file: !114, line: 180, type: !24)
!123 = !DILocalVariable(name: "n", scope: !115, file: !114, line: 182, type: !24)
!124 = !{!125}
!125 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!126 = !{!34, !35, !127, !128, !23, !129, !24, !27, !29, !32}
!127 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !130, line: 136, baseType: !131)
!130 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !132, line: 62, baseType: !26)
!132 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!133 = !{!85, !134, !136, !215, !217, !219, !221, !223, !225, !227, !230, !235}
!134 = !DIGlobalVariableExpression(var: !135)
!135 = distinct !DIGlobalVariable(name: "exit_status", scope: !87, file: !88, line: 68, type: !34, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "prev_file", scope: !138, file: !88, line: 280, type: !21, isLocal: true, isDefinition: true)
!138 = distinct !DISubprogram(name: "next_file", scope: !88, file: !88, line: 278, type: !139, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !195)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 49, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 241, size: 1728, elements: !146)
!145 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !167, !168, !169, !170, !173, !174, !176, !180, !183, !185, !186, !187, !188, !189, !190, !191}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 242, baseType: !34, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 247, baseType: !21, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 248, baseType: !21, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 249, baseType: !21, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 250, baseType: !21, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 251, baseType: !21, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 252, baseType: !21, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 253, baseType: !21, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 254, baseType: !21, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 256, baseType: !21, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 257, baseType: !21, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 258, baseType: !21, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 260, baseType: !160, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 156, size: 192, elements: !162)
!162 = !{!163, !164, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !161, file: !145, line: 157, baseType: !160, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !161, file: !145, line: 158, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !161, file: !145, line: 162, baseType: !34, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 262, baseType: !165, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 264, baseType: !34, size: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 268, baseType: !34, size: 32, offset: 928)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 270, baseType: !171, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !132, line: 140, baseType: !172)
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 274, baseType: !35, size: 16, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 275, baseType: !175, size: 8, offset: 1040)
!175 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 276, baseType: !177, size: 8, offset: 1048)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 1)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 280, baseType: !181, size: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 150, baseType: null)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 289, baseType: !184, size: 64, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !132, line: 141, baseType: !172)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !144, file: !145, line: 297, baseType: !23, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !144, file: !145, line: 298, baseType: !23, size: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !144, file: !145, line: 299, baseType: !23, size: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !144, file: !145, line: 300, baseType: !23, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 302, baseType: !24, size: 64, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 303, baseType: !34, size: 32, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 305, baseType: !192, size: 160, offset: 1568)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 20)
!195 = !{!196, !197, !198, !203, !204, !206, !207, !211, !212, !214}
!196 = !DILocalVariable(name: "fp", arg: 1, scope: !138, file: !88, line: 278, type: !141)
!197 = !DILocalVariable(name: "file", scope: !138, file: !88, line: 281, type: !21)
!198 = !DILocalVariable(name: "__s1_len", scope: !199, file: !88, line: 290, type: !24)
!199 = distinct !DILexicalBlock(scope: !200, file: !88, line: 290, column: 11)
!200 = distinct !DILexicalBlock(scope: !201, file: !88, line: 290, column: 11)
!201 = distinct !DILexicalBlock(scope: !202, file: !88, line: 284, column: 5)
!202 = distinct !DILexicalBlock(scope: !138, file: !88, line: 283, column: 7)
!203 = !DILocalVariable(name: "__s2_len", scope: !199, file: !88, line: 290, type: !24)
!204 = !DILocalVariable(name: "__s2", scope: !205, file: !88, line: 290, type: !29)
!205 = distinct !DILexicalBlock(scope: !199, file: !88, line: 290, column: 11)
!206 = !DILocalVariable(name: "__result", scope: !205, file: !88, line: 290, type: !34)
!207 = !DILocalVariable(name: "__s1_len", scope: !208, file: !88, line: 301, type: !24)
!208 = distinct !DILexicalBlock(scope: !209, file: !88, line: 301, column: 11)
!209 = distinct !DILexicalBlock(scope: !210, file: !88, line: 301, column: 11)
!210 = distinct !DILexicalBlock(scope: !138, file: !88, line: 300, column: 5)
!211 = !DILocalVariable(name: "__s2_len", scope: !208, file: !88, line: 301, type: !24)
!212 = !DILocalVariable(name: "__s2", scope: !213, file: !88, line: 301, type: !29)
!213 = distinct !DILexicalBlock(scope: !208, file: !88, line: 301, column: 11)
!214 = !DILocalVariable(name: "__result", scope: !213, file: !88, line: 301, type: !34)
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "max_column_width", scope: !87, file: !88, line: 41, type: !24, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !87, file: !88, line: 53, type: !24, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220)
!220 = distinct !DIGlobalVariable(name: "tab_list", scope: !87, file: !88, line: 46, type: !128, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !87, file: !88, line: 49, type: !24, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "extend_size", scope: !87, file: !88, line: 38, type: !129, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226)
!226 = distinct !DIGlobalVariable(name: "tab_size", scope: !87, file: !88, line: 35, type: !129, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228)
!228 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !87, file: !88, line: 65, type: !229, isLocal: true, isDefinition: true)
!229 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !87, file: !88, line: 59, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 2)
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "file_list", scope: !87, file: !88, line: 56, type: !237, isLocal: true, isDefinition: true)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "Version", scope: !240, file: !241, line: 2, type: !32, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, globals: !243)
!241 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!242 = !{}
!243 = !{!238}
!244 = !DIGlobalVariableExpression(var: !245)
!245 = distinct !DIGlobalVariable(name: "file_name", scope: !246, file: !251, line: 36, type: !32, isLocal: true, isDefinition: true)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, globals: !248)
!247 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!248 = !{!244, !249}
!249 = !DIGlobalVariableExpression(var: !250)
!250 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !246, file: !251, line: 46, type: !229, isLocal: true, isDefinition: true)
!251 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "exit_failure", scope: !254, file: !257, line: 24, type: !258, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, globals: !256)
!255 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!256 = !{!252}
!257 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!258 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "program_name", scope: !261, file: !265, line: 33, type: !32, isDefinition: true)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, retainedTypes: !263, globals: !264)
!262 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !{!23, !21}
!264 = !{!259}
!265 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !268, file: !280, line: 77, type: !315, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !270, retainedTypes: !276, globals: !277)
!269 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !{!90, !271, !5}
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !91, line: 242, size: 32, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!274 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!275 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!276 = !{!34, !35, !24, !21}
!277 = !{!266, !278, !285, !297, !299, !304, !311, !313}
!278 = !DIGlobalVariableExpression(var: !279)
!279 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !268, file: !280, line: 93, type: !281, isDefinition: true)
!280 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 320, elements: !283)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!283 = !{!284}
!284 = !DISubrange(count: 10)
!285 = !DIGlobalVariableExpression(var: !286)
!286 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !268, file: !280, line: 1043, type: !287, isDefinition: true)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !280, line: 57, size: 448, elements: !288)
!288 = !{!289, !290, !291, !295, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !287, file: !280, line: 60, baseType: !90, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !280, line: 63, baseType: !34, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !287, file: !280, line: 67, baseType: !292, size: 256, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 256, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !287, file: !280, line: 70, baseType: !32, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !287, file: !280, line: 73, baseType: !32, size: 64, offset: 384)
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !268, file: !280, line: 108, type: !287, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300)
!300 = distinct !DIGlobalVariable(name: "slot0", scope: !268, file: !280, line: 834, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 256)
!304 = !DIGlobalVariableExpression(var: !305)
!305 = distinct !DIGlobalVariable(name: "slotvec", scope: !268, file: !280, line: 837, type: !306, isLocal: true, isDefinition: true)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !280, line: 826, size: 128, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !307, file: !280, line: 828, baseType: !24, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !307, file: !280, line: 829, baseType: !21, size: 64, offset: 64)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "nslots", scope: !268, file: !280, line: 835, type: !34, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314)
!314 = distinct !DIGlobalVariable(name: "slotvec0", scope: !268, file: !280, line: 836, type: !307, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 704, elements: !317)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!317 = !{!318}
!318 = !DISubrange(count: 11)
!319 = !DIGlobalVariableExpression(var: !320)
!320 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !321, file: !324, line: 26, type: !325, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, globals: !323)
!322 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!323 = !{!319}
!324 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 376, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 47)
!328 = !DIGlobalVariableExpression(var: !329)
!329 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !330, file: !673, line: 120, type: !674, isLocal: true, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !332, retainedTypes: !671, globals: !672)
!331 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!332 = !{!333}
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !334, line: 41, size: 32, elements: !335)
!334 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!336 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!337 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!338 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!339 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!340 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!341 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!342 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!343 = !DIEnumerator(name: "DAY_1", value: 131079)
!344 = !DIEnumerator(name: "DAY_2", value: 131080)
!345 = !DIEnumerator(name: "DAY_3", value: 131081)
!346 = !DIEnumerator(name: "DAY_4", value: 131082)
!347 = !DIEnumerator(name: "DAY_5", value: 131083)
!348 = !DIEnumerator(name: "DAY_6", value: 131084)
!349 = !DIEnumerator(name: "DAY_7", value: 131085)
!350 = !DIEnumerator(name: "ABMON_1", value: 131086)
!351 = !DIEnumerator(name: "ABMON_2", value: 131087)
!352 = !DIEnumerator(name: "ABMON_3", value: 131088)
!353 = !DIEnumerator(name: "ABMON_4", value: 131089)
!354 = !DIEnumerator(name: "ABMON_5", value: 131090)
!355 = !DIEnumerator(name: "ABMON_6", value: 131091)
!356 = !DIEnumerator(name: "ABMON_7", value: 131092)
!357 = !DIEnumerator(name: "ABMON_8", value: 131093)
!358 = !DIEnumerator(name: "ABMON_9", value: 131094)
!359 = !DIEnumerator(name: "ABMON_10", value: 131095)
!360 = !DIEnumerator(name: "ABMON_11", value: 131096)
!361 = !DIEnumerator(name: "ABMON_12", value: 131097)
!362 = !DIEnumerator(name: "MON_1", value: 131098)
!363 = !DIEnumerator(name: "MON_2", value: 131099)
!364 = !DIEnumerator(name: "MON_3", value: 131100)
!365 = !DIEnumerator(name: "MON_4", value: 131101)
!366 = !DIEnumerator(name: "MON_5", value: 131102)
!367 = !DIEnumerator(name: "MON_6", value: 131103)
!368 = !DIEnumerator(name: "MON_7", value: 131104)
!369 = !DIEnumerator(name: "MON_8", value: 131105)
!370 = !DIEnumerator(name: "MON_9", value: 131106)
!371 = !DIEnumerator(name: "MON_10", value: 131107)
!372 = !DIEnumerator(name: "MON_11", value: 131108)
!373 = !DIEnumerator(name: "MON_12", value: 131109)
!374 = !DIEnumerator(name: "AM_STR", value: 131110)
!375 = !DIEnumerator(name: "PM_STR", value: 131111)
!376 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!377 = !DIEnumerator(name: "D_FMT", value: 131113)
!378 = !DIEnumerator(name: "T_FMT", value: 131114)
!379 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!380 = !DIEnumerator(name: "ERA", value: 131116)
!381 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!382 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!383 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!384 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!385 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!386 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!387 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!388 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!389 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!390 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!391 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!392 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!393 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!394 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!395 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!396 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!397 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!398 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!399 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!400 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!401 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!402 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!403 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!404 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!405 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!406 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!407 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!408 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!409 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!410 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!411 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!412 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!413 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!414 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!415 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!416 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!417 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!418 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!419 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!420 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!421 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!422 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!423 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!424 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!425 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!426 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!427 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!428 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!429 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!430 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!431 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!432 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!433 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!434 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!435 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!436 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!437 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!438 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!439 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!440 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!441 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!442 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!443 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!444 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!445 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!446 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!447 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!448 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!449 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!450 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!451 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!452 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!453 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!454 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!455 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!456 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!457 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!458 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!459 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!460 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!461 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!462 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!463 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!464 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!465 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!466 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!467 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!469 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!470 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!471 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!472 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!473 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!474 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!475 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!476 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!477 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!478 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!479 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!480 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!481 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!482 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!483 = !DIEnumerator(name: "CODESET", value: 14)
!484 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!485 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!486 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!487 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!536 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!537 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!538 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!539 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!540 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!555 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!556 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!557 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!558 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!559 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!560 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!561 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!562 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!563 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!564 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!565 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!566 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!567 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!568 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!569 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!570 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!571 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!572 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!573 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!574 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!575 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!576 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!577 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!594 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!595 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!598 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!599 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!600 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!601 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!602 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!603 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!604 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!605 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!606 = !DIEnumerator(name: "THOUSEP", value: 65537)
!607 = !DIEnumerator(name: "__GROUPING", value: 65538)
!608 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!609 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!610 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!611 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!612 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!613 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!614 = !DIEnumerator(name: "__YESSTR", value: 327682)
!615 = !DIEnumerator(name: "__NOSTR", value: 327683)
!616 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!617 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!618 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!619 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!620 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!621 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!625 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!626 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!627 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!628 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!629 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!630 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!635 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!636 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!637 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!638 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!639 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!640 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!641 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!642 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!643 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!644 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!646 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!647 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!648 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!649 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!650 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!651 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!652 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!669 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!670 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!671 = !{!23, !21, !36}
!672 = !{!328}
!673 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !32)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !677)
!676 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!677 = !{!104}
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !680, retainedTypes: !685)
!679 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!680 = !{!681}
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !682, line: 41, size: 32, elements: !683)
!682 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!683 = !{!684}
!684 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!685 = !{!23}
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !688, retainedTypes: !696)
!687 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !{!689}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !690, file: !114, line: 192, size: 32, elements: !124)
!690 = distinct !DISubprogram(name: "x2nrealloc", scope: !114, file: !114, line: 180, type: !116, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !686, variables: !691)
!691 = !{!692, !693, !694, !695}
!692 = !DILocalVariable(name: "p", arg: 1, scope: !690, file: !114, line: 180, type: !23)
!693 = !DILocalVariable(name: "pn", arg: 2, scope: !690, file: !114, line: 180, type: !118)
!694 = !DILocalVariable(name: "s", arg: 3, scope: !690, file: !114, line: 180, type: !24)
!695 = !DILocalVariable(name: "n", scope: !690, file: !114, line: 182, type: !24)
!696 = !{!24, !21, !23}
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242)
!698 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242)
!700 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, retainedTypes: !685)
!702 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242)
!704 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, retainedTypes: !685)
!706 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, retainedTypes: !685)
!708 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, retainedTypes: !711)
!710 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !{!24}
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242)
!713 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !242, retainedTypes: !716)
!715 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!716 = !{!24, !27, !29, !32}
!717 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!718 = !{i32 2, !"Dwarf Version", i32 4}
!719 = !{i32 2, !"Debug Info Version", i32 3}
!720 = !{i32 1, !"PIC Level", i32 2}
!721 = !{i32 1, !"PIE Level", i32 2}
!722 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 63, type: !723, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !34}
!725 = !{!726}
!726 = !DILocalVariable(name: "status", arg: 1, scope: !722, file: !3, line: 63, type: !34)
!727 = !DIExpression()
!728 = !DILocation(line: 63, column: 12, scope: !722)
!729 = !DILocation(line: 65, column: 14, scope: !730)
!730 = distinct !DILexicalBlock(scope: !722, file: !3, line: 65, column: 7)
!731 = !DILocation(line: 65, column: 7, scope: !722)
!732 = !DILocation(line: 66, column: 5, scope: !733)
!733 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 1)
!734 = distinct !DILexicalBlock(scope: !730, file: !3, line: 66, column: 5)
!735 = !{!736, !736, i64 0}
!736 = !{!"any pointer", !737, i64 0}
!737 = !{!"omnipotent char", !738, i64 0}
!738 = !{!"Simple C/C++ TBAA"}
!739 = !DILocation(line: 66, column: 5, scope: !740)
!740 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 3)
!741 = !DILocation(line: 66, column: 5, scope: !742)
!742 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 2)
!743 = !DILocation(line: 69, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !730, file: !3, line: 68, column: 5)
!745 = !DILocation(line: 69, column: 7, scope: !746)
!746 = !DILexicalBlockFile(scope: !744, file: !3, discriminator: 1)
!747 = !DILocation(line: 73, column: 7, scope: !744)
!748 = !DILocation(line: 73, column: 7, scope: !746)
!749 = !DILocation(line: 580, column: 3, scope: !750, inlinedAt: !753)
!750 = distinct !DISubprogram(name: "emit_stdin_note", scope: !41, file: !41, line: 578, type: !751, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !242)
!751 = !DISubroutineType(types: !752)
!752 = !{null}
!753 = distinct !DILocation(line: 77, column: 7, scope: !744)
!754 = !DILocation(line: 580, column: 3, scope: !755, inlinedAt: !753)
!755 = !DILexicalBlockFile(scope: !750, file: !41, discriminator: 1)
!756 = !DILocation(line: 587, column: 3, scope: !757, inlinedAt: !758)
!757 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !41, file: !41, line: 585, type: !751, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !242)
!758 = distinct !DILocation(line: 78, column: 7, scope: !744)
!759 = !DILocation(line: 587, column: 3, scope: !760, inlinedAt: !758)
!760 = !DILexicalBlockFile(scope: !757, file: !41, discriminator: 1)
!761 = !DILocation(line: 80, column: 7, scope: !744)
!762 = !DILocation(line: 80, column: 7, scope: !746)
!763 = !DILocation(line: 84, column: 7, scope: !744)
!764 = !DILocation(line: 84, column: 7, scope: !746)
!765 = !DILocation(line: 87, column: 7, scope: !744)
!766 = !DILocation(line: 87, column: 7, scope: !746)
!767 = !DILocation(line: 88, column: 7, scope: !744)
!768 = !DILocation(line: 88, column: 7, scope: !746)
!769 = !DILocation(line: 642, column: 15, scope: !40, inlinedAt: !770)
!770 = distinct !DILocation(line: 89, column: 7, scope: !744)
!771 = !DILocation(line: 651, column: 3, scope: !40, inlinedAt: !770)
!772 = !DILocation(line: 651, column: 3, scope: !773, inlinedAt: !770)
!773 = !DILexicalBlockFile(scope: !40, file: !41, discriminator: 1)
!774 = !DILocation(line: 655, column: 29, scope: !40, inlinedAt: !770)
!775 = !DILocation(line: 655, column: 15, scope: !40, inlinedAt: !770)
!776 = !DILocation(line: 656, column: 7, scope: !60, inlinedAt: !770)
!777 = !DILocation(line: 656, column: 19, scope: !60, inlinedAt: !770)
!778 = !DILocation(line: 656, column: 22, scope: !779, inlinedAt: !770)
!779 = !DILexicalBlockFile(scope: !60, file: !41, discriminator: 16)
!780 = !DILocation(line: 656, column: 7, scope: !781, inlinedAt: !770)
!781 = !DILexicalBlockFile(scope: !40, file: !41, discriminator: 16)
!782 = !DILocation(line: 662, column: 7, scope: !783, inlinedAt: !770)
!783 = distinct !DILexicalBlock(scope: !60, file: !41, line: 657, column: 5)
!784 = !DILocation(line: 662, column: 7, scope: !785, inlinedAt: !770)
!785 = !DILexicalBlockFile(scope: !783, file: !41, discriminator: 1)
!786 = !DILocation(line: 664, column: 5, scope: !783, inlinedAt: !770)
!787 = !DILocation(line: 665, column: 3, scope: !40, inlinedAt: !770)
!788 = !DILocation(line: 665, column: 3, scope: !773, inlinedAt: !770)
!789 = !DILocation(line: 667, column: 3, scope: !40, inlinedAt: !770)
!790 = !DILocation(line: 667, column: 3, scope: !773, inlinedAt: !770)
!791 = !DILocation(line: 91, column: 3, scope: !722)
!792 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 184, type: !793, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!34, !34, !237}
!795 = !{!796, !797, !798, !799}
!796 = !DILocalVariable(name: "argc", arg: 1, scope: !792, file: !3, line: 184, type: !34)
!797 = !DILocalVariable(name: "argv", arg: 2, scope: !792, file: !3, line: 184, type: !237)
!798 = !DILocalVariable(name: "c", scope: !792, file: !3, line: 186, type: !34)
!799 = !DILocalVariable(name: "tab_stop", scope: !800, file: !3, line: 215, type: !804)
!800 = distinct !DILexicalBlock(scope: !801, file: !3, line: 214, column: 13)
!801 = distinct !DILexicalBlock(scope: !802, file: !3, line: 211, column: 15)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 200, column: 9)
!803 = distinct !DILexicalBlock(scope: !792, file: !3, line: 198, column: 5)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 16, elements: !233)
!805 = !DILocation(line: 184, column: 11, scope: !792)
!806 = !DILocation(line: 184, column: 24, scope: !792)
!807 = !DILocation(line: 189, column: 21, scope: !792)
!808 = !DILocation(line: 189, column: 3, scope: !792)
!809 = !DILocation(line: 190, column: 3, scope: !792)
!810 = !DILocation(line: 191, column: 3, scope: !792)
!811 = !DILocation(line: 192, column: 3, scope: !792)
!812 = !DILocation(line: 194, column: 3, scope: !792)
!813 = !DILocation(line: 195, column: 23, scope: !792)
!814 = !{!815, !815, i64 0}
!815 = !{!"_Bool", !737, i64 0}
!816 = !DILocation(line: 197, column: 3, scope: !792)
!817 = !DILocation(line: 197, column: 15, scope: !818)
!818 = !DILexicalBlockFile(scope: !792, file: !3, discriminator: 1)
!819 = !DILocation(line: 186, column: 7, scope: !792)
!820 = !DILocation(line: 197, column: 3, scope: !818)
!821 = !DILocation(line: 202, column: 31, scope: !802)
!822 = !DILocation(line: 203, column: 11, scope: !802)
!823 = !DILocation(line: 206, column: 28, scope: !802)
!824 = !DILocation(line: 206, column: 11, scope: !802)
!825 = !DILocation(line: 207, column: 11, scope: !802)
!826 = !DILocation(line: 211, column: 15, scope: !801)
!827 = !DILocation(line: 211, column: 15, scope: !802)
!828 = !DILocation(line: 212, column: 37, scope: !801)
!829 = !DILocation(line: 212, column: 13, scope: !801)
!830 = distinct !{!830, !816, !831}
!831 = !DILocation(line: 229, column: 5, scope: !792)
!832 = !DILocation(line: 215, column: 15, scope: !800)
!833 = !DILocation(line: 215, column: 20, scope: !800)
!834 = !DILocation(line: 216, column: 29, scope: !800)
!835 = !DILocation(line: 216, column: 27, scope: !800)
!836 = !{!737, !737, i64 0}
!837 = !DILocation(line: 217, column: 27, scope: !800)
!838 = !DILocation(line: 218, column: 15, scope: !800)
!839 = !DILocation(line: 219, column: 13, scope: !801)
!840 = !DILocation(line: 222, column: 9, scope: !802)
!841 = !DILocation(line: 224, column: 9, scope: !802)
!842 = !DILocation(line: 224, column: 9, scope: !843)
!843 = !DILexicalBlockFile(scope: !802, file: !3, discriminator: 1)
!844 = !DILocation(line: 227, column: 11, scope: !802)
!845 = !DILocation(line: 231, column: 3, scope: !792)
!846 = !DILocation(line: 233, column: 20, scope: !792)
!847 = !{!848, !848, i64 0}
!848 = !{!"int", !737, i64 0}
!849 = !DILocation(line: 233, column: 27, scope: !792)
!850 = !DILocation(line: 233, column: 38, scope: !818)
!851 = !DILocation(line: 233, column: 19, scope: !792)
!852 = !DILocation(line: 233, column: 3, scope: !853)
!853 = !DILexicalBlockFile(scope: !792, file: !3, discriminator: 3)
!854 = !DILocation(line: 102, column: 14, scope: !855, inlinedAt: !910)
!855 = distinct !DISubprogram(name: "expand", scope: !3, file: !3, line: 99, type: !751, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !856)
!856 = !{!857, !898, !900, !901, !902, !903, !909}
!857 = !DILocalVariable(name: "fp", scope: !855, file: !3, line: 102, type: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 49, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 241, size: 1728, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !860, file: !145, line: 242, baseType: !34, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !860, file: !145, line: 247, baseType: !21, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !860, file: !145, line: 248, baseType: !21, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !860, file: !145, line: 249, baseType: !21, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !860, file: !145, line: 250, baseType: !21, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !860, file: !145, line: 251, baseType: !21, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !860, file: !145, line: 252, baseType: !21, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !860, file: !145, line: 253, baseType: !21, size: 64, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !860, file: !145, line: 254, baseType: !21, size: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !860, file: !145, line: 256, baseType: !21, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !860, file: !145, line: 257, baseType: !21, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !860, file: !145, line: 258, baseType: !21, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !860, file: !145, line: 260, baseType: !875, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 156, size: 192, elements: !877)
!877 = !{!878, !879, !881}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !876, file: !145, line: 157, baseType: !875, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !876, file: !145, line: 158, baseType: !880, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !876, file: !145, line: 162, baseType: !34, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !860, file: !145, line: 262, baseType: !880, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !860, file: !145, line: 264, baseType: !34, size: 32, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !860, file: !145, line: 268, baseType: !34, size: 32, offset: 928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !860, file: !145, line: 270, baseType: !171, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !860, file: !145, line: 274, baseType: !35, size: 16, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !860, file: !145, line: 275, baseType: !175, size: 8, offset: 1040)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !860, file: !145, line: 276, baseType: !177, size: 8, offset: 1048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !860, file: !145, line: 280, baseType: !181, size: 64, offset: 1088)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !860, file: !145, line: 289, baseType: !184, size: 64, offset: 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !860, file: !145, line: 297, baseType: !23, size: 64, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !860, file: !145, line: 298, baseType: !23, size: 64, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !860, file: !145, line: 299, baseType: !23, size: 64, offset: 1344)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !860, file: !145, line: 300, baseType: !23, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !860, file: !145, line: 302, baseType: !24, size: 64, offset: 1472)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !860, file: !145, line: 303, baseType: !34, size: 32, offset: 1536)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !860, file: !145, line: 305, baseType: !192, size: 160, offset: 1568)
!898 = !DILocalVariable(name: "c", scope: !899, file: !3, line: 110, type: !34)
!899 = distinct !DILexicalBlock(scope: !855, file: !3, line: 108, column: 5)
!900 = !DILocalVariable(name: "convert", scope: !899, file: !3, line: 113, type: !229)
!901 = !DILocalVariable(name: "column", scope: !899, file: !3, line: 120, type: !129)
!902 = !DILocalVariable(name: "tab_index", scope: !899, file: !3, line: 123, type: !24)
!903 = !DILocalVariable(name: "next_tab_column", scope: !904, file: !3, line: 138, type: !129)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 136, column: 17)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 135, column: 19)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 134, column: 13)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 133, column: 15)
!908 = distinct !DILexicalBlock(scope: !899, file: !3, line: 129, column: 9)
!909 = !DILocalVariable(name: "last_tab", scope: !904, file: !3, line: 139, type: !229)
!910 = distinct !DILocation(line: 235, column: 3, scope: !792)
!911 = !DILocation(line: 102, column: 9, scope: !855, inlinedAt: !910)
!912 = !DILocation(line: 104, column: 8, scope: !913, inlinedAt: !910)
!913 = distinct !DILexicalBlock(scope: !855, file: !3, line: 104, column: 7)
!914 = !DILocation(line: 104, column: 7, scope: !855, inlinedAt: !910)
!915 = !DILocation(line: 113, column: 12, scope: !899, inlinedAt: !910)
!916 = !DILocation(line: 120, column: 17, scope: !899, inlinedAt: !910)
!917 = !DILocation(line: 123, column: 7, scope: !899, inlinedAt: !910)
!918 = !DILocation(line: 123, column: 14, scope: !899, inlinedAt: !910)
!919 = !{!920, !920, i64 0}
!920 = !{!"long", !737, i64 0}
!921 = !DILocation(line: 128, column: 7, scope: !899, inlinedAt: !910)
!922 = distinct !{!922, !923, !924}
!923 = !DILocation(line: 128, column: 7, scope: !899)
!924 = !DILocation(line: 179, column: 23, scope: !899)
!925 = !DILocation(line: 130, column: 11, scope: !908, inlinedAt: !910)
!926 = !DILocalVariable(name: "__fp", arg: 1, scope: !927, file: !928, line: 63, type: !858)
!927 = distinct !DISubprogram(name: "getc_unlocked", scope: !928, file: !928, line: 63, type: !929, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !931)
!928 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!929 = !DISubroutineType(types: !930)
!930 = !{!34, !858}
!931 = !{!926}
!932 = !DILocation(line: 63, column: 22, scope: !927, inlinedAt: !933)
!933 = distinct !DILocation(line: 130, column: 23, scope: !934, inlinedAt: !910)
!934 = !DILexicalBlockFile(scope: !908, file: !3, discriminator: 1)
!935 = !DILocation(line: 65, column: 10, scope: !927, inlinedAt: !933)
!936 = !{!937, !736, i64 8}
!937 = !{!"_IO_FILE", !848, i64 0, !736, i64 8, !736, i64 16, !736, i64 24, !736, i64 32, !736, i64 40, !736, i64 48, !736, i64 56, !736, i64 64, !736, i64 72, !736, i64 80, !736, i64 88, !736, i64 96, !736, i64 104, !848, i64 112, !848, i64 116, !920, i64 120, !938, i64 128, !737, i64 130, !737, i64 131, !736, i64 136, !920, i64 144, !736, i64 152, !736, i64 160, !736, i64 168, !736, i64 176, !920, i64 184, !848, i64 192, !737, i64 196}
!938 = !{!"short", !737, i64 0}
!939 = !{!937, !736, i64 16}
!940 = !{!"branch_weights", i32 2000, i32 1}
!941 = !DILocation(line: 65, column: 10, scope: !942, inlinedAt: !933)
!942 = !DILexicalBlockFile(scope: !927, file: !928, discriminator: 2)
!943 = !DILocation(line: 110, column: 11, scope: !899, inlinedAt: !910)
!944 = !DILocation(line: 130, column: 38, scope: !934, inlinedAt: !910)
!945 = !DILocation(line: 65, column: 10, scope: !946, inlinedAt: !933)
!946 = !DILexicalBlockFile(scope: !927, file: !928, discriminator: 1)
!947 = !DILocation(line: 130, column: 34, scope: !934, inlinedAt: !910)
!948 = !DILocation(line: 130, column: 47, scope: !949, inlinedAt: !910)
!949 = !DILexicalBlockFile(scope: !908, file: !3, discriminator: 2)
!950 = !DILocation(line: 130, column: 38, scope: !949, inlinedAt: !910)
!951 = !DILocation(line: 130, column: 11, scope: !952, inlinedAt: !910)
!952 = !DILexicalBlockFile(scope: !908, file: !3, discriminator: 3)
!953 = distinct !{!953, !954, !955}
!954 = !DILocation(line: 130, column: 11, scope: !908)
!955 = !DILocation(line: 131, column: 13, scope: !908)
!956 = !DILocation(line: 133, column: 15, scope: !907, inlinedAt: !910)
!957 = !DILocation(line: 133, column: 15, scope: !908, inlinedAt: !910)
!958 = !DILocation(line: 135, column: 19, scope: !906, inlinedAt: !910)
!959 = !DIExpression(DW_OP_deref)
!960 = !DILocation(line: 139, column: 24, scope: !904, inlinedAt: !910)
!961 = !DILocation(line: 139, column: 19, scope: !904, inlinedAt: !910)
!962 = !DILocation(line: 141, column: 37, scope: !904, inlinedAt: !910)
!963 = !DILocation(line: 138, column: 29, scope: !904, inlinedAt: !910)
!964 = !DILocation(line: 144, column: 23, scope: !965, inlinedAt: !910)
!965 = distinct !DILexicalBlock(scope: !904, file: !3, line: 144, column: 23)
!966 = !{i8 0, i8 2}
!967 = !DILocation(line: 145, column: 46, scope: !965, inlinedAt: !910)
!968 = !DILocation(line: 144, column: 23, scope: !904, inlinedAt: !910)
!969 = !DILocation(line: 147, column: 39, scope: !970, inlinedAt: !910)
!970 = distinct !DILexicalBlock(scope: !904, file: !3, line: 147, column: 23)
!971 = !DILocation(line: 147, column: 23, scope: !904, inlinedAt: !910)
!972 = !DILocation(line: 150, column: 35, scope: !973, inlinedAt: !910)
!973 = !DILexicalBlockFile(scope: !904, file: !3, discriminator: 1)
!974 = !DILocation(line: 150, column: 19, scope: !973, inlinedAt: !910)
!975 = !DILocation(line: 105, column: 23, scope: !976, inlinedAt: !981)
!976 = distinct !DISubprogram(name: "putchar_unlocked", scope: !928, file: !928, line: 105, type: !977, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !979)
!977 = !DISubroutineType(types: !978)
!978 = !{!34, !34}
!979 = !{!980}
!980 = !DILocalVariable(name: "__c", arg: 1, scope: !976, file: !928, line: 105, type: !34)
!981 = distinct !DILocation(line: 151, column: 25, scope: !982, inlinedAt: !910)
!982 = distinct !DILexicalBlock(scope: !904, file: !3, line: 151, column: 25)
!983 = !DILocation(line: 148, column: 21, scope: !970, inlinedAt: !910)
!984 = !DILocation(line: 148, column: 21, scope: !985, inlinedAt: !910)
!985 = !DILexicalBlockFile(scope: !970, file: !3, discriminator: 1)
!986 = !DILocation(line: 107, column: 10, scope: !976, inlinedAt: !981)
!987 = !{!937, !736, i64 40}
!988 = !{!937, !736, i64 48}
!989 = !DILocation(line: 107, column: 10, scope: !990, inlinedAt: !981)
!990 = !DILexicalBlockFile(scope: !976, file: !928, discriminator: 2)
!991 = !DILocation(line: 151, column: 25, scope: !904, inlinedAt: !910)
!992 = !DILocation(line: 107, column: 10, scope: !993, inlinedAt: !981)
!993 = !DILexicalBlockFile(scope: !976, file: !928, discriminator: 1)
!994 = !DILocation(line: 151, column: 39, scope: !982, inlinedAt: !910)
!995 = !DILocation(line: 150, column: 26, scope: !973, inlinedAt: !910)
!996 = distinct !{!996, !997, !998}
!997 = !DILocation(line: 150, column: 19, scope: !904)
!998 = !DILocation(line: 152, column: 23, scope: !904)
!999 = !DILocation(line: 152, column: 23, scope: !982, inlinedAt: !910)
!1000 = !DILocation(line: 152, column: 23, scope: !1001, inlinedAt: !910)
!1001 = !DILexicalBlockFile(scope: !982, file: !3, discriminator: 1)
!1002 = !DILocation(line: 152, column: 23, scope: !1003, inlinedAt: !910)
!1003 = !DILexicalBlockFile(scope: !982, file: !3, discriminator: 2)
!1004 = !DILocation(line: 155, column: 17, scope: !905, inlinedAt: !910)
!1005 = !DILocation(line: 155, column: 17, scope: !904, inlinedAt: !910)
!1006 = !DILocation(line: 160, column: 30, scope: !1007, inlinedAt: !910)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 157, column: 17)
!1008 = distinct !DILexicalBlock(scope: !905, file: !3, line: 156, column: 24)
!1009 = !DILocation(line: 160, column: 29, scope: !1007, inlinedAt: !910)
!1010 = !DILocation(line: 160, column: 26, scope: !1007, inlinedAt: !910)
!1011 = !DILocation(line: 161, column: 34, scope: !1007, inlinedAt: !910)
!1012 = !DILocation(line: 161, column: 33, scope: !1007, inlinedAt: !910)
!1013 = !DILocation(line: 161, column: 32, scope: !1007, inlinedAt: !910)
!1014 = !DILocation(line: 161, column: 29, scope: !1007, inlinedAt: !910)
!1015 = !DILocation(line: 162, column: 17, scope: !1007, inlinedAt: !910)
!1016 = !DILocation(line: 165, column: 25, scope: !1017, inlinedAt: !910)
!1017 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 164, column: 17)
!1018 = !DILocation(line: 166, column: 24, scope: !1019, inlinedAt: !910)
!1019 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 166, column: 23)
!1020 = !DILocation(line: 166, column: 23, scope: !1017, inlinedAt: !910)
!1021 = !DILocation(line: 167, column: 21, scope: !1019, inlinedAt: !910)
!1022 = !DILocation(line: 167, column: 21, scope: !1023, inlinedAt: !910)
!1023 = !DILexicalBlockFile(scope: !1019, file: !3, discriminator: 1)
!1024 = !DILocation(line: 170, column: 26, scope: !906, inlinedAt: !910)
!1025 = !DILocation(line: 170, column: 46, scope: !906, inlinedAt: !910)
!1026 = !DILocation(line: 170, column: 52, scope: !1027, inlinedAt: !910)
!1027 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 1)
!1028 = !{!938, !938, i64 0}
!1029 = !DILocation(line: 170, column: 50, scope: !1027, inlinedAt: !910)
!1030 = !DILocation(line: 170, column: 46, scope: !1027, inlinedAt: !910)
!1031 = !DILocation(line: 170, column: 23, scope: !1032, inlinedAt: !910)
!1032 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 2)
!1033 = !DILocation(line: 171, column: 13, scope: !906, inlinedAt: !910)
!1034 = !DILocation(line: 173, column: 17, scope: !1035, inlinedAt: !910)
!1035 = distinct !DILexicalBlock(scope: !908, file: !3, line: 173, column: 15)
!1036 = !DILocation(line: 173, column: 15, scope: !908, inlinedAt: !910)
!1037 = !DILocation(line: 105, column: 23, scope: !976, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 176, column: 15, scope: !1039, inlinedAt: !910)
!1039 = distinct !DILexicalBlock(scope: !908, file: !3, line: 176, column: 15)
!1040 = !DILocation(line: 107, column: 10, scope: !976, inlinedAt: !1038)
!1041 = !DILocation(line: 107, column: 10, scope: !990, inlinedAt: !1038)
!1042 = !DILocation(line: 176, column: 15, scope: !908, inlinedAt: !910)
!1043 = !DILocation(line: 107, column: 10, scope: !993, inlinedAt: !1038)
!1044 = !DILocation(line: 176, column: 27, scope: !1039, inlinedAt: !910)
!1045 = !DILocation(line: 177, column: 13, scope: !1039, inlinedAt: !910)
!1046 = !DILocation(line: 177, column: 13, scope: !1047, inlinedAt: !910)
!1047 = !DILexicalBlockFile(scope: !1039, file: !3, discriminator: 1)
!1048 = !DILocation(line: 177, column: 13, scope: !1049, inlinedAt: !910)
!1049 = !DILexicalBlockFile(scope: !1039, file: !3, discriminator: 2)
!1050 = !DILocation(line: 179, column: 16, scope: !899, inlinedAt: !910)
!1051 = !DILocation(line: 178, column: 9, scope: !934, inlinedAt: !910)
!1052 = !DILocation(line: 180, column: 5, scope: !855, inlinedAt: !910)
!1053 = !DILocation(line: 237, column: 3, scope: !792)
!1054 = !DILocation(line: 239, column: 10, scope: !792)
!1055 = !DILocation(line: 239, column: 3, scope: !792)
!1056 = distinct !DISubprogram(name: "add_tab_stop", scope: !88, file: !88, line: 74, type: !1057, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !1059)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !129}
!1059 = !{!1060, !1061, !1062}
!1060 = !DILocalVariable(name: "tabval", arg: 1, scope: !1056, file: !88, line: 74, type: !129)
!1061 = !DILocalVariable(name: "prev_column", scope: !1056, file: !88, line: 76, type: !129)
!1062 = !DILocalVariable(name: "column_width", scope: !1056, file: !88, line: 77, type: !129)
!1063 = !DILocation(line: 74, column: 25, scope: !1056)
!1064 = !DILocation(line: 76, column: 27, scope: !1056)
!1065 = !DILocation(line: 76, column: 44, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1056, file: !88, discriminator: 1)
!1067 = !DILocation(line: 76, column: 68, scope: !1066)
!1068 = !DILocation(line: 76, column: 27, scope: !1066)
!1069 = !DILocation(line: 76, column: 27, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1056, file: !88, discriminator: 3)
!1071 = !DILocation(line: 76, column: 13, scope: !1056)
!1072 = !DILocation(line: 77, column: 40, scope: !1056)
!1073 = !DILocation(line: 77, column: 59, scope: !1066)
!1074 = !DILocation(line: 77, column: 28, scope: !1056)
!1075 = !DILocation(line: 77, column: 13, scope: !1056)
!1076 = !DILocation(line: 79, column: 25, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1056, file: !88, line: 79, column: 7)
!1078 = !DILocation(line: 79, column: 22, scope: !1077)
!1079 = !DILocation(line: 79, column: 7, scope: !1056)
!1080 = !DILocation(line: 80, column: 16, scope: !1077)
!1081 = !DILocation(line: 180, column: 19, scope: !115, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 80, column: 16, scope: !1077)
!1083 = !DILocation(line: 180, column: 30, scope: !115, inlinedAt: !1082)
!1084 = !DILocation(line: 180, column: 41, scope: !115, inlinedAt: !1082)
!1085 = !DILocation(line: 182, column: 10, scope: !115, inlinedAt: !1082)
!1086 = !DILocation(line: 184, column: 9, scope: !1087, inlinedAt: !1082)
!1087 = distinct !DILexicalBlock(scope: !115, file: !114, line: 184, column: 7)
!1088 = !DILocation(line: 184, column: 7, scope: !115, inlinedAt: !1082)
!1089 = !DILocation(line: 186, column: 11, scope: !1090, inlinedAt: !1082)
!1090 = distinct !DILexicalBlock(scope: !1087, file: !114, line: 185, column: 5)
!1091 = !DILocation(line: 205, column: 11, scope: !1092, inlinedAt: !1082)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !114, line: 204, column: 11)
!1093 = distinct !DILexicalBlock(scope: !1087, file: !114, line: 199, column: 5)
!1094 = !DILocation(line: 204, column: 11, scope: !1093, inlinedAt: !1082)
!1095 = !DILocation(line: 206, column: 9, scope: !1092, inlinedAt: !1082)
!1096 = !DILocation(line: 207, column: 14, scope: !1093, inlinedAt: !1082)
!1097 = !DILocation(line: 207, column: 18, scope: !1093, inlinedAt: !1082)
!1098 = !DILocation(line: 207, column: 9, scope: !1093, inlinedAt: !1082)
!1099 = !DILocation(line: 210, column: 7, scope: !115, inlinedAt: !1082)
!1100 = !DILocation(line: 211, column: 25, scope: !115, inlinedAt: !1082)
!1101 = !DILocation(line: 211, column: 10, scope: !115, inlinedAt: !1082)
!1102 = !DILocation(line: 80, column: 14, scope: !1077)
!1103 = !DILocation(line: 80, column: 5, scope: !1077)
!1104 = !DILocation(line: 81, column: 26, scope: !1056)
!1105 = !DILocation(line: 81, column: 3, scope: !1056)
!1106 = !DILocation(line: 81, column: 30, scope: !1056)
!1107 = !DILocation(line: 83, column: 7, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1056, file: !88, line: 83, column: 7)
!1109 = !DILocation(line: 83, column: 24, scope: !1108)
!1110 = !DILocation(line: 83, column: 7, scope: !1056)
!1111 = !DILocation(line: 87, column: 24, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1108, file: !88, line: 84, column: 5)
!1113 = !DILocation(line: 88, column: 5, scope: !1112)
!1114 = !DILocation(line: 89, column: 1, scope: !1056)
!1115 = distinct !DISubprogram(name: "parse_tab_stops", scope: !88, file: !88, line: 111, type: !42, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1133}
!1117 = !DILocalVariable(name: "stops", arg: 1, scope: !1115, file: !88, line: 111, type: !32)
!1118 = !DILocalVariable(name: "have_tabval", scope: !1115, file: !88, line: 113, type: !229)
!1119 = !DILocalVariable(name: "tabval", scope: !1115, file: !88, line: 114, type: !129)
!1120 = !DILocalVariable(name: "extend_tabval", scope: !1115, file: !88, line: 115, type: !229)
!1121 = !DILocalVariable(name: "num_start", scope: !1115, file: !88, line: 116, type: !32)
!1122 = !DILocalVariable(name: "ok", scope: !1115, file: !88, line: 117, type: !229)
!1123 = !DILocalVariable(name: "len", scope: !1124, file: !88, line: 160, type: !24)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !88, line: 159, column: 13)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !88, line: 158, column: 15)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !88, line: 149, column: 9)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !88, line: 148, column: 16)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !88, line: 138, column: 16)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !88, line: 121, column: 11)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !88, line: 120, column: 5)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !88, line: 119, column: 3)
!1132 = distinct !DILexicalBlock(scope: !1115, file: !88, line: 119, column: 3)
!1133 = !DILocalVariable(name: "bad_num", scope: !1124, file: !88, line: 161, type: !21)
!1134 = !DILocation(line: 111, column: 30, scope: !1115)
!1135 = !DILocation(line: 113, column: 8, scope: !1115)
!1136 = !DILocation(line: 114, column: 13, scope: !1115)
!1137 = !DILocation(line: 115, column: 8, scope: !1115)
!1138 = !DILocation(line: 116, column: 15, scope: !1115)
!1139 = !DILocation(line: 117, column: 8, scope: !1115)
!1140 = !DILocation(line: 119, column: 3, scope: !1115)
!1141 = !DILocation(line: 119, column: 10, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1131, file: !88, discriminator: 1)
!1143 = !DILocation(line: 119, column: 3, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1132, file: !88, discriminator: 1)
!1145 = !DILocation(line: 121, column: 28, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1129, file: !88, discriminator: 1)
!1147 = !DILocation(line: 121, column: 11, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1130, file: !88, discriminator: 1)
!1149 = !DILocation(line: 123, column: 15, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !88, line: 123, column: 15)
!1151 = distinct !DILexicalBlock(scope: !1129, file: !88, line: 122, column: 9)
!1152 = !DILocation(line: 123, column: 15, scope: !1151)
!1153 = !DILocation(line: 125, column: 19, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !88, line: 125, column: 19)
!1155 = distinct !DILexicalBlock(scope: !1150, file: !88, line: 124, column: 13)
!1156 = !DILocation(line: 125, column: 19, scope: !1155)
!1157 = !DILocalVariable(name: "tabval", arg: 1, scope: !1158, file: !88, line: 92, type: !129)
!1158 = distinct !DISubprogram(name: "set_extend_size", scope: !88, file: !88, line: 92, type: !1159, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !1161)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!229, !129}
!1161 = !{!1157, !1162}
!1162 = !DILocalVariable(name: "ok", scope: !1158, file: !88, line: 94, type: !229)
!1163 = !DILocation(line: 92, column: 28, scope: !1158, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 127, column: 25, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !88, line: 127, column: 23)
!1166 = distinct !DILexicalBlock(scope: !1154, file: !88, line: 126, column: 17)
!1167 = !DILocation(line: 94, column: 8, scope: !1158, inlinedAt: !1164)
!1168 = !DILocation(line: 96, column: 7, scope: !1169, inlinedAt: !1164)
!1169 = distinct !DILexicalBlock(scope: !1158, file: !88, line: 96, column: 7)
!1170 = !DILocation(line: 96, column: 7, scope: !1158, inlinedAt: !1164)
!1171 = !DILocation(line: 103, column: 15, scope: !1158, inlinedAt: !1164)
!1172 = !DILocation(line: 127, column: 23, scope: !1166)
!1173 = !DILocation(line: 99, column: 14, scope: !1174, inlinedAt: !1164)
!1174 = distinct !DILexicalBlock(scope: !1169, file: !88, line: 97, column: 5)
!1175 = !DILocation(line: 98, column: 7, scope: !1174, inlinedAt: !1164)
!1176 = !DILocation(line: 74, column: 25, scope: !1056, inlinedAt: !1177)
!1177 = distinct !DILocation(line: 134, column: 17, scope: !1154)
!1178 = !DILocation(line: 76, column: 27, scope: !1056, inlinedAt: !1177)
!1179 = !DILocation(line: 76, column: 44, scope: !1066, inlinedAt: !1177)
!1180 = !DILocation(line: 76, column: 68, scope: !1066, inlinedAt: !1177)
!1181 = !DILocation(line: 76, column: 27, scope: !1066, inlinedAt: !1177)
!1182 = !DILocation(line: 76, column: 27, scope: !1070, inlinedAt: !1177)
!1183 = !DILocation(line: 76, column: 13, scope: !1056, inlinedAt: !1177)
!1184 = !DILocation(line: 77, column: 40, scope: !1056, inlinedAt: !1177)
!1185 = !DILocation(line: 77, column: 59, scope: !1066, inlinedAt: !1177)
!1186 = !DILocation(line: 77, column: 28, scope: !1056, inlinedAt: !1177)
!1187 = !DILocation(line: 77, column: 13, scope: !1056, inlinedAt: !1177)
!1188 = !DILocation(line: 79, column: 25, scope: !1077, inlinedAt: !1177)
!1189 = !DILocation(line: 79, column: 22, scope: !1077, inlinedAt: !1177)
!1190 = !DILocation(line: 79, column: 7, scope: !1056, inlinedAt: !1177)
!1191 = !DILocation(line: 80, column: 16, scope: !1077, inlinedAt: !1177)
!1192 = !DILocation(line: 180, column: 19, scope: !115, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 80, column: 16, scope: !1077, inlinedAt: !1177)
!1194 = !DILocation(line: 180, column: 30, scope: !115, inlinedAt: !1193)
!1195 = !DILocation(line: 180, column: 41, scope: !115, inlinedAt: !1193)
!1196 = !DILocation(line: 182, column: 10, scope: !115, inlinedAt: !1193)
!1197 = !DILocation(line: 184, column: 9, scope: !1087, inlinedAt: !1193)
!1198 = !DILocation(line: 184, column: 7, scope: !115, inlinedAt: !1193)
!1199 = !DILocation(line: 186, column: 11, scope: !1090, inlinedAt: !1193)
!1200 = !DILocation(line: 205, column: 11, scope: !1092, inlinedAt: !1193)
!1201 = !DILocation(line: 204, column: 11, scope: !1093, inlinedAt: !1193)
!1202 = !DILocation(line: 206, column: 9, scope: !1092, inlinedAt: !1193)
!1203 = !DILocation(line: 207, column: 14, scope: !1093, inlinedAt: !1193)
!1204 = !DILocation(line: 207, column: 18, scope: !1093, inlinedAt: !1193)
!1205 = !DILocation(line: 207, column: 9, scope: !1093, inlinedAt: !1193)
!1206 = !DILocation(line: 210, column: 7, scope: !115, inlinedAt: !1193)
!1207 = !DILocation(line: 211, column: 25, scope: !115, inlinedAt: !1193)
!1208 = !DILocation(line: 211, column: 10, scope: !115, inlinedAt: !1193)
!1209 = !DILocation(line: 80, column: 14, scope: !1077, inlinedAt: !1177)
!1210 = !DILocation(line: 80, column: 5, scope: !1077, inlinedAt: !1177)
!1211 = !DILocation(line: 81, column: 26, scope: !1056, inlinedAt: !1177)
!1212 = !DILocation(line: 81, column: 3, scope: !1056, inlinedAt: !1177)
!1213 = !DILocation(line: 81, column: 30, scope: !1056, inlinedAt: !1177)
!1214 = !DILocation(line: 83, column: 7, scope: !1108, inlinedAt: !1177)
!1215 = !DILocation(line: 83, column: 24, scope: !1108, inlinedAt: !1177)
!1216 = !DILocation(line: 83, column: 7, scope: !1056, inlinedAt: !1177)
!1217 = !DILocation(line: 87, column: 24, scope: !1112, inlinedAt: !1177)
!1218 = !DILocation(line: 88, column: 5, scope: !1112, inlinedAt: !1177)
!1219 = !DILocation(line: 138, column: 23, scope: !1128)
!1220 = !DILocation(line: 138, column: 16, scope: !1129)
!1221 = !DILocation(line: 140, column: 15, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !88, line: 140, column: 15)
!1223 = distinct !DILexicalBlock(scope: !1128, file: !88, line: 139, column: 9)
!1224 = !DILocation(line: 140, column: 15, scope: !1223)
!1225 = !DILocation(line: 142, column: 28, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1222, file: !88, line: 141, column: 13)
!1227 = !DILocation(line: 143, column: 22, scope: !1226)
!1228 = !DILocation(line: 142, column: 15, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1226, file: !88, discriminator: 1)
!1230 = !DILocation(line: 145, column: 13, scope: !1226)
!1231 = !DILocation(line: 138, column: 16, scope: !1128)
!1232 = !DILocation(line: 148, column: 16, scope: !1127)
!1233 = !DILocation(line: 148, column: 16, scope: !1128)
!1234 = !DILocation(line: 150, column: 16, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1126, file: !88, line: 150, column: 15)
!1236 = !DILocation(line: 150, column: 15, scope: !1126)
!1237 = !DILocation(line: 158, column: 16, scope: !1125)
!1238 = !DILocation(line: 158, column: 16, scope: !1239)
!1239 = !DILexicalBlockFile(scope: !1125, file: !88, discriminator: 1)
!1240 = !DILocation(line: 158, column: 15, scope: !1241)
!1241 = !DILexicalBlockFile(scope: !1126, file: !88, discriminator: 4)
!1242 = !DILocation(line: 160, column: 28, scope: !1124)
!1243 = !DILocation(line: 160, column: 22, scope: !1124)
!1244 = !DILocation(line: 161, column: 31, scope: !1124)
!1245 = !DILocation(line: 161, column: 21, scope: !1124)
!1246 = !DILocation(line: 162, column: 28, scope: !1124)
!1247 = !DILocation(line: 162, column: 59, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !1124, file: !88, discriminator: 1)
!1249 = !DILocation(line: 162, column: 15, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1124, file: !88, discriminator: 2)
!1251 = !DILocation(line: 163, column: 15, scope: !1124)
!1252 = !DILocation(line: 165, column: 33, scope: !1124)
!1253 = !DILocation(line: 165, column: 39, scope: !1124)
!1254 = !DILocation(line: 166, column: 13, scope: !1124)
!1255 = !DILocation(line: 170, column: 24, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1127, file: !88, line: 169, column: 9)
!1257 = !DILocation(line: 171, column: 18, scope: !1256)
!1258 = !DILocation(line: 170, column: 11, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1256, file: !88, discriminator: 1)
!1260 = !DILocation(line: 173, column: 11, scope: !1256)
!1261 = !DILocation(line: 119, column: 23, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1131, file: !88, discriminator: 2)
!1263 = !DILocation(line: 119, column: 3, scope: !1262)
!1264 = distinct !{!1264, !1265, !1266}
!1265 = !DILocation(line: 119, column: 3, scope: !1132)
!1266 = !DILocation(line: 175, column: 5, scope: !1132)
!1267 = !DILocation(line: 177, column: 10, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1115, file: !88, line: 177, column: 7)
!1269 = !DILocation(line: 179, column: 11, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !88, line: 179, column: 11)
!1271 = distinct !DILexicalBlock(scope: !1268, file: !88, line: 178, column: 5)
!1272 = !DILocation(line: 179, column: 11, scope: !1271)
!1273 = !DILocation(line: 92, column: 28, scope: !1158, inlinedAt: !1274)
!1274 = distinct !DILocation(line: 180, column: 15, scope: !1270)
!1275 = !DILocation(line: 94, column: 8, scope: !1158, inlinedAt: !1274)
!1276 = !DILocation(line: 96, column: 7, scope: !1169, inlinedAt: !1274)
!1277 = !DILocation(line: 96, column: 7, scope: !1158, inlinedAt: !1274)
!1278 = !DILocation(line: 99, column: 14, scope: !1174, inlinedAt: !1274)
!1279 = !DILocation(line: 98, column: 7, scope: !1174, inlinedAt: !1274)
!1280 = !DILocation(line: 102, column: 5, scope: !1174, inlinedAt: !1274)
!1281 = !DILocation(line: 103, column: 15, scope: !1158, inlinedAt: !1274)
!1282 = !DILocation(line: 180, column: 9, scope: !1270)
!1283 = !DILocation(line: 74, column: 25, scope: !1056, inlinedAt: !1284)
!1284 = distinct !DILocation(line: 182, column: 9, scope: !1270)
!1285 = !DILocation(line: 76, column: 27, scope: !1056, inlinedAt: !1284)
!1286 = !DILocation(line: 76, column: 44, scope: !1066, inlinedAt: !1284)
!1287 = !DILocation(line: 76, column: 68, scope: !1066, inlinedAt: !1284)
!1288 = !DILocation(line: 76, column: 27, scope: !1066, inlinedAt: !1284)
!1289 = !DILocation(line: 76, column: 27, scope: !1070, inlinedAt: !1284)
!1290 = !DILocation(line: 76, column: 13, scope: !1056, inlinedAt: !1284)
