!llvm.dbg.cu = !{!2, !220, !226, !234, !656, !241, !248, !659, !302, !667, !684, !686, !697, !701, !703, !705, !707, !709, !712, !714, !311}
!llvm.ident = !{!717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717, !717}
!llvm.module.flags = !{!718, !719, !720, !721}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 47, type: !215, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !60)
!3 = !DIFile(filename: "src/fold.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 46, size: 32, elements: !30)
!29 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!31 = !DIEnumerator(name: "_ISupper", value: 256)
!32 = !DIEnumerator(name: "_ISlower", value: 512)
!33 = !DIEnumerator(name: "_ISalpha", value: 1024)
!34 = !DIEnumerator(name: "_ISdigit", value: 2048)
!35 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!36 = !DIEnumerator(name: "_ISspace", value: 8192)
!37 = !DIEnumerator(name: "_ISprint", value: 16384)
!38 = !DIEnumerator(name: "_ISgraph", value: 32768)
!39 = !DIEnumerator(name: "_ISblank", value: 1)
!40 = !DIEnumerator(name: "_IScntrl", value: 2)
!41 = !DIEnumerator(name: "_ISpunct", value: 4)
!42 = !DIEnumerator(name: "_ISalnum", value: 8)
!43 = !{!44, !46, !47, !50, !52, !55, !57, !58, !59, !54}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 62, baseType: !49)
!48 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!60 = !{!61, !64, !66, !68, !0, !98, !112, !213}
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "break_spaces", scope: !2, file: !3, line: 39, type: !63, isLocal: true, isDefinition: true)
!63 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!64 = !DIGlobalVariableExpression(var: !65)
!65 = distinct !DIGlobalVariable(name: "count_bytes", scope: !2, file: !3, line: 42, type: !63, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 45, type: !63, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69)
!69 = distinct !DIGlobalVariable(name: "infomap", scope: !70, file: !71, line: 632, type: !95, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !71, file: !71, line: 630, type: !72, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !74)
!71 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !DISubroutineType(types: !73)
!73 = !{null, !55}
!74 = !{!75, !76, !77, !84, !86, !87, !88, !91, !92, !94}
!75 = !DILocalVariable(name: "program", arg: 1, scope: !70, file: !71, line: 630, type: !55)
!76 = !DILocalVariable(name: "node", scope: !70, file: !71, line: 642, type: !55)
!77 = !DILocalVariable(name: "map_prog", scope: !70, file: !71, line: 643, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !70, file: !71, line: 632, size: 128, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !80, file: !71, line: 632, baseType: !55, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !80, file: !71, line: 632, baseType: !55, size: 64, offset: 64)
!84 = !DILocalVariable(name: "__s1_len", scope: !85, file: !71, line: 645, type: !47)
!85 = distinct !DILexicalBlock(scope: !70, file: !71, line: 645, column: 33)
!86 = !DILocalVariable(name: "__s2_len", scope: !85, file: !71, line: 645, type: !47)
!87 = !DILocalVariable(name: "lc_messages", scope: !70, file: !71, line: 655, type: !55)
!88 = !DILocalVariable(name: "__s1_len", scope: !89, file: !71, line: 656, type: !47)
!89 = distinct !DILexicalBlock(scope: !90, file: !71, line: 656, column: 22)
!90 = distinct !DILexicalBlock(scope: !70, file: !71, line: 656, column: 7)
!91 = !DILocalVariable(name: "__s2_len", scope: !89, file: !71, line: 656, type: !47)
!92 = !DILocalVariable(name: "__s2", scope: !93, file: !71, line: 656, type: !52)
!93 = distinct !DILexicalBlock(scope: !89, file: !71, line: 656, column: 22)
!94 = !DILocalVariable(name: "__result", scope: !93, file: !71, line: 656, type: !57)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 896, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 7)
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1536, elements: !110)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !103, line: 104, size: 256, elements: !104)
!103 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!104 = !{!105, !106, !107, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !103, line: 106, baseType: !55, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !102, file: !103, line: 109, baseType: !57, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !102, file: !103, line: 110, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !103, line: 111, baseType: !57, size: 32, offset: 192)
!110 = !{!111}
!111 = !DISubrange(count: 6)
!112 = !DIGlobalVariableExpression(var: !113)
!113 = distinct !DIGlobalVariable(name: "line_out", scope: !114, file: !3, line: 126, type: !44, isLocal: true, isDefinition: true)
!114 = distinct !DISubprogram(name: "fold_file", scope: !3, file: !3, line: 120, type: !115, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!63, !55, !47}
!117 = !{!118, !119, !120, !176, !177, !178, !179, !180, !183, !184, !186, !187, !193, !194, !197, !202, !203, !205, !206, !209, !210, !212}
!118 = !DILocalVariable(name: "filename", arg: 1, scope: !114, file: !3, line: 120, type: !55)
!119 = !DILocalVariable(name: "width", arg: 2, scope: !114, file: !3, line: 120, type: !47)
!120 = !DILocalVariable(name: "istream", scope: !114, file: !3, line: 122, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !123, line: 49, baseType: !124)
!123 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !125, line: 241, size: 1728, elements: !126)
!125 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !147, !148, !149, !150, !154, !155, !157, !161, !164, !166, !167, !168, !169, !170, !171, !172}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !124, file: !125, line: 242, baseType: !57, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !124, file: !125, line: 247, baseType: !44, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !124, file: !125, line: 248, baseType: !44, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !124, file: !125, line: 249, baseType: !44, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !124, file: !125, line: 250, baseType: !44, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !124, file: !125, line: 251, baseType: !44, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !124, file: !125, line: 252, baseType: !44, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !124, file: !125, line: 253, baseType: !44, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !124, file: !125, line: 254, baseType: !44, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !124, file: !125, line: 256, baseType: !44, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !124, file: !125, line: 257, baseType: !44, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !124, file: !125, line: 258, baseType: !44, size: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !124, file: !125, line: 260, baseType: !140, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !125, line: 156, size: 192, elements: !142)
!142 = !{!143, !144, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !141, file: !125, line: 157, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !141, file: !125, line: 158, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !141, file: !125, line: 162, baseType: !57, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !124, file: !125, line: 262, baseType: !145, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !124, file: !125, line: 264, baseType: !57, size: 32, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !124, file: !125, line: 268, baseType: !57, size: 32, offset: 928)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !124, file: !125, line: 270, baseType: !151, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !152, line: 140, baseType: !153)
!152 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!153 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !124, file: !125, line: 274, baseType: !58, size: 16, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !124, file: !125, line: 275, baseType: !156, size: 8, offset: 1040)
!156 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !124, file: !125, line: 276, baseType: !158, size: 8, offset: 1048)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 1)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !124, file: !125, line: 280, baseType: !162, size: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !125, line: 150, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !124, file: !125, line: 289, baseType: !165, size: 64, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !152, line: 141, baseType: !153)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !124, file: !125, line: 297, baseType: !46, size: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !124, file: !125, line: 298, baseType: !46, size: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !124, file: !125, line: 299, baseType: !46, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !124, file: !125, line: 300, baseType: !46, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !124, file: !125, line: 302, baseType: !47, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !124, file: !125, line: 303, baseType: !57, size: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !124, file: !125, line: 305, baseType: !173, size: 160, offset: 1568)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !DILocalVariable(name: "c", scope: !114, file: !3, line: 123, type: !57)
!177 = !DILocalVariable(name: "column", scope: !114, file: !3, line: 124, type: !47)
!178 = !DILocalVariable(name: "offset_out", scope: !114, file: !3, line: 125, type: !47)
!179 = !DILocalVariable(name: "saved_errno", scope: !114, file: !3, line: 128, type: !57)
!180 = !DILocalVariable(name: "__s1_len", scope: !181, file: !3, line: 130, type: !47)
!181 = distinct !DILexicalBlock(scope: !182, file: !3, line: 130, column: 7)
!182 = distinct !DILexicalBlock(scope: !114, file: !3, line: 130, column: 7)
!183 = !DILocalVariable(name: "__s2_len", scope: !181, file: !3, line: 130, type: !47)
!184 = !DILocalVariable(name: "__s2", scope: !185, file: !3, line: 130, type: !52)
!185 = distinct !DILexicalBlock(scope: !181, file: !3, line: 130, column: 7)
!186 = !DILocalVariable(name: "__result", scope: !185, file: !3, line: 130, type: !57)
!187 = !DILocalVariable(name: "found_blank", scope: !188, file: !3, line: 169, type: !63)
!188 = distinct !DILexicalBlock(scope: !189, file: !3, line: 168, column: 13)
!189 = distinct !DILexicalBlock(scope: !190, file: !3, line: 167, column: 15)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 163, column: 9)
!191 = distinct !DILexicalBlock(scope: !192, file: !3, line: 162, column: 11)
!192 = distinct !DILexicalBlock(scope: !114, file: !3, line: 147, column: 5)
!193 = !DILocalVariable(name: "logical_end", scope: !188, file: !3, line: 170, type: !47)
!194 = !DILocalVariable(name: "i", scope: !195, file: !3, line: 185, type: !47)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 184, column: 17)
!196 = distinct !DILexicalBlock(scope: !188, file: !3, line: 183, column: 19)
!197 = !DILocalVariable(name: "__s1_len", scope: !198, file: !3, line: 226, type: !47)
!198 = distinct !DILexicalBlock(scope: !199, file: !3, line: 226, column: 12)
!199 = distinct !DILexicalBlock(scope: !200, file: !3, line: 226, column: 11)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 224, column: 5)
!201 = distinct !DILexicalBlock(scope: !114, file: !3, line: 223, column: 7)
!202 = !DILocalVariable(name: "__s2_len", scope: !198, file: !3, line: 226, type: !47)
!203 = !DILocalVariable(name: "__s2", scope: !204, file: !3, line: 226, type: !52)
!204 = distinct !DILexicalBlock(scope: !198, file: !3, line: 226, column: 12)
!205 = !DILocalVariable(name: "__result", scope: !204, file: !3, line: 226, type: !57)
!206 = !DILocalVariable(name: "__s1_len", scope: !207, file: !3, line: 230, type: !47)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 230, column: 8)
!208 = distinct !DILexicalBlock(scope: !114, file: !3, line: 230, column: 7)
!209 = !DILocalVariable(name: "__s2_len", scope: !207, file: !3, line: 230, type: !47)
!210 = !DILocalVariable(name: "__s2", scope: !211, file: !3, line: 230, type: !52)
!211 = distinct !DILexicalBlock(scope: !207, file: !3, line: 230, column: 8)
!212 = !DILocalVariable(name: "__result", scope: !211, file: !3, line: 230, type: !57)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "allocated_out", scope: !114, file: !3, line: 127, type: !47, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 280, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 35)
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "Version", scope: !220, file: !221, line: 2, type: !55, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, globals: !223)
!221 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!222 = !{}
!223 = !{!218}
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "file_name", scope: !226, file: !231, line: 36, type: !55, isLocal: true, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, globals: !228)
!227 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!224, !229}
!229 = !DIGlobalVariableExpression(var: !230)
!230 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !226, file: !231, line: 46, type: !63, isLocal: true, isDefinition: true)
!231 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!232 = !DIGlobalVariableExpression(var: !233)
!233 = distinct !DIGlobalVariable(name: "exit_failure", scope: !234, file: !237, line: 24, type: !238, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, globals: !236)
!235 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!236 = !{!232}
!237 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!238 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !57)
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "program_name", scope: !241, file: !245, line: 33, type: !55, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !243, globals: !244)
!242 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = !{!46, !44}
!244 = !{!239}
!245 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !248, file: !260, line: 77, type: !296, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !250, retainedTypes: !256, globals: !257)
!249 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!250 = !{!5, !251, !28}
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !252)
!252 = !{!253, !254, !255}
!253 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!254 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!255 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!256 = !{!57, !58, !47, !44}
!257 = !{!246, !258, !265, !278, !280, !285, !292, !294}
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !248, file: !260, line: 93, type: !261, isDefinition: true)
!260 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 320, elements: !263)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!263 = !{!264}
!264 = !DISubrange(count: 10)
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !248, file: !260, line: 1043, type: !267, isDefinition: true)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !260, line: 57, size: 448, elements: !268)
!268 = !{!269, !270, !271, !276, !277}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !267, file: !260, line: 60, baseType: !5, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !267, file: !260, line: 63, baseType: !57, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !267, file: !260, line: 67, baseType: !272, size: 256, offset: 64)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 256, elements: !274)
!273 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!274 = !{!275}
!275 = !DISubrange(count: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !267, file: !260, line: 70, baseType: !55, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !267, file: !260, line: 73, baseType: !55, size: 64, offset: 384)
!278 = !DIGlobalVariableExpression(var: !279)
!279 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !248, file: !260, line: 108, type: !267, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "slot0", scope: !248, file: !260, line: 834, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 256)
!285 = !DIGlobalVariableExpression(var: !286)
!286 = distinct !DIGlobalVariable(name: "slotvec", scope: !248, file: !260, line: 837, type: !287, isLocal: true, isDefinition: true)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !260, line: 826, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !288, file: !260, line: 828, baseType: !47, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !288, file: !260, line: 829, baseType: !44, size: 64, offset: 64)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "nslots", scope: !248, file: !260, line: 835, type: !57, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295)
!295 = distinct !DIGlobalVariable(name: "slotvec0", scope: !248, file: !260, line: 836, type: !288, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 704, elements: !298)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!298 = !{!299}
!299 = !DISubrange(count: 11)
!300 = !DIGlobalVariableExpression(var: !301)
!301 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !302, file: !305, line: 26, type: !306, isDefinition: true)
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, globals: !304)
!303 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!304 = !{!300}
!305 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 47)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !311, file: !654, line: 120, type: !655, isLocal: true, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !313, retainedTypes: !652, globals: !653)
!312 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!313 = !{!314}
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 41, size: 32, elements: !316)
!315 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!317 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!318 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!319 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!320 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!321 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!322 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!323 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!324 = !DIEnumerator(name: "DAY_1", value: 131079)
!325 = !DIEnumerator(name: "DAY_2", value: 131080)
!326 = !DIEnumerator(name: "DAY_3", value: 131081)
!327 = !DIEnumerator(name: "DAY_4", value: 131082)
!328 = !DIEnumerator(name: "DAY_5", value: 131083)
!329 = !DIEnumerator(name: "DAY_6", value: 131084)
!330 = !DIEnumerator(name: "DAY_7", value: 131085)
!331 = !DIEnumerator(name: "ABMON_1", value: 131086)
!332 = !DIEnumerator(name: "ABMON_2", value: 131087)
!333 = !DIEnumerator(name: "ABMON_3", value: 131088)
!334 = !DIEnumerator(name: "ABMON_4", value: 131089)
!335 = !DIEnumerator(name: "ABMON_5", value: 131090)
!336 = !DIEnumerator(name: "ABMON_6", value: 131091)
!337 = !DIEnumerator(name: "ABMON_7", value: 131092)
!338 = !DIEnumerator(name: "ABMON_8", value: 131093)
!339 = !DIEnumerator(name: "ABMON_9", value: 131094)
!340 = !DIEnumerator(name: "ABMON_10", value: 131095)
!341 = !DIEnumerator(name: "ABMON_11", value: 131096)
!342 = !DIEnumerator(name: "ABMON_12", value: 131097)
!343 = !DIEnumerator(name: "MON_1", value: 131098)
!344 = !DIEnumerator(name: "MON_2", value: 131099)
!345 = !DIEnumerator(name: "MON_3", value: 131100)
!346 = !DIEnumerator(name: "MON_4", value: 131101)
!347 = !DIEnumerator(name: "MON_5", value: 131102)
!348 = !DIEnumerator(name: "MON_6", value: 131103)
!349 = !DIEnumerator(name: "MON_7", value: 131104)
!350 = !DIEnumerator(name: "MON_8", value: 131105)
!351 = !DIEnumerator(name: "MON_9", value: 131106)
!352 = !DIEnumerator(name: "MON_10", value: 131107)
!353 = !DIEnumerator(name: "MON_11", value: 131108)
!354 = !DIEnumerator(name: "MON_12", value: 131109)
!355 = !DIEnumerator(name: "AM_STR", value: 131110)
!356 = !DIEnumerator(name: "PM_STR", value: 131111)
!357 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!358 = !DIEnumerator(name: "D_FMT", value: 131113)
!359 = !DIEnumerator(name: "T_FMT", value: 131114)
!360 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!361 = !DIEnumerator(name: "ERA", value: 131116)
!362 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!363 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!364 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!365 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!366 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!367 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!368 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!369 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!370 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!371 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!372 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!373 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!374 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!375 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!376 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!377 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!378 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!379 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!380 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!381 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!382 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!383 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!384 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!385 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!386 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!387 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!388 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!389 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!390 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!391 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!392 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!393 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!394 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!395 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!396 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!397 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!398 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!399 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!400 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!401 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!402 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!403 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!404 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!405 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!406 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!407 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!408 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!409 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!410 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!411 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!412 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!413 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!414 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!415 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!416 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!417 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!418 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!419 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!420 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!421 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!422 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!423 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!424 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!425 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!426 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!427 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!428 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!429 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!430 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!431 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!432 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!433 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!434 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!435 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!436 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!437 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!438 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!439 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!440 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!441 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!442 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!443 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!444 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!445 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!446 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!447 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!448 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!449 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!450 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!451 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!452 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!453 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!454 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!455 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!456 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!457 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!458 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!459 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!460 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!461 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!462 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!463 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!464 = !DIEnumerator(name: "CODESET", value: 14)
!465 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!466 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!467 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!468 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!511 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!512 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!513 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!514 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!515 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!516 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!517 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!518 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!519 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!520 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!521 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!524 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!525 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!526 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!527 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!528 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!529 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!530 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!536 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!537 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!538 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!539 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!540 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!541 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!542 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!543 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!544 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!545 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!546 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!547 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!548 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!549 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!550 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!551 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!552 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!553 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!554 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!555 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!556 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!557 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!558 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!563 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!575 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!576 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!579 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!580 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!581 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!582 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!583 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!584 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!585 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!586 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!587 = !DIEnumerator(name: "THOUSEP", value: 65537)
!588 = !DIEnumerator(name: "__GROUPING", value: 65538)
!589 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!590 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!591 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!592 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!593 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!594 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!595 = !DIEnumerator(name: "__YESSTR", value: 327682)
!596 = !DIEnumerator(name: "__NOSTR", value: 327683)
!597 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!598 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!599 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!600 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!601 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!602 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!603 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!604 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!605 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!606 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!607 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!608 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!609 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!610 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!611 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!612 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!613 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!614 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!615 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!616 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!617 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!618 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!619 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!620 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!621 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!622 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!623 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!624 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!625 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!626 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!627 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!628 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!629 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!630 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!631 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!632 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!633 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!638 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!639 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!640 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!641 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!650 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!651 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!652 = !{!46, !44, !59}
!653 = !{!309}
!654 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !658)
!657 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!658 = !{!19}
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !661, retainedTypes: !666)
!660 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!661 = !{!662}
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !663, line: 41, size: 32, elements: !664)
!663 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!664 = !{!665}
!665 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!666 = !{!46}
!667 = distinct !DICompileUnit(language: DW_LANG_C99, file: !668, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !669, retainedTypes: !683)
!668 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!669 = !{!670}
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !672, file: !671, line: 192, size: 32, elements: !681)
!671 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = distinct !DISubprogram(name: "x2nrealloc", scope: !671, file: !671, line: 180, type: !673, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !667, variables: !676)
!673 = !DISubroutineType(types: !674)
!674 = !{!46, !46, !675, !47}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!676 = !{!677, !678, !679, !680}
!677 = !DILocalVariable(name: "p", arg: 1, scope: !672, file: !671, line: 180, type: !46)
!678 = !DILocalVariable(name: "pn", arg: 2, scope: !672, file: !671, line: 180, type: !675)
!679 = !DILocalVariable(name: "s", arg: 3, scope: !672, file: !671, line: 180, type: !47)
!680 = !DILocalVariable(name: "n", scope: !672, file: !671, line: 182, type: !47)
!681 = !{!682}
!682 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!683 = !{!47, !44, !46}
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222)
!685 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !688)
!687 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !{!689}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !690, line: 26, size: 32, elements: !691)
!690 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!691 = !{!692, !693, !694, !695, !696}
!692 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!693 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!694 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!695 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!696 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !699, retainedTypes: !700)
!698 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = !{!689, !28}
!700 = !{!57, !58, !44}
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !666)
!702 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222)
!704 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !666)
!706 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !666)
!708 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !711)
!710 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !{!47}
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222)
!713 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !716)
!715 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!716 = !{!47, !50, !52, !55}
!717 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!718 = !{i32 2, !"Dwarf Version", i32 4}
!719 = !{i32 2, !"Debug Info Version", i32 3}
!720 = !{i32 1, !"PIC Level", i32 2}
!721 = !{i32 1, !"PIE Level", i32 2}
!722 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 60, type: !723, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !57}
!725 = !{!726}
!726 = !DILocalVariable(name: "status", arg: 1, scope: !722, file: !3, line: 60, type: !57)
!727 = !DIExpression()
!728 = !DILocation(line: 60, column: 12, scope: !722)
!729 = !DILocation(line: 62, column: 14, scope: !730)
!730 = distinct !DILexicalBlock(scope: !722, file: !3, line: 62, column: 7)
!731 = !DILocation(line: 62, column: 7, scope: !722)
!732 = !DILocation(line: 63, column: 5, scope: !733)
!733 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 1)
!734 = distinct !DILexicalBlock(scope: !730, file: !3, line: 63, column: 5)
!735 = !{!736, !736, i64 0}
!736 = !{!"any pointer", !737, i64 0}
!737 = !{!"omnipotent char", !738, i64 0}
!738 = !{!"Simple C/C++ TBAA"}
!739 = !DILocation(line: 63, column: 5, scope: !740)
!740 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 3)
!741 = !DILocation(line: 63, column: 5, scope: !742)
!742 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 2)
!743 = !DILocation(line: 66, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !730, file: !3, line: 65, column: 5)
!745 = !DILocation(line: 66, column: 7, scope: !746)
!746 = !DILexicalBlockFile(scope: !744, file: !3, discriminator: 1)
!747 = !DILocation(line: 70, column: 7, scope: !744)
!748 = !DILocation(line: 70, column: 7, scope: !746)
!749 = !DILocation(line: 580, column: 3, scope: !750, inlinedAt: !753)
!750 = distinct !DISubprogram(name: "emit_stdin_note", scope: !71, file: !71, line: 578, type: !751, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !222)
!751 = !DISubroutineType(types: !752)
!752 = !{null}
!753 = distinct !DILocation(line: 74, column: 7, scope: !744)
!754 = !DILocation(line: 580, column: 3, scope: !755, inlinedAt: !753)
!755 = !DILexicalBlockFile(scope: !750, file: !71, discriminator: 1)
!756 = !DILocation(line: 587, column: 3, scope: !757, inlinedAt: !758)
!757 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !71, file: !71, line: 585, type: !751, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !222)
!758 = distinct !DILocation(line: 75, column: 7, scope: !744)
!759 = !DILocation(line: 587, column: 3, scope: !760, inlinedAt: !758)
!760 = !DILexicalBlockFile(scope: !757, file: !71, discriminator: 1)
!761 = !DILocation(line: 77, column: 7, scope: !744)
!762 = !DILocation(line: 77, column: 7, scope: !746)
!763 = !DILocation(line: 82, column: 7, scope: !744)
!764 = !DILocation(line: 82, column: 7, scope: !746)
!765 = !DILocation(line: 83, column: 7, scope: !744)
!766 = !DILocation(line: 83, column: 7, scope: !746)
!767 = !DILocation(line: 642, column: 15, scope: !70, inlinedAt: !768)
!768 = distinct !DILocation(line: 84, column: 7, scope: !744)
!769 = !DILocation(line: 651, column: 3, scope: !70, inlinedAt: !768)
!770 = !DILocation(line: 651, column: 3, scope: !771, inlinedAt: !768)
!771 = !DILexicalBlockFile(scope: !70, file: !71, discriminator: 1)
!772 = !DILocation(line: 655, column: 29, scope: !70, inlinedAt: !768)
!773 = !DILocation(line: 655, column: 15, scope: !70, inlinedAt: !768)
!774 = !DILocation(line: 656, column: 7, scope: !90, inlinedAt: !768)
!775 = !DILocation(line: 656, column: 19, scope: !90, inlinedAt: !768)
!776 = !DILocation(line: 656, column: 22, scope: !777, inlinedAt: !768)
!777 = !DILexicalBlockFile(scope: !90, file: !71, discriminator: 16)
!778 = !DILocation(line: 656, column: 7, scope: !779, inlinedAt: !768)
!779 = !DILexicalBlockFile(scope: !70, file: !71, discriminator: 16)
!780 = !DILocation(line: 662, column: 7, scope: !781, inlinedAt: !768)
!781 = distinct !DILexicalBlock(scope: !90, file: !71, line: 657, column: 5)
!782 = !DILocation(line: 662, column: 7, scope: !783, inlinedAt: !768)
!783 = !DILexicalBlockFile(scope: !781, file: !71, discriminator: 1)
!784 = !DILocation(line: 664, column: 5, scope: !781, inlinedAt: !768)
!785 = !DILocation(line: 665, column: 3, scope: !70, inlinedAt: !768)
!786 = !DILocation(line: 665, column: 3, scope: !771, inlinedAt: !768)
!787 = !DILocation(line: 667, column: 3, scope: !70, inlinedAt: !768)
!788 = !DILocation(line: 667, column: 3, scope: !771, inlinedAt: !768)
!789 = !DILocation(line: 86, column: 3, scope: !722)
!790 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 240, type: !791, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !794)
!791 = !DISubroutineType(types: !792)
!792 = !{!57, !57, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!794 = !{!795, !796, !797, !798, !799, !800, !801}
!795 = !DILocalVariable(name: "argc", arg: 1, scope: !790, file: !3, line: 240, type: !57)
!796 = !DILocalVariable(name: "argv", arg: 2, scope: !790, file: !3, line: 240, type: !793)
!797 = !DILocalVariable(name: "width", scope: !790, file: !3, line: 242, type: !47)
!798 = !DILocalVariable(name: "i", scope: !790, file: !3, line: 243, type: !57)
!799 = !DILocalVariable(name: "optc", scope: !790, file: !3, line: 244, type: !57)
!800 = !DILocalVariable(name: "ok", scope: !790, file: !3, line: 245, type: !63)
!801 = !DILocalVariable(name: "optargbuf", scope: !802, file: !3, line: 259, type: !803)
!802 = distinct !DILexicalBlock(scope: !790, file: !3, line: 258, column: 5)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 16, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 2)
!806 = !DILocation(line: 240, column: 11, scope: !790)
!807 = !DILocation(line: 240, column: 24, scope: !790)
!808 = !DILocation(line: 242, column: 10, scope: !790)
!809 = !DILocation(line: 248, column: 21, scope: !790)
!810 = !DILocation(line: 248, column: 3, scope: !790)
!811 = !DILocation(line: 249, column: 3, scope: !790)
!812 = !DILocation(line: 250, column: 3, scope: !790)
!813 = !DILocation(line: 251, column: 3, scope: !790)
!814 = !DILocation(line: 253, column: 3, scope: !790)
!815 = !DILocation(line: 257, column: 18, scope: !816)
!816 = !DILexicalBlockFile(scope: !790, file: !3, discriminator: 1)
!817 = !DILocation(line: 244, column: 7, scope: !790)
!818 = !DILocation(line: 257, column: 71, scope: !816)
!819 = !DILocation(line: 257, column: 3, scope: !816)
!820 = !DILocation(line: 259, column: 7, scope: !802)
!821 = !DILocation(line: 259, column: 12, scope: !802)
!822 = !DILocation(line: 261, column: 7, scope: !802)
!823 = !DILocation(line: 265, column: 11, scope: !824)
!824 = distinct !DILexicalBlock(scope: !802, file: !3, line: 262, column: 9)
!825 = !DILocation(line: 269, column: 11, scope: !824)
!826 = !DILocation(line: 273, column: 15, scope: !827)
!827 = distinct !DILexicalBlock(scope: !824, file: !3, line: 273, column: 15)
!828 = !DILocation(line: 273, column: 15, scope: !824)
!829 = !DILocation(line: 274, column: 19, scope: !827)
!830 = !DILocation(line: 274, column: 13, scope: !827)
!831 = !DILocation(line: 277, column: 30, scope: !832)
!832 = distinct !DILexicalBlock(scope: !827, file: !3, line: 276, column: 13)
!833 = !DILocation(line: 277, column: 28, scope: !832)
!834 = !{!737, !737, i64 0}
!835 = !DILocation(line: 278, column: 28, scope: !832)
!836 = !DILocation(line: 273, column: 15, scope: !837)
!837 = !DILexicalBlockFile(scope: !827, file: !3, discriminator: 1)
!838 = !DILocation(line: 283, column: 31, scope: !824)
!839 = !DILocation(line: 284, column: 31, scope: !824)
!840 = !DILocation(line: 283, column: 19, scope: !824)
!841 = !DILocation(line: 285, column: 11, scope: !824)
!842 = !DILocation(line: 287, column: 9, scope: !824)
!843 = !DILocation(line: 289, column: 9, scope: !824)
!844 = !DILocation(line: 289, column: 9, scope: !845)
!845 = !DILexicalBlockFile(scope: !824, file: !3, discriminator: 1)
!846 = !DILocation(line: 292, column: 11, scope: !824)
!847 = !DILocation(line: 294, column: 5, scope: !790)
!848 = distinct !{!848, !849, !847}
!849 = !DILocation(line: 257, column: 3, scope: !790)
!850 = !DILocation(line: 296, column: 15, scope: !851)
!851 = distinct !DILexicalBlock(scope: !790, file: !3, line: 296, column: 7)
!852 = !{!853, !853, i64 0}
!853 = !{!"int", !737, i64 0}
!854 = !DILocation(line: 296, column: 12, scope: !851)
!855 = !DILocation(line: 296, column: 7, scope: !790)
!856 = !DILocation(line: 245, column: 8, scope: !790)
!857 = !DILocation(line: 243, column: 7, scope: !790)
!858 = !DILocation(line: 301, column: 26, scope: !859)
!859 = !DILexicalBlockFile(scope: !860, file: !3, discriminator: 1)
!860 = distinct !DILexicalBlock(scope: !861, file: !3, line: 301, column: 7)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 301, column: 7)
!862 = distinct !DILexicalBlock(scope: !851, file: !3, line: 299, column: 5)
!863 = !DILocation(line: 301, column: 7, scope: !864)
!864 = !DILexicalBlockFile(scope: !861, file: !3, discriminator: 1)
!865 = !DILocation(line: 302, column: 26, scope: !860)
!866 = !DILocation(line: 297, column: 10, scope: !851)
!867 = !DILocation(line: 297, column: 8, scope: !851)
!868 = !DILocation(line: 297, column: 5, scope: !851)
!869 = !DILocation(line: 302, column: 15, scope: !860)
!870 = !DILocation(line: 302, column: 12, scope: !860)
!871 = !DILocation(line: 301, column: 35, scope: !872)
!872 = !DILexicalBlockFile(scope: !860, file: !3, discriminator: 2)
!873 = distinct !{!873, !874, !875}
!874 = !DILocation(line: 301, column: 7, scope: !861)
!875 = !DILocation(line: 302, column: 40, scope: !861)
!876 = !DILocation(line: 305, column: 23, scope: !877)
!877 = distinct !DILexicalBlock(scope: !790, file: !3, line: 305, column: 7)
!878 = !DILocation(line: 305, column: 34, scope: !879)
!879 = !DILexicalBlockFile(scope: !877, file: !3, discriminator: 1)
!880 = !DILocation(line: 305, column: 26, scope: !879)
!881 = !DILocation(line: 305, column: 41, scope: !879)
!882 = !DILocation(line: 305, column: 7, scope: !816)
!883 = !DILocation(line: 306, column: 5, scope: !877)
!884 = !DILocation(line: 306, column: 5, scope: !879)
!885 = !DILocation(line: 308, column: 10, scope: !790)
!886 = !DILocation(line: 308, column: 3, scope: !790)
!887 = !DILocation(line: 120, column: 24, scope: !114)
!888 = !DILocation(line: 120, column: 41, scope: !114)
!889 = !DILocation(line: 124, column: 10, scope: !114)
!890 = !DILocation(line: 125, column: 10, scope: !114)
!891 = !DILocation(line: 130, column: 7, scope: !181)
!892 = !DILocation(line: 130, column: 7, scope: !185)
!893 = !DILocation(line: 130, column: 7, scope: !894)
!894 = !DILexicalBlockFile(scope: !185, file: !3, discriminator: 2)
!895 = !DILocation(line: 130, column: 7, scope: !896)
!896 = !DILexicalBlockFile(scope: !897, file: !3, discriminator: 3)
!897 = distinct !DILexicalBlock(scope: !185, file: !3, line: 130, column: 7)
!898 = !DILocation(line: 130, column: 7, scope: !899)
!899 = !DILexicalBlockFile(scope: !897, file: !3, discriminator: 2)
!900 = !DILocation(line: 130, column: 7, scope: !901)
!901 = !DILexicalBlockFile(scope: !902, file: !3, discriminator: 4)
!902 = distinct !DILexicalBlock(scope: !897, file: !3, line: 130, column: 7)
!903 = !DILocation(line: 130, column: 7, scope: !904)
!904 = !DILexicalBlockFile(scope: !182, file: !3, discriminator: 13)
!905 = !DILocation(line: 130, column: 7, scope: !906)
!906 = !DILexicalBlockFile(scope: !114, file: !3, discriminator: 13)
!907 = !DILocation(line: 132, column: 17, scope: !908)
!908 = distinct !DILexicalBlock(scope: !182, file: !3, line: 131, column: 5)
!909 = !DILocation(line: 122, column: 9, scope: !114)
!910 = !DILocation(line: 134, column: 5, scope: !908)
!911 = !DILocation(line: 136, column: 15, scope: !182)
!912 = !DILocation(line: 138, column: 15, scope: !913)
!913 = distinct !DILexicalBlock(scope: !114, file: !3, line: 138, column: 7)
!914 = !DILocation(line: 138, column: 7, scope: !114)
!915 = !DILocation(line: 140, column: 17, scope: !916)
!916 = distinct !DILexicalBlock(scope: !913, file: !3, line: 139, column: 5)
!917 = !DILocation(line: 140, column: 30, scope: !918)
!918 = !DILexicalBlockFile(scope: !916, file: !3, discriminator: 1)
!919 = !DILocation(line: 140, column: 7, scope: !920)
!920 = !DILexicalBlockFile(scope: !916, file: !3, discriminator: 2)
!921 = !DILocation(line: 141, column: 7, scope: !916)
!922 = !DILocation(line: 144, column: 3, scope: !114)
!923 = !DILocation(line: 146, column: 3, scope: !114)
!924 = !DILocalVariable(name: "__fp", arg: 1, scope: !925, file: !926, line: 63, type: !121)
!925 = distinct !DISubprogram(name: "getc_unlocked", scope: !926, file: !926, line: 63, type: !927, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !929)
!926 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!927 = !DISubroutineType(types: !928)
!928 = !{!57, !121}
!929 = !{!924}
!930 = !DILocation(line: 63, column: 22, scope: !925, inlinedAt: !931)
!931 = distinct !DILocation(line: 146, column: 15, scope: !932)
!932 = !DILexicalBlockFile(scope: !114, file: !3, discriminator: 1)
!933 = !DILocation(line: 65, column: 10, scope: !925, inlinedAt: !931)
!934 = !{!935, !736, i64 8}
!935 = !{!"_IO_FILE", !853, i64 0, !736, i64 8, !736, i64 16, !736, i64 24, !736, i64 32, !736, i64 40, !736, i64 48, !736, i64 56, !736, i64 64, !736, i64 72, !736, i64 80, !736, i64 88, !736, i64 96, !736, i64 104, !853, i64 112, !853, i64 116, !936, i64 120, !937, i64 128, !737, i64 130, !737, i64 131, !736, i64 136, !936, i64 144, !736, i64 152, !736, i64 160, !736, i64 168, !736, i64 176, !936, i64 184, !853, i64 192, !737, i64 196}
!936 = !{!"long", !737, i64 0}
!937 = !{!"short", !737, i64 0}
!938 = !{!935, !736, i64 16}
!939 = !{!"branch_weights", i32 2000, i32 1}
!940 = !DILocation(line: 65, column: 10, scope: !941, inlinedAt: !931)
!941 = !DILexicalBlockFile(scope: !925, file: !926, discriminator: 2)
!942 = !DILocation(line: 123, column: 7, scope: !114)
!943 = !DILocation(line: 146, column: 3, scope: !932)
!944 = !DILocation(line: 65, column: 10, scope: !945, inlinedAt: !931)
!945 = !DILexicalBlockFile(scope: !925, file: !926, discriminator: 1)
!946 = !DILocation(line: 146, column: 31, scope: !932)
!947 = !DILocation(line: 148, column: 22, scope: !948)
!948 = distinct !DILexicalBlock(scope: !192, file: !3, line: 148, column: 11)
!949 = !DILocation(line: 148, column: 29, scope: !948)
!950 = !{!936, !936, i64 0}
!951 = !DILocation(line: 148, column: 26, scope: !948)
!952 = !DILocation(line: 148, column: 11, scope: !192)
!953 = !DILocation(line: 149, column: 20, scope: !948)
!954 = !DILocation(line: 149, column: 18, scope: !948)
!955 = !DILocation(line: 149, column: 9, scope: !948)
!956 = !DILocation(line: 151, column: 13, scope: !957)
!957 = distinct !DILexicalBlock(scope: !192, file: !3, line: 151, column: 11)
!958 = !DILocation(line: 151, column: 11, scope: !192)
!959 = !DILocation(line: 153, column: 11, scope: !960)
!960 = distinct !DILexicalBlock(scope: !957, file: !3, line: 152, column: 9)
!961 = !DILocation(line: 153, column: 34, scope: !960)
!962 = !DILocation(line: 154, column: 11, scope: !960)
!963 = !DILocation(line: 156, column: 11, scope: !960)
!964 = distinct !{!964, !923, !965}
!965 = !DILocation(line: 216, column: 5, scope: !114)
!966 = !DILocalVariable(name: "column", arg: 1, scope: !967, file: !3, line: 94, type: !47)
!967 = distinct !DISubprogram(name: "adjust_column", scope: !3, file: !3, line: 94, type: !968, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!47, !47, !45}
!970 = !{!966, !971}
!971 = !DILocalVariable(name: "c", arg: 2, scope: !967, file: !3, line: 94, type: !45)
!972 = !DILocation(line: 94, column: 23, scope: !967, inlinedAt: !973)
!973 = distinct !DILocation(line: 160, column: 16, scope: !192)
!974 = !DILocation(line: 94, column: 36, scope: !967, inlinedAt: !973)
!975 = !DILocation(line: 96, column: 7, scope: !967, inlinedAt: !973)
!976 = !DILocation(line: 98, column: 11, scope: !977, inlinedAt: !973)
!977 = distinct !DILexicalBlock(scope: !978, file: !3, line: 97, column: 5)
!978 = distinct !DILexicalBlock(scope: !967, file: !3, line: 96, column: 7)
!979 = !DILocation(line: 100, column: 22, scope: !980, inlinedAt: !973)
!980 = distinct !DILexicalBlock(scope: !981, file: !3, line: 100, column: 15)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 99, column: 9)
!982 = distinct !DILexicalBlock(scope: !977, file: !3, line: 98, column: 11)
!983 = !DILocation(line: 101, column: 19, scope: !980, inlinedAt: !973)
!984 = !DILocation(line: 100, column: 15, scope: !981, inlinedAt: !973)
!985 = !DILocation(line: 106, column: 38, scope: !986, inlinedAt: !973)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 105, column: 16)
!987 = distinct !DILexicalBlock(scope: !982, file: !3, line: 103, column: 16)
!988 = !DILocation(line: 106, column: 29, scope: !986, inlinedAt: !973)
!989 = !DILocation(line: 106, column: 16, scope: !986, inlinedAt: !973)
!990 = !DILocation(line: 106, column: 9, scope: !986, inlinedAt: !973)
!991 = !DILocation(line: 108, column: 15, scope: !986, inlinedAt: !973)
!992 = !DILocation(line: 111, column: 11, scope: !978, inlinedAt: !973)
!993 = !DILocation(line: 162, column: 18, scope: !191)
!994 = !DILocation(line: 162, column: 11, scope: !192)
!995 = !DILocation(line: 167, column: 15, scope: !190)
!996 = !DILocation(line: 170, column: 22, scope: !188)
!997 = !DILocation(line: 173, column: 15, scope: !998)
!998 = !DILexicalBlockFile(scope: !188, file: !3, discriminator: 1)
!999 = !DILocation(line: 175, column: 19, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !188, file: !3, line: 174, column: 17)
!1001 = !DILocation(line: 176, column: 23, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 176, column: 23)
!1003 = !{!937, !937, i64 0}
!1004 = !DILocation(line: 176, column: 23, scope: !1000)
!1005 = distinct !{!1005, !1006, !1007}
!1006 = !DILocation(line: 173, column: 15, scope: !188)
!1007 = !DILocation(line: 181, column: 17, scope: !188)
!1008 = !DILocation(line: 189, column: 19, scope: !195)
!1009 = !DILocalVariable(name: "__c", arg: 1, scope: !1010, file: !926, line: 105, type: !57)
!1010 = distinct !DISubprogram(name: "putchar_unlocked", scope: !926, file: !926, line: 105, type: !1011, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!57, !57}
!1013 = !{!1009}
!1014 = !DILocation(line: 105, column: 23, scope: !1010, inlinedAt: !1015)
!1015 = distinct !DILocation(line: 191, column: 19, scope: !195)
!1016 = !DILocation(line: 107, column: 10, scope: !1010, inlinedAt: !1015)
!1017 = !{!935, !736, i64 40}
!1018 = !{!935, !736, i64 48}
!1019 = !DILocation(line: 107, column: 10, scope: !1020, inlinedAt: !1015)
!1020 = !DILexicalBlockFile(scope: !1010, file: !926, discriminator: 1)
!1021 = !DILocation(line: 107, column: 10, scope: !1022, inlinedAt: !1015)
!1022 = !DILexicalBlockFile(scope: !1010, file: !926, discriminator: 2)
!1023 = !DILocation(line: 194, column: 28, scope: !195)
!1024 = !DILocation(line: 194, column: 47, scope: !195)
!1025 = !DILocation(line: 195, column: 39, scope: !195)
!1026 = !DILocation(line: 194, column: 19, scope: !195)
!1027 = !DILocation(line: 185, column: 26, scope: !195)
!1028 = !DILocation(line: 197, column: 42, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1030, file: !3, discriminator: 1)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 197, column: 19)
!1031 = distinct !DILexicalBlock(scope: !195, file: !3, line: 197, column: 19)
!1032 = !DILocation(line: 197, column: 19, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1031, file: !3, discriminator: 1)
!1034 = !DILocation(line: 94, column: 23, scope: !967, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 198, column: 30, scope: !1030)
!1036 = !DILocation(line: 94, column: 36, scope: !967, inlinedAt: !1035)
!1037 = !DILocation(line: 96, column: 7, scope: !967, inlinedAt: !1035)
!1038 = !DILocation(line: 198, column: 53, scope: !1030)
!1039 = !DILocation(line: 98, column: 11, scope: !977, inlinedAt: !1035)
!1040 = !DILocation(line: 100, column: 22, scope: !980, inlinedAt: !1035)
!1041 = !DILocation(line: 101, column: 19, scope: !980, inlinedAt: !1035)
!1042 = !DILocation(line: 100, column: 15, scope: !981, inlinedAt: !1035)
!1043 = !DILocation(line: 106, column: 38, scope: !986, inlinedAt: !1035)
!1044 = !DILocation(line: 106, column: 29, scope: !986, inlinedAt: !1035)
!1045 = !DILocation(line: 106, column: 16, scope: !986, inlinedAt: !1035)
!1046 = !DILocation(line: 106, column: 9, scope: !986, inlinedAt: !1035)
!1047 = !DILocation(line: 108, column: 15, scope: !986, inlinedAt: !1035)
!1048 = !DILocation(line: 111, column: 11, scope: !978, inlinedAt: !1035)
!1049 = !DILocation(line: 197, column: 57, scope: !1050)
!1050 = !DILexicalBlockFile(scope: !1030, file: !3, discriminator: 2)
!1051 = distinct !{!1051, !1052, !1053}
!1052 = !DILocation(line: 197, column: 19, scope: !1031)
!1053 = !DILocation(line: 198, column: 64, scope: !1031)
!1054 = !DILocation(line: 203, column: 26, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !190, file: !3, line: 203, column: 15)
!1056 = !DILocation(line: 203, column: 15, scope: !190)
!1057 = !DILocation(line: 205, column: 38, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 204, column: 13)
!1059 = !DILocation(line: 206, column: 15, scope: !1058)
!1060 = !DILocation(line: 209, column: 34, scope: !190)
!1061 = !DILocation(line: 210, column: 11, scope: !190)
!1062 = !DILocation(line: 212, column: 11, scope: !190)
!1063 = !DILocation(line: 215, column: 7, scope: !192)
!1064 = !DILocation(line: 215, column: 26, scope: !192)
!1065 = !DILocation(line: 215, column: 30, scope: !192)
!1066 = !DILocation(line: 146, column: 3, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !114, file: !3, discriminator: 2)
!1068 = !DILocation(line: 218, column: 17, scope: !114)
!1069 = !DILocation(line: 128, column: 7, scope: !114)
!1070 = !DILocation(line: 220, column: 7, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !114, file: !3, line: 220, column: 7)
!1072 = !DILocation(line: 220, column: 7, scope: !114)
!1073 = !DILocation(line: 221, column: 5, scope: !1071)
!1074 = !DILocalVariable(name: "__stream", arg: 1, scope: !1075, file: !926, line: 132, type: !121)
!1075 = distinct !DISubprogram(name: "ferror_unlocked", scope: !926, file: !926, line: 132, type: !927, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1076)
!1076 = !{!1074}
!1077 = !DILocation(line: 132, column: 1, scope: !1075, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 223, column: 7, scope: !201)
!1079 = !DILocation(line: 134, column: 10, scope: !1075, inlinedAt: !1078)
!1080 = !{!935, !853, i64 0}
!1081 = !DILocation(line: 223, column: 7, scope: !201)
!1082 = !DILocation(line: 223, column: 7, scope: !114)
!1083 = !DILocation(line: 225, column: 36, scope: !200)
!1084 = !DILocation(line: 225, column: 7, scope: !1085)
!1085 = !DILexicalBlockFile(scope: !200, file: !3, discriminator: 1)
!1086 = !DILocation(line: 226, column: 12, scope: !198)
!1087 = !DILocation(line: 226, column: 12, scope: !204)
!1088 = !DILocation(line: 226, column: 12, scope: !1089)
!1089 = !DILexicalBlockFile(scope: !204, file: !3, discriminator: 2)
!1090 = !DILocation(line: 226, column: 12, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1092, file: !3, discriminator: 3)
!1092 = distinct !DILexicalBlock(scope: !204, file: !3, line: 226, column: 12)
!1093 = !DILocation(line: 226, column: 12, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1092, file: !3, discriminator: 2)
!1095 = !DILocation(line: 226, column: 12, scope: !1096)
!1096 = !DILexicalBlockFile(scope: !1097, file: !3, discriminator: 4)
!1097 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 226, column: 12)
!1098 = !DILocation(line: 226, column: 12, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !198, file: !3, discriminator: 11)
!1100 = !DILocation(line: 226, column: 11, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !200, file: !3, discriminator: 13)
!1102 = !DILocation(line: 227, column: 9, scope: !199)
!1103 = !DILocation(line: 230, column: 8, scope: !207)
!1104 = !DILocation(line: 230, column: 8, scope: !211)
!1105 = !DILocation(line: 230, column: 8, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !211, file: !3, discriminator: 2)
!1107 = !DILocation(line: 230, column: 8, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 3)
!1109 = distinct !DILexicalBlock(scope: !211, file: !3, line: 230, column: 8)
!1110 = !DILocation(line: 230, column: 8, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1109, file: !3, discriminator: 2)
!1112 = !DILocation(line: 230, column: 8, scope: !1113)
!1113 = !DILexicalBlockFile(scope: !1114, file: !3, discriminator: 4)
!1114 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 230, column: 8)
!1115 = !DILocation(line: 230, column: 8, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !207, file: !3, discriminator: 11)
!1117 = !DILocation(line: 230, column: 30, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !208, file: !3, discriminator: 13)
!1119 = !DILocation(line: 230, column: 33, scope: !1120)
!1120 = !DILexicalBlockFile(scope: !208, file: !3, discriminator: 14)
!1121 = !DILocation(line: 230, column: 50, scope: !1120)
!1122 = !DILocation(line: 230, column: 7, scope: !1123)
!1123 = !DILexicalBlockFile(scope: !114, file: !3, discriminator: 14)
!1124 = !DILocation(line: 232, column: 17, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !208, file: !3, line: 231, column: 5)
!1126 = !DILocation(line: 232, column: 30, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1125, file: !3, discriminator: 1)
!1128 = !DILocation(line: 232, column: 7, scope: !1129)
!1129 = !DILexicalBlockFile(scope: !1125, file: !3, discriminator: 2)
!1130 = !DILocation(line: 233, column: 7, scope: !1125)
!1131 = !DILocation(line: 237, column: 1, scope: !114)
!1132 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !231, file: !231, line: 41, type: !72, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !226, variables: !1133)
!1133 = !{!1134}
!1134 = !DILocalVariable(name: "file", arg: 1, scope: !1132, file: !231, line: 41, type: !55)
!1135 = !DILocation(line: 41, column: 41, scope: !1132)
!1136 = !DILocation(line: 43, column: 13, scope: !1132)
!1137 = !DILocation(line: 44, column: 1, scope: !1132)
!1138 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !231, file: !231, line: 78, type: !1139, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !226, variables: !1141)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{null, !63}
!1141 = !{!1142}
!1142 = !DILocalVariable(name: "ignore", arg: 1, scope: !1138, file: !231, line: 78, type: !63)
!1143 = !DIExpression(DW_OP_LLVM_fragment, 0, 1)
!1144 = !DILocation(line: 78, column: 37, scope: !1138)
!1145 = !DILocation(line: 80, column: 16, scope: !1138)
!1146 = !{!1147, !1147, i64 0}
!1147 = !{!"_Bool", !737, i64 0}
!1148 = !DILocation(line: 81, column: 1, scope: !1138)
!1149 = distinct !DISubprogram(name: "close_stdout", scope: !231, file: !231, line: 107, type: !751, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !226, variables: !1150)
!1150 = !{!1151}
!1151 = !DILocalVariable(name: "write_error", scope: !1152, file: !231, line: 112, type: !55)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !231, line: 111, column: 5)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !231, line: 109, column: 7)
!1154 = !DILocation(line: 109, column: 21, scope: !1153)
!1155 = !DILocation(line: 109, column: 7, scope: !1153)
!1156 = !DILocation(line: 109, column: 29, scope: !1153)
!1157 = !DILocation(line: 110, column: 7, scope: !1153)
!1158 = !DILocation(line: 110, column: 12, scope: !1159)
!1159 = !DILexicalBlockFile(scope: !1153, file: !231, discriminator: 1)
!1160 = !{i8 0, i8 2}
!1161 = !DILocation(line: 114, column: 19, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1152, file: !231, line: 113, column: 11)
!1163 = !DILocation(line: 110, column: 25, scope: !1159)
!1164 = !DILocation(line: 110, column: 28, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1153, file: !231, discriminator: 2)
!1166 = !DILocation(line: 110, column: 34, scope: !1165)
!1167 = !DILocation(line: 109, column: 7, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1149, file: !231, discriminator: 1)
!1169 = !DILocation(line: 112, column: 33, scope: !1152)
!1170 = !DILocation(line: 112, column: 19, scope: !1152)
!1171 = !DILocation(line: 113, column: 11, scope: !1162)
!1172 = !DILocation(line: 113, column: 11, scope: !1152)
!1173 = !DILocation(line: 114, column: 36, scope: !1174)
!1174 = !DILexicalBlockFile(scope: !1162, file: !231, discriminator: 1)
!1175 = !DILocation(line: 114, column: 9, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1162, file: !231, discriminator: 2)
!1177 = !DILocation(line: 114, column: 9, scope: !1162)
!1178 = !DILocation(line: 117, column: 9, scope: !1174)
!1179 = !DILocation(line: 119, column: 14, scope: !1152)
!1180 = !DILocation(line: 119, column: 7, scope: !1152)
!1181 = !DILocation(line: 122, column: 22, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1149, file: !231, line: 122, column: 8)
!1183 = !DILocation(line: 122, column: 8, scope: !1182)
!1184 = !DILocation(line: 122, column: 30, scope: !1182)
!1185 = !DILocation(line: 122, column: 8, scope: !1149)
!1186 = !DILocation(line: 123, column: 13, scope: !1182)
!1187 = !DILocation(line: 123, column: 6, scope: !1182)
!1188 = !DILocation(line: 124, column: 1, scope: !1149)
!1189 = distinct !DISubprogram(name: "fdadvise", scope: !1190, file: !1190, line: 31, type: !1191, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !656, variables: !1195)
!1190 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1191 = !DISubroutineType(types: !1192)
!1192 = !{null, !57, !1193, !1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !123, line: 91, baseType: !151)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !20, line: 52, baseType: !19)
!1195 = !{!1196, !1197, !1198, !1199, !1200}
!1196 = !DILocalVariable(name: "fd", arg: 1, scope: !1189, file: !1190, line: 31, type: !57)
!1197 = !DILocalVariable(name: "offset", arg: 2, scope: !1189, file: !1190, line: 31, type: !1193)
!1198 = !DILocalVariable(name: "len", arg: 3, scope: !1189, file: !1190, line: 31, type: !1193)
!1199 = !DILocalVariable(name: "advice", arg: 4, scope: !1189, file: !1190, line: 31, type: !1194)
!1200 = !DILocalVariable(name: "__x", scope: !1201, file: !1190, line: 34, type: !57)
!1201 = distinct !DILexicalBlock(scope: !1189, file: !1190, line: 34, column: 3)
!1202 = !DILocation(line: 31, column: 15, scope: !1189)
!1203 = !DILocation(line: 31, column: 25, scope: !1189)
!1204 = !DILocation(line: 31, column: 39, scope: !1189)
!1205 = !DILocation(line: 31, column: 54, scope: !1189)
!1206 = !DILocation(line: 34, column: 3, scope: !1201)
!1207 = !DILocation(line: 36, column: 1, scope: !1189)
!1208 = distinct !DISubprogram(name: "fadvise", scope: !1190, file: !1190, line: 39, type: !1209, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !656, variables: !1251)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !1211, !1194}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !123, line: 49, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !125, line: 241, size: 1728, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1213, file: !125, line: 242, baseType: !57, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1213, file: !125, line: 247, baseType: !44, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1213, file: !125, line: 248, baseType: !44, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1213, file: !125, line: 249, baseType: !44, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1213, file: !125, line: 250, baseType: !44, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1213, file: !125, line: 251, baseType: !44, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1213, file: !125, line: 252, baseType: !44, size: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1213, file: !125, line: 253, baseType: !44, size: 64, offset: 448)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1213, file: !125, line: 254, baseType: !44, size: 64, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1213, file: !125, line: 256, baseType: !44, size: 64, offset: 576)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1213, file: !125, line: 257, baseType: !44, size: 64, offset: 640)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1213, file: !125, line: 258, baseType: !44, size: 64, offset: 704)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1213, file: !125, line: 260, baseType: !1228, size: 64, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !125, line: 156, size: 192, elements: !1230)
!1230 = !{!1231, !1232, !1234}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1229, file: !125, line: 157, baseType: !1228, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1229, file: !125, line: 158, baseType: !1233, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1229, file: !125, line: 162, baseType: !57, size: 32, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1213, file: !125, line: 262, baseType: !1233, size: 64, offset: 832)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1213, file: !125, line: 264, baseType: !57, size: 32, offset: 896)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1213, file: !125, line: 268, baseType: !57, size: 32, offset: 928)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1213, file: !125, line: 270, baseType: !151, size: 64, offset: 960)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1213, file: !125, line: 274, baseType: !58, size: 16, offset: 1024)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1213, file: !125, line: 275, baseType: !156, size: 8, offset: 1040)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1213, file: !125, line: 276, baseType: !158, size: 8, offset: 1048)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1213, file: !125, line: 280, baseType: !162, size: 64, offset: 1088)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1213, file: !125, line: 289, baseType: !165, size: 64, offset: 1152)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1213, file: !125, line: 297, baseType: !46, size: 64, offset: 1216)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1213, file: !125, line: 298, baseType: !46, size: 64, offset: 1280)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1213, file: !125, line: 299, baseType: !46, size: 64, offset: 1344)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1213, file: !125, line: 300, baseType: !46, size: 64, offset: 1408)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1213, file: !125, line: 302, baseType: !47, size: 64, offset: 1472)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1213, file: !125, line: 303, baseType: !57, size: 32, offset: 1536)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1213, file: !125, line: 305, baseType: !173, size: 160, offset: 1568)
!1251 = !{!1252, !1253}
!1252 = !DILocalVariable(name: "fp", arg: 1, scope: !1208, file: !1190, line: 39, type: !1211)
!1253 = !DILocalVariable(name: "advice", arg: 2, scope: !1208, file: !1190, line: 39, type: !1194)
!1254 = !DILocation(line: 39, column: 16, scope: !1208)
!1255 = !DILocation(line: 39, column: 30, scope: !1208)
!1256 = !DILocation(line: 41, column: 7, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1208, file: !1190, line: 41, column: 7)
!1258 = !DILocation(line: 41, column: 7, scope: !1208)
!1259 = !DILocation(line: 42, column: 15, scope: !1257)
!1260 = !DILocation(line: 31, column: 15, scope: !1189, inlinedAt: !1261)
!1261 = distinct !DILocation(line: 42, column: 5, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1257, file: !1190, discriminator: 1)
!1263 = !DILocation(line: 31, column: 25, scope: !1189, inlinedAt: !1261)
!1264 = !DILocation(line: 31, column: 39, scope: !1189, inlinedAt: !1261)
!1265 = !DILocation(line: 31, column: 54, scope: !1189, inlinedAt: !1261)
!1266 = !DILocation(line: 34, column: 3, scope: !1201, inlinedAt: !1261)
!1267 = !DILocation(line: 42, column: 5, scope: !1257)
!1268 = !DILocation(line: 43, column: 1, scope: !1208)
!1269 = distinct !DISubprogram(name: "set_program_name", scope: !245, file: !245, line: 39, type: !72, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !241, variables: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DILocalVariable(name: "argv0", arg: 1, scope: !1269, file: !245, line: 39, type: !55)
!1272 = !DILocalVariable(name: "slash", scope: !1269, file: !245, line: 46, type: !55)
!1273 = !DILocalVariable(name: "base", scope: !1269, file: !245, line: 47, type: !55)
!1274 = !DILocation(line: 39, column: 31, scope: !1269)
!1275 = !DILocation(line: 51, column: 13, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1269, file: !245, line: 51, column: 7)
!1277 = !DILocation(line: 51, column: 7, scope: !1269)
!1278 = !DILocation(line: 55, column: 14, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1276, file: !245, line: 52, column: 5)
!1280 = !DILocation(line: 54, column: 7, scope: !1279)
!1281 = !DILocation(line: 56, column: 7, scope: !1279)
!1282 = !DILocation(line: 59, column: 11, scope: !1269)
!1283 = !DILocation(line: 46, column: 15, scope: !1269)
!1284 = !DILocation(line: 60, column: 17, scope: !1269)
!1285 = !DILocation(line: 60, column: 33, scope: !1286)
!1286 = !DILexicalBlockFile(scope: !1269, file: !245, discriminator: 1)
!1287 = !DILocation(line: 60, column: 11, scope: !1269)
!1288 = !DILocation(line: 47, column: 15, scope: !1269)
!1289 = !DILocation(line: 61, column: 12, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1269, file: !245, line: 61, column: 7)
!1291 = !DILocation(line: 61, column: 20, scope: !1290)
!1292 = !DILocation(line: 61, column: 25, scope: !1290)
!1293 = !DILocation(line: 61, column: 28, scope: !1294)
!1294 = !DILexicalBlockFile(scope: !1290, file: !245, discriminator: 1)
!1295 = !DILocation(line: 61, column: 61, scope: !1294)
!1296 = !DILocation(line: 61, column: 7, scope: !1286)
!1297 = !DILocation(line: 64, column: 11, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1299, file: !245, line: 64, column: 11)
!1299 = distinct !DILexicalBlock(scope: !1290, file: !245, line: 62, column: 5)
!1300 = !DILocation(line: 64, column: 36, scope: !1298)
!1301 = !DILocation(line: 64, column: 11, scope: !1299)
!1302 = !DILocation(line: 66, column: 24, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1298, file: !245, line: 65, column: 9)
!1304 = !DILocation(line: 70, column: 41, scope: !1303)
!1305 = !DILocation(line: 72, column: 9, scope: !1303)
!1306 = !DILocation(line: 84, column: 16, scope: !1269)
!1307 = !DILocation(line: 90, column: 27, scope: !1269)
!1308 = !DILocation(line: 92, column: 1, scope: !1269)
!1309 = distinct !DISubprogram(name: "clone_quoting_options", scope: !260, file: !260, line: 114, type: !1310, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !248, variables: !1313)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!1312, !1312}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!1313 = !{!1314, !1315, !1316}
!1314 = !DILocalVariable(name: "o", arg: 1, scope: !1309, file: !260, line: 114, type: !1312)
!1315 = !DILocalVariable(name: "e", scope: !1309, file: !260, line: 116, type: !57)
!1316 = !DILocalVariable(name: "p", scope: !1309, file: !260, line: 117, type: !1312)
!1317 = !DILocation(line: 114, column: 48, scope: !1309)
!1318 = !DILocation(line: 116, column: 11, scope: !1309)
!1319 = !DILocation(line: 116, column: 7, scope: !1309)
