!llvm.dbg.cu = !{!2, !212, !217, !225, !657, !660, !232, !239, !663, !303, !671, !688, !690, !701, !704, !706, !708, !710, !712, !715, !717, !312}
!llvm.ident = !{!720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720, !720}
!llvm.module.flags = !{!721, !722, !723, !724}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 149, type: !198, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !48)
!3 = !DIFile(filename: "src/nl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "section", file: !3, line: 61, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "Header", value: 0)
!31 = !DIEnumerator(name: "Body", value: 1)
!32 = !DIEnumerator(name: "Footer", value: 2)
!33 = !DIEnumerator(name: "Text", value: 3)
!34 = !{!35, !38, !40, !43, !46, !47, !37, !42}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 62, baseType: !37)
!36 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!37 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !{!49, !51, !76, !78, !80, !85, !87, !89, !91, !93, !95, !103, !110, !113, !0, !144, !146, !148, !150, !152, !154, !156, !158, !160, !162, !167, !169, !172, !174, !176, !181, !183, !185, !187, !189, !192}
!49 = !DIGlobalVariableExpression(var: !50)
!50 = distinct !DIGlobalVariable(name: "current_type", scope: !2, file: !3, line: 76, type: !43, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52)
!52 = distinct !DIGlobalVariable(name: "body_regex", scope: !2, file: !3, line: 79, type: !53, isLocal: true, isDefinition: true)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !54, line: 414, size: 512, elements: !55)
!54 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!55 = !{!56, !59, !61, !62, !64, !65, !67, !68, !70, !71, !72, !73, !74, !75}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !53, file: !54, line: 418, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !54, line: 418, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !53, file: !54, line: 421, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !54, line: 57, baseType: !37)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !53, file: !54, line: 424, baseType: !60, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !53, file: !54, line: 427, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !54, line: 73, baseType: !37)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !53, file: !54, line: 432, baseType: !46, size: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !53, file: !54, line: 438, baseType: !66, size: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !53, file: !54, line: 441, baseType: !35, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !53, file: !54, line: 447, baseType: !69, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !53, file: !54, line: 458, baseType: !69, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !53, file: !54, line: 462, baseType: !69, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !53, file: !54, line: 466, baseType: !69, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !53, file: !54, line: 470, baseType: !69, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !53, file: !54, line: 473, baseType: !69, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !53, file: !54, line: 476, baseType: !69, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "header_regex", scope: !2, file: !3, line: 82, type: !53, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "footer_regex", scope: !2, file: !3, line: 85, type: !53, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81)
!81 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !2, file: !3, line: 88, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 256)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !2, file: !3, line: 89, type: !82, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88)
!88 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !2, file: !3, line: 90, type: !82, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "header_del_len", scope: !2, file: !3, line: 105, type: !35, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "body_del_len", scope: !2, file: !3, line: 111, type: !35, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !2, file: !3, line: 117, type: !35, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "line_buf", scope: !2, file: !3, line: 120, type: !97, isLocal: true, isDefinition: true)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !98, line: 26, size: 192, elements: !99)
!98 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !97, file: !98, line: 28, baseType: !35, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !97, file: !98, line: 29, baseType: !35, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !97, file: !98, line: 30, baseType: !46, size: 64, offset: 128)
!103 = !DIGlobalVariableExpression(var: !104)
!104 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 144, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !106, line: 135, baseType: !107)
!106 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !108, line: 61, baseType: !109)
!108 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIGlobalVariableExpression(var: !111)
!111 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 147, type: !112, isLocal: true, isDefinition: true)
!112 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!113 = !DIGlobalVariableExpression(var: !114)
!114 = distinct !DIGlobalVariable(name: "infomap", scope: !115, file: !116, line: 632, type: !141, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !116, file: !116, line: 630, type: !117, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !119)
!116 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !DISubroutineType(types: !118)
!118 = !{null, !43}
!119 = !{!120, !121, !122, !129, !131, !132, !133, !136, !137, !139}
!120 = !DILocalVariable(name: "program", arg: 1, scope: !115, file: !116, line: 630, type: !43)
!121 = !DILocalVariable(name: "node", scope: !115, file: !116, line: 642, type: !43)
!122 = !DILocalVariable(name: "map_prog", scope: !115, file: !116, line: 643, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !115, file: !116, line: 632, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !125, file: !116, line: 632, baseType: !43, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !125, file: !116, line: 632, baseType: !43, size: 64, offset: 64)
!129 = !DILocalVariable(name: "__s1_len", scope: !130, file: !116, line: 645, type: !35)
!130 = distinct !DILexicalBlock(scope: !115, file: !116, line: 645, column: 33)
!131 = !DILocalVariable(name: "__s2_len", scope: !130, file: !116, line: 645, type: !35)
!132 = !DILocalVariable(name: "lc_messages", scope: !115, file: !116, line: 655, type: !43)
!133 = !DILocalVariable(name: "__s1_len", scope: !134, file: !116, line: 656, type: !35)
!134 = distinct !DILexicalBlock(scope: !135, file: !116, line: 656, column: 22)
!135 = distinct !DILexicalBlock(scope: !115, file: !116, line: 656, column: 7)
!136 = !DILocalVariable(name: "__s2_len", scope: !134, file: !116, line: 656, type: !35)
!137 = !DILocalVariable(name: "__s2", scope: !138, file: !116, line: 656, type: !40)
!138 = distinct !DILexicalBlock(scope: !134, file: !116, line: 656, column: 22)
!139 = !DILocalVariable(name: "__result", scope: !138, file: !116, line: 656, type: !140)
!140 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 896, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 7)
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "header_type", scope: !2, file: !3, line: 70, type: !43, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147)
!147 = distinct !DIGlobalVariable(name: "body_type", scope: !2, file: !3, line: 67, type: !43, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "footer_type", scope: !2, file: !3, line: 73, type: !43, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !2, file: !3, line: 126, type: !105, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "page_incr", scope: !2, file: !3, line: 129, type: !105, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !2, file: !3, line: 132, type: !112, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157)
!157 = distinct !DIGlobalVariable(name: "blank_join", scope: !2, file: !3, line: 135, type: !105, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "separator_str", scope: !2, file: !3, line: 96, type: !43, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161)
!161 = distinct !DIGlobalVariable(name: "lineno_width", scope: !2, file: !3, line: 138, type: !140, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !2, file: !3, line: 54, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 8)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "lineno_format", scope: !2, file: !3, line: 141, type: !43, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170)
!170 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !2, file: !3, line: 48, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 56, elements: !142)
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !2, file: !3, line: 51, type: !164, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175)
!175 = distinct !DIGlobalVariable(name: "section_del", scope: !2, file: !3, line: 99, type: !43, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !2, file: !3, line: 57, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "header_del", scope: !2, file: !3, line: 102, type: !46, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "body_del", scope: !2, file: !3, line: 108, type: !46, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "footer_del", scope: !2, file: !3, line: 114, type: !46, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188)
!188 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !2, file: !3, line: 123, type: !46, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "current_regex", scope: !2, file: !3, line: 93, type: !191, isLocal: true, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "blank_lines", scope: !194, file: !3, line: 324, type: !105, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "proc_text", scope: !3, file: !3, line: 322, type: !195, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{null}
!197 = !{}
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 3584, elements: !208)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !201, line: 104, size: 256, elements: !202)
!201 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!202 = !{!203, !204, !205, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !201, line: 106, baseType: !43, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !200, file: !201, line: 109, baseType: !140, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 110, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !200, file: !201, line: 111, baseType: !140, size: 32, offset: 192)
!208 = !{!209}
!209 = !DISubrange(count: 14)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "Version", scope: !212, file: !213, line: 2, type: !43, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, globals: !214)
!213 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{!210}
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "file_name", scope: !217, file: !222, line: 36, type: !43, isLocal: true, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, globals: !219)
!218 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!219 = !{!215, !220}
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !217, file: !222, line: 46, type: !112, isLocal: true, isDefinition: true)
!222 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "exit_failure", scope: !225, file: !228, line: 24, type: !229, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, globals: !227)
!226 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!227 = !{!223}
!228 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!229 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !140)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "program_name", scope: !232, file: !236, line: 33, type: !43, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !234, globals: !235)
!233 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!234 = !{!47, !46}
!235 = !{!230}
!236 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!237 = !DIGlobalVariableExpression(var: !238)
!238 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !239, file: !267, line: 77, type: !297, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !241, retainedTypes: !262, globals: !264)
!240 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!241 = !{!5, !242, !247}
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !243)
!243 = !{!244, !245, !246}
!244 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!245 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!246 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !248, line: 46, size: 32, elements: !249)
!248 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!250 = !DIEnumerator(name: "_ISupper", value: 256)
!251 = !DIEnumerator(name: "_ISlower", value: 512)
!252 = !DIEnumerator(name: "_ISalpha", value: 1024)
!253 = !DIEnumerator(name: "_ISdigit", value: 2048)
!254 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!255 = !DIEnumerator(name: "_ISspace", value: 8192)
!256 = !DIEnumerator(name: "_ISprint", value: 16384)
!257 = !DIEnumerator(name: "_ISgraph", value: 32768)
!258 = !DIEnumerator(name: "_ISblank", value: 1)
!259 = !DIEnumerator(name: "_IScntrl", value: 2)
!260 = !DIEnumerator(name: "_ISpunct", value: 4)
!261 = !DIEnumerator(name: "_ISalnum", value: 8)
!262 = !{!140, !263, !35, !46}
!263 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!264 = !{!237, !265, !272, !282, !284, !286, !293, !295}
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !239, file: !267, line: 93, type: !268, isDefinition: true)
!267 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 320, elements: !270)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!270 = !{!271}
!271 = !DISubrange(count: 10)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !239, file: !267, line: 1043, type: !274, isDefinition: true)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !267, line: 57, size: 448, elements: !275)
!275 = !{!276, !277, !278, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !274, file: !267, line: 60, baseType: !5, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !267, line: 63, baseType: !140, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !274, file: !267, line: 67, baseType: !279, size: 256, offset: 64)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !165)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !274, file: !267, line: 70, baseType: !43, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !274, file: !267, line: 73, baseType: !43, size: 64, offset: 384)
!282 = !DIGlobalVariableExpression(var: !283)
!283 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !239, file: !267, line: 108, type: !274, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285)
!285 = distinct !DIGlobalVariable(name: "slot0", scope: !239, file: !267, line: 834, type: !82, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "slotvec", scope: !239, file: !267, line: 837, type: !288, isLocal: true, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !267, line: 826, size: 128, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !289, file: !267, line: 828, baseType: !35, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !289, file: !267, line: 829, baseType: !46, size: 64, offset: 64)
!293 = !DIGlobalVariableExpression(var: !294)
!294 = distinct !DIGlobalVariable(name: "nslots", scope: !239, file: !267, line: 835, type: !140, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296)
!296 = distinct !DIGlobalVariable(name: "slotvec0", scope: !239, file: !267, line: 836, type: !289, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 704, elements: !299)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!299 = !{!300}
!300 = !DISubrange(count: 11)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !303, file: !306, line: 26, type: !307, isDefinition: true)
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, globals: !305)
!304 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!305 = !{!301}
!306 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 376, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 47)
!310 = !DIGlobalVariableExpression(var: !311)
!311 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !312, file: !655, line: 120, type: !656, isLocal: true, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !314, retainedTypes: !653, globals: !654)
!313 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!314 = !{!315}
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 41, size: 32, elements: !317)
!316 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!318 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!319 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!320 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!321 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!322 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!323 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!324 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!325 = !DIEnumerator(name: "DAY_1", value: 131079)
!326 = !DIEnumerator(name: "DAY_2", value: 131080)
!327 = !DIEnumerator(name: "DAY_3", value: 131081)
!328 = !DIEnumerator(name: "DAY_4", value: 131082)
!329 = !DIEnumerator(name: "DAY_5", value: 131083)
!330 = !DIEnumerator(name: "DAY_6", value: 131084)
!331 = !DIEnumerator(name: "DAY_7", value: 131085)
!332 = !DIEnumerator(name: "ABMON_1", value: 131086)
!333 = !DIEnumerator(name: "ABMON_2", value: 131087)
!334 = !DIEnumerator(name: "ABMON_3", value: 131088)
!335 = !DIEnumerator(name: "ABMON_4", value: 131089)
!336 = !DIEnumerator(name: "ABMON_5", value: 131090)
!337 = !DIEnumerator(name: "ABMON_6", value: 131091)
!338 = !DIEnumerator(name: "ABMON_7", value: 131092)
!339 = !DIEnumerator(name: "ABMON_8", value: 131093)
!340 = !DIEnumerator(name: "ABMON_9", value: 131094)
!341 = !DIEnumerator(name: "ABMON_10", value: 131095)
!342 = !DIEnumerator(name: "ABMON_11", value: 131096)
!343 = !DIEnumerator(name: "ABMON_12", value: 131097)
!344 = !DIEnumerator(name: "MON_1", value: 131098)
!345 = !DIEnumerator(name: "MON_2", value: 131099)
!346 = !DIEnumerator(name: "MON_3", value: 131100)
!347 = !DIEnumerator(name: "MON_4", value: 131101)
!348 = !DIEnumerator(name: "MON_5", value: 131102)
!349 = !DIEnumerator(name: "MON_6", value: 131103)
!350 = !DIEnumerator(name: "MON_7", value: 131104)
!351 = !DIEnumerator(name: "MON_8", value: 131105)
!352 = !DIEnumerator(name: "MON_9", value: 131106)
!353 = !DIEnumerator(name: "MON_10", value: 131107)
!354 = !DIEnumerator(name: "MON_11", value: 131108)
!355 = !DIEnumerator(name: "MON_12", value: 131109)
!356 = !DIEnumerator(name: "AM_STR", value: 131110)
!357 = !DIEnumerator(name: "PM_STR", value: 131111)
!358 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!359 = !DIEnumerator(name: "D_FMT", value: 131113)
!360 = !DIEnumerator(name: "T_FMT", value: 131114)
!361 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!362 = !DIEnumerator(name: "ERA", value: 131116)
!363 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!364 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!365 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!366 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!367 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!368 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!369 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!370 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!371 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!372 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!373 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!374 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!375 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!376 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!377 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!378 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!379 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!380 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!381 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!382 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!383 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!384 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!385 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!386 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!387 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!388 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!389 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!390 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!391 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!392 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!393 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!394 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!395 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!396 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!397 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!398 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!399 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!400 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!401 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!402 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!403 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!404 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!405 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!406 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!407 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!408 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!409 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!410 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!411 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!412 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!413 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!414 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!415 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!416 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!417 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!418 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!419 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!420 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!421 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!422 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!423 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!424 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!425 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!426 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!427 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!428 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!429 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!430 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!431 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!432 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!433 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!434 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!435 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!436 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!437 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!438 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!439 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!440 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!441 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!442 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!443 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!444 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!445 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!446 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!447 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!448 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!449 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!450 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!451 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!452 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!453 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!454 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!455 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!456 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!457 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!458 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!459 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!460 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!461 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!462 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!463 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!464 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!465 = !DIEnumerator(name: "CODESET", value: 14)
!466 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!467 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!469 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!512 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!513 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!514 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!515 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!516 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!517 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!518 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!519 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!521 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!522 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!524 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!525 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!526 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!527 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!528 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!529 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!530 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!537 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!538 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!539 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!540 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!541 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!542 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!543 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!544 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!545 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!546 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!547 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!548 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!549 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!550 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!551 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!552 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!553 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!554 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!555 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!556 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!557 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!558 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!559 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!563 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!576 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!577 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!580 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!581 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!582 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!583 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!584 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!585 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!586 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!587 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!588 = !DIEnumerator(name: "THOUSEP", value: 65537)
!589 = !DIEnumerator(name: "__GROUPING", value: 65538)
!590 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!591 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!592 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!593 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!594 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!595 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!596 = !DIEnumerator(name: "__YESSTR", value: 327682)
!597 = !DIEnumerator(name: "__NOSTR", value: 327683)
!598 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!599 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!600 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!601 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!602 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!603 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!604 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!605 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!606 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!607 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!608 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!609 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!610 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!611 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!612 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!613 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!614 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!615 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!616 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!617 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!618 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!619 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!620 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!621 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!622 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!623 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!624 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!625 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!626 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!627 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!628 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!629 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!630 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!631 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!632 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!633 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!634 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!638 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!639 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!640 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!641 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!651 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!652 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!653 = !{!47, !46, !66}
!654 = !{!310}
!655 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !659)
!658 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = !{!19}
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !662)
!661 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = !{!66}
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !665, retainedTypes: !670)
!664 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!665 = !{!666}
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !667, line: 41, size: 32, elements: !668)
!667 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!668 = !{!669}
!669 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!670 = !{!47}
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !673, retainedTypes: !687)
!672 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!673 = !{!674}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !676, file: !675, line: 192, size: 32, elements: !685)
!675 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = distinct !DISubprogram(name: "x2nrealloc", scope: !675, file: !675, line: 180, type: !677, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !671, variables: !680)
!677 = !DISubroutineType(types: !678)
!678 = !{!47, !47, !679, !35}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!680 = !{!681, !682, !683, !684}
!681 = !DILocalVariable(name: "p", arg: 1, scope: !676, file: !675, line: 180, type: !47)
!682 = !DILocalVariable(name: "pn", arg: 2, scope: !676, file: !675, line: 180, type: !679)
!683 = !DILocalVariable(name: "s", arg: 3, scope: !676, file: !675, line: 180, type: !35)
!684 = !DILocalVariable(name: "n", scope: !676, file: !675, line: 182, type: !35)
!685 = !{!686}
!686 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!687 = !{!35, !46, !47}
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197)
!689 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !692)
!691 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!692 = !{!693}
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !694, line: 26, size: 32, elements: !695)
!694 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!695 = !{!696, !697, !698, !699, !700}
!696 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!697 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!698 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!699 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!700 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !692, retainedTypes: !703)
!702 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!703 = !{!46}
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !670)
!705 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197)
!707 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !670)
!709 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !670)
!711 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !714)
!713 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!714 = !{!35}
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197)
!716 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !719)
!718 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!719 = !{!35, !38, !40, !43}
!720 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!721 = !{i32 2, !"Dwarf Version", i32 4}
!722 = !{i32 2, !"Debug Info Version", i32 3}
!723 = !{i32 1, !"PIC Level", i32 2}
!724 = !{i32 1, !"PIE Level", i32 2}
!725 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 170, type: !726, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !140}
!728 = !{!729}
!729 = !DILocalVariable(name: "status", arg: 1, scope: !725, file: !3, line: 170, type: !140)
!730 = !DIExpression()
!731 = !DILocation(line: 170, column: 12, scope: !725)
!732 = !DILocation(line: 172, column: 14, scope: !733)
!733 = distinct !DILexicalBlock(scope: !725, file: !3, line: 172, column: 7)
!734 = !DILocation(line: 172, column: 7, scope: !725)
!735 = !DILocation(line: 173, column: 5, scope: !736)
!736 = !DILexicalBlockFile(scope: !737, file: !3, discriminator: 1)
!737 = distinct !DILexicalBlock(scope: !733, file: !3, line: 173, column: 5)
!738 = !{!739, !739, i64 0}
!739 = !{!"any pointer", !740, i64 0}
!740 = !{!"omnipotent char", !741, i64 0}
!741 = !{!"Simple C/C++ TBAA"}
!742 = !DILocation(line: 173, column: 5, scope: !743)
!743 = !DILexicalBlockFile(scope: !737, file: !3, discriminator: 3)
!744 = !DILocation(line: 173, column: 5, scope: !745)
!745 = !DILexicalBlockFile(scope: !737, file: !3, discriminator: 2)
!746 = !DILocation(line: 176, column: 7, scope: !747)
!747 = distinct !DILexicalBlock(scope: !733, file: !3, line: 175, column: 5)
!748 = !DILocation(line: 176, column: 7, scope: !749)
!749 = !DILexicalBlockFile(scope: !747, file: !3, discriminator: 1)
!750 = !DILocation(line: 180, column: 7, scope: !747)
!751 = !DILocation(line: 180, column: 7, scope: !749)
!752 = !DILocation(line: 580, column: 3, scope: !753, inlinedAt: !754)
!753 = distinct !DISubprogram(name: "emit_stdin_note", scope: !116, file: !116, line: 578, type: !195, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !197)
!754 = distinct !DILocation(line: 184, column: 7, scope: !747)
!755 = !DILocation(line: 580, column: 3, scope: !756, inlinedAt: !754)
!756 = !DILexicalBlockFile(scope: !753, file: !116, discriminator: 1)
!757 = !DILocation(line: 587, column: 3, scope: !758, inlinedAt: !759)
!758 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !116, file: !116, line: 585, type: !195, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !197)
!759 = distinct !DILocation(line: 185, column: 7, scope: !747)
!760 = !DILocation(line: 587, column: 3, scope: !761, inlinedAt: !759)
!761 = !DILexicalBlockFile(scope: !758, file: !116, discriminator: 1)
!762 = !DILocation(line: 187, column: 7, scope: !747)
!763 = !DILocation(line: 187, column: 7, scope: !749)
!764 = !DILocation(line: 192, column: 7, scope: !747)
!765 = !DILocation(line: 192, column: 7, scope: !749)
!766 = !DILocation(line: 200, column: 7, scope: !747)
!767 = !DILocation(line: 200, column: 7, scope: !749)
!768 = !DILocation(line: 204, column: 7, scope: !747)
!769 = !DILocation(line: 204, column: 7, scope: !749)
!770 = !DILocation(line: 205, column: 7, scope: !747)
!771 = !DILocation(line: 205, column: 7, scope: !749)
!772 = !DILocation(line: 206, column: 7, scope: !747)
!773 = !DILocation(line: 206, column: 7, scope: !749)
!774 = !DILocation(line: 212, column: 7, scope: !747)
!775 = !DILocation(line: 212, column: 7, scope: !749)
!776 = !DILocation(line: 642, column: 15, scope: !115, inlinedAt: !777)
!777 = distinct !DILocation(line: 227, column: 7, scope: !747)
!778 = !DILocation(line: 651, column: 3, scope: !115, inlinedAt: !777)
!779 = !DILocation(line: 651, column: 3, scope: !780, inlinedAt: !777)
!780 = !DILexicalBlockFile(scope: !115, file: !116, discriminator: 1)
!781 = !DILocation(line: 655, column: 29, scope: !115, inlinedAt: !777)
!782 = !DILocation(line: 655, column: 15, scope: !115, inlinedAt: !777)
!783 = !DILocation(line: 656, column: 7, scope: !135, inlinedAt: !777)
!784 = !DILocation(line: 656, column: 19, scope: !135, inlinedAt: !777)
!785 = !DILocation(line: 656, column: 22, scope: !786, inlinedAt: !777)
!786 = !DILexicalBlockFile(scope: !135, file: !116, discriminator: 16)
!787 = !DILocation(line: 656, column: 7, scope: !788, inlinedAt: !777)
!788 = !DILexicalBlockFile(scope: !115, file: !116, discriminator: 16)
!789 = !DILocation(line: 662, column: 7, scope: !790, inlinedAt: !777)
!790 = distinct !DILexicalBlock(scope: !135, file: !116, line: 657, column: 5)
!791 = !DILocation(line: 662, column: 7, scope: !792, inlinedAt: !777)
!792 = !DILexicalBlockFile(scope: !790, file: !116, discriminator: 1)
!793 = !DILocation(line: 664, column: 5, scope: !790, inlinedAt: !777)
!794 = !DILocation(line: 665, column: 3, scope: !115, inlinedAt: !777)
!795 = !DILocation(line: 665, column: 3, scope: !780, inlinedAt: !777)
!796 = !DILocation(line: 667, column: 3, scope: !115, inlinedAt: !777)
!797 = !DILocation(line: 667, column: 3, scope: !780, inlinedAt: !777)
!798 = !DILocation(line: 229, column: 3, scope: !725)
!799 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 459, type: !800, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !803)
!800 = !DISubroutineType(types: !801)
!801 = !{!140, !140, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!803 = !{!804, !805, !806, !807, !808, !809, !814, !815, !817, !818, !821, !822, !824, !825, !828, !829, !831}
!804 = !DILocalVariable(name: "argc", arg: 1, scope: !799, file: !3, line: 459, type: !140)
!805 = !DILocalVariable(name: "argv", arg: 2, scope: !799, file: !3, line: 459, type: !802)
!806 = !DILocalVariable(name: "c", scope: !799, file: !3, line: 461, type: !140)
!807 = !DILocalVariable(name: "len", scope: !799, file: !3, line: 462, type: !35)
!808 = !DILocalVariable(name: "ok", scope: !799, file: !3, line: 463, type: !112)
!809 = !DILocalVariable(name: "__s1_len", scope: !810, file: !3, line: 528, type: !35)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 528, column: 15)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 528, column: 15)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 479, column: 9)
!813 = distinct !DILexicalBlock(scope: !799, file: !3, line: 477, column: 5)
!814 = !DILocalVariable(name: "__s2_len", scope: !810, file: !3, line: 528, type: !35)
!815 = !DILocalVariable(name: "__s2", scope: !816, file: !3, line: 528, type: !40)
!816 = distinct !DILexicalBlock(scope: !810, file: !3, line: 528, column: 15)
!817 = !DILocalVariable(name: "__result", scope: !816, file: !3, line: 528, type: !140)
!818 = !DILocalVariable(name: "__s1_len", scope: !819, file: !3, line: 530, type: !35)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 530, column: 20)
!820 = distinct !DILexicalBlock(scope: !811, file: !3, line: 530, column: 20)
!821 = !DILocalVariable(name: "__s2_len", scope: !819, file: !3, line: 530, type: !35)
!822 = !DILocalVariable(name: "__s2", scope: !823, file: !3, line: 530, type: !40)
!823 = distinct !DILexicalBlock(scope: !819, file: !3, line: 530, column: 20)
!824 = !DILocalVariable(name: "__result", scope: !823, file: !3, line: 530, type: !140)
!825 = !DILocalVariable(name: "__s1_len", scope: !826, file: !3, line: 532, type: !35)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 532, column: 20)
!827 = distinct !DILexicalBlock(scope: !820, file: !3, line: 532, column: 20)
!828 = !DILocalVariable(name: "__s2_len", scope: !826, file: !3, line: 532, type: !35)
!829 = !DILocalVariable(name: "__s2", scope: !830, file: !3, line: 532, type: !40)
!830 = distinct !DILexicalBlock(scope: !826, file: !3, line: 532, column: 20)
!831 = !DILocalVariable(name: "__result", scope: !830, file: !3, line: 532, type: !140)
!832 = !DILocation(line: 459, column: 11, scope: !799)
!833 = !DILocation(line: 459, column: 24, scope: !799)
!834 = !DILocation(line: 463, column: 8, scope: !799)
!835 = !DILocation(line: 466, column: 21, scope: !799)
!836 = !DILocation(line: 466, column: 3, scope: !799)
!837 = !DILocation(line: 467, column: 3, scope: !799)
!838 = !DILocation(line: 468, column: 3, scope: !799)
!839 = !DILocation(line: 469, column: 3, scope: !799)
!840 = !DILocation(line: 471, column: 3, scope: !799)
!841 = !DILocation(line: 475, column: 3, scope: !799)
!842 = !DILocation(line: 475, column: 15, scope: !843)
!843 = !DILexicalBlockFile(scope: !799, file: !3, discriminator: 1)
!844 = !DILocation(line: 461, column: 7, scope: !799)
!845 = !DILocation(line: 475, column: 3, scope: !843)
!846 = !DILocalVariable(name: "typep", arg: 1, scope: !847, file: !3, line: 236, type: !850)
!847 = distinct !DISubprogram(name: "build_type_arg", scope: !3, file: !3, line: 236, type: !848, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !851)
!848 = !DISubroutineType(types: !849)
!849 = !{!112, !850, !191, !46}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!851 = !{!846, !852, !853, !854, !855}
!852 = !DILocalVariable(name: "regexp", arg: 2, scope: !847, file: !3, line: 237, type: !191)
!853 = !DILocalVariable(name: "fastmap", arg: 3, scope: !847, file: !3, line: 237, type: !46)
!854 = !DILocalVariable(name: "errmsg", scope: !847, file: !3, line: 239, type: !43)
!855 = !DILocalVariable(name: "rval", scope: !847, file: !3, line: 240, type: !112)
!856 = !DILocation(line: 236, column: 30, scope: !847, inlinedAt: !857)
!857 = distinct !DILocation(line: 481, column: 17, scope: !858)
!858 = distinct !DILexicalBlock(scope: !812, file: !3, line: 481, column: 15)
!859 = !DILocation(line: 237, column: 43, scope: !847, inlinedAt: !857)
!860 = !DILocation(line: 237, column: 57, scope: !847, inlinedAt: !857)
!861 = !DILocation(line: 240, column: 8, scope: !847, inlinedAt: !857)
!862 = !DILocation(line: 242, column: 12, scope: !847, inlinedAt: !857)
!863 = !DILocation(line: 242, column: 11, scope: !847, inlinedAt: !857)
!864 = !{!740, !740, i64 0}
!865 = !DILocation(line: 242, column: 3, scope: !847, inlinedAt: !857)
!866 = !DILocation(line: 247, column: 14, scope: !867, inlinedAt: !857)
!867 = distinct !DILexicalBlock(scope: !847, file: !3, line: 243, column: 5)
!868 = !DILocation(line: 248, column: 7, scope: !867, inlinedAt: !857)
!869 = !DILocation(line: 250, column: 22, scope: !867, inlinedAt: !857)
!870 = !DILocation(line: 250, column: 14, scope: !867, inlinedAt: !857)
!871 = !DILocation(line: 252, column: 25, scope: !867, inlinedAt: !857)
!872 = !DILocation(line: 253, column: 23, scope: !867, inlinedAt: !857)
!873 = !DILocation(line: 255, column: 25, scope: !867, inlinedAt: !857)
!874 = !{!875, !875, i64 0}
!875 = !{!"long", !740, i64 0}
!876 = !DILocation(line: 257, column: 44, scope: !867, inlinedAt: !857)
!877 = !DILocation(line: 257, column: 16, scope: !878, inlinedAt: !857)
!878 = !DILexicalBlockFile(scope: !867, file: !3, discriminator: 1)
!879 = !DILocation(line: 239, column: 15, scope: !847, inlinedAt: !857)
!880 = !DILocation(line: 258, column: 11, scope: !881, inlinedAt: !857)
!881 = distinct !DILexicalBlock(scope: !867, file: !3, line: 258, column: 11)
!882 = !DILocation(line: 258, column: 11, scope: !867, inlinedAt: !857)
!883 = !DILocation(line: 259, column: 9, scope: !881, inlinedAt: !857)
!884 = !DILocation(line: 483, column: 28, scope: !885)
!885 = distinct !DILexicalBlock(scope: !858, file: !3, line: 482, column: 13)
!886 = !DILocation(line: 484, column: 29, scope: !885)
!887 = !DILocation(line: 484, column: 22, scope: !885)
!888 = !DILocation(line: 483, column: 15, scope: !889)
!889 = !DILexicalBlockFile(scope: !885, file: !3, discriminator: 1)
!890 = !DILocation(line: 486, column: 13, scope: !885)
!891 = !DILocation(line: 236, column: 30, scope: !847, inlinedAt: !892)
!892 = distinct !DILocation(line: 489, column: 17, scope: !893)
!893 = distinct !DILexicalBlock(scope: !812, file: !3, line: 489, column: 15)
!894 = !DILocation(line: 237, column: 43, scope: !847, inlinedAt: !892)
!895 = !DILocation(line: 237, column: 57, scope: !847, inlinedAt: !892)
!896 = !DILocation(line: 240, column: 8, scope: !847, inlinedAt: !892)
!897 = !DILocation(line: 242, column: 12, scope: !847, inlinedAt: !892)
!898 = !DILocation(line: 242, column: 11, scope: !847, inlinedAt: !892)
!899 = !DILocation(line: 242, column: 3, scope: !847, inlinedAt: !892)
!900 = !DILocation(line: 247, column: 14, scope: !867, inlinedAt: !892)
!901 = !DILocation(line: 248, column: 7, scope: !867, inlinedAt: !892)
!902 = !DILocation(line: 250, column: 22, scope: !867, inlinedAt: !892)
!903 = !DILocation(line: 250, column: 14, scope: !867, inlinedAt: !892)
!904 = !DILocation(line: 252, column: 25, scope: !867, inlinedAt: !892)
!905 = !DILocation(line: 253, column: 23, scope: !867, inlinedAt: !892)
!906 = !DILocation(line: 255, column: 25, scope: !867, inlinedAt: !892)
!907 = !DILocation(line: 257, column: 44, scope: !867, inlinedAt: !892)
!908 = !DILocation(line: 257, column: 16, scope: !878, inlinedAt: !892)
!909 = !DILocation(line: 239, column: 15, scope: !847, inlinedAt: !892)
!910 = !DILocation(line: 258, column: 11, scope: !881, inlinedAt: !892)
!911 = !DILocation(line: 258, column: 11, scope: !867, inlinedAt: !892)
!912 = !DILocation(line: 259, column: 9, scope: !881, inlinedAt: !892)
!913 = !DILocation(line: 491, column: 28, scope: !914)
!914 = distinct !DILexicalBlock(scope: !893, file: !3, line: 490, column: 13)
!915 = !DILocation(line: 492, column: 29, scope: !914)
!916 = !DILocation(line: 492, column: 22, scope: !914)
!917 = !DILocation(line: 491, column: 15, scope: !918)
!918 = !DILexicalBlockFile(scope: !914, file: !3, discriminator: 1)
!919 = !DILocation(line: 494, column: 13, scope: !914)
!920 = !DILocation(line: 236, column: 30, scope: !847, inlinedAt: !921)
!921 = distinct !DILocation(line: 497, column: 17, scope: !922)
!922 = distinct !DILexicalBlock(scope: !812, file: !3, line: 497, column: 15)
!923 = !DILocation(line: 237, column: 43, scope: !847, inlinedAt: !921)
!924 = !DILocation(line: 237, column: 57, scope: !847, inlinedAt: !921)
!925 = !DILocation(line: 240, column: 8, scope: !847, inlinedAt: !921)
!926 = !DILocation(line: 242, column: 12, scope: !847, inlinedAt: !921)
!927 = !DILocation(line: 242, column: 11, scope: !847, inlinedAt: !921)
!928 = !DILocation(line: 242, column: 3, scope: !847, inlinedAt: !921)
!929 = !DILocation(line: 247, column: 14, scope: !867, inlinedAt: !921)
!930 = !DILocation(line: 248, column: 7, scope: !867, inlinedAt: !921)
!931 = !DILocation(line: 250, column: 22, scope: !867, inlinedAt: !921)
!932 = !DILocation(line: 250, column: 14, scope: !867, inlinedAt: !921)
!933 = !DILocation(line: 252, column: 25, scope: !867, inlinedAt: !921)
!934 = !DILocation(line: 253, column: 23, scope: !867, inlinedAt: !921)
!935 = !DILocation(line: 255, column: 25, scope: !867, inlinedAt: !921)
!936 = !DILocation(line: 257, column: 44, scope: !867, inlinedAt: !921)
!937 = !DILocation(line: 257, column: 16, scope: !878, inlinedAt: !921)
!938 = !DILocation(line: 239, column: 15, scope: !847, inlinedAt: !921)
!939 = !DILocation(line: 258, column: 11, scope: !881, inlinedAt: !921)
!940 = !DILocation(line: 258, column: 11, scope: !867, inlinedAt: !921)
!941 = !DILocation(line: 259, column: 9, scope: !881, inlinedAt: !921)
!942 = !DILocation(line: 499, column: 28, scope: !943)
!943 = distinct !DILexicalBlock(scope: !922, file: !3, line: 498, column: 13)
!944 = !DILocation(line: 500, column: 29, scope: !943)
!945 = !DILocation(line: 500, column: 22, scope: !943)
!946 = !DILocation(line: 499, column: 15, scope: !947)
!947 = !DILexicalBlockFile(scope: !943, file: !3, discriminator: 1)
!948 = !DILocation(line: 502, column: 13, scope: !943)
!949 = !DILocation(line: 505, column: 46, scope: !812)
!950 = !DILocation(line: 506, column: 46, scope: !812)
!951 = !DILocation(line: 505, column: 34, scope: !812)
!952 = !DILocation(line: 505, column: 32, scope: !812)
!953 = !DILocation(line: 508, column: 11, scope: !812)
!954 = !DILocation(line: 510, column: 35, scope: !812)
!955 = !DILocation(line: 511, column: 35, scope: !812)
!956 = !DILocation(line: 510, column: 23, scope: !812)
!957 = !DILocation(line: 510, column: 21, scope: !812)
!958 = !DILocation(line: 512, column: 11, scope: !812)
!959 = !DILocation(line: 515, column: 11, scope: !812)
!960 = !DILocation(line: 517, column: 36, scope: !812)
!961 = !DILocation(line: 518, column: 36, scope: !812)
!962 = !DILocation(line: 517, column: 24, scope: !812)
!963 = !DILocation(line: 517, column: 22, scope: !812)
!964 = !DILocation(line: 519, column: 11, scope: !812)
!965 = !DILocation(line: 521, column: 27, scope: !812)
!966 = !DILocation(line: 521, column: 25, scope: !812)
!967 = !DILocation(line: 522, column: 11, scope: !812)
!968 = !DILocation(line: 524, column: 38, scope: !812)
!969 = !DILocation(line: 525, column: 38, scope: !812)
!970 = !DILocation(line: 524, column: 26, scope: !812)
!971 = !DILocation(line: 524, column: 24, scope: !812)
!972 = !{!973, !973, i64 0}
!973 = !{!"int", !740, i64 0}
!974 = !DILocation(line: 526, column: 11, scope: !812)
!975 = !DILocation(line: 528, column: 15, scope: !810)
!976 = !DILocation(line: 528, column: 15, scope: !977)
!977 = !DILexicalBlockFile(scope: !816, file: !3, discriminator: 2)
!978 = !DILocation(line: 528, column: 15, scope: !816)
!979 = !DILocation(line: 528, column: 15, scope: !980)
!980 = !DILexicalBlockFile(scope: !981, file: !3, discriminator: 2)
!981 = distinct !DILexicalBlock(scope: !816, file: !3, line: 528, column: 15)
!982 = !DILocation(line: 528, column: 15, scope: !983)
!983 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 4)
!984 = distinct !DILexicalBlock(scope: !981, file: !3, line: 528, column: 15)
!985 = !DILocation(line: 528, column: 15, scope: !986)
!986 = !DILexicalBlockFile(scope: !987, file: !3, discriminator: 5)
!987 = distinct !DILexicalBlock(scope: !984, file: !3, line: 528, column: 15)
!988 = !DILocation(line: 528, column: 15, scope: !989)
!989 = !DILexicalBlockFile(scope: !987, file: !3, discriminator: 4)
!990 = !DILocation(line: 528, column: 15, scope: !991)
!991 = !DILexicalBlockFile(scope: !992, file: !3, discriminator: 6)
!992 = distinct !DILexicalBlock(scope: !987, file: !3, line: 528, column: 15)
!993 = !DILocation(line: 528, column: 15, scope: !994)
!994 = !DILexicalBlockFile(scope: !811, file: !3, discriminator: 13)
!995 = !DILocation(line: 528, column: 15, scope: !996)
!996 = !DILexicalBlockFile(scope: !812, file: !3, discriminator: 13)
!997 = !DILocation(line: 529, column: 27, scope: !811)
!998 = !DILocation(line: 529, column: 13, scope: !811)
!999 = distinct !{!999, !841, !1000}
!1000 = !DILocation(line: 550, column: 5, scope: !799)
!1001 = !DILocation(line: 530, column: 20, scope: !819)
!1002 = !DILocation(line: 530, column: 20, scope: !823)
!1003 = !DILocation(line: 530, column: 20, scope: !1004)
!1004 = !DILexicalBlockFile(scope: !1005, file: !3, discriminator: 3)
!1005 = distinct !DILexicalBlock(scope: !823, file: !3, line: 530, column: 20)
!1006 = !DILocation(line: 530, column: 20, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !1005, file: !3, discriminator: 2)
!1008 = !DILocation(line: 530, column: 20, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !1010, file: !3, discriminator: 4)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 530, column: 20)
!1011 = !DILocation(line: 530, column: 20, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !1013, file: !3, discriminator: 5)
!1013 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 530, column: 20)
!1014 = !DILocation(line: 530, column: 20, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !1013, file: !3, discriminator: 4)
!1016 = !DILocation(line: 530, column: 20, scope: !1017)
!1017 = !DILexicalBlockFile(scope: !1018, file: !3, discriminator: 6)
!1018 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 530, column: 20)
!1019 = !DILocation(line: 530, column: 20, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !820, file: !3, discriminator: 13)
!1021 = !DILocation(line: 530, column: 20, scope: !994)
!1022 = !DILocation(line: 531, column: 27, scope: !820)
!1023 = !DILocation(line: 531, column: 13, scope: !820)
!1024 = !DILocation(line: 532, column: 20, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1026, file: !3, discriminator: 4)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 532, column: 20)
!1027 = distinct !DILexicalBlock(scope: !830, file: !3, line: 532, column: 20)
!1028 = !DILocation(line: 532, column: 20, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1030, file: !3, discriminator: 5)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 532, column: 20)
!1031 = !DILocation(line: 532, column: 20, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !1030, file: !3, discriminator: 4)
!1033 = !DILocation(line: 532, column: 20, scope: !1034)
!1034 = !DILexicalBlockFile(scope: !1035, file: !3, discriminator: 6)
!1035 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 532, column: 20)
!1036 = !DILocation(line: 532, column: 20, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !827, file: !3, discriminator: 13)
!1038 = !DILocation(line: 532, column: 20, scope: !1020)
!1039 = !DILocation(line: 533, column: 27, scope: !827)
!1040 = !DILocation(line: 533, column: 13, scope: !827)
!1041 = !DILocation(line: 536, column: 28, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !827, file: !3, line: 535, column: 13)
!1043 = !DILocation(line: 537, column: 29, scope: !1042)
!1044 = !DILocation(line: 537, column: 22, scope: !1042)
!1045 = !DILocation(line: 536, column: 15, scope: !1046)
!1046 = !DILexicalBlockFile(scope: !1042, file: !3, discriminator: 1)
!1047 = !DILocation(line: 542, column: 25, scope: !812)
!1048 = !DILocation(line: 542, column: 23, scope: !812)
!1049 = !DILocation(line: 543, column: 11, scope: !812)
!1050 = !DILocation(line: 544, column: 9, scope: !812)
!1051 = !DILocation(line: 545, column: 9, scope: !812)
!1052 = !DILocation(line: 545, column: 9, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !812, file: !3, discriminator: 1)
!1054 = !DILocation(line: 552, column: 8, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !799, file: !3, line: 552, column: 7)
!1056 = !DILocation(line: 552, column: 7, scope: !799)
!1057 = !DILocation(line: 553, column: 5, scope: !1055)
!1058 = !DILocation(line: 556, column: 17, scope: !799)
!1059 = !DILocation(line: 556, column: 9, scope: !799)
!1060 = !DILocation(line: 462, column: 10, scope: !799)
!1061 = !DILocation(line: 558, column: 24, scope: !799)
!1062 = !DILocation(line: 558, column: 18, scope: !799)
!1063 = !DILocation(line: 559, column: 40, scope: !799)
!1064 = !DILocation(line: 559, column: 16, scope: !799)
!1065 = !DILocation(line: 559, column: 14, scope: !799)
!1066 = !DILocation(line: 560, column: 39, scope: !799)
!1067 = !DILocalVariable(name: "__dest", arg: 1, scope: !1068, file: !1069, line: 114, type: !1072)
!1068 = distinct !DISubprogram(name: "stpcpy", scope: !1069, file: !1069, line: 114, type: !1070, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1074)
!1069 = !DIFile(filename: "/usr/include/bits/string3.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!46, !1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !46)
!1073 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!1074 = !{!1067, !1075}
!1075 = !DILocalVariable(name: "__src", arg: 2, scope: !1068, file: !1069, line: 114, type: !1073)
!1076 = !DILocation(line: 114, column: 1, scope: !1068, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 560, column: 19, scope: !799)
!1078 = !DILocation(line: 116, column: 49, scope: !1068, inlinedAt: !1077)
!1079 = !DILocation(line: 116, column: 10, scope: !1068, inlinedAt: !1077)
!1080 = !DILocation(line: 560, column: 53, scope: !799)
!1081 = !DILocation(line: 114, column: 1, scope: !1068, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 560, column: 11, scope: !843)
!1083 = !DILocation(line: 116, column: 49, scope: !1068, inlinedAt: !1082)
!1084 = !DILocation(line: 116, column: 10, scope: !1068, inlinedAt: !1082)
!1085 = !DILocation(line: 560, column: 67, scope: !799)
!1086 = !DILocation(line: 114, column: 1, scope: !1068, inlinedAt: !1087)
!1087 = distinct !DILocation(line: 560, column: 3, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !799, file: !3, discriminator: 2)
!1089 = !DILocation(line: 116, column: 49, scope: !1068, inlinedAt: !1087)
!1090 = !DILocation(line: 116, column: 10, scope: !1068, inlinedAt: !1087)
!1091 = !DILocation(line: 562, column: 22, scope: !799)
!1092 = !DILocation(line: 562, column: 16, scope: !799)
!1093 = !DILocation(line: 563, column: 36, scope: !799)
!1094 = !DILocation(line: 563, column: 14, scope: !799)
!1095 = !DILocation(line: 563, column: 12, scope: !799)
!1096 = !DILocation(line: 564, column: 29, scope: !799)
!1097 = !DILocation(line: 114, column: 1, scope: !1068, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 564, column: 11, scope: !799)
!1099 = !DILocation(line: 116, column: 49, scope: !1068, inlinedAt: !1098)
!1100 = !DILocation(line: 116, column: 10, scope: !1068, inlinedAt: !1098)
!1101 = !DILocation(line: 564, column: 43, scope: !799)
!1102 = !DILocation(line: 114, column: 1, scope: !1068, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 564, column: 3, scope: !843)
!1104 = !DILocation(line: 116, column: 49, scope: !1068, inlinedAt: !1103)
!1105 = !DILocation(line: 116, column: 10, scope: !1068, inlinedAt: !1103)
!1106 = !DILocation(line: 566, column: 18, scope: !799)
!1107 = !DILocation(line: 567, column: 40, scope: !799)
!1108 = !DILocation(line: 567, column: 16, scope: !799)
!1109 = !DILocation(line: 567, column: 14, scope: !799)
!1110 = !DILocation(line: 568, column: 23, scope: !799)
!1111 = !DILocation(line: 114, column: 1, scope: !1068, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 568, column: 3, scope: !799)
!1113 = !DILocation(line: 116, column: 49, scope: !1068, inlinedAt: !1112)
!1114 = !DILocation(line: 116, column: 10, scope: !1068, inlinedAt: !1112)
!1115 = !DILocation(line: 571, column: 3, scope: !799)
!1116 = !DILocation(line: 574, column: 17, scope: !799)
!1117 = !DILocation(line: 574, column: 9, scope: !799)
!1118 = !DILocation(line: 575, column: 32, scope: !799)
!1119 = !DILocation(line: 575, column: 45, scope: !799)
!1120 = !DILocation(line: 575, column: 51, scope: !799)
!1121 = !DILocation(line: 575, column: 23, scope: !799)
!1122 = !DILocation(line: 575, column: 21, scope: !799)
!1123 = !DILocation(line: 576, column: 35, scope: !799)
!1124 = !DILocation(line: 576, column: 48, scope: !799)
!1125 = !DILocation(line: 576, column: 3, scope: !799)
!1126 = !DILocation(line: 577, column: 3, scope: !799)
!1127 = !DILocation(line: 577, column: 41, scope: !799)
!1128 = !DILocation(line: 579, column: 13, scope: !799)
!1129 = !DILocation(line: 579, column: 11, scope: !799)
!1130 = !DILocation(line: 580, column: 18, scope: !799)
!1131 = !DILocation(line: 580, column: 16, scope: !799)
!1132 = !DILocation(line: 581, column: 17, scope: !799)
!1133 = !DILocation(line: 585, column: 7, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !799, file: !3, line: 585, column: 7)
!1135 = !DILocation(line: 585, column: 14, scope: !1134)
!1136 = !DILocation(line: 585, column: 7, scope: !799)
!1137 = !DILocation(line: 588, column: 19, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1139, file: !3, discriminator: 1)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 588, column: 5)
!1140 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 588, column: 5)
!1141 = !DILocation(line: 588, column: 5, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1140, file: !3, discriminator: 1)
!1143 = !DILocation(line: 589, column: 22, scope: !1139)
!1144 = !DILocation(line: 586, column: 10, scope: !1134)
!1145 = !DILocation(line: 586, column: 8, scope: !1134)
!1146 = !DILocation(line: 586, column: 5, scope: !1134)
!1147 = !DILocation(line: 589, column: 13, scope: !1139)
!1148 = !DILocation(line: 589, column: 10, scope: !1139)
!1149 = !DILocation(line: 588, column: 33, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1139, file: !3, discriminator: 2)
!1151 = distinct !{!1151, !1152, !1153}
!1152 = !DILocation(line: 588, column: 5, scope: !1140)
!1153 = !DILocation(line: 589, column: 34, scope: !1140)
!1154 = !DILocation(line: 591, column: 23, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !799, file: !3, line: 591, column: 7)
!1156 = !DILocation(line: 591, column: 34, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1155, file: !3, discriminator: 1)
!1158 = !DILocation(line: 591, column: 26, scope: !1157)
!1159 = !DILocation(line: 591, column: 41, scope: !1157)
!1160 = !DILocation(line: 591, column: 7, scope: !843)
!1161 = !DILocation(line: 592, column: 5, scope: !1155)
!1162 = !DILocation(line: 592, column: 5, scope: !1157)
!1163 = !DILocation(line: 594, column: 10, scope: !799)
!1164 = !DILocation(line: 594, column: 3, scope: !799)
!1165 = distinct !DISubprogram(name: "nl_file", scope: !3, file: !3, line: 420, type: !1166, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1168)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!112, !43}
!1168 = !{!1169, !1170, !1224, !1227, !1228, !1230, !1231, !1234, !1235, !1237}
!1169 = !DILocalVariable(name: "file", arg: 1, scope: !1165, file: !3, line: 420, type: !43)
!1170 = !DILocalVariable(name: "stream", scope: !1165, file: !3, line: 422, type: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1173, line: 49, baseType: !1174)
!1173 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1175, line: 241, size: 1728, elements: !1176)
!1175 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1197, !1198, !1199, !1200, !1202, !1203, !1205, !1209, !1212, !1214, !1215, !1216, !1217, !1218, !1219, !1220}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1174, file: !1175, line: 242, baseType: !140, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1174, file: !1175, line: 247, baseType: !46, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1174, file: !1175, line: 248, baseType: !46, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1174, file: !1175, line: 249, baseType: !46, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1174, file: !1175, line: 250, baseType: !46, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1174, file: !1175, line: 251, baseType: !46, size: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1174, file: !1175, line: 252, baseType: !46, size: 64, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1174, file: !1175, line: 253, baseType: !46, size: 64, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1174, file: !1175, line: 254, baseType: !46, size: 64, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1174, file: !1175, line: 256, baseType: !46, size: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1174, file: !1175, line: 257, baseType: !46, size: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1174, file: !1175, line: 258, baseType: !46, size: 64, offset: 704)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1174, file: !1175, line: 260, baseType: !1190, size: 64, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1175, line: 156, size: 192, elements: !1192)
!1192 = !{!1193, !1194, !1196}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1191, file: !1175, line: 157, baseType: !1190, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1191, file: !1175, line: 158, baseType: !1195, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1191, file: !1175, line: 162, baseType: !140, size: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1174, file: !1175, line: 262, baseType: !1195, size: 64, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1174, file: !1175, line: 264, baseType: !140, size: 32, offset: 896)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1174, file: !1175, line: 268, baseType: !140, size: 32, offset: 928)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1174, file: !1175, line: 270, baseType: !1201, size: 64, offset: 960)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 140, baseType: !109)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1174, file: !1175, line: 274, baseType: !263, size: 16, offset: 1024)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1174, file: !1175, line: 275, baseType: !1204, size: 8, offset: 1040)
!1204 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1174, file: !1175, line: 276, baseType: !1206, size: 8, offset: 1048)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !1207)
!1207 = !{!1208}
!1208 = !DISubrange(count: 1)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1174, file: !1175, line: 280, baseType: !1210, size: 64, offset: 1088)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1175, line: 150, baseType: null)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1174, file: !1175, line: 289, baseType: !1213, size: 64, offset: 1152)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 141, baseType: !109)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1174, file: !1175, line: 297, baseType: !47, size: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1174, file: !1175, line: 298, baseType: !47, size: 64, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1174, file: !1175, line: 299, baseType: !47, size: 64, offset: 1344)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1174, file: !1175, line: 300, baseType: !47, size: 64, offset: 1408)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1174, file: !1175, line: 302, baseType: !35, size: 64, offset: 1472)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1174, file: !1175, line: 303, baseType: !140, size: 32, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1174, file: !1175, line: 305, baseType: !1221, size: 160, offset: 1568)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !1222)
!1222 = !{!1223}
!1223 = !DISubrange(count: 20)
!1224 = !DILocalVariable(name: "__s1_len", scope: !1225, file: !3, line: 424, type: !35)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 424, column: 7)
!1226 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 424, column: 7)
!1227 = !DILocalVariable(name: "__s2_len", scope: !1225, file: !3, line: 424, type: !35)
!1228 = !DILocalVariable(name: "__s2", scope: !1229, file: !3, line: 424, type: !40)
!1229 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 424, column: 7)
!1230 = !DILocalVariable(name: "__result", scope: !1229, file: !3, line: 424, type: !140)
!1231 = !DILocalVariable(name: "__s1_len", scope: !1232, file: !3, line: 448, type: !35)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 448, column: 7)
!1233 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 448, column: 7)
!1234 = !DILocalVariable(name: "__s2_len", scope: !1232, file: !3, line: 448, type: !35)
!1235 = !DILocalVariable(name: "__s2", scope: !1236, file: !3, line: 448, type: !40)
!1236 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 448, column: 7)
!1237 = !DILocalVariable(name: "__result", scope: !1236, file: !3, line: 448, type: !140)
!1238 = !DILocation(line: 420, column: 22, scope: !1165)
!1239 = !DILocation(line: 424, column: 7, scope: !1225)
!1240 = !DILocation(line: 424, column: 7, scope: !1229)
!1241 = !DILocation(line: 424, column: 7, scope: !1242)
!1242 = !DILexicalBlockFile(scope: !1229, file: !3, discriminator: 2)
!1243 = !DILocation(line: 424, column: 7, scope: !1244)
!1244 = !DILexicalBlockFile(scope: !1245, file: !3, discriminator: 3)
!1245 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 424, column: 7)
!1246 = !DILocation(line: 424, column: 7, scope: !1247)
!1247 = !DILexicalBlockFile(scope: !1245, file: !3, discriminator: 2)
!1248 = !DILocation(line: 424, column: 7, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1250, file: !3, discriminator: 4)
!1250 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 424, column: 7)
!1251 = !DILocation(line: 424, column: 7, scope: !1252)
!1252 = !DILexicalBlockFile(scope: !1225, file: !3, discriminator: 11)
!1253 = !DILocation(line: 424, column: 7, scope: !1254)
!1254 = !DILexicalBlockFile(scope: !1165, file: !3, discriminator: 13)
!1255 = !DILocation(line: 427, column: 16, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 425, column: 5)
!1257 = !DILocation(line: 422, column: 9, scope: !1165)
!1258 = !DILocation(line: 428, column: 5, scope: !1256)
!1259 = !DILocation(line: 431, column: 16, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 430, column: 5)
!1261 = !DILocation(line: 432, column: 18, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 432, column: 11)
!1263 = !DILocation(line: 432, column: 11, scope: !1260)
!1264 = !DILocation(line: 434, column: 21, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 433, column: 9)
!1266 = !DILocation(line: 434, column: 34, scope: !1267)
!1267 = !DILexicalBlockFile(scope: !1265, file: !3, discriminator: 1)
!1268 = !DILocation(line: 434, column: 11, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1265, file: !3, discriminator: 2)
!1270 = !DILocation(line: 435, column: 11, scope: !1265)
!1271 = !DILocation(line: 439, column: 3, scope: !1165)
!1272 = !DILocalVariable(name: "fp", arg: 1, scope: !1273, file: !3, line: 394, type: !1171)
!1273 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 394, type: !1274, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1276)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{null, !1171}
!1276 = !{!1272}
!1277 = !DILocation(line: 394, column: 21, scope: !1273, inlinedAt: !1278)
!1278 = distinct !DILocation(line: 441, column: 3, scope: !1165)
!1279 = !DILocation(line: 396, column: 10, scope: !1280, inlinedAt: !1278)
!1280 = !DILexicalBlockFile(scope: !1273, file: !3, discriminator: 1)
!1281 = !DILocation(line: 396, column: 3, scope: !1280, inlinedAt: !1278)
!1282 = !DILocation(line: 375, column: 25, scope: !1283, inlinedAt: !1288)
!1283 = distinct !DISubprogram(name: "check_section", scope: !3, file: !3, line: 373, type: !1284, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1286)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!28}
!1286 = !{!1287}
!1287 = !DILocalVariable(name: "len", scope: !1283, file: !3, line: 375, type: !35)
!1288 = distinct !DILocation(line: 398, column: 15, scope: !1289, inlinedAt: !1278)
!1289 = distinct !DILexicalBlock(scope: !1273, file: !3, line: 397, column: 5)
!1290 = !{!1291, !875, i64 8}
!1291 = !{!"linebuffer", !875, i64 0, !875, i64 8, !739, i64 16}
!1292 = !DILocation(line: 375, column: 32, scope: !1283, inlinedAt: !1288)
!1293 = !DILocation(line: 375, column: 10, scope: !1283, inlinedAt: !1288)
!1294 = !DILocation(line: 377, column: 11, scope: !1295, inlinedAt: !1288)
!1295 = distinct !DILexicalBlock(scope: !1283, file: !3, line: 377, column: 7)
!1296 = !DILocation(line: 377, column: 15, scope: !1295, inlinedAt: !1288)
!1297 = !DILocation(line: 377, column: 35, scope: !1298, inlinedAt: !1288)
!1298 = !DILexicalBlockFile(scope: !1295, file: !3, discriminator: 1)
!1299 = !{!1291, !739, i64 16}
