!llvm.dbg.cu = !{!2, !387, !393, !406, !833, !414, !844, !846, !421, !428, !848, !478, !856, !867, !869, !871, !874, !878, !880, !882, !884, !886, !889, !891, !487}
!llvm.ident = !{!894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894, !894}
!llvm.module.flags = !{!895, !896, !897, !898}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "integral_type_size", scope: !2, file: !3, line: 260, type: !384, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !87, globals: !106)
!3 = !DIFile(filename: "src/od.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !17, !25, !34, !51, !54, !69, !73}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "size_spec", file: !3, line: 52, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "NO_SIZE", value: 0)
!8 = !DIEnumerator(name: "CHAR", value: 1)
!9 = !DIEnumerator(name: "SHORT", value: 2)
!10 = !DIEnumerator(name: "INT", value: 3)
!11 = !DIEnumerator(name: "LONG", value: 4)
!12 = !DIEnumerator(name: "LONG_LONG", value: 5)
!13 = !DIEnumerator(name: "FLOAT_SINGLE", value: 6)
!14 = !DIEnumerator(name: "FLOAT_DOUBLE", value: 7)

!109 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1566, type: !110, isDefinition: true, scopeLine: 1567, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !113)
!110 = !DISubroutineType(types: !111)
!111 = !{!100, !100, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !122, !123, !124, !125, !126, !128, !129, !130, !131, !135, !138, !139, !143, !144, !148}
!114 = !DILocalVariable(name: "argc", arg: 1, scope: !109, file: !3, line: 1566, type: !100)
!115 = !DILocalVariable(name: "argv", arg: 2, scope: !109, file: !3, line: 1566, type: !112)
!116 = !DILocalVariable(name: "n_files", scope: !109, file: !3, line: 1568, type: !100)
!117 = !DILocalVariable(name: "i", scope: !109, file: !3, line: 1569, type: !41)
!118 = !DILocalVariable(name: "l_c_m", scope: !109, file: !3, line: 1570, type: !100)
!119 = !DILocalVariable(name: "desired_width", scope: !109, file: !3, line: 1571, type: !41)
!120 = !DILocalVariable(name: "modern", scope: !109, file: !3, line: 1572, type: !121)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DILocalVariable(name: "width_specified", scope: !109, file: !3, line: 1573, type: !121)
!123 = !DILocalVariable(name: "ok", scope: !109, file: !3, line: 1574, type: !121)
!124 = !DILocalVariable(name: "width_per_block", scope: !109, file: !3, line: 1575, type: !41)
!125 = !DILocalVariable(name: "pseudo_start", scope: !109, file: !3, line: 1580, type: !102)
!126 = !DILocalVariable(name: "tmp", scope: !127, file: !3, line: 1624, type: !102)
!127 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1623, column: 5)
!128 = !DILocalVariable(name: "s_err", scope: !127, file: !3, line: 1625, type: !17)
!129 = !DILocalVariable(name: "oi", scope: !127, file: !3, line: 1626, type: !100)
!130 = !DILocalVariable(name: "c", scope: !127, file: !3, line: 1627, type: !100)
!131 = !DILocalVariable(name: "w_tmp", scope: !132, file: !3, line: 1771, type: !102)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 1770, column: 13)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1765, column: 15)
!134 = distinct !DILexicalBlock(scope: !127, file: !3, line: 1632, column: 9)
!135 = !DILocalVariable(name: "o1", scope: !136, file: !3, line: 1814, type: !102)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 1813, column: 5)
!137 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1812, column: 7)
!138 = !DILocalVariable(name: "o2", scope: !136, file: !3, line: 1815, type: !102)
!139 = !DILocalVariable(name: "fields_per_block", scope: !140, file: !3, line: 1951, type: !100)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 1950, column: 5)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 1949, column: 3)
!142 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1949, column: 3)
!143 = !DILocalVariable(name: "block_width", scope: !140, file: !3, line: 1952, type: !100)
!144 = !DILocalVariable(name: "fields_per_block", scope: !145, file: !3, line: 1958, type: !100)
!145 = distinct !DILexicalBlock(scope: !146, file: !3, line: 1957, column: 5)
!146 = distinct !DILexicalBlock(scope: !147, file: !3, line: 1956, column: 3)
!147 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1956, column: 3)
!148 = !DILocalVariable(name: "block_width", scope: !145, file: !3, line: 1959, type: !100)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 104, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 13)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "address_base", scope: !2, file: !3, line: 177, type: !100, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !2, file: !3, line: 185, type: !100, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157)
!157 = distinct !DIGlobalVariable(name: "string_min", scope: !2, file: !3, line: 188, type: !41, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !2, file: !3, line: 191, type: !121, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161)
!161 = distinct !DIGlobalVariable(name: "traditional", scope: !2, file: !3, line: 196, type: !121, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !2, file: !3, line: 199, type: !121, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !2, file: !3, line: 203, type: !102, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "format_address", scope: !2, file: !3, line: 207, type: !168, isLocal: true, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !102, !90}
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "max_bytes_to_format", scope: !2, file: !3, line: 217, type: !102, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174)
!174 = distinct !DIGlobalVariable(name: "end_offset", scope: !2, file: !3, line: 220, type: !102, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176)
!176 = distinct !DIGlobalVariable(name: "spec", scope: !2, file: !3, line: 228, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !3, line: 100, size: 320, elements: !179)
!179 = !{!180, !181, !182, !186, !190, !191, !192}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !178, file: !3, line: 102, baseType: !25, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !3, line: 103, baseType: !5, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !178, file: !3, line: 108, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !41, !41, !95, !88, !100, !100}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !178, file: !3, line: 110, baseType: !187, size: 64, offset: 128)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !178, file: !3, line: 111, baseType: !121, size: 8, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !178, file: !3, line: 112, baseType: !100, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !178, file: !3, line: 113, baseType: !100, size: 32, offset: 256)
!193 = !DIGlobalVariableExpression(var: !194)
!194 = distinct !DIGlobalVariable(name: "n_specs", scope: !2, file: !3, line: 231, type: !41, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !2, file: !3, line: 234, type: !41, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198)
!198 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !2, file: !3, line: 240, type: !41, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "file_list", scope: !2, file: !3, line: 247, type: !93, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "in_stream", scope: !2, file: !3, line: 254, type: !203, isLocal: true, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !205, line: 49, baseType: !206)
!205 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !207, line: 241, size: 1728, elements: !208)
!207 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !229, !230, !231, !232, !235, !236, !238, !242, !245, !247, !248, !249, !250, !251, !252, !253}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !206, file: !207, line: 242, baseType: !100, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !206, file: !207, line: 247, baseType: !91, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !206, file: !207, line: 248, baseType: !91, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !206, file: !207, line: 249, baseType: !91, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !206, file: !207, line: 250, baseType: !91, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !206, file: !207, line: 251, baseType: !91, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !206, file: !207, line: 252, baseType: !91, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !206, file: !207, line: 253, baseType: !91, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !206, file: !207, line: 254, baseType: !91, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !206, file: !207, line: 256, baseType: !91, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !206, file: !207, line: 257, baseType: !91, size: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !206, file: !207, line: 258, baseType: !91, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !206, file: !207, line: 260, baseType: !222, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !207, line: 156, size: 192, elements: !224)
!224 = !{!225, !226, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !223, file: !207, line: 157, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !223, file: !207, line: 158, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !223, file: !207, line: 162, baseType: !100, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !206, file: !207, line: 262, baseType: !227, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !206, file: !207, line: 264, baseType: !100, size: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !206, file: !207, line: 268, baseType: !100, size: 32, offset: 928)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !206, file: !207, line: 270, baseType: !233, size: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 140, baseType: !234)
!234 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !206, file: !207, line: 274, baseType: !101, size: 16, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !206, file: !207, line: 275, baseType: !237, size: 8, offset: 1040)
!237 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !206, file: !207, line: 276, baseType: !239, size: 8, offset: 1048)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 8, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !206, file: !207, line: 280, baseType: !243, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !207, line: 150, baseType: null)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !206, file: !207, line: 289, baseType: !246, size: 64, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 141, baseType: !234)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !206, file: !207, line: 297, baseType: !39, size: 64, offset: 1216)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !206, file: !207, line: 298, baseType: !39, size: 64, offset: 1280)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !206, file: !207, line: 299, baseType: !39, size: 64, offset: 1344)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !206, file: !207, line: 300, baseType: !39, size: 64, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !206, file: !207, line: 302, baseType: !41, size: 64, offset: 1472)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !206, file: !207, line: 303, baseType: !100, size: 32, offset: 1536)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !206, file: !207, line: 305, baseType: !254, size: 160, offset: 1568)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 160, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 20)
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 257, type: !121, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !2, file: !3, line: 263, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 544, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 17)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "input_swap", scope: !2, file: !3, line: 270, type: !121, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "infomap", scope: !268, file: !269, line: 632, type: !293, isLocal: true, isDefinition: true)
!268 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !269, file: !269, line: 630, type: !270, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !272)
!269 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !DISubroutineType(types: !271)
!271 = !{null, !88}
!272 = !{!273, !274, !275, !282, !284, !285, !286, !289, !290, !292}
!273 = !DILocalVariable(name: "program", arg: 1, scope: !268, file: !269, line: 630, type: !88)
!274 = !DILocalVariable(name: "node", scope: !268, file: !269, line: 642, type: !88)
!275 = !DILocalVariable(name: "map_prog", scope: !268, file: !269, line: 643, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !268, file: !269, line: 632, size: 128, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !278, file: !269, line: 632, baseType: !88, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !278, file: !269, line: 632, baseType: !88, size: 64, offset: 64)
!282 = !DILocalVariable(name: "__s1_len", scope: !283, file: !269, line: 645, type: !41)
!283 = distinct !DILexicalBlock(scope: !268, file: !269, line: 645, column: 33)
!284 = !DILocalVariable(name: "__s2_len", scope: !283, file: !269, line: 645, type: !41)
!285 = !DILocalVariable(name: "lc_messages", scope: !268, file: !269, line: 655, type: !88)
!286 = !DILocalVariable(name: "__s1_len", scope: !287, file: !269, line: 656, type: !41)
!287 = distinct !DILexicalBlock(scope: !288, file: !269, line: 656, column: 22)
!288 = distinct !DILexicalBlock(scope: !268, file: !269, line: 656, column: 7)
!289 = !DILocalVariable(name: "__s2_len", scope: !287, file: !269, line: 656, type: !41)
!290 = !DILocalVariable(name: "__s2", scope: !291, file: !269, line: 656, type: !97)
!291 = distinct !DILexicalBlock(scope: !287, file: !269, line: 656, column: 22)
!292 = !DILocalVariable(name: "__result", scope: !291, file: !269, line: 656, type: !100)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 896, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 7)
!296 = !DIGlobalVariableExpression(var: !297)
!297 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 272, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 280, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 35)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 298, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 3072, elements: !313)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !306, line: 104, size: 256, elements: !307)
!306 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = !{!308, !309, !310, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 106, baseType: !88, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !305, file: !306, line: 109, baseType: !100, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !306, line: 110, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !305, file: !306, line: 111, baseType: !100, size: 32, offset: 192)
!313 = !{!314}
!314 = !DISubrange(count: 12)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !2, file: !3, line: 210, type: !102, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "limit_bytes_to_format", scope: !2, file: !3, line: 214, type: !121, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320)
!320 = distinct !DIGlobalVariable(name: "bytes_to_signed_dec_digits", scope: !2, file: !3, line: 129, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 544, elements: !262)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "bytes_to_oct_digits", scope: !2, file: !3, line: 126, type: !321, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326)
!326 = distinct !DIGlobalVariable(name: "bytes_to_unsigned_dec_digits", scope: !2, file: !3, line: 132, type: !321, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328)
!328 = distinct !DIGlobalVariable(name: "bytes_to_hex_digits", scope: !2, file: !3, line: 135, type: !321, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "charname", scope: !2, file: !3, line: 167, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1056, elements: !332)
!332 = !{!333, !334}
!333 = !DISubrange(count: 33)
!334 = !DISubrange(count: 4)
!335 = !DIGlobalVariableExpression(var: !336)
!336 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !2, file: !3, line: 225, type: !121, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338)
!338 = distinct !DIGlobalVariable(name: "endian_types", scope: !2, file: !3, line: 293, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 64, elements: !341)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "endian_args", scope: !2, file: !3, line: 288, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 3)
!348 = !DIGlobalVariableExpression(var: !349)
!349 = distinct !DIGlobalVariable(name: "default_file_list", scope: !2, file: !3, line: 251, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !341)
!351 = !DIGlobalVariableExpression(var: !352)
!352 = distinct !DIGlobalVariable(name: "input_filename", scope: !2, file: !3, line: 244, type: !88, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "width_bytes", scope: !2, file: !3, line: 149, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 288, elements: !357)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!357 = !{!358}
!358 = !DISubrange(count: 9)
!359 = !DIGlobalVariableExpression(var: !360)
!360 = distinct !DIGlobalVariable(name: "first", scope: !361, file: !3, line: 1186, type: !121, isLocal: true, isDefinition: true)
!361 = distinct !DISubprogram(name: "write_block", scope: !3, file: !3, line: 1183, type: !362, isLocal: true, isDefinition: true, scopeLine: 1185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !364)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !102, !41, !88, !88}
!364 = !{!365, !366, !367, !368, !369, !372, !376, !377, !378, !381}
!365 = !DILocalVariable(name: "current_offset", arg: 1, scope: !361, file: !3, line: 1183, type: !102)
!366 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !361, file: !3, line: 1183, type: !41)
!367 = !DILocalVariable(name: "prev_block", arg: 3, scope: !361, file: !3, line: 1184, type: !88)
!368 = !DILocalVariable(name: "curr_block", arg: 4, scope: !361, file: !3, line: 1184, type: !88)
!369 = !DILocalVariable(name: "i", scope: !370, file: !3, line: 1208, type: !41)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 1207, column: 5)
!371 = distinct !DILexicalBlock(scope: !361, file: !3, line: 1191, column: 7)
!372 = !DILocalVariable(name: "datum_width", scope: !373, file: !3, line: 1213, type: !100)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 1212, column: 9)
!374 = distinct !DILexicalBlock(scope: !375, file: !3, line: 1211, column: 7)
!375 = distinct !DILexicalBlock(scope: !370, file: !3, line: 1211, column: 7)
!376 = !DILocalVariable(name: "fields_per_block", scope: !373, file: !3, line: 1214, type: !100)
!377 = !DILocalVariable(name: "blank_fields", scope: !373, file: !3, line: 1215, type: !100)
!378 = !DILocalVariable(name: "field_width", scope: !379, file: !3, line: 1226, type: !100)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 1224, column: 13)
!380 = distinct !DILexicalBlock(scope: !373, file: !3, line: 1223, column: 15)
!381 = !DILocalVariable(name: "pad_width", scope: !379, file: !3, line: 1227, type: !100)
!382 = !DIGlobalVariableExpression(var: !383)
!383 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !361, file: !3, line: 1187, type: !121, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, elements: !357)
!385 = !DIGlobalVariableExpression(var: !386)
!386 = distinct !DIGlobalVariable(name: "Version", scope: !387, file: !388, line: 2, type: !88, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, globals: !390)
!388 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!389 = !{}
!390 = !{!385}
!391 = !DIGlobalVariableExpression(var: !392)
!392 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !393, file: !398, line: 69, type: !399, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !395, retainedTypes: !396, globals: !397)
!394 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!395 = !{!73}
!396 = !{!41, !39, !99}
!397 = !{!391}
!398 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !400, line: 55, baseType: !401)
!400 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{null}
!404 = !DIGlobalVariableExpression(var: !405)
!405 = distinct !DIGlobalVariable(name: "file_name", scope: !406, file: !411, line: 36, type: !88, isLocal: true, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, globals: !408)
!407 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!408 = !{!404, !409}
!409 = !DIGlobalVariableExpression(var: !410)
!410 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !406, file: !411, line: 46, type: !121, isLocal: true, isDefinition: true)
!411 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!412 = !DIGlobalVariableExpression(var: !413)
!413 = distinct !DIGlobalVariable(name: "exit_failure", scope: !414, file: !417, line: 24, type: !418, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, globals: !416)
!415 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!416 = !{!412}
!417 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!418 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !100)
!419 = !DIGlobalVariableExpression(var: !420)
!420 = distinct !DIGlobalVariable(name: "program_name", scope: !421, file: !425, line: 33, type: !88, isDefinition: true)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !423, globals: !424)
!422 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!423 = !{!39, !91}
!424 = !{!419}
!425 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!426 = !DIGlobalVariableExpression(var: !427)
!427 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !428, file: !440, line: 77, type: !473, isDefinition: true)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !430, retainedTypes: !436, globals: !437)
!429 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!430 = !{!73, !431, !54}
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !74, line: 242, size: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!434 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!435 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!436 = !{!100, !101, !41, !91}
!437 = !{!426, !438, !445, !455, !457, !462, !469, !471}
!438 = !DIGlobalVariableExpression(var: !439)
!439 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !428, file: !440, line: 93, type: !441, isDefinition: true)
!440 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 320, elements: !443)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!443 = !{!444}
!444 = !DISubrange(count: 10)
!445 = !DIGlobalVariableExpression(var: !446)
!446 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !428, file: !440, line: 1043, type: !447, isDefinition: true)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !440, line: 57, size: 448, elements: !448)
!448 = !{!449, !450, !451, !453, !454}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !447, file: !440, line: 60, baseType: !73, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !447, file: !440, line: 63, baseType: !100, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !447, file: !440, line: 67, baseType: !452, size: 256, offset: 64)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 256, elements: !188)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !447, file: !440, line: 70, baseType: !88, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !447, file: !440, line: 73, baseType: !88, size: 64, offset: 384)
!455 = !DIGlobalVariableExpression(var: !456)
!456 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !428, file: !440, line: 108, type: !447, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "slot0", scope: !428, file: !440, line: 834, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 2048, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 256)
!462 = !DIGlobalVariableExpression(var: !463)
!463 = distinct !DIGlobalVariable(name: "slotvec", scope: !428, file: !440, line: 837, type: !464, isLocal: true, isDefinition: true)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !440, line: 826, size: 128, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !465, file: !440, line: 828, baseType: !41, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !465, file: !440, line: 829, baseType: !91, size: 64, offset: 64)
!469 = !DIGlobalVariableExpression(var: !470)
!470 = distinct !DIGlobalVariable(name: "nslots", scope: !428, file: !440, line: 835, type: !100, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472)
!472 = distinct !DIGlobalVariable(name: "slotvec0", scope: !428, file: !440, line: 836, type: !465, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 704, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 11)
!476 = !DIGlobalVariableExpression(var: !477)
!477 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !478, file: !481, line: 26, type: !482, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, globals: !480)
!479 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!480 = !{!476}
!481 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 376, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 47)
!485 = !DIGlobalVariableExpression(var: !486)
!486 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !487, file: !831, line: 120, type: !832, isLocal: true, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !489, retainedTypes: !828, globals: !830)
!488 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!489 = !{!490}
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !491, line: 41, size: 32, elements: !492)
!491 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!493 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!494 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!495 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!496 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!497 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!498 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!499 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!500 = !DIEnumerator(name: "DAY_1", value: 131079)
!501 = !DIEnumerator(name: "DAY_2", value: 131080)
!502 = !DIEnumerator(name: "DAY_3", value: 131081)
!503 = !DIEnumerator(name: "DAY_4", value: 131082)
!504 = !DIEnumerator(name: "DAY_5", value: 131083)
!505 = !DIEnumerator(name: "DAY_6", value: 131084)
!506 = !DIEnumerator(name: "DAY_7", value: 131085)
!507 = !DIEnumerator(name: "ABMON_1", value: 131086)
!508 = !DIEnumerator(name: "ABMON_2", value: 131087)
!509 = !DIEnumerator(name: "ABMON_3", value: 131088)
!510 = !DIEnumerator(name: "ABMON_4", value: 131089)
!511 = !DIEnumerator(name: "ABMON_5", value: 131090)
!512 = !DIEnumerator(name: "ABMON_6", value: 131091)
!513 = !DIEnumerator(name: "ABMON_7", value: 131092)
!514 = !DIEnumerator(name: "ABMON_8", value: 131093)
!515 = !DIEnumerator(name: "ABMON_9", value: 131094)
!516 = !DIEnumerator(name: "ABMON_10", value: 131095)
!517 = !DIEnumerator(name: "ABMON_11", value: 131096)
!518 = !DIEnumerator(name: "ABMON_12", value: 131097)
!519 = !DIEnumerator(name: "MON_1", value: 131098)
!520 = !DIEnumerator(name: "MON_2", value: 131099)
!521 = !DIEnumerator(name: "MON_3", value: 131100)
!522 = !DIEnumerator(name: "MON_4", value: 131101)
!523 = !DIEnumerator(name: "MON_5", value: 131102)
!524 = !DIEnumerator(name: "MON_6", value: 131103)
!525 = !DIEnumerator(name: "MON_7", value: 131104)
!526 = !DIEnumerator(name: "MON_8", value: 131105)
!527 = !DIEnumerator(name: "MON_9", value: 131106)
!528 = !DIEnumerator(name: "MON_10", value: 131107)
!529 = !DIEnumerator(name: "MON_11", value: 131108)
!530 = !DIEnumerator(name: "MON_12", value: 131109)
!531 = !DIEnumerator(name: "AM_STR", value: 131110)
!532 = !DIEnumerator(name: "PM_STR", value: 131111)
!533 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!534 = !DIEnumerator(name: "D_FMT", value: 131113)
!535 = !DIEnumerator(name: "T_FMT", value: 131114)
!536 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!537 = !DIEnumerator(name: "ERA", value: 131116)
!538 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!539 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!540 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!541 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!542 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!543 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!544 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!545 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!546 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!547 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!548 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!549 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!550 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!551 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!552 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!553 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!554 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!555 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!556 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!557 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!558 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!559 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!560 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!561 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!562 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!563 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!564 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!565 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!566 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!567 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!568 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!569 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!570 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!571 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!572 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!573 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!574 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!575 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!576 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!577 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!578 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!579 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!580 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!581 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!582 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!583 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!584 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!585 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!586 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!587 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!588 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!589 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!590 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!591 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!592 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!593 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!594 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!595 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!596 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!597 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!598 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!599 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!600 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!601 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!602 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!603 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!604 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!605 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!606 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!607 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!608 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!609 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!610 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!611 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!612 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!613 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!614 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!615 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!616 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!617 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!618 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!619 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!620 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!621 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!622 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!623 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!624 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!625 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!626 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!627 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!628 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!629 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!630 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!631 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!632 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!633 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!634 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!635 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!636 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!637 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!638 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!639 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!640 = !DIEnumerator(name: "CODESET", value: 14)
!641 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!642 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!643 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!644 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!662 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!663 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!664 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!665 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!666 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!668 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!669 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!675 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!682 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!683 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!684 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!685 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!686 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!687 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!688 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!689 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!690 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!691 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!692 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!693 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!694 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!695 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!696 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!697 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!698 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!699 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!700 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!701 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!702 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!703 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!704 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!705 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!706 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!707 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!708 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!709 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!710 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!711 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!712 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!713 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!714 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!715 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!716 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!717 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!718 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!719 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!720 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!721 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!722 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!723 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!724 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!725 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!726 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!727 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!728 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!729 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!730 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!731 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!732 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!733 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!734 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!736 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!737 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!739 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!740 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!743 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!746 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!747 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!748 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!749 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!750 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!751 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!752 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!753 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!754 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!755 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!756 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!757 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!758 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!759 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!760 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!761 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!762 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!763 = !DIEnumerator(name: "THOUSEP", value: 65537)
!764 = !DIEnumerator(name: "__GROUPING", value: 65538)
!765 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!766 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!767 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!768 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!769 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!770 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!771 = !DIEnumerator(name: "__YESSTR", value: 327682)
!772 = !DIEnumerator(name: "__NOSTR", value: 327683)
!773 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!774 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!775 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!776 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!777 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!778 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!779 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!780 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!781 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!782 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!783 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!784 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!785 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!786 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!787 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!788 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!789 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!790 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!791 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!792 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!793 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!794 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!795 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!796 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!797 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!798 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!799 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!800 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!801 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!802 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!803 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!804 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!805 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!806 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!807 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!808 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!809 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!810 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!811 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!812 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!814 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!815 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!816 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!817 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!818 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!821 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!822 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!823 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!824 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!825 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!826 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!827 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!828 = !{!39, !91, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!830 = !{!485}
!831 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !88)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !835)
!834 = !DIFile(filename: "./lib/dtoastr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!835 = !{!836}
!836 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !837, line: 52, size: 32, elements: !838)
!837 = !DIFile(filename: "./lib/ftoastr.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!838 = !{!839, !840, !841, !842, !843}
!839 = !DIEnumerator(name: "FTOASTR_LEFT_JUSTIFY", value: 1)
!840 = !DIEnumerator(name: "FTOASTR_ALWAYS_SIGNED", value: 2)
!841 = !DIEnumerator(name: "FTOASTR_SPACE_POSITIVE", value: 4)
!842 = !DIEnumerator(name: "FTOASTR_ZERO_PAD", value: 8)
!843 = !DIEnumerator(name: "FTOASTR_UPPER_E", value: 16)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !835)
!845 = !DIFile(filename: "./lib/ftoastr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !835)
!847 = !DIFile(filename: "./lib/ldtoastr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !850, retainedTypes: !855)
!849 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!850 = !{!851}
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !852, line: 41, size: 32, elements: !853)
!852 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!853 = !{!854}
!854 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!855 = !{!39}
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !858, retainedTypes: !866)
!857 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!858 = !{!859}
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !860, file: !35, line: 192, size: 32, elements: !49)
!860 = distinct !DISubprogram(name: "x2nrealloc", scope: !35, file: !35, line: 180, type: !37, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !856, variables: !861)
!861 = !{!862, !863, !864, !865}
!862 = !DILocalVariable(name: "p", arg: 1, scope: !860, file: !35, line: 180, type: !39)
!863 = !DILocalVariable(name: "pn", arg: 2, scope: !860, file: !35, line: 180, type: !40)
!864 = !DILocalVariable(name: "s", arg: 3, scope: !860, file: !35, line: 180, type: !41)
!865 = !DILocalVariable(name: "n", scope: !860, file: !35, line: 182, type: !41)
!866 = !{!41, !91, !39}
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389)
!868 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389)
!870 = !DIFile(filename: "./lib/xprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !873)
!872 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = !{!17}
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !876, retainedTypes: !877)
!875 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !{!17, !54}
!877 = !{!100, !101, !91}
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !855)
!879 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389)
!881 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !855)
!883 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !855)
!885 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !888)
!887 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!888 = !{!41}
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389)
!890 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !893)
!892 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!893 = !{!41, !95, !97, !88}
!894 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!895 = !{i32 2, !"Dwarf Version", i32 4}
!896 = !{i32 2, !"Debug Info Version", i32 3}
!897 = !{i32 1, !"PIC Level", i32 2}
!898 = !{i32 1, !"PIE Level", i32 2}
!899 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 316, type: !900, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !100}
!902 = !{!903}
!903 = !DILocalVariable(name: "status", arg: 1, scope: !899, file: !3, line: 316, type: !100)
!904 = !DIExpression()
!905 = !DILocation(line: 316, column: 12, scope: !899)
!906 = !DILocation(line: 318, column: 14, scope: !907)
!907 = distinct !DILexicalBlock(scope: !899, file: !3, line: 318, column: 7)
!908 = !DILocation(line: 318, column: 7, scope: !899)
!909 = !DILocation(line: 319, column: 5, scope: !910)
!910 = !DILexicalBlockFile(scope: !911, file: !3, discriminator: 1)
!911 = distinct !DILexicalBlock(scope: !907, file: !3, line: 319, column: 5)
!912 = !{!913, !913, i64 0}
!913 = !{!"any pointer", !914, i64 0}
!914 = !{!"omnipotent char", !915, i64 0}
!915 = !{!"Simple C/C++ TBAA"}
!916 = !DILocation(line: 319, column: 5, scope: !917)
!917 = !DILexicalBlockFile(scope: !911, file: !3, discriminator: 3)
!918 = !DILocation(line: 319, column: 5, scope: !919)
!919 = !DILexicalBlockFile(scope: !911, file: !3, discriminator: 2)
!920 = !DILocation(line: 322, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !907, file: !3, line: 321, column: 5)
!922 = !DILocation(line: 322, column: 7, scope: !923)
!923 = !DILexicalBlockFile(scope: !921, file: !3, discriminator: 1)
!924 = !DILocation(line: 328, column: 7, scope: !921)
!925 = !DILocation(line: 328, column: 7, scope: !923)
!926 = !DILocation(line: 580, column: 3, scope: !927, inlinedAt: !928)
!927 = distinct !DISubprogram(name: "emit_stdin_note", scope: !269, file: !269, line: 578, type: !402, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !389)
!928 = distinct !DILocation(line: 334, column: 7, scope: !921)
!929 = !DILocation(line: 580, column: 3, scope: !930, inlinedAt: !928)
!930 = !DILexicalBlockFile(scope: !927, file: !269, discriminator: 1)
!931 = !DILocation(line: 336, column: 7, scope: !921)
!932 = !DILocation(line: 336, column: 7, scope: !923)
!933 = !DILocation(line: 587, column: 3, scope: !934, inlinedAt: !935)
!934 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !269, file: !269, line: 585, type: !402, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !389)
!935 = distinct !DILocation(line: 346, column: 7, scope: !921)
!936 = !DILocation(line: 587, column: 3, scope: !937, inlinedAt: !935)
!937 = !DILexicalBlockFile(scope: !934, file: !269, discriminator: 1)
!938 = !DILocation(line: 348, column: 7, scope: !921)
!939 = !DILocation(line: 348, column: 7, scope: !923)
!940 = !DILocation(line: 354, column: 7, scope: !921)
!941 = !DILocation(line: 354, column: 7, scope: !923)
!942 = !DILocation(line: 365, column: 7, scope: !921)
!943 = !DILocation(line: 365, column: 7, scope: !923)
!944 = !DILocation(line: 366, column: 7, scope: !921)
!945 = !DILocation(line: 366, column: 7, scope: !923)
!946 = !DILocation(line: 367, column: 7, scope: !921)
!947 = !DILocation(line: 367, column: 7, scope: !923)
!948 = !DILocation(line: 376, column: 7, scope: !921)
!949 = !DILocation(line: 376, column: 7, scope: !923)
!950 = !DILocation(line: 384, column: 7, scope: !921)
!951 = !DILocation(line: 384, column: 7, scope: !923)
!952 = !DILocation(line: 391, column: 7, scope: !921)
!953 = !DILocation(line: 391, column: 7, scope: !923)
!954 = !DILocation(line: 398, column: 7, scope: !921)
!955 = !DILocation(line: 398, column: 7, scope: !923)
!956 = !DILocation(line: 405, column: 7, scope: !921)
!957 = !DILocation(line: 405, column: 7, scope: !923)
!958 = !DILocation(line: 410, column: 7, scope: !921)
!959 = !DILocation(line: 410, column: 7, scope: !923)
!960 = !DILocation(line: 642, column: 15, scope: !268, inlinedAt: !961)
!961 = distinct !DILocation(line: 421, column: 7, scope: !921)
!962 = !DILocation(line: 651, column: 3, scope: !268, inlinedAt: !961)
!963 = !DILocation(line: 651, column: 3, scope: !964, inlinedAt: !961)
!964 = !DILexicalBlockFile(scope: !268, file: !269, discriminator: 1)
!965 = !DILocation(line: 655, column: 29, scope: !268, inlinedAt: !961)
!966 = !DILocation(line: 655, column: 15, scope: !268, inlinedAt: !961)
!967 = !DILocation(line: 656, column: 7, scope: !288, inlinedAt: !961)
!968 = !DILocation(line: 656, column: 19, scope: !288, inlinedAt: !961)
!969 = !DILocation(line: 656, column: 22, scope: !970, inlinedAt: !961)
!970 = !DILexicalBlockFile(scope: !288, file: !269, discriminator: 16)
!971 = !DILocation(line: 656, column: 7, scope: !972, inlinedAt: !961)
!972 = !DILexicalBlockFile(scope: !268, file: !269, discriminator: 16)
!973 = !DILocation(line: 662, column: 7, scope: !974, inlinedAt: !961)
!974 = distinct !DILexicalBlock(scope: !288, file: !269, line: 657, column: 5)
!975 = !DILocation(line: 662, column: 7, scope: !976, inlinedAt: !961)
!976 = !DILexicalBlockFile(scope: !974, file: !269, discriminator: 1)
!977 = !DILocation(line: 664, column: 5, scope: !974, inlinedAt: !961)
!978 = !DILocation(line: 665, column: 3, scope: !268, inlinedAt: !961)
!979 = !DILocation(line: 665, column: 3, scope: !964, inlinedAt: !961)
!980 = !DILocation(line: 667, column: 3, scope: !268, inlinedAt: !961)
!981 = !DILocation(line: 667, column: 3, scope: !964, inlinedAt: !961)
!982 = !DILocation(line: 423, column: 3, scope: !899)
!983 = !DILocalVariable(name: "block", scope: !984, file: !3, line: 1375, type: !1000)
!984 = distinct !DISubprogram(name: "dump", scope: !3, file: !3, line: 1373, type: !985, isLocal: true, isDefinition: true, scopeLine: 1374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!121}
!987 = !{!983, !988, !989, !990, !991, !992, !996, !999}
!988 = !DILocalVariable(name: "current_offset", scope: !984, file: !3, line: 1376, type: !102)
!989 = !DILocalVariable(name: "idx", scope: !984, file: !3, line: 1377, type: !121)
!990 = !DILocalVariable(name: "ok", scope: !984, file: !3, line: 1378, type: !121)
!991 = !DILocalVariable(name: "n_bytes_read", scope: !984, file: !3, line: 1379, type: !41)
!992 = !DILocalVariable(name: "n_needed", scope: !993, file: !3, line: 1390, type: !41)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 1389, column: 9)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 1387, column: 5)
!995 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1386, column: 7)
!996 = !DILocalVariable(name: "l_c_m", scope: !997, file: !3, line: 1425, type: !100)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 1424, column: 5)
!998 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1423, column: 7)
!999 = !DILocalVariable(name: "bytes_to_write", scope: !997, file: !3, line: 1426, type: !41)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !341)
!1001 = !DILocation(line: 1375, column: 9, scope: !984, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 1977, column: 48, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !109, file: !3, discriminator: 2)
!1004 = !DILocalVariable(name: "buf", scope: !1005, file: !3, line: 1065, type: !1054)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1064, column: 13)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 1043, column: 15)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 1035, column: 9)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1034, column: 11)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 1021, column: 5)
!1010 = distinct !DISubprogram(name: "skip", scope: !3, file: !3, line: 1012, type: !1011, isLocal: true, isDefinition: true, scopeLine: 1013, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!121, !102}
!1013 = !{!1014, !1015, !1016, !1017, !1004, !1052, !1053}
!1014 = !DILocalVariable(name: "n_skip", arg: 1, scope: !1010, file: !3, line: 1012, type: !102)
!1015 = !DILocalVariable(name: "ok", scope: !1010, file: !3, line: 1014, type: !121)
!1016 = !DILocalVariable(name: "in_errno", scope: !1010, file: !3, line: 1015, type: !100)
!1017 = !DILocalVariable(name: "file_stats", scope: !1009, file: !3, line: 1022, type: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1019, line: 46, size: 1152, elements: !1020)
!1019 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1020 = !{!1021, !1023, !1025, !1027, !1029, !1031, !1033, !1034, !1035, !1036, !1038, !1040, !1048, !1049, !1050}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1018, file: !1019, line: 48, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !105, line: 133, baseType: !43)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1018, file: !1019, line: 53, baseType: !1024, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !105, line: 136, baseType: !43)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1018, file: !1019, line: 61, baseType: !1026, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !105, line: 139, baseType: !43)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1018, file: !1019, line: 62, baseType: !1028, size: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !105, line: 138, baseType: !92)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1018, file: !1019, line: 64, baseType: !1030, size: 32, offset: 224)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !105, line: 134, baseType: !92)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1018, file: !1019, line: 65, baseType: !1032, size: 32, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !105, line: 135, baseType: !92)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1018, file: !1019, line: 67, baseType: !100, size: 32, offset: 288)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1018, file: !1019, line: 69, baseType: !1022, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1018, file: !1019, line: 74, baseType: !233, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1018, file: !1019, line: 78, baseType: !1037, size: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !105, line: 162, baseType: !234)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1018, file: !1019, line: 80, baseType: !1039, size: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !105, line: 167, baseType: !234)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1018, file: !1019, line: 91, baseType: !1041, size: 128, offset: 576)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1042, line: 8, size: 128, elements: !1043)
!1042 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1043 = !{!1044, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1041, file: !1042, line: 10, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !105, line: 148, baseType: !234)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1041, file: !1042, line: 11, baseType: !1047, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !105, line: 184, baseType: !234)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1018, file: !1019, line: 92, baseType: !1041, size: 128, offset: 704)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1018, file: !1019, line: 93, baseType: !1041, size: 128, offset: 832)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1018, file: !1019, line: 106, baseType: !1051, size: 192, offset: 960)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 192, elements: !346)
!1052 = !DILocalVariable(name: "n_bytes_read", scope: !1005, file: !3, line: 1066, type: !41)
!1053 = !DILocalVariable(name: "n_bytes_to_read", scope: !1005, file: !3, line: 1066, type: !41)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 65536, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 8192)
!1057 = !DILocation(line: 1065, column: 20, scope: !1005, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 1920, column: 9, scope: !109)
!1059 = !DILocation(line: 1566, column: 11, scope: !109)
!1060 = !DILocation(line: 1566, column: 24, scope: !109)
!1061 = !DILocation(line: 1572, column: 8, scope: !109)
!1062 = !DILocation(line: 1573, column: 8, scope: !109)
!1063 = !DILocation(line: 1574, column: 8, scope: !109)
!1064 = !DILocation(line: 1575, column: 10, scope: !109)
!1065 = !DILocation(line: 1583, column: 21, scope: !109)
!1066 = !DILocation(line: 1583, column: 3, scope: !109)
!1067 = !DILocation(line: 1584, column: 3, scope: !109)
!1068 = !DILocation(line: 1585, column: 3, scope: !109)
!1069 = !DILocation(line: 1586, column: 3, scope: !109)
!1070 = !DILocation(line: 1588, column: 3, scope: !109)
!1071 = !DILocation(line: 1569, column: 10, scope: !109)
!1072 = !DILocation(line: 1591, column: 27, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 1590, column: 3)
!1074 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1590, column: 3)
!1075 = !DILocation(line: 1593, column: 37, scope: !109)
!1076 = !{!914, !914, i64 0}
!1077 = !DILocation(line: 1594, column: 42, scope: !109)
!1078 = !DILocation(line: 1595, column: 36, scope: !109)
!1079 = !DILocation(line: 1600, column: 55, scope: !109)
!1080 = !DILocation(line: 1604, column: 21, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 1603, column: 3)
!1082 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1603, column: 3)
!1083 = !DILocation(line: 1606, column: 32, scope: !109)
!1084 = !DILocation(line: 1610, column: 38, scope: !109)
!1085 = !DILocation(line: 1611, column: 33, scope: !109)
!1086 = !DILocation(line: 1613, column: 11, scope: !109)
!1087 = !{!1088, !1088, i64 0}
!1088 = !{!"long", !914, i64 0}
!1089 = !DILocation(line: 1614, column: 21, scope: !109)
!1090 = !DILocation(line: 1615, column: 8, scope: !109)
!1091 = !DILocation(line: 1617, column: 18, scope: !109)
!1092 = !DILocation(line: 1618, column: 16, scope: !109)
!1093 = !{!1094, !1094, i64 0}
!1094 = !{!"int", !914, i64 0}
!1095 = !DILocation(line: 1619, column: 19, scope: !109)
!1096 = !DILocation(line: 1622, column: 3, scope: !109)
!1097 = !DILocation(line: 1571, column: 10, scope: !109)
!1098 = !DILocation(line: 1624, column: 7, scope: !127)
!1099 = !DILocation(line: 1626, column: 7, scope: !127)
!1100 = !DILocation(line: 1626, column: 11, scope: !127)
!1101 = !DIExpression(DW_OP_deref)
!1102 = !DILocation(line: 1627, column: 15, scope: !127)
!1103 = !DILocation(line: 1627, column: 11, scope: !127)
!1104 = !DILocation(line: 1628, column: 11, scope: !127)
!1105 = !DILocation(line: 1635, column: 19, scope: !134)
!1106 = !DILocation(line: 1635, column: 11, scope: !134)
!1107 = !DILocation(line: 1638, column: 30, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1636, column: 13)
!1109 = !DILocation(line: 1639, column: 28, scope: !1108)
!1110 = !DILocation(line: 1641, column: 15, scope: !1108)
!1111 = !DILocation(line: 1643, column: 30, scope: !1108)
!1112 = !DILocation(line: 1644, column: 28, scope: !1108)
!1113 = !DILocation(line: 1646, column: 15, scope: !1108)
!1114 = !DILocation(line: 1648, column: 30, scope: !1108)
!1115 = !DILocation(line: 1649, column: 28, scope: !1108)
!1116 = !DILocation(line: 1651, column: 15, scope: !1108)
!1117 = !DILocation(line: 1653, column: 30, scope: !1108)
!1118 = !DILocation(line: 1655, column: 15, scope: !1108)
!1119 = !DILocation(line: 1657, column: 15, scope: !1108)
!1120 = !DILocation(line: 1657, column: 15, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1108, file: !3, discriminator: 1)
!1122 = !DILocation(line: 1663, column: 11, scope: !134)
!1123 = !DILocation(line: 1667, column: 31, scope: !134)
!1124 = !DILocation(line: 1667, column: 19, scope: !134)
!1125 = !DILocation(line: 1625, column: 25, scope: !127)
!1126 = !DILocation(line: 1668, column: 21, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1668, column: 15)
!1128 = !DILocation(line: 1668, column: 15, scope: !134)
!1129 = !DILocation(line: 1669, column: 35, scope: !1127)
!1130 = !DILocation(line: 1669, column: 56, scope: !1127)
!1131 = !DILocation(line: 1669, column: 13, scope: !1127)
!1132 = !DILocation(line: 1676, column: 31, scope: !134)
!1133 = !DILocation(line: 1676, column: 19, scope: !134)
!1134 = !DILocation(line: 1678, column: 21, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1678, column: 15)
!1136 = !DILocation(line: 1678, column: 15, scope: !134)
!1137 = !DILocation(line: 1679, column: 35, scope: !1135)
!1138 = !DILocation(line: 1679, column: 56, scope: !1135)
!1139 = !DILocation(line: 1679, column: 13, scope: !1135)
!1140 = !DILocation(line: 1684, column: 15, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1684, column: 15)
!1142 = !DILocation(line: 1684, column: 22, scope: !1141)
!1143 = !DILocation(line: 1684, column: 15, scope: !134)
!1144 = !DILocation(line: 1624, column: 17, scope: !127)
!1145 = !DILocation(line: 1688, column: 23, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 1687, column: 13)
!1147 = !DILocation(line: 1689, column: 25, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 1689, column: 19)
!1149 = !DILocation(line: 1689, column: 19, scope: !1146)
!1150 = !DILocation(line: 1690, column: 39, scope: !1148)
!1151 = !DILocation(line: 1690, column: 60, scope: !1148)
!1152 = !DILocation(line: 1690, column: 17, scope: !1148)
!1153 = !DILocation(line: 1694, column: 30, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 1694, column: 19)
!1155 = !DILocation(line: 1700, column: 11, scope: !134)
!1156 = !DILocation(line: 1704, column: 39, scope: !134)
!1157 = !DILocation(line: 1704, column: 17, scope: !134)
!1158 = !DILocation(line: 1704, column: 14, scope: !134)
!1159 = !DILocation(line: 1705, column: 11, scope: !134)
!1160 = !DILocation(line: 1710, column: 11, scope: !134)
!1161 = !DILocation(line: 1714, column: 11, scope: !134)
!1162 = !DILocation(line: 1717, column: 19, scope: !134)
!1163 = !DILocation(line: 1717, column: 11, scope: !134)
!1164 = !DILocation(line: 1721, column: 19, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1718, column: 13)
!1166 = !{!1167, !1167, i64 0}
!1167 = !{!"_Bool", !914, i64 0}
!1168 = !DILocation(line: 1726, column: 11, scope: !134)
!1169 = !DILocation(line: 1740, column: 11, scope: !134)
!1170 = !DILocation(line: 1741, column: 11, scope: !134)
!1171 = !DILocation(line: 1742, column: 11, scope: !134)
!1172 = !DILocation(line: 1743, column: 11, scope: !134)
!1173 = !DILocation(line: 1744, column: 11, scope: !134)
!1174 = !DILocation(line: 1746, column: 11, scope: !134)
!1175 = !DILocation(line: 1747, column: 11, scope: !134)
!1176 = !DILocation(line: 1749, column: 11, scope: !134)
!1177 = !DILocation(line: 1750, column: 11, scope: !134)
!1178 = !DILocation(line: 1752, column: 11, scope: !134)
!1179 = !DILocation(line: 1753, column: 11, scope: !134)
!1180 = !DILocation(line: 1755, column: 11, scope: !134)
!1181 = !DILocation(line: 1756, column: 11, scope: !134)
!1182 = !DILocation(line: 1758, column: 11, scope: !134)
!1183 = !DILocation(line: 1765, column: 15, scope: !133)
!1184 = !DILocation(line: 1765, column: 22, scope: !133)
!1185 = !DILocation(line: 1765, column: 15, scope: !134)
!1186 = !DILocation(line: 1771, column: 15, scope: !132)
!1187 = !DILocation(line: 1771, column: 25, scope: !132)
!1188 = !DILocation(line: 1772, column: 23, scope: !132)
!1189 = !DILocation(line: 1773, column: 25, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1773, column: 19)
!1191 = !DILocation(line: 1773, column: 19, scope: !132)
!1192 = !DILocation(line: 1774, column: 39, scope: !1190)
!1193 = !DILocation(line: 1774, column: 60, scope: !1190)
!1194 = !DILocation(line: 1774, column: 17, scope: !1190)
!1195 = !DILocation(line: 1775, column: 30, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1775, column: 19)
!1197 = !DILocation(line: 1778, column: 13, scope: !133)
!1198 = !DILocation(line: 1781, column: 9, scope: !134)
!1199 = !DILocation(line: 1783, column: 9, scope: !134)
!1200 = !DILocation(line: 1783, column: 9, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !134, file: !3, discriminator: 1)
!1202 = !DILocation(line: 1786, column: 11, scope: !134)
!1203 = !DILocation(line: 1789, column: 5, scope: !109)
!1204 = !DILocation(line: 1791, column: 8, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1791, column: 7)
!1206 = !DILocation(line: 1791, column: 7, scope: !109)
!1207 = !DILocation(line: 1794, column: 28, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1209, file: !3, discriminator: 1)
!1209 = distinct !DILexicalBlock(scope: !109, file: !3, line: 1794, column: 7)
!1210 = !DILocation(line: 1794, column: 36, scope: !1208)
!1211 = !DILocation(line: 1794, column: 25, scope: !1209)
!1212 = !DILocation(line: 1795, column: 5, scope: !1209)
!1213 = !DILocation(line: 1795, column: 5, scope: !1208)
!1214 = !DILocation(line: 1798, column: 20, scope: !109)
!1215 = !DILocation(line: 1798, column: 18, scope: !109)
!1216 = !DILocation(line: 1568, column: 7, scope: !109)
!1217 = !DILocation(line: 1812, column: 8, scope: !137)
!1218 = !DILocation(line: 1812, column: 15, scope: !137)
!1219 = !DILocation(line: 1812, column: 7, scope: !1220)
!1220 = !DILexicalBlockFile(scope: !109, file: !3, discriminator: 1)
!1221 = !DILocation(line: 1814, column: 7, scope: !136)
!1222 = !DILocation(line: 1815, column: 7, scope: !136)
!1223 = !DILocation(line: 1817, column: 7, scope: !136)
!1224 = !DILocation(line: 1820, column: 28, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 1820, column: 15)
!1226 = distinct !DILexicalBlock(scope: !136, file: !3, line: 1818, column: 9)
!1227 = !DILocation(line: 1820, column: 47, scope: !1228)
!1228 = !DILexicalBlockFile(scope: !1225, file: !3, discriminator: 1)
!1229 = !DILocation(line: 1821, column: 15, scope: !1225)
!1230 = !DILocation(line: 1814, column: 17, scope: !136)
!1231 = !DILocalVariable(name: "s", arg: 1, scope: !1232, file: !3, line: 1333, type: !88)
!1232 = distinct !DISubprogram(name: "parse_old_offset", scope: !3, file: !3, line: 1333, type: !1233, isLocal: true, isDefinition: true, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1236)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!121, !88, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!1236 = !{!1231, !1237, !1238}
!1237 = !DILocalVariable(name: "offset", arg: 2, scope: !1232, file: !3, line: 1333, type: !1235)
!1238 = !DILocalVariable(name: "radix", scope: !1232, file: !3, line: 1335, type: !100)
!1239 = !DILocation(line: 1333, column: 31, scope: !1232, inlinedAt: !1240)
!1240 = distinct !DILocation(line: 1821, column: 18, scope: !1228)
!1241 = !DILocation(line: 1333, column: 45, scope: !1232, inlinedAt: !1240)
!1242 = !DILocation(line: 1337, column: 7, scope: !1232, inlinedAt: !1240)
!1243 = !DILocation(line: 1342, column: 5, scope: !1244, inlinedAt: !1240)
!1244 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 1341, column: 7)
!1245 = !DILocation(line: 1347, column: 7, scope: !1246, inlinedAt: !1240)
!1246 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 1347, column: 7)
!1247 = !DILocation(line: 1347, column: 23, scope: !1246, inlinedAt: !1240)
!1248 = !DILocation(line: 1347, column: 7, scope: !1232, inlinedAt: !1240)
!1249 = !DILocation(line: 1351, column: 11, scope: !1250, inlinedAt: !1240)
!1250 = distinct !DILexicalBlock(scope: !1251, file: !3, line: 1351, column: 11)
!1251 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 1350, column: 5)
!1252 = !DILocation(line: 1351, column: 16, scope: !1250, inlinedAt: !1240)
!1253 = !DILocation(line: 1351, column: 23, scope: !1250, inlinedAt: !1240)
!1254 = !DILocation(line: 1351, column: 27, scope: !1255, inlinedAt: !1240)
!1255 = !DILexicalBlockFile(scope: !1250, file: !3, discriminator: 1)
!1256 = !DILocation(line: 1351, column: 39, scope: !1255, inlinedAt: !1240)
!1257 = !DILocation(line: 1335, column: 7, scope: !1232, inlinedAt: !1240)
!1258 = !DILocation(line: 1357, column: 10, scope: !1232, inlinedAt: !1240)
!1259 = !DILocation(line: 1357, column: 52, scope: !1232, inlinedAt: !1240)
!1260 = !DILocation(line: 1820, column: 15, scope: !1261)
!1261 = !DILexicalBlockFile(scope: !1226, file: !3, discriminator: 2)
!1262 = !DILocation(line: 1823, column: 33, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 1822, column: 13)
!1264 = !DILocation(line: 1823, column: 31, scope: !1263)
!1265 = !DILocation(line: 1825, column: 15, scope: !1263)
!1266 = !DILocation(line: 1826, column: 13, scope: !1263)
!1267 = !DILocation(line: 1830, column: 28, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 1830, column: 15)
!1269 = !DILocation(line: 1830, column: 31, scope: !1270)
!1270 = !DILexicalBlockFile(scope: !1268, file: !3, discriminator: 1)
!1271 = !DILocation(line: 1830, column: 51, scope: !1270)
!1272 = !DILocation(line: 1831, column: 16, scope: !1268)
!1273 = !DILocation(line: 1831, column: 19, scope: !1270)
!1274 = !DILocation(line: 1832, column: 15, scope: !1268)
!1275 = !DILocation(line: 1832, column: 36, scope: !1270)
!1276 = !DILocation(line: 1815, column: 17, scope: !136)
!1277 = !DILocation(line: 1333, column: 31, scope: !1232, inlinedAt: !1278)
!1278 = distinct !DILocation(line: 1832, column: 18, scope: !1270)
!1279 = !DILocation(line: 1333, column: 45, scope: !1232, inlinedAt: !1278)
!1280 = !DILocation(line: 1337, column: 7, scope: !1281, inlinedAt: !1278)
!1281 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 1337, column: 7)
!1282 = !DILocation(line: 1337, column: 7, scope: !1232, inlinedAt: !1278)
!1283 = !DILocation(line: 1342, column: 5, scope: !1244, inlinedAt: !1278)
!1284 = !DILocation(line: 1347, column: 7, scope: !1246, inlinedAt: !1278)
!1285 = !DILocation(line: 1347, column: 23, scope: !1246, inlinedAt: !1278)
!1286 = !DILocation(line: 1347, column: 7, scope: !1232, inlinedAt: !1278)
!1287 = !DILocation(line: 1351, column: 11, scope: !1250, inlinedAt: !1278)
!1288 = !DILocation(line: 1351, column: 16, scope: !1250, inlinedAt: !1278)
!1289 = !DILocation(line: 1351, column: 23, scope: !1250, inlinedAt: !1278)
!1290 = !DILocation(line: 1351, column: 27, scope: !1255, inlinedAt: !1278)
!1291 = !DILocation(line: 1351, column: 39, scope: !1255, inlinedAt: !1278)
!1292 = !DILocation(line: 1335, column: 7, scope: !1232, inlinedAt: !1278)
!1293 = !DILocation(line: 1357, column: 10, scope: !1232, inlinedAt: !1278)
!1294 = !DILocation(line: 1357, column: 52, scope: !1232, inlinedAt: !1278)
!1295 = !DILocation(line: 1830, column: 15, scope: !1261)
!1296 = !DILocation(line: 1834, column: 31, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1298, file: !3, line: 1834, column: 19)
!1298 = distinct !DILexicalBlock(scope: !1268, file: !3, line: 1833, column: 13)
!1299 = !DILocation(line: 1834, column: 57, scope: !1300)
!1300 = !DILexicalBlockFile(scope: !1297, file: !3, discriminator: 1)
!1301 = !DILocation(line: 1834, column: 52, scope: !1300)
!1302 = !DILocation(line: 1333, column: 31, scope: !1232, inlinedAt: !1303)
!1303 = distinct !DILocation(line: 1834, column: 34, scope: !1300)
!1304 = !DILocation(line: 1333, column: 45, scope: !1232, inlinedAt: !1303)
!1305 = !DILocation(line: 1337, column: 7, scope: !1281, inlinedAt: !1303)
!1306 = !DILocation(line: 1337, column: 7, scope: !1232, inlinedAt: !1303)
!1307 = !DILocation(line: 1342, column: 5, scope: !1244, inlinedAt: !1303)
!1308 = !DILocation(line: 1347, column: 7, scope: !1246, inlinedAt: !1303)
!1309 = !DILocation(line: 1347, column: 23, scope: !1246, inlinedAt: !1303)
!1310 = !DILocation(line: 1347, column: 7, scope: !1232, inlinedAt: !1303)
!1311 = !DILocation(line: 1351, column: 11, scope: !1250, inlinedAt: !1303)
!1312 = !DILocation(line: 1351, column: 16, scope: !1250, inlinedAt: !1303)
!1313 = !DILocation(line: 1351, column: 23, scope: !1250, inlinedAt: !1303)
!1314 = !DILocation(line: 1351, column: 27, scope: !1255, inlinedAt: !1303)
!1315 = !DILocation(line: 1351, column: 39, scope: !1255, inlinedAt: !1303)
!1316 = !DILocation(line: 1335, column: 7, scope: !1232, inlinedAt: !1303)
!1317 = !DILocation(line: 1357, column: 10, scope: !1232, inlinedAt: !1303)
!1318 = !DILocation(line: 1357, column: 52, scope: !1232, inlinedAt: !1303)
!1319 = !DILocation(line: 1834, column: 19, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !1298, file: !3, discriminator: 1)
!1321 = !DILocation(line: 1836, column: 37, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 1835, column: 17)
!1323 = !DILocation(line: 1836, column: 35, scope: !1322)
!1324 = !DILocation(line: 1838, column: 34, scope: !1322)
!1325 = !DILocation(line: 1580, column: 13, scope: !109)
!1326 = !DILocation(line: 1839, column: 24, scope: !1322)
!1327 = !DILocation(line: 1841, column: 17, scope: !1322)
!1328 = !DILocation(line: 1844, column: 37, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 1843, column: 17)
!1330 = !DILocation(line: 1844, column: 35, scope: !1329)
!1331 = !DILocation(line: 1846, column: 43, scope: !1329)
!1332 = !DILocation(line: 1846, column: 38, scope: !1329)
!1333 = !DILocation(line: 1846, column: 31, scope: !1329)
!1334 = !DILocation(line: 1846, column: 19, scope: !1329)
!1335 = !DILocation(line: 1846, column: 36, scope: !1329)
!1336 = !DILocation(line: 1847, column: 19, scope: !1329)
!1337 = !DILocation(line: 1854, column: 15, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 1853, column: 15)
!1339 = !DILocation(line: 1854, column: 48, scope: !1340)
!1340 = !DILexicalBlockFile(scope: !1338, file: !3, discriminator: 1)
!1341 = !DILocation(line: 1854, column: 36, scope: !1340)
!1342 = !DILocation(line: 1333, column: 31, scope: !1232, inlinedAt: !1343)
!1343 = distinct !DILocation(line: 1854, column: 18, scope: !1340)
!1344 = !DILocation(line: 1333, column: 45, scope: !1232, inlinedAt: !1343)
!1345 = !DILocation(line: 1337, column: 7, scope: !1281, inlinedAt: !1343)
!1346 = !DILocation(line: 1337, column: 7, scope: !1232, inlinedAt: !1343)
!1347 = !DILocation(line: 1342, column: 5, scope: !1244, inlinedAt: !1343)
!1348 = !DILocation(line: 1347, column: 7, scope: !1246, inlinedAt: !1343)
!1349 = !DILocation(line: 1347, column: 23, scope: !1246, inlinedAt: !1343)
!1350 = !DILocation(line: 1347, column: 7, scope: !1232, inlinedAt: !1343)
!1351 = !DILocation(line: 1351, column: 11, scope: !1250, inlinedAt: !1343)
!1352 = !DILocation(line: 1351, column: 16, scope: !1250, inlinedAt: !1343)
!1353 = !DILocation(line: 1351, column: 23, scope: !1250, inlinedAt: !1343)
!1354 = !DILocation(line: 1351, column: 27, scope: !1255, inlinedAt: !1343)
!1355 = !DILocation(line: 1351, column: 39, scope: !1255, inlinedAt: !1343)
!1356 = !DILocation(line: 1335, column: 7, scope: !1232, inlinedAt: !1343)
!1357 = !DILocation(line: 1357, column: 10, scope: !1232, inlinedAt: !1343)
!1358 = !DILocation(line: 1357, column: 52, scope: !1232, inlinedAt: !1343)
!1359 = !DILocation(line: 1855, column: 15, scope: !1338)
!1360 = !DILocation(line: 1855, column: 41, scope: !1340)
!1361 = !DILocation(line: 1855, column: 48, scope: !1340)
!1362 = !DILocation(line: 1855, column: 36, scope: !1340)
!1363 = !DILocation(line: 1333, column: 31, scope: !1232, inlinedAt: !1364)
!1364 = distinct !DILocation(line: 1855, column: 18, scope: !1340)
!1365 = !DILocation(line: 1333, column: 45, scope: !1232, inlinedAt: !1364)
!1366 = !DILocation(line: 1337, column: 7, scope: !1281, inlinedAt: !1364)
!1367 = !DILocation(line: 1337, column: 7, scope: !1232, inlinedAt: !1364)
!1368 = !DILocation(line: 1342, column: 5, scope: !1244, inlinedAt: !1364)
!1369 = !DILocation(line: 1347, column: 7, scope: !1246, inlinedAt: !1364)
!1370 = !DILocation(line: 1347, column: 23, scope: !1246, inlinedAt: !1364)
!1371 = !DILocation(line: 1347, column: 7, scope: !1232, inlinedAt: !1364)
!1372 = !DILocation(line: 1351, column: 11, scope: !1250, inlinedAt: !1364)
!1373 = !DILocation(line: 1351, column: 16, scope: !1250, inlinedAt: !1364)
!1374 = !DILocation(line: 1351, column: 23, scope: !1250, inlinedAt: !1364)
!1375 = !DILocation(line: 1351, column: 27, scope: !1255, inlinedAt: !1364)
!1376 = !DILocation(line: 1351, column: 39, scope: !1255, inlinedAt: !1364)
!1377 = !DILocation(line: 1335, column: 7, scope: !1232, inlinedAt: !1364)
