!llvm.dbg.cu = !{!2, !212, !218, !261, !269, !688, !691, !276, !283, !697, !333, !705, !722, !724, !726, !728, !730, !732, !735, !750, !342}
!llvm.ident = !{!752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752, !752}
!llvm.module.flags = !{!753, !754, !755, !756}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 75, type: !198, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !38, globals: !54)
!3 = !DIFile(filename: "src/pinky.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !23}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 148, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22}
!22 = !DIEnumerator(name: "UT_USER_SIZE", value: 32)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 46, size: 32, elements: !25)
!24 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!26 = !DIEnumerator(name: "_ISupper", value: 256)
!27 = !DIEnumerator(name: "_ISlower", value: 512)
!28 = !DIEnumerator(name: "_ISalpha", value: 1024)
!29 = !DIEnumerator(name: "_ISdigit", value: 2048)
!30 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!31 = !DIEnumerator(name: "_ISspace", value: 8192)
!32 = !DIEnumerator(name: "_ISprint", value: 16384)
!33 = !DIEnumerator(name: "_ISgraph", value: 32768)
!34 = !DIEnumerator(name: "_ISblank", value: 1)
!35 = !DIEnumerator(name: "_IScntrl", value: 2)
!36 = !DIEnumerator(name: "_ISpunct", value: 4)
!37 = !DIEnumerator(name: "_ISalnum", value: 8)
!38 = !{!39, !41, !42, !45, !47, !50, !49, !52, !53}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 62, baseType: !44)
!43 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !{!55, !0, !85, !88, !90, !92, !94, !96, !98, !100, !102, !104, !106, !125, !130}
!55 = !DIGlobalVariableExpression(var: !56)
!56 = distinct !DIGlobalVariable(name: "infomap", scope: !57, file: !58, line: 632, type: !82, isLocal: true, isDefinition: true)
!57 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !58, file: !58, line: 630, type: !59, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !61)
!58 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!59 = !DISubroutineType(types: !60)
!60 = !{null, !50}
!61 = !{!62, !63, !64, !71, !73, !74, !75, !78, !79, !81}
!62 = !DILocalVariable(name: "program", arg: 1, scope: !57, file: !58, line: 630, type: !50)
!63 = !DILocalVariable(name: "node", scope: !57, file: !58, line: 642, type: !50)
!64 = !DILocalVariable(name: "map_prog", scope: !57, file: !58, line: 643, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !57, file: !58, line: 632, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !67, file: !58, line: 632, baseType: !50, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !67, file: !58, line: 632, baseType: !50, size: 64, offset: 64)
!71 = !DILocalVariable(name: "__s1_len", scope: !72, file: !58, line: 645, type: !42)
!72 = distinct !DILexicalBlock(scope: !57, file: !58, line: 645, column: 33)
!73 = !DILocalVariable(name: "__s2_len", scope: !72, file: !58, line: 645, type: !42)
!74 = !DILocalVariable(name: "lc_messages", scope: !57, file: !58, line: 655, type: !50)
!75 = !DILocalVariable(name: "__s1_len", scope: !76, file: !58, line: 656, type: !42)
!76 = distinct !DILexicalBlock(scope: !77, file: !58, line: 656, column: 22)
!77 = distinct !DILexicalBlock(scope: !57, file: !58, line: 656, column: 7)
!78 = !DILocalVariable(name: "__s2_len", scope: !76, file: !58, line: 656, type: !42)
!79 = !DILocalVariable(name: "__s2", scope: !80, file: !58, line: 656, type: !47)
!80 = distinct !DILexicalBlock(scope: !76, file: !58, line: 656, column: 22)
!81 = !DILocalVariable(name: "__result", scope: !80, file: !58, line: 656, type: !52)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 896, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 7)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "do_short_format", scope: !2, file: !3, line: 63, type: !87, isLocal: true, isDefinition: true)
!87 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!88 = !DIGlobalVariableExpression(var: !89)
!89 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 47, type: !87, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "include_fullname", scope: !2, file: !3, line: 50, type: !87, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "include_where", scope: !2, file: !3, line: 67, type: !87, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95)
!95 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 44, type: !87, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97)
!97 = distinct !DIGlobalVariable(name: "include_project", scope: !2, file: !3, line: 53, type: !87, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "include_plan", scope: !2, file: !3, line: 56, type: !87, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !2, file: !3, line: 60, type: !87, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103)
!103 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 72, type: !50, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 73, type: !52, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107)
!107 = distinct !DIGlobalVariable(name: "now", scope: !108, file: !3, line: 149, type: !111, isLocal: true, isDefinition: true)
!108 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 147, type: !109, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !116)
!109 = !DISubroutineType(types: !110)
!110 = !{!50, !111}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !112, line: 8, baseType: !113)
!112 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !114, line: 148, baseType: !115)
!114 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!115 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!116 = !{!117, !118, !119, !122, !123}
!117 = !DILocalVariable(name: "when", arg: 1, scope: !108, file: !3, line: 147, type: !111)
!118 = !DILocalVariable(name: "seconds_idle", scope: !108, file: !3, line: 151, type: !111)
!119 = !DILocalVariable(name: "hours", scope: !120, file: !3, line: 161, type: !52)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 160, column: 5)
!121 = distinct !DILexicalBlock(scope: !108, file: !3, line: 159, column: 7)
!122 = !DILocalVariable(name: "minutes", scope: !120, file: !3, line: 162, type: !52)
!123 = !DILocalVariable(name: "days", scope: !124, file: !3, line: 167, type: !44)
!124 = distinct !DILexicalBlock(scope: !121, file: !3, line: 166, column: 5)
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "buf", scope: !108, file: !3, line: 150, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 176, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 22)
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "buf", scope: !132, file: !3, line: 177, type: !195, isLocal: true, isDefinition: true)
!132 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 175, type: !133, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !176)
!133 = !DISubroutineType(types: !134)
!134 = !{!50, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !20, line: 146, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !139, line: 55, size: 3072, elements: !140)
!139 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!140 = !{!141, !143, !145, !149, !153, !154, !158, !163, !165, !170, !172}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !138, file: !139, line: 57, baseType: !142, size: 16)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !138, file: !139, line: 58, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !114, line: 142, baseType: !52)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !138, file: !139, line: 59, baseType: !146, size: 256, offset: 64)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !138, file: !139, line: 60, baseType: !150, size: 32, offset: 320)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 4)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !138, file: !139, line: 61, baseType: !146, size: 256, offset: 352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !138, file: !139, line: 62, baseType: !155, size: 2048, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !138, file: !139, line: 63, baseType: !159, size: 32, offset: 2656)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !139, line: 42, size: 32, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !159, file: !139, line: 45, baseType: !142, size: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !159, file: !139, line: 46, baseType: !142, size: 16, offset: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !138, file: !139, line: 70, baseType: !164, size: 32, offset: 2688)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !114, line: 40, baseType: !52)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !138, file: !139, line: 75, baseType: !166, size: 64, offset: 2720)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !139, line: 71, size: 64, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !166, file: !139, line: 73, baseType: !164, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !166, file: !139, line: 74, baseType: !164, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !138, file: !139, line: 80, baseType: !171, size: 128, offset: 2784)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !151)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !138, file: !139, line: 81, baseType: !173, size: 160, offset: 2912)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !{!177, !178, !179}
!177 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !132, file: !3, line: 175, type: !135)
!178 = !DILocalVariable(name: "t", scope: !132, file: !3, line: 185, type: !111)
!179 = !DILocalVariable(name: "tmp", scope: !132, file: !3, line: 186, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !182, line: 8, size: 448, elements: !183)
!182 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !181, file: !182, line: 10, baseType: !52, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !181, file: !182, line: 11, baseType: !52, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !181, file: !182, line: 12, baseType: !52, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !181, file: !182, line: 13, baseType: !52, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !181, file: !182, line: 14, baseType: !52, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !181, file: !182, line: 15, baseType: !52, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !181, file: !182, line: 16, baseType: !52, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !181, file: !182, line: 17, baseType: !52, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !181, file: !182, line: 18, baseType: !52, size: 32, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !181, file: !182, line: 21, baseType: !115, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !181, file: !182, line: 22, baseType: !50, size: 64, offset: 384)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 264, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 33)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 768, elements: !208)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !201, line: 104, size: 256, elements: !202)
!201 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!202 = !{!203, !204, !205, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !201, line: 106, baseType: !50, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !200, file: !201, line: 109, baseType: !52, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 110, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !200, file: !201, line: 111, baseType: !52, size: 32, offset: 192)
!208 = !{!209}
!209 = !DISubrange(count: 3)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "Version", scope: !212, file: !213, line: 2, type: !50, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, globals: !215)
!213 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{}
!215 = !{!210}
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "last_cherror", scope: !218, file: !224, line: 28, type: !52, isLocal: true, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, globals: !220)
!219 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!220 = !{!221, !216}
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "hints", scope: !223, file: !224, line: 63, type: !233, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "canon_host_r", scope: !224, file: !224, line: 60, type: !225, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !218, variables: !227)
!224 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!225 = !DISubroutineType(types: !226)
!226 = !{!39, !50, !206}
!227 = !{!228, !229, !230, !231, !258}
!228 = !DILocalVariable(name: "host", arg: 1, scope: !223, file: !224, line: 60, type: !50)
!229 = !DILocalVariable(name: "cherror", arg: 2, scope: !223, file: !224, line: 60, type: !206)
!230 = !DILocalVariable(name: "retval", scope: !223, file: !224, line: 62, type: !39)
!231 = !DILocalVariable(name: "res", scope: !223, file: !224, line: 64, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !234, line: 566, size: 384, elements: !235)
!234 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !{!236, !237, !238, !239, !240, !245, !256, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !233, file: !234, line: 568, baseType: !52, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !233, file: !234, line: 569, baseType: !52, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !233, file: !234, line: 570, baseType: !52, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !233, file: !234, line: 571, baseType: !52, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !233, file: !234, line: 572, baseType: !241, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !242, line: 33, baseType: !243)
!242 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !114, line: 198, baseType: !244)
!244 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !233, file: !234, line: 573, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !242, line: 172, size: 128, elements: !248)
!248 = !{!249, !252}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !247, file: !242, line: 174, baseType: !250, size: 16)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !251, line: 28, baseType: !53)
!251 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !247, file: !242, line: 175, baseType: !253, size: 112, offset: 16)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 112, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 14)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !233, file: !234, line: 574, baseType: !39, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !233, file: !234, line: 575, baseType: !232, size: 64, offset: 320)
!258 = !DILocalVariable(name: "status", scope: !223, file: !224, line: 65, type: !52)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "file_name", scope: !261, file: !266, line: 36, type: !50, isLocal: true, isDefinition: true)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, globals: !263)
!262 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !{!259, !264}
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !261, file: !266, line: 46, type: !87, isLocal: true, isDefinition: true)
!266 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !DIGlobalVariableExpression(var: !268)
!268 = distinct !DIGlobalVariable(name: "exit_failure", scope: !269, file: !272, line: 24, type: !273, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, globals: !271)
!270 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!271 = !{!267}
!272 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!273 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!274 = !DIGlobalVariableExpression(var: !275)
!275 = distinct !DIGlobalVariable(name: "program_name", scope: !276, file: !280, line: 33, type: !50, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !278, globals: !279)
!277 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!278 = !{!41, !39}
!279 = !{!274}
!280 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!281 = !DIGlobalVariableExpression(var: !282)
!282 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !283, file: !295, line: 77, type: !327, isDefinition: true)
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !285, retainedTypes: !291, globals: !292)
!284 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!285 = !{!5, !286, !23}
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!289 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!290 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!291 = !{!52, !53, !42, !39}
!292 = !{!281, !293, !300, !312, !314, !316, !323, !325}
!293 = !DIGlobalVariableExpression(var: !294)
!294 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !283, file: !295, line: 93, type: !296, isDefinition: true)
!295 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 320, elements: !298)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!298 = !{!299}
!299 = !DISubrange(count: 10)
!300 = !DIGlobalVariableExpression(var: !301)
!301 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !283, file: !295, line: 1043, type: !302, isDefinition: true)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !295, line: 57, size: 448, elements: !303)
!303 = !{!304, !305, !306, !310, !311}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !302, file: !295, line: 60, baseType: !5, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !295, line: 63, baseType: !52, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !302, file: !295, line: 67, baseType: !307, size: 256, offset: 64)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 256, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 8)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !302, file: !295, line: 70, baseType: !50, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !302, file: !295, line: 73, baseType: !50, size: 64, offset: 384)
!312 = !DIGlobalVariableExpression(var: !313)
!313 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !283, file: !295, line: 108, type: !302, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315)
!315 = distinct !DIGlobalVariable(name: "slot0", scope: !283, file: !295, line: 834, type: !155, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317)
!317 = distinct !DIGlobalVariable(name: "slotvec", scope: !283, file: !295, line: 837, type: !318, isLocal: true, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !295, line: 826, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !319, file: !295, line: 828, baseType: !42, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !319, file: !295, line: 829, baseType: !39, size: 64, offset: 64)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "nslots", scope: !283, file: !295, line: 835, type: !52, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326)
!326 = distinct !DIGlobalVariable(name: "slotvec0", scope: !283, file: !295, line: 836, type: !319, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 704, elements: !329)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!329 = !{!330}
!330 = !DISubrange(count: 11)
!331 = !DIGlobalVariableExpression(var: !332)
!332 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !333, file: !336, line: 26, type: !337, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, globals: !335)
!334 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!335 = !{!331}
!336 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 47)
!340 = !DIGlobalVariableExpression(var: !341)
!341 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !342, file: !686, line: 120, type: !687, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !344, retainedTypes: !683, globals: !685)
!343 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !{!345}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !346, line: 41, size: 32, elements: !347)
!346 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!348 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!349 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!350 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!351 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!352 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!353 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!354 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!355 = !DIEnumerator(name: "DAY_1", value: 131079)
!356 = !DIEnumerator(name: "DAY_2", value: 131080)
!357 = !DIEnumerator(name: "DAY_3", value: 131081)
!358 = !DIEnumerator(name: "DAY_4", value: 131082)
!359 = !DIEnumerator(name: "DAY_5", value: 131083)
!360 = !DIEnumerator(name: "DAY_6", value: 131084)
!361 = !DIEnumerator(name: "DAY_7", value: 131085)
!362 = !DIEnumerator(name: "ABMON_1", value: 131086)
!363 = !DIEnumerator(name: "ABMON_2", value: 131087)
!364 = !DIEnumerator(name: "ABMON_3", value: 131088)
!365 = !DIEnumerator(name: "ABMON_4", value: 131089)
!366 = !DIEnumerator(name: "ABMON_5", value: 131090)
!367 = !DIEnumerator(name: "ABMON_6", value: 131091)
!368 = !DIEnumerator(name: "ABMON_7", value: 131092)
!369 = !DIEnumerator(name: "ABMON_8", value: 131093)
!370 = !DIEnumerator(name: "ABMON_9", value: 131094)
!371 = !DIEnumerator(name: "ABMON_10", value: 131095)
!372 = !DIEnumerator(name: "ABMON_11", value: 131096)
!373 = !DIEnumerator(name: "ABMON_12", value: 131097)
!374 = !DIEnumerator(name: "MON_1", value: 131098)
!375 = !DIEnumerator(name: "MON_2", value: 131099)
!376 = !DIEnumerator(name: "MON_3", value: 131100)
!377 = !DIEnumerator(name: "MON_4", value: 131101)
!378 = !DIEnumerator(name: "MON_5", value: 131102)
!379 = !DIEnumerator(name: "MON_6", value: 131103)
!380 = !DIEnumerator(name: "MON_7", value: 131104)
!381 = !DIEnumerator(name: "MON_8", value: 131105)
!382 = !DIEnumerator(name: "MON_9", value: 131106)
!383 = !DIEnumerator(name: "MON_10", value: 131107)
!384 = !DIEnumerator(name: "MON_11", value: 131108)
!385 = !DIEnumerator(name: "MON_12", value: 131109)
!386 = !DIEnumerator(name: "AM_STR", value: 131110)
!387 = !DIEnumerator(name: "PM_STR", value: 131111)
!388 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!389 = !DIEnumerator(name: "D_FMT", value: 131113)
!390 = !DIEnumerator(name: "T_FMT", value: 131114)
!391 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!392 = !DIEnumerator(name: "ERA", value: 131116)
!393 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!394 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!395 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!396 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!397 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!398 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!399 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!400 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!401 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!402 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!403 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!404 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!405 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!406 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!407 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!408 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!409 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!410 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!411 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!412 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!413 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!414 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!415 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!416 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!417 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!418 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!419 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!420 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!421 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!422 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!423 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!424 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!425 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!426 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!427 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!428 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!429 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!430 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!431 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!432 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!433 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!434 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!435 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!436 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!437 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!438 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!439 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!440 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!441 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!442 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!443 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!444 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!445 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!446 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!447 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!448 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!449 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!450 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!451 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!452 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!453 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!454 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!455 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!456 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!457 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!458 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!459 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!460 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!461 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!462 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!463 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!464 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!465 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!466 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!467 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!468 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!469 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!470 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!471 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!472 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!473 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!474 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!475 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!476 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!477 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!478 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!479 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!480 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!481 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!482 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!483 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!484 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!485 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!486 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!488 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!489 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!490 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!491 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!492 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!493 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!494 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!495 = !DIEnumerator(name: "CODESET", value: 14)
!496 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!497 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!498 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!499 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!542 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!543 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!544 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!545 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!551 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!552 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!556 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!567 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!568 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!569 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!570 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!571 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!572 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!573 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!574 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!575 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!576 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!577 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!578 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!579 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!580 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!581 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!582 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!583 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!584 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!585 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!586 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!587 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!588 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!589 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!606 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!607 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!610 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!611 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!612 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!613 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!614 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!615 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!616 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!617 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!618 = !DIEnumerator(name: "THOUSEP", value: 65537)
!619 = !DIEnumerator(name: "__GROUPING", value: 65538)
!620 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!621 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!622 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!623 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!624 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!625 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!626 = !DIEnumerator(name: "__YESSTR", value: 327682)
!627 = !DIEnumerator(name: "__NOSTR", value: 327683)
!628 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!629 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!630 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!631 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!632 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!633 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!634 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!635 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!636 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!637 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!638 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!640 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!641 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!642 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!643 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!644 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!645 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!646 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!650 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!651 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!652 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!653 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!654 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!655 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!656 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!657 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!658 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!659 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!660 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!661 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!662 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!663 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!664 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!681 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!682 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!683 = !{!41, !39, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!685 = !{!340}
!686 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !690)
!689 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!690 = !{!42, !45, !47, !50}
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !693)
!692 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !695, line: 135, baseType: !696)
!695 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !114, line: 61, baseType: !115)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !699, retainedTypes: !704)
!698 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = !{!700}
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !701, line: 41, size: 32, elements: !702)
!701 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = !{!703}
!703 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!704 = !{!41}
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !707, retainedTypes: !721)
!706 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = !{!708}
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !710, file: !709, line: 192, size: 32, elements: !719)
!709 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!710 = distinct !DISubprogram(name: "x2nrealloc", scope: !709, file: !709, line: 180, type: !711, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !705, variables: !714)
!711 = !DISubroutineType(types: !712)
!712 = !{!41, !41, !713, !42}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!714 = !{!715, !716, !717, !718}
!715 = !DILocalVariable(name: "p", arg: 1, scope: !710, file: !709, line: 180, type: !41)
!716 = !DILocalVariable(name: "pn", arg: 2, scope: !710, file: !709, line: 180, type: !713)
!717 = !DILocalVariable(name: "s", arg: 3, scope: !710, file: !709, line: 180, type: !42)
!718 = !DILocalVariable(name: "n", scope: !710, file: !709, line: 182, type: !42)
!719 = !{!720}
!720 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!721 = !{!42, !39, !41}
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214)
!723 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !704)
!725 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214)
!727 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !704)
!729 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !704)
!731 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214, retainedTypes: !734)
!733 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!734 = !{!42}
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !737, retainedTypes: !749)
!736 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!737 = !{!738, !742}
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 208, size: 32, elements: !739)
!739 = !{!740, !741}
!740 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1)
!741 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2)
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !743, file: !709, line: 192, size: 32, elements: !719)
!743 = distinct !DISubprogram(name: "x2nrealloc", scope: !709, file: !709, line: 180, type: !711, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !735, variables: !744)
!744 = !{!745, !746, !747, !748}
!745 = !DILocalVariable(name: "p", arg: 1, scope: !743, file: !709, line: 180, type: !41)
!746 = !DILocalVariable(name: "pn", arg: 2, scope: !743, file: !709, line: 180, type: !713)
!747 = !DILocalVariable(name: "s", arg: 3, scope: !743, file: !709, line: 180, type: !42)
!748 = !DILocalVariable(name: "n", scope: !743, file: !709, line: 182, type: !42)
!749 = !{!39, !41}
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !214)
!751 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!752 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!753 = !{i32 2, !"Dwarf Version", i32 4}
!754 = !{i32 2, !"Debug Info Version", i32 3}
!755 = !{i32 1, !"PIC Level", i32 2}
!756 = !{i32 1, !"PIE Level", i32 2}
!757 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 487, type: !758, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !52}
!760 = !{!761}
!761 = !DILocalVariable(name: "status", arg: 1, scope: !757, file: !3, line: 487, type: !52)
!762 = !DIExpression()
!763 = !DILocation(line: 487, column: 12, scope: !757)
!764 = !DILocation(line: 489, column: 14, scope: !765)
!765 = distinct !DILexicalBlock(scope: !757, file: !3, line: 489, column: 7)
!766 = !DILocation(line: 489, column: 7, scope: !757)
!767 = !DILocation(line: 490, column: 5, scope: !768)
!768 = !DILexicalBlockFile(scope: !769, file: !3, discriminator: 1)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 490, column: 5)
!770 = !{!771, !771, i64 0}
!771 = !{!"any pointer", !772, i64 0}
!772 = !{!"omnipotent char", !773, i64 0}
!773 = !{!"Simple C/C++ TBAA"}
!774 = !DILocation(line: 490, column: 5, scope: !775)
!775 = !DILexicalBlockFile(scope: !769, file: !3, discriminator: 3)
!776 = !DILocation(line: 490, column: 5, scope: !777)
!777 = !DILexicalBlockFile(scope: !769, file: !3, discriminator: 2)
!778 = !DILocation(line: 493, column: 7, scope: !779)
!779 = distinct !DILexicalBlock(scope: !765, file: !3, line: 492, column: 5)
!780 = !DILocation(line: 493, column: 7, scope: !781)
!781 = !DILexicalBlockFile(scope: !779, file: !3, discriminator: 1)
!782 = !DILocation(line: 494, column: 7, scope: !779)
!783 = !DILocation(line: 494, column: 7, scope: !781)
!784 = !DILocation(line: 502, column: 7, scope: !779)
!785 = !DILocation(line: 502, column: 7, scope: !781)
!786 = !DILocation(line: 509, column: 7, scope: !779)
!787 = !DILocation(line: 509, column: 7, scope: !781)
!788 = !DILocation(line: 510, column: 7, scope: !779)
!789 = !DILocation(line: 510, column: 7, scope: !781)
!790 = !DILocation(line: 511, column: 7, scope: !779)
!791 = !DILocation(line: 511, column: 7, scope: !781)
!792 = !DILocation(line: 642, column: 15, scope: !57, inlinedAt: !793)
!793 = distinct !DILocation(line: 516, column: 7, scope: !779)
!794 = !DILocation(line: 651, column: 3, scope: !57, inlinedAt: !793)
!795 = !DILocation(line: 651, column: 3, scope: !796, inlinedAt: !793)
!796 = !DILexicalBlockFile(scope: !57, file: !58, discriminator: 1)
!797 = !DILocation(line: 655, column: 29, scope: !57, inlinedAt: !793)
!798 = !DILocation(line: 655, column: 15, scope: !57, inlinedAt: !793)
!799 = !DILocation(line: 656, column: 7, scope: !77, inlinedAt: !793)
!800 = !DILocation(line: 656, column: 19, scope: !77, inlinedAt: !793)
!801 = !DILocation(line: 656, column: 22, scope: !802, inlinedAt: !793)
!802 = !DILexicalBlockFile(scope: !77, file: !58, discriminator: 16)
!803 = !DILocation(line: 656, column: 7, scope: !804, inlinedAt: !793)
!804 = !DILexicalBlockFile(scope: !57, file: !58, discriminator: 16)
!805 = !DILocation(line: 662, column: 7, scope: !806, inlinedAt: !793)
!806 = distinct !DILexicalBlock(scope: !77, file: !58, line: 657, column: 5)
!807 = !DILocation(line: 662, column: 7, scope: !808, inlinedAt: !793)
!808 = !DILexicalBlockFile(scope: !806, file: !58, discriminator: 1)
!809 = !DILocation(line: 664, column: 5, scope: !806, inlinedAt: !793)
!810 = !DILocation(line: 665, column: 3, scope: !57, inlinedAt: !793)
!811 = !DILocation(line: 665, column: 3, scope: !796, inlinedAt: !793)
!812 = !DILocation(line: 667, column: 3, scope: !57, inlinedAt: !793)
!813 = !DILocation(line: 667, column: 3, scope: !796, inlinedAt: !793)
!814 = !DILocation(line: 518, column: 3, scope: !757)
!815 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 522, type: !816, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !819)
!816 = !DISubroutineType(types: !817)
!817 = !{!52, !52, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!819 = !{!820, !821, !822, !823}
!820 = !DILocalVariable(name: "argc", arg: 1, scope: !815, file: !3, line: 522, type: !52)
!821 = !DILocalVariable(name: "argv", arg: 2, scope: !815, file: !3, line: 522, type: !818)
!822 = !DILocalVariable(name: "optc", scope: !815, file: !3, line: 524, type: !52)
!823 = !DILocalVariable(name: "n_users", scope: !815, file: !3, line: 525, type: !52)
!824 = !DILocalVariable(name: "buf", scope: !825, file: !3, line: 350, type: !909)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 348, column: 5)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 347, column: 7)
!827 = distinct !DISubprogram(name: "print_long_entry", scope: !3, file: !3, line: 307, type: !59, isLocal: true, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !828)
!828 = !{!829, !830, !844, !848, !849, !824, !900, !901, !902, !905, !908, !912, !913, !914}
!829 = !DILocalVariable(name: "name", arg: 1, scope: !827, file: !3, line: 307, type: !50)
!830 = !DILocalVariable(name: "pw", scope: !827, file: !3, line: 309, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !833, line: 49, size: 384, elements: !834)
!833 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!834 = !{!835, !836, !837, !839, !841, !842, !843}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !832, file: !833, line: 51, baseType: !39, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !832, file: !833, line: 52, baseType: !39, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !832, file: !833, line: 53, baseType: !838, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !114, line: 134, baseType: !244)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !832, file: !833, line: 54, baseType: !840, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !114, line: 135, baseType: !244)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !832, file: !833, line: 55, baseType: !39, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !832, file: !833, line: 56, baseType: !39, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !832, file: !833, line: 57, baseType: !39, size: 64, offset: 320)
!844 = !DILocalVariable(name: "comma", scope: !845, file: !3, line: 325, type: !847)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 324, column: 5)
!846 = distinct !DILexicalBlock(scope: !827, file: !3, line: 317, column: 7)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!848 = !DILocalVariable(name: "result", scope: !845, file: !3, line: 326, type: !39)
!849 = !DILocalVariable(name: "stream", scope: !825, file: !3, line: 349, type: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !852, line: 49, baseType: !853)
!852 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !854, line: 241, size: 1728, elements: !855)
!854 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !876, !877, !878, !879, !881, !882, !884, !888, !891, !893, !894, !895, !896, !897, !898, !899}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !853, file: !854, line: 242, baseType: !52, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !853, file: !854, line: 247, baseType: !39, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !853, file: !854, line: 248, baseType: !39, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !853, file: !854, line: 249, baseType: !39, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !853, file: !854, line: 250, baseType: !39, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !853, file: !854, line: 251, baseType: !39, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !853, file: !854, line: 252, baseType: !39, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !853, file: !854, line: 253, baseType: !39, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !853, file: !854, line: 254, baseType: !39, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !853, file: !854, line: 256, baseType: !39, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !853, file: !854, line: 257, baseType: !39, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !853, file: !854, line: 258, baseType: !39, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !853, file: !854, line: 260, baseType: !869, size: 64, offset: 768)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !854, line: 156, size: 192, elements: !871)
!871 = !{!872, !873, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !870, file: !854, line: 157, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !870, file: !854, line: 158, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !870, file: !854, line: 162, baseType: !52, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !853, file: !854, line: 262, baseType: !874, size: 64, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !853, file: !854, line: 264, baseType: !52, size: 32, offset: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !853, file: !854, line: 268, baseType: !52, size: 32, offset: 928)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !853, file: !854, line: 270, baseType: !880, size: 64, offset: 960)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !114, line: 140, baseType: !115)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !853, file: !854, line: 274, baseType: !53, size: 16, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !853, file: !854, line: 275, baseType: !883, size: 8, offset: 1040)
!883 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !853, file: !854, line: 276, baseType: !885, size: 8, offset: 1048)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 1)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !853, file: !854, line: 280, baseType: !889, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !854, line: 150, baseType: null)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !853, file: !854, line: 289, baseType: !892, size: 64, offset: 1152)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !114, line: 141, baseType: !115)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !853, file: !854, line: 297, baseType: !41, size: 64, offset: 1216)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !853, file: !854, line: 298, baseType: !41, size: 64, offset: 1280)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !853, file: !854, line: 299, baseType: !41, size: 64, offset: 1344)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !853, file: !854, line: 300, baseType: !41, size: 64, offset: 1408)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !853, file: !854, line: 302, baseType: !42, size: 64, offset: 1472)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !853, file: !854, line: 303, baseType: !52, size: 32, offset: 1536)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !853, file: !854, line: 305, baseType: !173, size: 160, offset: 1568)
!900 = !DILocalVariable(name: "baseproject", scope: !825, file: !3, line: 351, type: !328)
!901 = !DILocalVariable(name: "project", scope: !825, file: !3, line: 352, type: !847)
!902 = !DILocalVariable(name: "bytes", scope: !903, file: !3, line: 359, type: !42)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 358, column: 9)
!904 = distinct !DILexicalBlock(scope: !825, file: !3, line: 357, column: 11)
!905 = !DILocalVariable(name: "stream", scope: !906, file: !3, line: 373, type: !850)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 372, column: 5)
!907 = distinct !DILexicalBlock(scope: !827, file: !3, line: 371, column: 7)
!908 = !DILocalVariable(name: "buf", scope: !906, file: !3, line: 374, type: !909)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 1024)
!912 = !DILocalVariable(name: "baseplan", scope: !906, file: !3, line: 375, type: !328)
!913 = !DILocalVariable(name: "plan", scope: !906, file: !3, line: 376, type: !847)
!914 = !DILocalVariable(name: "bytes", scope: !915, file: !3, line: 383, type: !42)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 382, column: 9)
!916 = distinct !DILexicalBlock(scope: !906, file: !3, line: 381, column: 11)
!917 = !DILocation(line: 350, column: 12, scope: !825, inlinedAt: !918)
!918 = distinct !DILocation(line: 483, column: 5, scope: !919, inlinedAt: !930)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 482, column: 3)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 482, column: 3)
!921 = distinct !DISubprogram(name: "long_pinky", scope: !3, file: !3, line: 478, type: !922, isLocal: true, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !926)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !924, !925}
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!926 = !{!927, !928, !929}
!927 = !DILocalVariable(name: "argc_names", arg: 1, scope: !921, file: !3, line: 478, type: !924)
!928 = !DILocalVariable(name: "argv_names", arg: 2, scope: !921, file: !3, line: 478, type: !925)
!929 = !DILocalVariable(name: "i", scope: !921, file: !3, line: 480, type: !52)
!930 = distinct !DILocation(line: 603, column: 5, scope: !931)
!931 = distinct !DILexicalBlock(scope: !815, file: !3, line: 600, column: 7)
!932 = !DILocation(line: 374, column: 12, scope: !906, inlinedAt: !918)
!933 = !DILocation(line: 522, column: 11, scope: !815)
!934 = !DILocation(line: 522, column: 24, scope: !815)
!935 = !DILocation(line: 528, column: 21, scope: !815)
!936 = !DILocation(line: 528, column: 3, scope: !815)
!937 = !DILocation(line: 529, column: 3, scope: !815)
!938 = !DILocation(line: 530, column: 3, scope: !815)
!939 = !DILocation(line: 531, column: 3, scope: !815)
!940 = !DILocation(line: 533, column: 3, scope: !815)
!941 = !DILocation(line: 535, column: 3, scope: !815)
!942 = !DILocation(line: 535, column: 18, scope: !943)
!943 = !DILexicalBlockFile(scope: !815, file: !3, discriminator: 1)
!944 = !DILocation(line: 524, column: 7, scope: !815)
!945 = !DILocation(line: 535, column: 3, scope: !943)
!946 = !DILocation(line: 541, column: 11, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 538, column: 9)
!948 = distinct !DILexicalBlock(scope: !815, file: !3, line: 536, column: 5)
!949 = !DILocation(line: 545, column: 11, scope: !947)
!950 = !DILocation(line: 549, column: 11, scope: !947)
!951 = !DILocation(line: 553, column: 11, scope: !947)
!952 = !DILocation(line: 560, column: 11, scope: !947)
!953 = !DILocation(line: 568, column: 11, scope: !947)
!954 = !DILocation(line: 572, column: 11, scope: !947)
!955 = !DILocation(line: 576, column: 11, scope: !947)
!956 = !DILocation(line: 580, column: 11, scope: !947)
!957 = distinct !{!957, !941, !958}
!958 = !DILocation(line: 589, column: 5, scope: !815)
!959 = !DILocation(line: 582, column: 9, scope: !947)
!960 = !DILocation(line: 584, column: 9, scope: !947)
!961 = !DILocation(line: 584, column: 9, scope: !962)
!962 = !DILexicalBlockFile(scope: !947, file: !3, discriminator: 1)
!963 = !DILocation(line: 587, column: 11, scope: !947)
!964 = !DILocation(line: 591, column: 20, scope: !815)
!965 = !{!966, !966, i64 0}
!966 = !{!"int", !772, i64 0}
!967 = !DILocation(line: 591, column: 18, scope: !815)
!968 = !DILocation(line: 525, column: 7, scope: !815)
!969 = !DILocation(line: 593, column: 35, scope: !970)
!970 = !DILexicalBlockFile(scope: !971, file: !3, discriminator: 1)
!971 = distinct !DILexicalBlock(scope: !815, file: !3, line: 593, column: 7)
!972 = !DILocation(line: 593, column: 24, scope: !971)
!973 = !DILocation(line: 595, column: 20, scope: !974)
!974 = distinct !DILexicalBlock(scope: !971, file: !3, line: 594, column: 5)
!975 = !DILocation(line: 595, column: 7, scope: !976)
!976 = !DILexicalBlockFile(scope: !974, file: !3, discriminator: 1)
!977 = !DILocation(line: 597, column: 7, scope: !974)
!978 = !DILocation(line: 600, column: 7, scope: !815)
!979 = !DILocation(line: 466, column: 3, scope: !980, inlinedAt: !990)
!980 = distinct !DISubprogram(name: "short_pinky", scope: !3, file: !3, line: 463, type: !981, isLocal: true, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !50, !924, !925}
!983 = !{!984, !985, !986, !987, !988}
!984 = !DILocalVariable(name: "filename", arg: 1, scope: !980, file: !3, line: 463, type: !50)
!985 = !DILocalVariable(name: "argc_names", arg: 2, scope: !980, file: !3, line: 464, type: !924)
!986 = !DILocalVariable(name: "argv_names", arg: 3, scope: !980, file: !3, line: 464, type: !925)
!987 = !DILocalVariable(name: "n_users", scope: !980, file: !3, line: 466, type: !42)
!988 = !DILocalVariable(name: "utmp_buf", scope: !980, file: !3, line: 467, type: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!990 = distinct !DILocation(line: 601, column: 5, scope: !931)
!991 = !DILocation(line: 467, column: 3, scope: !980, inlinedAt: !990)
!992 = !DILocation(line: 467, column: 16, scope: !980, inlinedAt: !990)
!993 = !DIExpression(DW_OP_deref)
!994 = !DILocation(line: 466, column: 10, scope: !980, inlinedAt: !990)
!995 = !DILocation(line: 469, column: 7, scope: !996, inlinedAt: !990)
!996 = distinct !DILexicalBlock(scope: !980, file: !3, line: 469, column: 7)
!997 = !DILocation(line: 469, column: 52, scope: !996, inlinedAt: !990)
!998 = !DILocation(line: 469, column: 7, scope: !980, inlinedAt: !990)
!999 = !DILocation(line: 470, column: 5, scope: !996, inlinedAt: !990)
!1000 = !DILocation(line: 470, column: 5, scope: !1001, inlinedAt: !990)
!1001 = !DILexicalBlockFile(scope: !996, file: !3, discriminator: 1)
!1002 = !DILocation(line: 470, column: 5, scope: !1003, inlinedAt: !990)
!1003 = !DILexicalBlockFile(scope: !996, file: !3, discriminator: 2)
!1004 = !DILocation(line: 472, column: 17, scope: !980, inlinedAt: !990)
!1005 = !{!1006, !1006, i64 0}
!1006 = !{!"long", !772, i64 0}
!1007 = !DILocation(line: 472, column: 26, scope: !980, inlinedAt: !990)
!1008 = !DILocalVariable(name: "n", arg: 1, scope: !1009, file: !3, line: 421, type: !42)
!1009 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 421, type: !1010, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !42, !135, !924, !925}
!1012 = !{!1008, !1013, !1014, !1015, !1016}
!1013 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !1009, file: !3, line: 421, type: !135)
!1014 = !DILocalVariable(name: "argc_names", arg: 3, scope: !1009, file: !3, line: 422, type: !924)
!1015 = !DILocalVariable(name: "argv_names", arg: 4, scope: !1009, file: !3, line: 422, type: !925)
!1016 = !DILocalVariable(name: "i", scope: !1017, file: !3, line: 444, type: !52)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 443, column: 13)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 442, column: 15)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 441, column: 9)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 440, column: 11)
!1021 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 439, column: 5)
!1022 = !DILocation(line: 421, column: 22, scope: !1009, inlinedAt: !1023)
!1023 = distinct !DILocation(line: 472, column: 3, scope: !980, inlinedAt: !990)
!1024 = !DILocation(line: 421, column: 44, scope: !1009, inlinedAt: !1023)
!1025 = !DILocation(line: 422, column: 25, scope: !1009, inlinedAt: !1023)
!1026 = !DILocation(line: 422, column: 49, scope: !1009, inlinedAt: !1023)
!1027 = !DILocation(line: 424, column: 7, scope: !1028, inlinedAt: !1023)
!1028 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 424, column: 7)
!1029 = !DILocation(line: 424, column: 7, scope: !1009, inlinedAt: !1023)
!1030 = !DILocation(line: 435, column: 7, scope: !1009, inlinedAt: !1023)
!1031 = !DILocation(line: 404, column: 3, scope: !1032, inlinedAt: !1035)
!1032 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 402, type: !1033, isLocal: true, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !214)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null}
!1035 = distinct !DILocation(line: 436, column: 5, scope: !1036, inlinedAt: !1023)
!1036 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 435, column: 7)
!1037 = !DILocation(line: 404, column: 3, scope: !1038, inlinedAt: !1035)
!1038 = !DILexicalBlockFile(scope: !1032, file: !3, discriminator: 1)
!1039 = !DILocation(line: 405, column: 7, scope: !1032, inlinedAt: !1035)
!1040 = !DILocation(line: 406, column: 5, scope: !1041, inlinedAt: !1035)
!1041 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 405, column: 7)
!1042 = !DILocation(line: 406, column: 5, scope: !1043, inlinedAt: !1035)
!1043 = !DILexicalBlockFile(scope: !1041, file: !3, discriminator: 1)
!1044 = !DILocation(line: 407, column: 3, scope: !1032, inlinedAt: !1035)
!1045 = !DILocation(line: 407, column: 3, scope: !1038, inlinedAt: !1035)
!1046 = !DILocation(line: 408, column: 7, scope: !1032, inlinedAt: !1035)
!1047 = !DILocation(line: 409, column: 5, scope: !1048, inlinedAt: !1035)
!1048 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 408, column: 7)
!1049 = !DILocation(line: 409, column: 5, scope: !1050, inlinedAt: !1035)
!1050 = !DILexicalBlockFile(scope: !1048, file: !3, discriminator: 1)
!1051 = !DILocation(line: 410, column: 3, scope: !1032, inlinedAt: !1035)
!1052 = !DILocation(line: 410, column: 3, scope: !1038, inlinedAt: !1035)
!1053 = !DILocation(line: 412, column: 7, scope: !1032, inlinedAt: !1035)
!1054 = !DILocation(line: 413, column: 5, scope: !1055, inlinedAt: !1035)
!1055 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 412, column: 7)
!1056 = !DILocation(line: 413, column: 5, scope: !1057, inlinedAt: !1035)
!1057 = !DILexicalBlockFile(scope: !1055, file: !3, discriminator: 1)
!1058 = !DILocalVariable(name: "__c", arg: 1, scope: !1059, file: !1060, line: 105, type: !52)
!1059 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1060, file: !1060, line: 105, type: !1061, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1063)
!1060 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!52, !52}
!1063 = !{!1058}
!1064 = !DILocation(line: 105, column: 23, scope: !1059, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 415, column: 3, scope: !1032, inlinedAt: !1035)
!1066 = !DILocation(line: 107, column: 10, scope: !1059, inlinedAt: !1065)
!1067 = !{!1068, !771, i64 40}
!1068 = !{!"_IO_FILE", !966, i64 0, !771, i64 8, !771, i64 16, !771, i64 24, !771, i64 32, !771, i64 40, !771, i64 48, !771, i64 56, !771, i64 64, !771, i64 72, !771, i64 80, !771, i64 88, !771, i64 96, !771, i64 104, !966, i64 112, !966, i64 116, !1006, i64 120, !1069, i64 128, !772, i64 130, !772, i64 131, !771, i64 136, !1006, i64 144, !771, i64 152, !771, i64 160, !771, i64 168, !771, i64 176, !1006, i64 184, !966, i64 192, !772, i64 196}
!1069 = !{!"short", !772, i64 0}
!1070 = !{!1068, !771, i64 48}
!1071 = !{!"branch_weights", i32 2000, i32 1}
!1072 = !DILocation(line: 107, column: 10, scope: !1073, inlinedAt: !1065)
!1073 = !DILexicalBlockFile(scope: !1059, file: !1060, discriminator: 1)
!1074 = !DILocation(line: 107, column: 10, scope: !1075, inlinedAt: !1065)
!1075 = !DILexicalBlockFile(scope: !1059, file: !1060, discriminator: 2)
!1076 = !{!772, !772, i64 0}
!1077 = !DILocation(line: 438, column: 3, scope: !1078, inlinedAt: !1023)
!1078 = !DILexicalBlockFile(scope: !1009, file: !3, discriminator: 1)
!1079 = !DILocation(line: 438, column: 11, scope: !1078, inlinedAt: !1023)
!1080 = !DILocation(line: 440, column: 11, scope: !1020, inlinedAt: !1023)
!1081 = !DILocation(line: 440, column: 11, scope: !1082, inlinedAt: !1023)
!1082 = !DILexicalBlockFile(scope: !1020, file: !3, discriminator: 1)
!1083 = !{!1084, !1069, i64 0}
!1084 = !{!"utmpx", !1069, i64 0, !966, i64 4, !772, i64 8, !772, i64 40, !772, i64 44, !772, i64 76, !1085, i64 332, !966, i64 336, !1086, i64 340, !772, i64 348, !772, i64 364}
!1085 = !{!"__exit_status", !1069, i64 0, !1069, i64 2}
!1086 = !{!"", !966, i64 0, !966, i64 4}
!1087 = !DILocation(line: 440, column: 11, scope: !1088, inlinedAt: !1023)
!1088 = !DILexicalBlockFile(scope: !1021, file: !3, discriminator: 1)
!1089 = !DILocation(line: 442, column: 15, scope: !1019, inlinedAt: !1023)
!1090 = !DILocation(line: 444, column: 19, scope: !1017, inlinedAt: !1023)
!1091 = !DILocation(line: 446, column: 15, scope: !1092, inlinedAt: !1023)
!1092 = !DILexicalBlockFile(scope: !1093, file: !3, discriminator: 1)
!1093 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 446, column: 15)
!1094 = !DILocation(line: 447, column: 21, scope: !1095, inlinedAt: !1023)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 447, column: 21)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 446, column: 15)
!1097 = !DILocation(line: 446, column: 29, scope: !1098, inlinedAt: !1023)
!1098 = !DILexicalBlockFile(scope: !1096, file: !3, discriminator: 1)
!1099 = distinct !{!1099, !1100, !1101}
!1100 = !DILocation(line: 446, column: 15, scope: !1093)
!1101 = !DILocation(line: 451, column: 19, scope: !1093)
!1102 = !DILocation(line: 446, column: 44, scope: !1103, inlinedAt: !1023)
!1103 = !DILexicalBlockFile(scope: !1096, file: !3, discriminator: 2)
!1104 = !DILocation(line: 447, column: 21, scope: !1096, inlinedAt: !1023)
!1105 = !DILocation(line: 449, column: 21, scope: !1106, inlinedAt: !1023)
!1106 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 448, column: 19)
!1107 = !DILocation(line: 450, column: 21, scope: !1106, inlinedAt: !1023)
!1108 = !DILocation(line: 454, column: 13, scope: !1018, inlinedAt: !1023)
!1109 = !DILocation(line: 456, column: 15, scope: !1021, inlinedAt: !1023)
!1110 = distinct !{!1110, !1111, !1112}
!1111 = !DILocation(line: 438, column: 3, scope: !1009)
!1112 = !DILocation(line: 457, column: 5, scope: !1009)
!1113 = !DILocation(line: 475, column: 1, scope: !980, inlinedAt: !990)
!1114 = !DILocation(line: 601, column: 5, scope: !931)
!1115 = !DILocation(line: 478, column: 23, scope: !921, inlinedAt: !930)
!1116 = !DILocation(line: 478, column: 47, scope: !921, inlinedAt: !930)
!1117 = !DILocation(line: 480, column: 7, scope: !921, inlinedAt: !930)
!1118 = !DILocation(line: 482, column: 17, scope: !1119, inlinedAt: !930)
!1119 = !DILexicalBlockFile(scope: !919, file: !3, discriminator: 1)
!1120 = !DILocation(line: 482, column: 3, scope: !1121, inlinedAt: !930)
!1121 = !DILexicalBlockFile(scope: !920, file: !3, discriminator: 1)
!1122 = !DILocation(line: 483, column: 23, scope: !919, inlinedAt: !930)
!1123 = !DILocation(line: 307, column: 30, scope: !827, inlinedAt: !918)
!1124 = !DILocation(line: 311, column: 8, scope: !827, inlinedAt: !918)
!1125 = !DILocation(line: 309, column: 18, scope: !827, inlinedAt: !918)
!1126 = !DILocation(line: 313, column: 3, scope: !827, inlinedAt: !918)
!1127 = !DILocation(line: 313, column: 3, scope: !1128, inlinedAt: !918)
!1128 = !DILexicalBlockFile(scope: !827, file: !3, discriminator: 1)
!1129 = !DILocation(line: 314, column: 3, scope: !827, inlinedAt: !918)
!1130 = !DILocation(line: 316, column: 3, scope: !827, inlinedAt: !918)
!1131 = !DILocation(line: 316, column: 3, scope: !1128, inlinedAt: !918)
!1132 = !DILocation(line: 317, column: 10, scope: !846, inlinedAt: !918)
!1133 = !DILocation(line: 317, column: 7, scope: !827, inlinedAt: !918)
!1134 = !DILocation(line: 320, column: 7, scope: !1135, inlinedAt: !918)
!1135 = distinct !DILexicalBlock(scope: !846, file: !3, line: 318, column: 5)
!1136 = !DILocation(line: 320, column: 7, scope: !1137, inlinedAt: !918)
!1137 = !DILexicalBlockFile(scope: !1135, file: !3, discriminator: 1)
!1138 = !DILocation(line: 321, column: 7, scope: !1135, inlinedAt: !918)
!1139 = !DILocation(line: 325, column: 27, scope: !845, inlinedAt: !918)
!1140 = !{!1141, !771, i64 24}
!1141 = !{!"passwd", !771, i64 0, !771, i64 8, !966, i64 16, !966, i64 20, !771, i64 24, !771, i64 32, !771, i64 40}
!1142 = !DILocation(line: 325, column: 19, scope: !845, inlinedAt: !918)
!1143 = !DILocation(line: 328, column: 11, scope: !1144, inlinedAt: !918)
!1144 = distinct !DILexicalBlock(scope: !845, file: !3, line: 328, column: 11)
!1145 = !DILocation(line: 328, column: 11, scope: !845, inlinedAt: !918)
!1146 = !DILocation(line: 329, column: 16, scope: !1144, inlinedAt: !918)
!1147 = !DILocation(line: 329, column: 9, scope: !1144, inlinedAt: !918)
!1148 = !DILocation(line: 331, column: 37, scope: !845, inlinedAt: !918)
!1149 = !DILocation(line: 331, column: 51, scope: !845, inlinedAt: !918)
!1150 = !{!1141, !771, i64 0}
!1151 = !DILocation(line: 331, column: 16, scope: !845, inlinedAt: !918)
!1152 = !DILocation(line: 326, column: 13, scope: !845, inlinedAt: !918)
!1153 = !DILocation(line: 332, column: 7, scope: !845, inlinedAt: !918)
!1154 = !DILocation(line: 333, column: 7, scope: !845, inlinedAt: !918)
!1155 = !DILocation(line: 105, column: 23, scope: !1059, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 336, column: 3, scope: !827, inlinedAt: !918)
!1157 = !DILocation(line: 107, column: 10, scope: !1059, inlinedAt: !1156)
!1158 = !DILocation(line: 107, column: 10, scope: !1073, inlinedAt: !1156)
!1159 = !DILocation(line: 107, column: 10, scope: !1075, inlinedAt: !1156)
!1160 = !DILocation(line: 338, column: 7, scope: !827, inlinedAt: !918)
!1161 = !DILocation(line: 340, column: 7, scope: !1162, inlinedAt: !918)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 339, column: 5)
!1163 = distinct !DILexicalBlock(scope: !827, file: !3, line: 338, column: 7)
!1164 = !DILocation(line: 340, column: 7, scope: !1165, inlinedAt: !918)
!1165 = !DILexicalBlockFile(scope: !1162, file: !3, discriminator: 1)
!1166 = !DILocation(line: 341, column: 7, scope: !1162, inlinedAt: !918)
!1167 = !{!1141, !771, i64 32}
!1168 = !DILocation(line: 342, column: 7, scope: !1162, inlinedAt: !918)
!1169 = !DILocation(line: 342, column: 7, scope: !1165, inlinedAt: !918)
!1170 = !DILocation(line: 343, column: 7, scope: !1162, inlinedAt: !918)
!1171 = !{!1141, !771, i64 40}
!1172 = !DILocation(line: 105, column: 23, scope: !1059, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 344, column: 7, scope: !1162, inlinedAt: !918)
!1174 = !DILocation(line: 107, column: 10, scope: !1059, inlinedAt: !1173)
!1175 = !DILocation(line: 107, column: 10, scope: !1073, inlinedAt: !1173)
!1176 = !DILocation(line: 107, column: 10, scope: !1075, inlinedAt: !1173)
!1177 = !DILocation(line: 347, column: 7, scope: !827, inlinedAt: !918)
!1178 = !DILocation(line: 350, column: 7, scope: !825, inlinedAt: !918)
!1179 = !DILocation(line: 353, column: 30, scope: !825, inlinedAt: !918)
!1180 = !DILocation(line: 353, column: 18, scope: !825, inlinedAt: !918)
!1181 = !DILocation(line: 353, column: 61, scope: !825, inlinedAt: !918)
!1182 = !DILocation(line: 353, column: 9, scope: !1183, inlinedAt: !918)
!1183 = !DILexicalBlockFile(scope: !825, file: !3, discriminator: 1)
!1184 = !DILocation(line: 352, column: 19, scope: !825, inlinedAt: !918)
!1185 = !DILocation(line: 354, column: 36, scope: !825, inlinedAt: !918)
!1186 = !DILocalVariable(name: "__dest", arg: 1, scope: !1187, file: !1188, line: 114, type: !1191)
!1187 = distinct !DISubprogram(name: "stpcpy", scope: !1188, file: !1188, line: 114, type: !1189, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1193)
!1188 = !DIFile(filename: "/usr/include/bits/string3.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!39, !1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!1192 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!1193 = !{!1186, !1194}
!1194 = !DILocalVariable(name: "__src", arg: 2, scope: !1187, file: !1188, line: 114, type: !1192)
!1195 = !DILocation(line: 114, column: 1, scope: !1187, inlinedAt: !1196)
!1196 = distinct !DILocation(line: 354, column: 15, scope: !825, inlinedAt: !918)
!1197 = !DILocation(line: 116, column: 49, scope: !1187, inlinedAt: !1196)
!1198 = !DILocation(line: 116, column: 10, scope: !1187, inlinedAt: !1196)
!1199 = !DILocation(line: 354, column: 7, scope: !1183, inlinedAt: !918)
!1200 = !DILocation(line: 356, column: 16, scope: !825, inlinedAt: !918)
!1201 = !DILocation(line: 349, column: 13, scope: !825, inlinedAt: !918)
!1202 = !DILocation(line: 357, column: 11, scope: !904, inlinedAt: !918)
!1203 = !DILocation(line: 357, column: 11, scope: !825, inlinedAt: !918)
!1204 = !DILocation(line: 361, column: 11, scope: !903, inlinedAt: !918)
!1205 = !DILocation(line: 361, column: 11, scope: !1206, inlinedAt: !918)
!1206 = !DILexicalBlockFile(scope: !903, file: !3, discriminator: 1)
!1207 = !DILocation(line: 363, column: 27, scope: !1206, inlinedAt: !918)
!1208 = !DILocation(line: 359, column: 18, scope: !903, inlinedAt: !918)
!1209 = !DILocation(line: 363, column: 65, scope: !1206, inlinedAt: !918)
!1210 = !DILocation(line: 363, column: 11, scope: !1206, inlinedAt: !918)
!1211 = !DILocation(line: 364, column: 13, scope: !903, inlinedAt: !918)
!1212 = distinct !{!1212, !1213, !1214}
!1213 = !DILocation(line: 363, column: 11, scope: !903)
!1214 = !DILocation(line: 364, column: 13, scope: !903)
!1215 = !DILocation(line: 365, column: 11, scope: !903, inlinedAt: !918)
!1216 = !DILocation(line: 366, column: 9, scope: !903, inlinedAt: !918)
!1217 = !DILocation(line: 368, column: 7, scope: !825, inlinedAt: !918)
!1218 = !DILocation(line: 369, column: 5, scope: !826, inlinedAt: !918)
!1219 = !DILocation(line: 369, column: 5, scope: !825, inlinedAt: !918)
!1220 = !DILocation(line: 371, column: 7, scope: !827, inlinedAt: !918)
!1221 = !DILocation(line: 374, column: 7, scope: !906, inlinedAt: !918)
!1222 = !DILocation(line: 377, column: 30, scope: !906, inlinedAt: !918)
!1223 = !DILocation(line: 377, column: 18, scope: !906, inlinedAt: !918)
!1224 = !DILocation(line: 377, column: 58, scope: !906, inlinedAt: !918)
!1225 = !DILocation(line: 377, column: 9, scope: !1226, inlinedAt: !918)
!1226 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 1)
!1227 = !DILocation(line: 376, column: 19, scope: !906, inlinedAt: !918)
!1228 = !DILocation(line: 378, column: 33, scope: !906, inlinedAt: !918)
!1229 = !DILocation(line: 114, column: 1, scope: !1187, inlinedAt: !1230)
!1230 = distinct !DILocation(line: 378, column: 15, scope: !906, inlinedAt: !918)
!1231 = !DILocation(line: 116, column: 49, scope: !1187, inlinedAt: !1230)
!1232 = !DILocation(line: 116, column: 10, scope: !1187, inlinedAt: !1230)
!1233 = !DILocation(line: 378, column: 7, scope: !1226, inlinedAt: !918)
!1234 = !DILocation(line: 380, column: 16, scope: !906, inlinedAt: !918)
!1235 = !DILocation(line: 373, column: 13, scope: !906, inlinedAt: !918)
!1236 = !DILocation(line: 381, column: 11, scope: !916, inlinedAt: !918)
!1237 = !DILocation(line: 381, column: 11, scope: !906, inlinedAt: !918)
!1238 = !DILocation(line: 385, column: 11, scope: !915, inlinedAt: !918)
!1239 = !DILocation(line: 385, column: 11, scope: !1240, inlinedAt: !918)
!1240 = !DILexicalBlockFile(scope: !915, file: !3, discriminator: 1)
!1241 = !DILocation(line: 387, column: 27, scope: !1240, inlinedAt: !918)
!1242 = !DILocation(line: 383, column: 18, scope: !915, inlinedAt: !918)
!1243 = !DILocation(line: 387, column: 65, scope: !1240, inlinedAt: !918)
!1244 = !DILocation(line: 387, column: 11, scope: !1240, inlinedAt: !918)
!1245 = !DILocation(line: 388, column: 13, scope: !915, inlinedAt: !918)
!1246 = distinct !{!1246, !1247, !1248}
!1247 = !DILocation(line: 387, column: 11, scope: !915)
!1248 = !DILocation(line: 388, column: 13, scope: !915)
!1249 = !DILocation(line: 389, column: 11, scope: !915, inlinedAt: !918)
!1250 = !DILocation(line: 390, column: 9, scope: !915, inlinedAt: !918)
!1251 = !DILocation(line: 392, column: 7, scope: !906, inlinedAt: !918)
!1252 = !DILocation(line: 393, column: 5, scope: !907, inlinedAt: !918)
