!llvm.dbg.cu = !{!2, !244, !250, !258, !725, !265, !272, !728, !749, !751, !753, !336, !760, !777, !779, !781, !783, !786, !788, !791, !345, !794, !796, !696, !798}
!llvm.ident = !{!800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800, !800}
!llvm.module.flags = !{!801, !802, !803, !804}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "separator", scope: !2, file: !3, line: 80, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !35)
!3 = !DIFile(filename: "src/tac.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !{!20, !22, !23, !27, !30, !32, !25}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 62, baseType: !29)
!28 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36, !0, !57, !59, !61, !63, !65, !67, !69, !94, !99, !129, !143, !213, !215, !225, !238, !240}
!36 = !DIGlobalVariableExpression(var: !37)
!37 = distinct !DIGlobalVariable(name: "default_file_list", scope: !38, file: !3, line: 612, type: !54, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 603, type: !39, isDefinition: true, scopeLine: 604, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !43)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !41, !42}
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!43 = !{!44, !45, !46, !47, !48, !50, !51, !52}
!44 = !DILocalVariable(name: "argc", arg: 1, scope: !38, file: !3, line: 603, type: !41)
!45 = !DILocalVariable(name: "argv", arg: 2, scope: !38, file: !3, line: 603, type: !42)
!46 = !DILocalVariable(name: "error_message", scope: !38, file: !3, line: 605, type: !25)
!47 = !DILocalVariable(name: "optc", scope: !38, file: !3, line: 606, type: !41)
!48 = !DILocalVariable(name: "ok", scope: !38, file: !3, line: 607, type: !49)
!49 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!50 = !DILocalVariable(name: "half_buffer_size", scope: !38, file: !3, line: 608, type: !27)
!51 = !DILocalVariable(name: "file", scope: !38, file: !3, line: 613, type: !23)
!52 = !DILocalVariable(name: "i", scope: !53, file: !3, line: 693, type: !27)
!53 = distinct !DILexicalBlock(scope: !38, file: !3, line: 692, column: 3)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 2)
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "separator_ends_record", scope: !2, file: !3, line: 87, type: !49, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60)
!60 = distinct !DIGlobalVariable(name: "sentinel_length", scope: !2, file: !3, line: 92, type: !27, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "match_length", scope: !2, file: !3, line: 97, type: !27, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64)
!64 = distinct !DIGlobalVariable(name: "G_buffer", scope: !2, file: !3, line: 100, type: !20, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66)
!66 = distinct !DIGlobalVariable(name: "read_size", scope: !2, file: !3, line: 103, type: !27, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68)
!68 = distinct !DIGlobalVariable(name: "G_buffer_size", scope: !2, file: !3, line: 108, type: !27, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "compiled_separator", scope: !2, file: !3, line: 111, type: !71, isLocal: true, isDefinition: true)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !72, line: 414, size: 512, elements: !73)
!72 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!73 = !{!74, !77, !79, !80, !82, !83, !85, !86, !88, !89, !90, !91, !92, !93}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !71, file: !72, line: 418, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !72, line: 418, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !71, file: !72, line: 421, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !72, line: 57, baseType: !29)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !71, file: !72, line: 424, baseType: !78, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !71, file: !72, line: 427, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !72, line: 73, baseType: !29)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !71, file: !72, line: 432, baseType: !20, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !71, file: !72, line: 438, baseType: !84, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !71, file: !72, line: 441, baseType: !27, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !71, file: !72, line: 447, baseType: !87, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!87 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !71, file: !72, line: 458, baseType: !87, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !71, file: !72, line: 462, baseType: !87, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !71, file: !72, line: 466, baseType: !87, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !71, file: !72, line: 470, baseType: !87, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !71, file: !72, line: 473, baseType: !87, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !71, file: !72, line: 476, baseType: !87, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!94 = !DIGlobalVariableExpression(var: !95)
!95 = distinct !DIGlobalVariable(name: "compiled_separator_fastmap", scope: !2, file: !3, line: 112, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 256)
!99 = !DIGlobalVariableExpression(var: !100)
!100 = distinct !DIGlobalVariable(name: "infomap", scope: !101, file: !102, line: 632, type: !126, isLocal: true, isDefinition: true)
!101 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !102, file: !102, line: 630, type: !103, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !105)
!102 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !25}
!105 = !{!106, !107, !108, !115, !117, !118, !119, !122, !123, !125}
!106 = !DILocalVariable(name: "program", arg: 1, scope: !101, file: !102, line: 630, type: !25)
!107 = !DILocalVariable(name: "node", scope: !101, file: !102, line: 642, type: !25)
!108 = !DILocalVariable(name: "map_prog", scope: !101, file: !102, line: 643, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !101, file: !102, line: 632, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !111, file: !102, line: 632, baseType: !25, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !111, file: !102, line: 632, baseType: !25, size: 64, offset: 64)
!115 = !DILocalVariable(name: "__s1_len", scope: !116, file: !102, line: 645, type: !27)
!116 = distinct !DILexicalBlock(scope: !101, file: !102, line: 645, column: 33)
!117 = !DILocalVariable(name: "__s2_len", scope: !116, file: !102, line: 645, type: !27)
!118 = !DILocalVariable(name: "lc_messages", scope: !101, file: !102, line: 655, type: !25)
!119 = !DILocalVariable(name: "__s1_len", scope: !120, file: !102, line: 656, type: !27)
!120 = distinct !DILexicalBlock(scope: !121, file: !102, line: 656, column: 22)
!121 = distinct !DILexicalBlock(scope: !101, file: !102, line: 656, column: 7)
!122 = !DILocalVariable(name: "__s2_len", scope: !120, file: !102, line: 656, type: !27)
!123 = !DILocalVariable(name: "__s2", scope: !124, file: !102, line: 656, type: !32)
!124 = distinct !DILexicalBlock(scope: !120, file: !102, line: 656, column: 22)
!125 = !DILocalVariable(name: "__result", scope: !124, file: !102, line: 656, type: !41)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 896, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 7)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 115, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 1536, elements: !141)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !134, line: 104, size: 256, elements: !135)
!134 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!136, !137, !138, !140}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !134, line: 106, baseType: !25, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !133, file: !134, line: 109, baseType: !41, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !133, file: !134, line: 110, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !133, file: !134, line: 111, baseType: !41, size: 32, offset: 192)
!141 = !{!142}
!142 = !DISubrange(count: 6)
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "tempfile", scope: !145, file: !3, line: 433, type: !20, isLocal: true, isDefinition: true)
!145 = distinct !DISubprogram(name: "temp_stream", scope: !3, file: !3, line: 431, type: !146, isLocal: true, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !205)
!146 = !DISubroutineType(types: !147)
!147 = !{!49, !148, !42}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 49, baseType: !152)
!151 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 241, size: 1728, elements: !154)
!153 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !175, !176, !177, !178, !182, !184, !186, !190, !193, !195, !196, !197, !198, !199, !200, !201}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !152, file: !153, line: 242, baseType: !41, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !152, file: !153, line: 247, baseType: !20, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !152, file: !153, line: 248, baseType: !20, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !152, file: !153, line: 249, baseType: !20, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !152, file: !153, line: 250, baseType: !20, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !152, file: !153, line: 251, baseType: !20, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !152, file: !153, line: 252, baseType: !20, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !152, file: !153, line: 253, baseType: !20, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !152, file: !153, line: 254, baseType: !20, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !152, file: !153, line: 256, baseType: !20, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !152, file: !153, line: 257, baseType: !20, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !152, file: !153, line: 258, baseType: !20, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !152, file: !153, line: 260, baseType: !168, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !153, line: 156, size: 192, elements: !170)
!170 = !{!171, !172, !174}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !169, file: !153, line: 157, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !169, file: !153, line: 158, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !169, file: !153, line: 162, baseType: !41, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !152, file: !153, line: 262, baseType: !173, size: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !152, file: !153, line: 264, baseType: !41, size: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !152, file: !153, line: 268, baseType: !41, size: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !152, file: !153, line: 270, baseType: !179, size: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !180, line: 140, baseType: !181)
!180 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!181 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !152, file: !153, line: 274, baseType: !183, size: 16, offset: 1024)
!183 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !152, file: !153, line: 275, baseType: !185, size: 8, offset: 1040)
!185 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !152, file: !153, line: 276, baseType: !187, size: 8, offset: 1048)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 1)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !152, file: !153, line: 280, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !153, line: 150, baseType: null)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !152, file: !153, line: 289, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !180, line: 141, baseType: !181)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !152, file: !153, line: 297, baseType: !22, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !152, file: !153, line: 298, baseType: !22, size: 64, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !152, file: !153, line: 299, baseType: !22, size: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !152, file: !153, line: 300, baseType: !22, size: 64, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !152, file: !153, line: 302, baseType: !27, size: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !152, file: !153, line: 303, baseType: !41, size: 32, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !152, file: !153, line: 305, baseType: !202, size: 160, offset: 1568)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 20)
!205 = !{!206, !207, !208, !211, !212}
!206 = !DILocalVariable(name: "fp", arg: 1, scope: !145, file: !3, line: 431, type: !148)
!207 = !DILocalVariable(name: "file_name", arg: 2, scope: !145, file: !3, line: 431, type: !42)
!208 = !DILocalVariable(name: "t", scope: !209, file: !3, line: 437, type: !25)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 436, column: 5)
!210 = distinct !DILexicalBlock(scope: !145, file: !3, line: 435, column: 7)
!211 = !DILocalVariable(name: "tempdir", scope: !209, file: !3, line: 438, type: !25)
!212 = !DILocalVariable(name: "fd", scope: !209, file: !3, line: 455, type: !41)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !145, file: !3, line: 434, type: !149, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "regs", scope: !2, file: !3, line: 113, type: !217, isLocal: true, isDefinition: true)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !72, line: 498, size: 192, elements: !218)
!218 = !{!219, !221, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !217, file: !72, line: 500, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !72, line: 56, baseType: !87)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !217, file: !72, line: 501, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !72, line: 491, baseType: !41)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !217, file: !72, line: 502, baseType: !222, size: 64, offset: 128)
!225 = !DIGlobalVariableExpression(var: !226)
!226 = distinct !DIGlobalVariable(name: "buffer", scope: !227, file: !3, line: 161, type: !235, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "output", scope: !3, file: !3, line: 159, type: !228, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !25, !25}
!230 = !{!231, !232, !233, !234}
!231 = !DILocalVariable(name: "start", arg: 1, scope: !227, file: !3, line: 159, type: !25)
!232 = !DILocalVariable(name: "past_end", arg: 2, scope: !227, file: !3, line: 159, type: !25)
!233 = !DILocalVariable(name: "bytes_to_add", scope: !227, file: !3, line: 163, type: !27)
!234 = !DILocalVariable(name: "bytes_available", scope: !227, file: !3, line: 164, type: !27)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 65536, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 8192)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "bytes_in_buffer", scope: !227, file: !3, line: 162, type: !27, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241)
!241 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 83, type: !49, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "Version", scope: !244, file: !245, line: 2, type: !25, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !247)
!245 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!246 = !{}
!247 = !{!242}
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "file_name", scope: !250, file: !255, line: 36, type: !25, isLocal: true, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !252)
!251 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!252 = !{!248, !253}
!253 = !DIGlobalVariableExpression(var: !254)
!254 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !250, file: !255, line: 46, type: !49, isLocal: true, isDefinition: true)
!255 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "exit_failure", scope: !258, file: !261, line: 24, type: !262, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !260)
!259 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!260 = !{!256}
!261 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!262 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "program_name", scope: !265, file: !269, line: 33, type: !25, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !267, globals: !268)
!266 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !{!22, !20}
!268 = !{!263}
!269 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !272, file: !299, line: 77, type: !331, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !274, retainedTypes: !295, globals: !296)
!273 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!274 = !{!5, !275, !280}
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!278 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!279 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 46, size: 32, elements: !282)
!281 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!283 = !DIEnumerator(name: "_ISupper", value: 256)
!284 = !DIEnumerator(name: "_ISlower", value: 512)
!285 = !DIEnumerator(name: "_ISalpha", value: 1024)
!286 = !DIEnumerator(name: "_ISdigit", value: 2048)
!287 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!288 = !DIEnumerator(name: "_ISspace", value: 8192)
!289 = !DIEnumerator(name: "_ISprint", value: 16384)
!290 = !DIEnumerator(name: "_ISgraph", value: 32768)
!291 = !DIEnumerator(name: "_ISblank", value: 1)
!292 = !DIEnumerator(name: "_IScntrl", value: 2)
!293 = !DIEnumerator(name: "_ISpunct", value: 4)
!294 = !DIEnumerator(name: "_ISalnum", value: 8)
!295 = !{!41, !183, !27, !20}
!296 = !{!270, !297, !304, !316, !318, !320, !327, !329}
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !272, file: !299, line: 93, type: !300, isDefinition: true)
!299 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 320, elements: !302)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!302 = !{!303}
!303 = !DISubrange(count: 10)
!304 = !DIGlobalVariableExpression(var: !305)
!305 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !272, file: !299, line: 1043, type: !306, isDefinition: true)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !299, line: 57, size: 448, elements: !307)
!307 = !{!308, !309, !310, !314, !315}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !306, file: !299, line: 60, baseType: !5, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !299, line: 63, baseType: !41, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !306, file: !299, line: 67, baseType: !311, size: 256, offset: 64)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !306, file: !299, line: 70, baseType: !25, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !306, file: !299, line: 73, baseType: !25, size: 64, offset: 384)
!316 = !DIGlobalVariableExpression(var: !317)
!317 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !272, file: !299, line: 108, type: !306, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319)
!319 = distinct !DIGlobalVariable(name: "slot0", scope: !272, file: !299, line: 834, type: !96, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321)
!321 = distinct !DIGlobalVariable(name: "slotvec", scope: !272, file: !299, line: 837, type: !322, isLocal: true, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !299, line: 826, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !323, file: !299, line: 828, baseType: !27, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !323, file: !299, line: 829, baseType: !20, size: 64, offset: 64)
!327 = !DIGlobalVariableExpression(var: !328)
!328 = distinct !DIGlobalVariable(name: "nslots", scope: !272, file: !299, line: 835, type: !41, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "slotvec0", scope: !272, file: !299, line: 836, type: !323, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 704, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 11)
!334 = !DIGlobalVariableExpression(var: !335)
!335 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !336, file: !339, line: 26, type: !340, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !338)
!337 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!338 = !{!334}
!339 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 376, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 47)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !345, file: !688, line: 120, type: !689, isLocal: true, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !347, retainedTypes: !686, globals: !687)
!346 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!347 = !{!348}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 41, size: 32, elements: !350)
!349 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!351 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!352 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!353 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!354 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!355 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!356 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!357 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!358 = !DIEnumerator(name: "DAY_1", value: 131079)
!359 = !DIEnumerator(name: "DAY_2", value: 131080)
!360 = !DIEnumerator(name: "DAY_3", value: 131081)
!361 = !DIEnumerator(name: "DAY_4", value: 131082)
!362 = !DIEnumerator(name: "DAY_5", value: 131083)
!363 = !DIEnumerator(name: "DAY_6", value: 131084)
!364 = !DIEnumerator(name: "DAY_7", value: 131085)
!365 = !DIEnumerator(name: "ABMON_1", value: 131086)
!366 = !DIEnumerator(name: "ABMON_2", value: 131087)
!367 = !DIEnumerator(name: "ABMON_3", value: 131088)
!368 = !DIEnumerator(name: "ABMON_4", value: 131089)
!369 = !DIEnumerator(name: "ABMON_5", value: 131090)
!370 = !DIEnumerator(name: "ABMON_6", value: 131091)
!371 = !DIEnumerator(name: "ABMON_7", value: 131092)
!372 = !DIEnumerator(name: "ABMON_8", value: 131093)
!373 = !DIEnumerator(name: "ABMON_9", value: 131094)
!374 = !DIEnumerator(name: "ABMON_10", value: 131095)
!375 = !DIEnumerator(name: "ABMON_11", value: 131096)
!376 = !DIEnumerator(name: "ABMON_12", value: 131097)
!377 = !DIEnumerator(name: "MON_1", value: 131098)
!378 = !DIEnumerator(name: "MON_2", value: 131099)
!379 = !DIEnumerator(name: "MON_3", value: 131100)
!380 = !DIEnumerator(name: "MON_4", value: 131101)
!381 = !DIEnumerator(name: "MON_5", value: 131102)
!382 = !DIEnumerator(name: "MON_6", value: 131103)
!383 = !DIEnumerator(name: "MON_7", value: 131104)
!384 = !DIEnumerator(name: "MON_8", value: 131105)
!385 = !DIEnumerator(name: "MON_9", value: 131106)
!386 = !DIEnumerator(name: "MON_10", value: 131107)
!387 = !DIEnumerator(name: "MON_11", value: 131108)
!388 = !DIEnumerator(name: "MON_12", value: 131109)
!389 = !DIEnumerator(name: "AM_STR", value: 131110)
!390 = !DIEnumerator(name: "PM_STR", value: 131111)
!391 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!392 = !DIEnumerator(name: "D_FMT", value: 131113)
!393 = !DIEnumerator(name: "T_FMT", value: 131114)
!394 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!395 = !DIEnumerator(name: "ERA", value: 131116)
!396 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!397 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!398 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!399 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!400 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!401 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!402 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!403 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!404 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!405 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!406 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!407 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!408 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!409 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!410 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!411 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!412 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!413 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!414 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!415 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!416 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!417 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!418 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!419 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!420 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!421 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!422 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!423 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!424 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!425 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!426 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!427 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!428 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!429 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!430 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!431 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!432 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!433 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!434 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!435 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!436 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!437 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!438 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!439 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!440 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!441 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!442 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!443 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!444 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!445 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!446 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!447 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!448 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!449 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!450 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!451 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!452 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!453 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!454 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!455 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!456 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!457 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!458 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!459 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!460 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!461 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!462 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!463 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!464 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!465 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!466 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!467 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!468 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!469 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!470 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!471 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!472 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!473 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!474 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!475 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!476 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!477 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!478 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!479 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!480 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!481 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!482 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!483 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!484 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!485 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!488 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!489 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!490 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!491 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!492 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!493 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!494 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!495 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!496 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!497 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!498 = !DIEnumerator(name: "CODESET", value: 14)
!499 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!500 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!501 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!502 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!545 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!551 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!552 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!553 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!554 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!555 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!556 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!567 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!568 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!570 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!571 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!572 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!573 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!574 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!575 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!576 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!577 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!578 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!579 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!580 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!581 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!582 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!583 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!584 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!585 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!586 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!587 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!588 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!589 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!590 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!591 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!592 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!609 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!610 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!611 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!613 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!614 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!615 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!616 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!617 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!618 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!619 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!620 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!621 = !DIEnumerator(name: "THOUSEP", value: 65537)
!622 = !DIEnumerator(name: "__GROUPING", value: 65538)
!623 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!624 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!625 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!626 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!627 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!628 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!629 = !DIEnumerator(name: "__YESSTR", value: 327682)
!630 = !DIEnumerator(name: "__NOSTR", value: 327683)
!631 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!632 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!633 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!634 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!635 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!636 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!637 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!638 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!640 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!641 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!642 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!643 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!644 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!645 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!646 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!650 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!651 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!652 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!653 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!654 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!655 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!656 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!657 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!658 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!659 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!660 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!661 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!662 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!663 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!664 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!665 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!666 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!667 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!684 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!685 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!686 = !{!22, !20, !84}
!687 = !{!343}
!688 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!689 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!690 = !DIGlobalVariableExpression(var: !691)
!691 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !692, file: !693, line: 335, type: !41, isLocal: true, isDefinition: true)
!692 = distinct !DISubprogram(name: "rpl_fcntl", scope: !693, file: !693, line: 272, type: !694, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !696, variables: !699)
!693 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!694 = !DISubroutineType(types: !695)
!695 = !{!41, !41, !41, null}
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !698)
!697 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!698 = !{!690}
!699 = !{!700, !701, !702, !713, !714, !717, !720, !723}
!700 = !DILocalVariable(name: "fd", arg: 1, scope: !692, file: !693, line: 272, type: !41)
!701 = !DILocalVariable(name: "action", arg: 2, scope: !692, file: !693, line: 272, type: !41)
!702 = !DILocalVariable(name: "arg", scope: !692, file: !693, line: 274, type: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !704, line: 30, baseType: !705)
!704 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !697, line: 274, baseType: !706)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 192, elements: !188)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !697, line: 274, size: 192, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !707, file: !697, line: 274, baseType: !87, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !707, file: !697, line: 274, baseType: !87, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !707, file: !697, line: 274, baseType: !22, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !707, file: !697, line: 274, baseType: !22, size: 64, offset: 128)
!713 = !DILocalVariable(name: "result", scope: !692, file: !693, line: 275, type: !41)
!714 = !DILocalVariable(name: "target", scope: !715, file: !693, line: 322, type: !41)
!715 = distinct !DILexicalBlock(scope: !716, file: !693, line: 321, column: 7)
!716 = distinct !DILexicalBlock(scope: !692, file: !693, line: 278, column: 5)
!717 = !DILocalVariable(name: "flags", scope: !718, file: !693, line: 359, type: !41)
!718 = distinct !DILexicalBlock(scope: !719, file: !693, line: 358, column: 11)
!719 = distinct !DILexicalBlock(scope: !715, file: !693, line: 357, column: 13)
!720 = !DILocalVariable(name: "saved_errno", scope: !721, file: !693, line: 362, type: !41)
!721 = distinct !DILexicalBlock(scope: !722, file: !693, line: 361, column: 15)
!722 = distinct !DILexicalBlock(scope: !718, file: !693, line: 360, column: 17)
!723 = !DILocalVariable(name: "p", scope: !724, file: !693, line: 404, type: !22)
!724 = distinct !DILexicalBlock(scope: !716, file: !693, line: 402, column: 7)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !727)
!726 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!727 = !{!22}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !730)
!729 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !733, file: !732, line: 62, size: 32, elements: !747)
!732 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!733 = distinct !DISubprogram(name: "safe_read", scope: !732, file: !732, line: 56, type: !734, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !728, variables: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!27, !41, !22, !27}
!736 = !{!737, !738, !739, !740}
!737 = !DILocalVariable(name: "fd", arg: 1, scope: !733, file: !732, line: 56, type: !41)
!738 = !DILocalVariable(name: "buf", arg: 2, scope: !733, file: !732, line: 56, type: !22)
!739 = !DILocalVariable(name: "count", arg: 3, scope: !733, file: !732, line: 56, type: !27)
!740 = !DILocalVariable(name: "result", scope: !741, file: !732, line: 66, type: !744)
!741 = distinct !DILexicalBlock(scope: !742, file: !732, line: 65, column: 5)
!742 = distinct !DILexicalBlock(scope: !743, file: !732, line: 64, column: 3)
!743 = distinct !DILexicalBlock(scope: !733, file: !732, line: 64, column: 3)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !745, line: 109, baseType: !746)
!745 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !180, line: 181, baseType: !181)
!747 = !{!748}
!748 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246)
!750 = !DIFile(filename: "./lib/mkstemp-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246)
!752 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !755, retainedTypes: !727)
!754 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!755 = !{!756}
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !757, line: 41, size: 32, elements: !758)
!757 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!758 = !{!759}
!759 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!760 = distinct !DICompileUnit(language: DW_LANG_C99, file: !761, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !762, retainedTypes: !776)
!761 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!762 = !{!763}
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !765, file: !764, line: 192, size: 32, elements: !774)
!764 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!765 = distinct !DISubprogram(name: "x2nrealloc", scope: !764, file: !764, line: 180, type: !766, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !760, variables: !769)
!766 = !DISubroutineType(types: !767)
!767 = !{!22, !22, !768, !27}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!769 = !{!770, !771, !772, !773}
!770 = !DILocalVariable(name: "p", arg: 1, scope: !765, file: !764, line: 180, type: !22)
!771 = !DILocalVariable(name: "pn", arg: 2, scope: !765, file: !764, line: 180, type: !768)
!772 = !DILocalVariable(name: "s", arg: 3, scope: !765, file: !764, line: 180, type: !27)
!773 = !DILocalVariable(name: "n", scope: !765, file: !764, line: 182, type: !27)
!774 = !{!775}
!775 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!776 = !{!27, !20, !22}
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246)
!778 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!779 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !727)
!780 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!781 = distinct !DICompileUnit(language: DW_LANG_C99, file: !782, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !727)
!782 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !785)
!784 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!785 = !{!27}
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246)
!787 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !790)
!789 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!790 = !{!20}
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !793)
!792 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!793 = !{!27, !30, !32, !25}
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246)
!795 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246)
!797 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !727)
!799 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!800 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!801 = !{i32 2, !"Dwarf Version", i32 4}
!802 = !{i32 2, !"Debug Info Version", i32 3}
!803 = !{i32 1, !"PIC Level", i32 2}
!804 = !{i32 1, !"PIE Level", i32 2}
!805 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 126, type: !806, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !41}
!808 = !{!809}
!809 = !DILocalVariable(name: "status", arg: 1, scope: !805, file: !3, line: 126, type: !41)
!810 = !DIExpression()
!811 = !DILocation(line: 126, column: 12, scope: !805)
!812 = !DILocation(line: 128, column: 14, scope: !813)
!813 = distinct !DILexicalBlock(scope: !805, file: !3, line: 128, column: 7)
!814 = !DILocation(line: 128, column: 7, scope: !805)
!815 = !DILocation(line: 129, column: 5, scope: !816)
!816 = !DILexicalBlockFile(scope: !817, file: !3, discriminator: 1)
!817 = distinct !DILexicalBlock(scope: !813, file: !3, line: 129, column: 5)
!818 = !{!819, !819, i64 0}
!819 = !{!"any pointer", !820, i64 0}
!820 = !{!"omnipotent char", !821, i64 0}
!821 = !{!"Simple C/C++ TBAA"}
!822 = !DILocation(line: 129, column: 5, scope: !823)
!823 = !DILexicalBlockFile(scope: !817, file: !3, discriminator: 3)
!824 = !DILocation(line: 129, column: 5, scope: !825)
!825 = !DILexicalBlockFile(scope: !817, file: !3, discriminator: 2)
!826 = !DILocation(line: 132, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !813, file: !3, line: 131, column: 5)
!828 = !DILocation(line: 132, column: 7, scope: !829)
!829 = !DILexicalBlockFile(scope: !827, file: !3, discriminator: 1)
!830 = !DILocation(line: 136, column: 7, scope: !827)
!831 = !DILocation(line: 136, column: 7, scope: !829)
!832 = !DILocation(line: 580, column: 3, scope: !833, inlinedAt: !836)
!833 = distinct !DISubprogram(name: "emit_stdin_note", scope: !102, file: !102, line: 578, type: !834, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !246)
!834 = !DISubroutineType(types: !835)
!835 = !{null}
!836 = distinct !DILocation(line: 140, column: 7, scope: !827)
!837 = !DILocation(line: 580, column: 3, scope: !838, inlinedAt: !836)
!838 = !DILexicalBlockFile(scope: !833, file: !102, discriminator: 1)
!839 = !DILocation(line: 587, column: 3, scope: !840, inlinedAt: !841)
!840 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !102, file: !102, line: 585, type: !834, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !246)
!841 = distinct !DILocation(line: 141, column: 7, scope: !827)
!842 = !DILocation(line: 587, column: 3, scope: !843, inlinedAt: !841)
!843 = !DILexicalBlockFile(scope: !840, file: !102, discriminator: 1)
!844 = !DILocation(line: 143, column: 7, scope: !827)
!845 = !DILocation(line: 143, column: 7, scope: !829)
!846 = !DILocation(line: 148, column: 7, scope: !827)
!847 = !DILocation(line: 148, column: 7, scope: !829)
!848 = !DILocation(line: 149, column: 7, scope: !827)
!849 = !DILocation(line: 149, column: 7, scope: !829)
!850 = !DILocation(line: 642, column: 15, scope: !101, inlinedAt: !851)
!851 = distinct !DILocation(line: 150, column: 7, scope: !827)
!852 = !DILocation(line: 651, column: 3, scope: !101, inlinedAt: !851)
!853 = !DILocation(line: 651, column: 3, scope: !854, inlinedAt: !851)
!854 = !DILexicalBlockFile(scope: !101, file: !102, discriminator: 1)
!855 = !DILocation(line: 655, column: 29, scope: !101, inlinedAt: !851)
!856 = !DILocation(line: 655, column: 15, scope: !101, inlinedAt: !851)
!857 = !DILocation(line: 656, column: 7, scope: !121, inlinedAt: !851)
!858 = !DILocation(line: 656, column: 19, scope: !121, inlinedAt: !851)
!859 = !DILocation(line: 656, column: 22, scope: !860, inlinedAt: !851)
!860 = !DILexicalBlockFile(scope: !121, file: !102, discriminator: 16)
!861 = !DILocation(line: 656, column: 7, scope: !862, inlinedAt: !851)
!862 = !DILexicalBlockFile(scope: !101, file: !102, discriminator: 16)
!863 = !DILocation(line: 662, column: 7, scope: !864, inlinedAt: !851)
!864 = distinct !DILexicalBlock(scope: !121, file: !102, line: 657, column: 5)
!865 = !DILocation(line: 662, column: 7, scope: !866, inlinedAt: !851)
!866 = !DILexicalBlockFile(scope: !864, file: !102, discriminator: 1)
!867 = !DILocation(line: 664, column: 5, scope: !864, inlinedAt: !851)
!868 = !DILocation(line: 665, column: 3, scope: !101, inlinedAt: !851)
!869 = !DILocation(line: 665, column: 3, scope: !854, inlinedAt: !851)
!870 = !DILocation(line: 667, column: 3, scope: !101, inlinedAt: !851)
!871 = !DILocation(line: 667, column: 3, scope: !854, inlinedAt: !851)
!872 = !DILocation(line: 152, column: 3, scope: !805)
!873 = !DILocation(line: 603, column: 11, scope: !38)
!874 = !DILocation(line: 603, column: 24, scope: !38)
!875 = !DILocation(line: 616, column: 21, scope: !38)
!876 = !DILocation(line: 616, column: 3, scope: !38)
!877 = !DILocation(line: 617, column: 3, scope: !38)
!878 = !DILocation(line: 618, column: 3, scope: !38)
!879 = !DILocation(line: 619, column: 3, scope: !38)
!880 = !DILocation(line: 621, column: 3, scope: !38)
!881 = !DILocation(line: 623, column: 13, scope: !38)
!882 = !DILocation(line: 624, column: 19, scope: !38)
!883 = !{!884, !884, i64 0}
!884 = !{!"long", !820, i64 0}
!885 = !DILocation(line: 627, column: 3, scope: !38)
!886 = !DILocation(line: 627, column: 18, scope: !887)
!887 = !DILexicalBlockFile(scope: !38, file: !3, discriminator: 1)
!888 = !DILocation(line: 606, column: 7, scope: !38)
!889 = !DILocation(line: 627, column: 3, scope: !887)
!890 = !DILocation(line: 633, column: 11, scope: !891)
!891 = distinct !DILexicalBlock(scope: !892, file: !3, line: 630, column: 9)
!892 = distinct !DILexicalBlock(scope: !38, file: !3, line: 628, column: 5)
!893 = !DILocation(line: 635, column: 27, scope: !891)
!894 = !DILocation(line: 636, column: 11, scope: !891)
!895 = !DILocation(line: 638, column: 23, scope: !891)
!896 = !DILocation(line: 638, column: 21, scope: !891)
!897 = !DILocation(line: 639, column: 11, scope: !891)
!898 = distinct !{!898, !885, !899}
!899 = !DILocation(line: 645, column: 5, scope: !38)
!900 = !DILocation(line: 640, column: 9, scope: !891)
!901 = !DILocation(line: 641, column: 9, scope: !891)
!902 = !DILocation(line: 641, column: 9, scope: !903)
!903 = !DILexicalBlockFile(scope: !891, file: !3, discriminator: 1)
!904 = !DILocation(line: 643, column: 11, scope: !891)
!905 = !DILocation(line: 647, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !38, file: !3, line: 647, column: 7)
!907 = !DILocation(line: 647, column: 23, scope: !906)
!908 = !{!820, !820, i64 0}
!909 = !DILocation(line: 647, column: 7, scope: !38)
!910 = !DILocation(line: 649, column: 11, scope: !911)
!911 = distinct !DILexicalBlock(scope: !906, file: !3, line: 648, column: 5)
!912 = !DILocation(line: 650, column: 9, scope: !913)
!913 = distinct !DILexicalBlock(scope: !911, file: !3, line: 649, column: 11)
!914 = !DILocation(line: 650, column: 9, scope: !915)
!915 = !DILexicalBlockFile(scope: !913, file: !3, discriminator: 1)
!916 = !DILocation(line: 653, column: 36, scope: !911)
!917 = !DILocation(line: 654, column: 34, scope: !911)
!918 = !DILocation(line: 656, column: 54, scope: !911)
!919 = !DILocation(line: 656, column: 23, scope: !920)
!920 = !DILexicalBlockFile(scope: !911, file: !3, discriminator: 1)
!921 = !DILocation(line: 605, column: 15, scope: !38)
!922 = !DILocation(line: 658, column: 11, scope: !923)
!923 = distinct !DILexicalBlock(scope: !911, file: !3, line: 658, column: 11)
!924 = !DILocation(line: 658, column: 11, scope: !911)
!925 = !DILocation(line: 659, column: 9, scope: !923)
!926 = !DILocation(line: 662, column: 38, scope: !906)
!927 = !DILocation(line: 662, column: 51, scope: !928)
!928 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 1)
!929 = !DILocation(line: 662, column: 38, scope: !928)
!930 = !DILocation(line: 662, column: 38, scope: !931)
!931 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 3)
!932 = !DILocation(line: 662, column: 36, scope: !931)
!933 = !DILocation(line: 662, column: 18, scope: !931)
!934 = !DILocation(line: 665, column: 10, scope: !887)
!935 = !DILocation(line: 665, column: 26, scope: !887)
!936 = !DILocation(line: 665, column: 3, scope: !887)
!937 = !DILocation(line: 667, column: 24, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !3, line: 667, column: 11)
!939 = distinct !DILexicalBlock(scope: !38, file: !3, line: 666, column: 5)
!940 = !DILocation(line: 667, column: 11, scope: !939)
!941 = !DILocation(line: 668, column: 9, scope: !938)
!942 = !DILocation(line: 669, column: 17, scope: !939)
!943 = !DILocation(line: 665, column: 39, scope: !887)
!944 = distinct !{!944, !945, !946}
!945 = !DILocation(line: 665, column: 3, scope: !38)
!946 = !DILocation(line: 670, column: 5, scope: !38)
!947 = !DILocation(line: 671, column: 32, scope: !38)
!948 = !DILocation(line: 673, column: 10, scope: !949)
!949 = distinct !DILexicalBlock(scope: !38, file: !3, line: 673, column: 7)
!950 = !DILocation(line: 671, column: 50, scope: !38)
!951 = !DILocation(line: 608, column: 10, scope: !38)
!952 = !DILocation(line: 672, column: 21, scope: !38)
!953 = !DILocation(line: 672, column: 17, scope: !38)
!954 = !DILocation(line: 673, column: 20, scope: !949)
!955 = !DILocation(line: 673, column: 59, scope: !956)
!956 = !DILexicalBlockFile(scope: !949, file: !3, discriminator: 1)
!957 = !DILocation(line: 673, column: 39, scope: !949)
!958 = !DILocation(line: 674, column: 5, scope: !949)
!959 = !DILocation(line: 675, column: 14, scope: !38)
!960 = !DILocation(line: 675, column: 12, scope: !38)
!961 = !DILocation(line: 676, column: 7, scope: !962)
!962 = distinct !DILexicalBlock(scope: !38, file: !3, line: 676, column: 7)
!963 = !DILocation(line: 676, column: 7, scope: !38)
!964 = !DILocation(line: 678, column: 25, scope: !965)
!965 = distinct !DILexicalBlock(scope: !962, file: !3, line: 677, column: 5)
!966 = !DILocation(line: 678, column: 52, scope: !965)
!967 = !DILocation(line: 678, column: 7, scope: !965)
!968 = !DILocation(line: 680, column: 5, scope: !965)
!969 = !DILocation(line: 686, column: 11, scope: !38)
!970 = !{!971, !971, i64 0}
!971 = !{!"int", !820, i64 0}
!972 = !DILocation(line: 686, column: 18, scope: !38)
!973 = !DILocation(line: 687, column: 36, scope: !38)
!974 = !DILocation(line: 613, column: 22, scope: !38)
!975 = !DILocation(line: 607, column: 8, scope: !38)
!976 = !DILocation(line: 693, column: 12, scope: !53)
!977 = !DILocation(line: 695, column: 17, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 1)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 695, column: 5)
!980 = distinct !DILexicalBlock(scope: !53, file: !3, line: 695, column: 5)
!981 = !DILocation(line: 695, column: 5, scope: !982)
!982 = !DILexicalBlockFile(scope: !980, file: !3, discriminator: 1)
!983 = !DILocation(line: 563, column: 23, scope: !984, inlinedAt: !1000)
!984 = distinct !DISubprogram(name: "tac_file", scope: !3, file: !3, line: 563, type: !985, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!49, !25}
!987 = !{!988, !989, !990, !992, !993, !994, !996, !997, !999}
!988 = !DILocalVariable(name: "filename", arg: 1, scope: !984, file: !3, line: 563, type: !25)
!989 = !DILocalVariable(name: "ok", scope: !984, file: !3, line: 565, type: !49)
!990 = !DILocalVariable(name: "file_size", scope: !984, file: !3, line: 566, type: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !151, line: 91, baseType: !179)
!992 = !DILocalVariable(name: "fd", scope: !984, file: !3, line: 567, type: !41)
!993 = !DILocalVariable(name: "is_stdin", scope: !984, file: !3, line: 568, type: !49)
!994 = !DILocalVariable(name: "__s1_len", scope: !995, file: !3, line: 568, type: !27)
!995 = distinct !DILexicalBlock(scope: !984, file: !3, line: 568, column: 19)
!996 = !DILocalVariable(name: "__s2_len", scope: !995, file: !3, line: 568, type: !27)
!997 = !DILocalVariable(name: "__s2", scope: !998, file: !3, line: 568, type: !32)
!998 = distinct !DILexicalBlock(scope: !995, file: !3, line: 568, column: 19)
!999 = !DILocalVariable(name: "__result", scope: !998, file: !3, line: 568, type: !41)
!1000 = distinct !DILocation(line: 696, column: 13, scope: !979)
!1001 = !DILocation(line: 568, column: 19, scope: !995, inlinedAt: !1000)
!1002 = !DILocation(line: 568, column: 19, scope: !998, inlinedAt: !1000)
!1003 = !DILocation(line: 568, column: 19, scope: !1004, inlinedAt: !1000)
!1004 = !DILexicalBlockFile(scope: !998, file: !3, discriminator: 2)
!1005 = !DILocation(line: 568, column: 19, scope: !1006, inlinedAt: !1000)
!1006 = !DILexicalBlockFile(scope: !1007, file: !3, discriminator: 3)
!1007 = distinct !DILexicalBlock(scope: !998, file: !3, line: 568, column: 19)
!1008 = !DILocation(line: 568, column: 19, scope: !1009, inlinedAt: !1000)
!1009 = !DILexicalBlockFile(scope: !1007, file: !3, discriminator: 2)
!1010 = !DILocation(line: 568, column: 19, scope: !1011, inlinedAt: !1000)
!1011 = !DILexicalBlockFile(scope: !1012, file: !3, discriminator: 4)
!1012 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 568, column: 19)
!1013 = !DILocation(line: 568, column: 19, scope: !1014, inlinedAt: !1000)
!1014 = !DILexicalBlockFile(scope: !995, file: !3, discriminator: 11)
!1015 = !DILocation(line: 570, column: 7, scope: !984, inlinedAt: !1000)
!1016 = !DILocation(line: 567, column: 7, scope: !984, inlinedAt: !1000)
!1017 = !DILocation(line: 574, column: 18, scope: !1018, inlinedAt: !1000)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 571, column: 5)
!1019 = distinct !DILexicalBlock(scope: !984, file: !3, line: 570, column: 7)
!1020 = !DILocation(line: 576, column: 5, scope: !1018, inlinedAt: !1000)
!1021 = !DILocation(line: 579, column: 12, scope: !1022, inlinedAt: !1000)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 578, column: 5)
!1023 = !DILocation(line: 580, column: 14, scope: !1024, inlinedAt: !1000)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 580, column: 11)
!1025 = !DILocation(line: 580, column: 11, scope: !1022, inlinedAt: !1000)
!1026 = !DILocation(line: 582, column: 21, scope: !1027, inlinedAt: !1000)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 581, column: 9)
!1028 = !DILocation(line: 582, column: 28, scope: !1029, inlinedAt: !1000)
!1029 = !DILexicalBlockFile(scope: !1027, file: !3, discriminator: 1)
!1030 = !DILocation(line: 583, column: 18, scope: !1027, inlinedAt: !1000)
!1031 = !DILocation(line: 582, column: 11, scope: !1032, inlinedAt: !1000)
!1032 = !DILexicalBlockFile(scope: !1027, file: !3, discriminator: 2)
!1033 = !DILocation(line: 584, column: 11, scope: !1027, inlinedAt: !1000)
!1034 = !DILocation(line: 588, column: 15, scope: !984, inlinedAt: !1000)
!1035 = !DILocation(line: 566, column: 9, scope: !984, inlinedAt: !1000)
!1036 = !DILocation(line: 590, column: 19, scope: !984, inlinedAt: !1000)
!1037 = !DILocation(line: 590, column: 23, scope: !984, inlinedAt: !1000)
!1038 = !DILocation(line: 590, column: 26, scope: !1039, inlinedAt: !1000)
!1039 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 1)
!1040 = !DILocation(line: 590, column: 9, scope: !1039, inlinedAt: !1000)
!1041 = !DILocalVariable(name: "input_fd", arg: 1, scope: !1042, file: !3, line: 546, type: !41)
!1042 = distinct !DISubprogram(name: "tac_nonseekable", scope: !3, file: !3, line: 546, type: !1043, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1045)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!49, !41, !25}
!1045 = !{!1041, !1046, !1047, !1048, !1049, !1050}
!1046 = !DILocalVariable(name: "file", arg: 2, scope: !1042, file: !3, line: 546, type: !25)
!1047 = !DILocalVariable(name: "tmp_stream", scope: !1042, file: !3, line: 548, type: !149)
!1048 = !DILocalVariable(name: "tmp_file", scope: !1042, file: !3, line: 549, type: !20)
!1049 = !DILocalVariable(name: "bytes_copied", scope: !1042, file: !3, line: 550, type: !991)
!1050 = !DILocalVariable(name: "ok", scope: !1042, file: !3, line: 554, type: !49)
!1051 = !DILocation(line: 546, column: 22, scope: !1042, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 591, column: 11, scope: !984, inlinedAt: !1000)
!1053 = !DILocation(line: 546, column: 44, scope: !1042, inlinedAt: !1052)
!1054 = !DIExpression(DW_OP_deref)
!1055 = !DILocation(line: 548, column: 9, scope: !1042, inlinedAt: !1052)
!1056 = !DILocation(line: 549, column: 9, scope: !1042, inlinedAt: !1052)
!1057 = !DILocalVariable(name: "g_tmp", arg: 1, scope: !1058, file: !3, line: 500, type: !148)
!1058 = distinct !DISubprogram(name: "copy_to_temp", scope: !3, file: !3, line: 500, type: !1059, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1061)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!991, !148, !42, !41, !25}
!1061 = !{!1057, !1062, !1063, !1064, !1065, !1066, !1067, !1071}
!1062 = !DILocalVariable(name: "g_tempfile", arg: 2, scope: !1058, file: !3, line: 500, type: !42)
!1063 = !DILocalVariable(name: "input_fd", arg: 3, scope: !1058, file: !3, line: 500, type: !41)
!1064 = !DILocalVariable(name: "file", arg: 4, scope: !1058, file: !3, line: 500, type: !25)
!1065 = !DILocalVariable(name: "fp", scope: !1058, file: !3, line: 502, type: !149)
!1066 = !DILocalVariable(name: "file_name", scope: !1058, file: !3, line: 503, type: !20)
!1067 = !DILocalVariable(name: "bytes_copied", scope: !1058, file: !3, line: 504, type: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1069, line: 136, baseType: !1070)
!1069 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !180, line: 62, baseType: !29)
!1071 = !DILocalVariable(name: "bytes_read", scope: !1072, file: !3, line: 510, type: !27)
!1072 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 509, column: 5)
!1073 = !DILocation(line: 500, column: 22, scope: !1058, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 550, column: 24, scope: !1042, inlinedAt: !1052)
!1075 = !DILocation(line: 500, column: 36, scope: !1058, inlinedAt: !1074)
!1076 = !DILocation(line: 500, column: 52, scope: !1058, inlinedAt: !1074)
!1077 = !DILocation(line: 500, column: 74, scope: !1058, inlinedAt: !1074)
!1078 = !DILocation(line: 504, column: 13, scope: !1058, inlinedAt: !1074)
!1079 = !DILocation(line: 502, column: 9, scope: !1058, inlinedAt: !1074)
!1080 = !DILocation(line: 503, column: 9, scope: !1058, inlinedAt: !1074)
!1081 = !DILocation(line: 431, column: 21, scope: !145, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 505, column: 8, scope: !1083, inlinedAt: !1074)
!1083 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 505, column: 7)
!1084 = !DILocation(line: 431, column: 32, scope: !145, inlinedAt: !1082)
!1085 = !DILocation(line: 435, column: 7, scope: !210, inlinedAt: !1082)
!1086 = !DILocation(line: 435, column: 16, scope: !210, inlinedAt: !1082)
!1087 = !DILocation(line: 435, column: 7, scope: !145, inlinedAt: !1082)
!1088 = !DILocation(line: 437, column: 23, scope: !209, inlinedAt: !1082)
!1089 = !DILocation(line: 437, column: 19, scope: !209, inlinedAt: !1082)
!1090 = !DILocation(line: 438, column: 29, scope: !209, inlinedAt: !1082)
!1091 = !DILocation(line: 438, column: 19, scope: !209, inlinedAt: !1082)
!1092 = !DILocation(line: 439, column: 18, scope: !209, inlinedAt: !1082)
!1093 = !DILocation(line: 439, column: 16, scope: !209, inlinedAt: !1082)
!1094 = !DILocation(line: 440, column: 19, scope: !1095, inlinedAt: !1082)
!1095 = distinct !DILexicalBlock(scope: !209, file: !3, line: 440, column: 11)
!1096 = !DILocation(line: 440, column: 11, scope: !209, inlinedAt: !1082)
!1097 = !DILocation(line: 442, column: 24, scope: !1098, inlinedAt: !1082)
!1098 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 441, column: 9)
!1099 = !DILocation(line: 442, column: 11, scope: !1100, inlinedAt: !1082)
!1100 = !DILexicalBlockFile(scope: !1098, file: !3, discriminator: 1)
!1101 = !DILocation(line: 443, column: 11, scope: !1098, inlinedAt: !1082)
!1102 = !DILocation(line: 455, column: 16, scope: !209, inlinedAt: !1082)
!1103 = !DILocation(line: 455, column: 11, scope: !209, inlinedAt: !1082)
!1104 = !DILocation(line: 456, column: 14, scope: !1105, inlinedAt: !1082)
!1105 = distinct !DILexicalBlock(scope: !209, file: !3, line: 456, column: 11)
!1106 = !DILocation(line: 456, column: 11, scope: !209, inlinedAt: !1082)
!1107 = !DILocation(line: 458, column: 21, scope: !1108, inlinedAt: !1082)
!1108 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 457, column: 9)
!1109 = !DILocation(line: 458, column: 28, scope: !1110, inlinedAt: !1082)
!1110 = !DILexicalBlockFile(scope: !1108, file: !3, discriminator: 1)
!1111 = !DILocation(line: 459, column: 18, scope: !1108, inlinedAt: !1082)
!1112 = !DILocation(line: 458, column: 11, scope: !1113, inlinedAt: !1082)
!1113 = !DILexicalBlockFile(scope: !1108, file: !3, discriminator: 2)
!1114 = !DILocation(line: 460, column: 11, scope: !1108, inlinedAt: !1082)
!1115 = !DILocation(line: 463, column: 16, scope: !209, inlinedAt: !1082)
!1116 = !DILocation(line: 463, column: 14, scope: !209, inlinedAt: !1082)
!1117 = !DILocation(line: 464, column: 13, scope: !1118, inlinedAt: !1082)
!1118 = distinct !DILexicalBlock(scope: !209, file: !3, line: 464, column: 11)
!1119 = !DILocation(line: 464, column: 11, scope: !209, inlinedAt: !1082)
!1120 = !DILocation(line: 466, column: 21, scope: !1121, inlinedAt: !1082)
!1121 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 465, column: 9)
!1122 = !DILocation(line: 466, column: 28, scope: !1123, inlinedAt: !1082)
!1123 = !DILexicalBlockFile(scope: !1121, file: !3, discriminator: 1)
!1124 = !DILocation(line: 467, column: 18, scope: !1121, inlinedAt: !1082)
!1125 = !DILocation(line: 466, column: 11, scope: !1126, inlinedAt: !1082)
!1126 = !DILexicalBlockFile(scope: !1121, file: !3, discriminator: 2)
!1127 = !DILocation(line: 468, column: 11, scope: !1121, inlinedAt: !1082)
!1128 = !DILocation(line: 469, column: 19, scope: !1121, inlinedAt: !1082)
!1129 = !DILocation(line: 469, column: 11, scope: !1121, inlinedAt: !1082)
!1130 = !DILocation(line: 471, column: 17, scope: !1121, inlinedAt: !1082)
!1131 = !DILocation(line: 471, column: 11, scope: !1121, inlinedAt: !1082)
!1132 = !DILocation(line: 472, column: 20, scope: !1121, inlinedAt: !1082)
!1133 = !DILocation(line: 473, column: 11, scope: !1121, inlinedAt: !1082)
!1134 = !DILocation(line: 476, column: 34, scope: !209, inlinedAt: !1082)
!1135 = !DILocalVariable(name: "fp", arg: 2, scope: !1136, file: !3, line: 420, type: !149)
!1136 = distinct !DISubprogram(name: "record_or_unlink_tempfile", scope: !3, file: !3, line: 420, type: !1137, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1139)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !25, !149}
!1139 = !{!1140, !1135}
!1140 = !DILocalVariable(name: "fn", arg: 1, scope: !1136, file: !3, line: 420, type: !25)
!1141 = !DILocation(line: 420, column: 50, scope: !1136, inlinedAt: !1142)
!1142 = distinct !DILocation(line: 476, column: 7, scope: !209, inlinedAt: !1082)
!1143 = !DILocation(line: 422, column: 3, scope: !1136, inlinedAt: !1142)
!1144 = !DILocation(line: 480, column: 7, scope: !1145, inlinedAt: !1082)
!1145 = distinct !DILexicalBlock(scope: !210, file: !3, line: 479, column: 5)
!1146 = !DILocation(line: 481, column: 19, scope: !1147, inlinedAt: !1082)
!1147 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 481, column: 11)
!1148 = !DILocation(line: 481, column: 11, scope: !1147, inlinedAt: !1082)
!1149 = !DILocation(line: 481, column: 40, scope: !1147, inlinedAt: !1082)
!1150 = !DILocation(line: 482, column: 11, scope: !1147, inlinedAt: !1082)
!1151 = !DILocation(line: 482, column: 33, scope: !1152, inlinedAt: !1082)
!1152 = !DILexicalBlockFile(scope: !1147, file: !3, discriminator: 1)
!1153 = !DILocation(line: 482, column: 25, scope: !1152, inlinedAt: !1082)
!1154 = !DILocation(line: 482, column: 14, scope: !1155, inlinedAt: !1082)
!1155 = !DILexicalBlockFile(scope: !1147, file: !3, discriminator: 2)
!1156 = !DILocation(line: 482, column: 45, scope: !1152, inlinedAt: !1082)
!1157 = !DILocation(line: 481, column: 11, scope: !1158, inlinedAt: !1082)
!1158 = !DILexicalBlockFile(scope: !1145, file: !3, discriminator: 1)
!1159 = !DILocation(line: 484, column: 21, scope: !1160, inlinedAt: !1082)
!1160 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 483, column: 9)
!1161 = !DILocation(line: 484, column: 28, scope: !1162, inlinedAt: !1082)
!1162 = !DILexicalBlockFile(scope: !1160, file: !3, discriminator: 1)
!1163 = !DILocation(line: 485, column: 18, scope: !1160, inlinedAt: !1082)
!1164 = !DILocation(line: 484, column: 11, scope: !1165, inlinedAt: !1082)
!1165 = !DILexicalBlockFile(scope: !1160, file: !3, discriminator: 2)
!1166 = !DILocation(line: 486, column: 11, scope: !1160, inlinedAt: !1082)
!1167 = !DILocation(line: 490, column: 9, scope: !145, inlinedAt: !1082)
!1168 = !DILocation(line: 491, column: 16, scope: !145, inlinedAt: !1082)
!1169 = !DILocation(line: 505, column: 7, scope: !1058, inlinedAt: !1074)
!1170 = !DILocation(line: 510, column: 48, scope: !1072, inlinedAt: !1074)
!1171 = !DILocation(line: 510, column: 58, scope: !1072, inlinedAt: !1074)
!1172 = !DILocation(line: 510, column: 27, scope: !1072, inlinedAt: !1074)
!1173 = !DILocation(line: 510, column: 14, scope: !1072, inlinedAt: !1074)
!1174 = !DILocation(line: 511, column: 11, scope: !1072, inlinedAt: !1074)
!1175 = !DILocation(line: 515, column: 21, scope: !1176, inlinedAt: !1074)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 514, column: 9)
!1177 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 513, column: 11)
!1178 = !DILocation(line: 515, column: 28, scope: !1179, inlinedAt: !1074)
!1179 = !DILexicalBlockFile(scope: !1176, file: !3, discriminator: 1)
!1180 = !DILocation(line: 515, column: 49, scope: !1181, inlinedAt: !1074)
!1181 = !DILexicalBlockFile(scope: !1176, file: !3, discriminator: 2)
!1182 = !DILocation(line: 515, column: 11, scope: !1183, inlinedAt: !1074)
!1183 = !DILexicalBlockFile(scope: !1176, file: !3, discriminator: 3)
!1184 = !DILocation(line: 516, column: 11, scope: !1176, inlinedAt: !1074)
!1185 = !DILocation(line: 519, column: 11, scope: !1186, inlinedAt: !1074)
!1186 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 519, column: 11)
!1187 = !DILocation(line: 519, column: 48, scope: !1186, inlinedAt: !1074)
!1188 = !DILocation(line: 528, column: 20, scope: !1072, inlinedAt: !1074)
!1189 = !DILocation(line: 519, column: 11, scope: !1072, inlinedAt: !1074)
!1190 = !DILocation(line: 521, column: 21, scope: !1191, inlinedAt: !1074)
!1191 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 520, column: 9)
!1192 = !DILocation(line: 521, column: 28, scope: !1193, inlinedAt: !1074)
!1193 = !DILexicalBlockFile(scope: !1191, file: !3, discriminator: 1)
!1194 = !DILocation(line: 521, column: 50, scope: !1191, inlinedAt: !1074)
!1195 = !DILocation(line: 521, column: 50, scope: !1196, inlinedAt: !1074)
!1196 = !DILexicalBlockFile(scope: !1191, file: !3, discriminator: 2)
!1197 = !DILocation(line: 521, column: 11, scope: !1198, inlinedAt: !1074)
!1198 = !DILexicalBlockFile(scope: !1191, file: !3, discriminator: 3)
!1199 = !DILocation(line: 522, column: 11, scope: !1191, inlinedAt: !1074)
!1200 = !DILocation(line: 531, column: 7, scope: !1201, inlinedAt: !1074)
!1201 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 531, column: 7)
!1202 = !DILocation(line: 531, column: 19, scope: !1201, inlinedAt: !1074)
!1203 = !DILocation(line: 531, column: 7, scope: !1058, inlinedAt: !1074)
!1204 = !DILocation(line: 533, column: 17, scope: !1205, inlinedAt: !1074)
!1205 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 532, column: 5)
!1206 = !DILocation(line: 533, column: 24, scope: !1207, inlinedAt: !1074)
!1207 = !DILexicalBlockFile(scope: !1205, file: !3, discriminator: 1)
!1208 = !DILocation(line: 533, column: 46, scope: !1205, inlinedAt: !1074)
!1209 = !DILocation(line: 533, column: 46, scope: !1210, inlinedAt: !1074)
!1210 = !DILexicalBlockFile(scope: !1205, file: !3, discriminator: 2)
!1211 = !DILocation(line: 533, column: 7, scope: !1212, inlinedAt: !1074)
!1212 = !DILexicalBlockFile(scope: !1205, file: !3, discriminator: 3)
!1213 = !DILocation(line: 534, column: 7, scope: !1205, inlinedAt: !1074)
!1214 = !DILocation(line: 550, column: 9, scope: !1042, inlinedAt: !1052)
!1215 = !DILocation(line: 551, column: 20, scope: !1216, inlinedAt: !1052)
!1216 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 551, column: 7)
!1217 = !DILocation(line: 551, column: 7, scope: !1042, inlinedAt: !1052)
!1218 = !DILocation(line: 554, column: 27, scope: !1042, inlinedAt: !1052)
!1219 = !DILocation(line: 554, column: 48, scope: !1042, inlinedAt: !1052)
!1220 = !DILocation(line: 554, column: 13, scope: !1221, inlinedAt: !1052)
!1221 = !DILexicalBlockFile(scope: !1042, file: !3, discriminator: 1)
!1222 = !DILocation(line: 592, column: 11, scope: !984, inlinedAt: !1000)
!1223 = !DILocation(line: 590, column: 9, scope: !1224, inlinedAt: !1000)
!1224 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 3)
!1225 = !DILocation(line: 590, column: 6, scope: !1226, inlinedAt: !1000)
!1226 = !DILexicalBlockFile(scope: !984, file: !3, discriminator: 4)
!1227 = !DILocation(line: 565, column: 8, scope: !984, inlinedAt: !1000)
!1228 = !DILocation(line: 594, column: 17, scope: !1229, inlinedAt: !1000)
!1229 = distinct !DILexicalBlock(scope: !984, file: !3, line: 594, column: 7)
!1230 = !DILocation(line: 594, column: 20, scope: !1231, inlinedAt: !1000)
!1231 = !DILexicalBlockFile(scope: !1229, file: !3, discriminator: 1)
!1232 = !DILocation(line: 594, column: 31, scope: !1231, inlinedAt: !1000)
!1233 = !DILocation(line: 594, column: 7, scope: !1039, inlinedAt: !1000)
!1234 = !DILocation(line: 596, column: 17, scope: !1235, inlinedAt: !1000)
!1235 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 595, column: 5)
!1236 = !DILocation(line: 596, column: 24, scope: !1237, inlinedAt: !1000)
!1237 = !DILexicalBlockFile(scope: !1235, file: !3, discriminator: 1)
!1238 = !DILocation(line: 596, column: 45, scope: !1239, inlinedAt: !1000)
!1239 = !DILexicalBlockFile(scope: !1235, file: !3, discriminator: 2)
!1240 = !DILocation(line: 596, column: 7, scope: !1241, inlinedAt: !1000)
!1241 = !DILexicalBlockFile(scope: !1235, file: !3, discriminator: 3)
!1242 = !DILocation(line: 598, column: 5, scope: !1235, inlinedAt: !1000)
!1243 = !DILocation(line: 599, column: 10, scope: !984, inlinedAt: !1000)
!1244 = !DILocation(line: 599, column: 3, scope: !984, inlinedAt: !1000)
!1245 = !DILocation(line: 696, column: 13, scope: !979)
!1246 = !DILocation(line: 696, column: 10, scope: !979)
!1247 = !DILocation(line: 695, column: 26, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !979, file: !3, discriminator: 2)
!1249 = distinct !{!1249, !1250, !1251}
!1250 = !DILocation(line: 695, column: 5, scope: !980)
!1251 = !DILocation(line: 696, column: 30, scope: !980)
!1252 = !DILocation(line: 159, column: 21, scope: !227, inlinedAt: !1253)
!1253 = distinct !DILocation(line: 700, column: 3, scope: !38)
!1254 = !DILocation(line: 159, column: 40, scope: !227, inlinedAt: !1253)
!1255 = !DILocation(line: 163, column: 10, scope: !227, inlinedAt: !1253)
!1256 = !DILocation(line: 164, column: 40, scope: !227, inlinedAt: !1253)
!1257 = !DILocation(line: 168, column: 7, scope: !1258, inlinedAt: !1253)
!1258 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 167, column: 5)
!1259 = distinct !DILexicalBlock(scope: !227, file: !3, line: 166, column: 7)
!1260 = !DILocation(line: 169, column: 23, scope: !1258, inlinedAt: !1253)
!1261 = !DILocation(line: 702, column: 23, scope: !1262)
