!llvm.dbg.cu = !{!2, !119, !125, !138, !146, !621, !624, !153, !160, !626, !628, !229, !636, !653, !655, !657, !242, !659, !661, !663, !666, !668, !275}
!llvm.ident = !{!671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671, !671}
!llvm.module.flags = !{!672, !673, !674, !675}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !105, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !55)
!3 = !DIFile(filename: "src/tee.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !21}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "output_error", file: !3, line: 48, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "output_error_sigpipe", value: 0)
!8 = !DIEnumerator(name: "output_error_warn", value: 1)
!9 = !DIEnumerator(name: "output_error_warn_nopipe", value: 2)
!10 = !DIEnumerator(name: "output_error_exit", value: 3)
!11 = !DIEnumerator(name: "output_error_exit_nopipe", value: 4)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 45, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18, !19, !20}
!15 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!16 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!17 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!18 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!19 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!20 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !22, line: 32, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!25 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!26 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!27 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!28 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!29 = !DIEnumerator(name: "c_quoting_style", value: 5)
!30 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !{!36, !39, !40, !41, !47, !50, !52}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !42, line: 84, baseType: !43)
!42 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 62, baseType: !49)
!48 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !{!56, !59, !61, !63, !0, !93, !99}
!56 = !DIGlobalVariableExpression(var: !57)
!57 = distinct !DIGlobalVariable(name: "append", scope: !2, file: !3, line: 43, type: !58, isLocal: true, isDefinition: true)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIGlobalVariableExpression(var: !60)
!60 = distinct !DIGlobalVariable(name: "ignore_interrupts", scope: !2, file: !3, line: 46, type: !58, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "output_error", scope: !2, file: !3, line: 57, type: !5, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64)
!64 = distinct !DIGlobalVariable(name: "infomap", scope: !65, file: !66, line: 632, type: !90, isLocal: true, isDefinition: true)
!65 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !66, file: !66, line: 630, type: !67, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !69)
!66 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !DISubroutineType(types: !68)
!68 = !{null, !36}
!69 = !{!70, !71, !72, !79, !81, !82, !83, !86, !87, !89}
!70 = !DILocalVariable(name: "program", arg: 1, scope: !65, file: !66, line: 630, type: !36)
!71 = !DILocalVariable(name: "node", scope: !65, file: !66, line: 642, type: !36)
!72 = !DILocalVariable(name: "map_prog", scope: !65, file: !66, line: 643, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !65, file: !66, line: 632, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !75, file: !66, line: 632, baseType: !36, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !75, file: !66, line: 632, baseType: !36, size: 64, offset: 64)
!79 = !DILocalVariable(name: "__s1_len", scope: !80, file: !66, line: 645, type: !47)
!80 = distinct !DILexicalBlock(scope: !65, file: !66, line: 645, column: 33)
!81 = !DILocalVariable(name: "__s2_len", scope: !80, file: !66, line: 645, type: !47)
!82 = !DILocalVariable(name: "lc_messages", scope: !65, file: !66, line: 655, type: !36)
!83 = !DILocalVariable(name: "__s1_len", scope: !84, file: !66, line: 656, type: !47)
!84 = distinct !DILexicalBlock(scope: !85, file: !66, line: 656, column: 22)
!85 = distinct !DILexicalBlock(scope: !65, file: !66, line: 656, column: 7)
!86 = !DILocalVariable(name: "__s2_len", scope: !84, file: !66, line: 656, type: !47)
!87 = !DILocalVariable(name: "__s2", scope: !88, file: !66, line: 656, type: !52)
!88 = distinct !DILexicalBlock(scope: !84, file: !66, line: 656, column: 22)
!89 = !DILocalVariable(name: "__result", scope: !88, file: !66, line: 656, type: !46)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 896, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 7)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "output_error_types", scope: !2, file: !3, line: 73, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !97)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!97 = !{!98}
!98 = !DISubrange(count: 4)
!99 = !DIGlobalVariableExpression(var: !100)
!100 = distinct !DIGlobalVariable(name: "output_error_args", scope: !2, file: !3, line: 69, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 320, elements: !103)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!103 = !{!104}
!104 = !DISubrange(count: 5)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1536, elements: !115)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !108, line: 104, size: 256, elements: !109)
!108 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !{!110, !111, !112, !114}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !108, line: 106, baseType: !36, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !107, file: !108, line: 109, baseType: !46, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !107, file: !108, line: 110, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !107, file: !108, line: 111, baseType: !46, size: 32, offset: 192)
!115 = !{!116}
!116 = !DISubrange(count: 6)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "Version", scope: !119, file: !120, line: 2, type: !36, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, globals: !122)
!120 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{}
!122 = !{!117}
!123 = !DIGlobalVariableExpression(var: !124)
!124 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !125, file: !130, line: 69, type: !131, isDefinition: true)
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !127, retainedTypes: !128, globals: !129)
!126 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!127 = !{!21}
!128 = !{!47, !40, !54}
!129 = !{!123}
!130 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !132, line: 55, baseType: !133)
!132 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "file_name", scope: !138, file: !143, line: 36, type: !36, isLocal: true, isDefinition: true)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, globals: !140)
!139 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!140 = !{!136, !141}
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !138, file: !143, line: 46, type: !58, isLocal: true, isDefinition: true)
!143 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "exit_failure", scope: !146, file: !149, line: 24, type: !150, isDefinition: true)
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, globals: !148)
!147 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !{!144}
!149 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!150 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!151 = !DIGlobalVariableExpression(var: !152)
!152 = distinct !DIGlobalVariable(name: "program_name", scope: !153, file: !157, line: 33, type: !36, isDefinition: true)
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !155, globals: !156)
!154 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!155 = !{!40, !39}
!156 = !{!151}
!157 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !160, file: !188, line: 77, type: !224, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !162, retainedTypes: !183, globals: !185)
!161 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !{!21, !163, !168}
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 242, size: 32, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!166 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!167 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !169, line: 46, size: 32, elements: !170)
!169 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!171 = !DIEnumerator(name: "_ISupper", value: 256)
!172 = !DIEnumerator(name: "_ISlower", value: 512)
!173 = !DIEnumerator(name: "_ISalpha", value: 1024)
!174 = !DIEnumerator(name: "_ISdigit", value: 2048)
!175 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!176 = !DIEnumerator(name: "_ISspace", value: 8192)
!177 = !DIEnumerator(name: "_ISprint", value: 16384)
!178 = !DIEnumerator(name: "_ISgraph", value: 32768)
!179 = !DIEnumerator(name: "_ISblank", value: 1)
!180 = !DIEnumerator(name: "_IScntrl", value: 2)
!181 = !DIEnumerator(name: "_ISpunct", value: 4)
!182 = !DIEnumerator(name: "_ISalnum", value: 8)
!183 = !{!46, !184, !47, !39}
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !{!158, !186, !193, !206, !208, !213, !220, !222}
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !160, file: !188, line: 93, type: !189, isDefinition: true)
!188 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 320, elements: !191)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!191 = !{!192}
!192 = !DISubrange(count: 10)
!193 = !DIGlobalVariableExpression(var: !194)
!194 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !160, file: !188, line: 1043, type: !195, isDefinition: true)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !188, line: 57, size: 448, elements: !196)
!196 = !{!197, !198, !199, !204, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !195, file: !188, line: 60, baseType: !21, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !188, line: 63, baseType: !46, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !195, file: !188, line: 67, baseType: !200, size: 256, offset: 64)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 256, elements: !202)
!201 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!202 = !{!203}
!203 = !DISubrange(count: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !195, file: !188, line: 70, baseType: !36, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !195, file: !188, line: 73, baseType: !36, size: 64, offset: 384)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !160, file: !188, line: 108, type: !195, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "slot0", scope: !160, file: !188, line: 834, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 256)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "slotvec", scope: !160, file: !188, line: 837, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !188, line: 826, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !216, file: !188, line: 828, baseType: !47, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !216, file: !188, line: 829, baseType: !39, size: 64, offset: 64)
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "nslots", scope: !160, file: !188, line: 835, type: !46, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "slotvec0", scope: !160, file: !188, line: 836, type: !216, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 704, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 11)
!227 = !DIGlobalVariableExpression(var: !228)
!228 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !229, file: !232, line: 26, type: !233, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, globals: !231)
!230 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!231 = !{!227}
!232 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 47)
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !238, file: !239, line: 335, type: !46, isLocal: true, isDefinition: true)
!238 = distinct !DISubprogram(name: "rpl_fcntl", scope: !239, file: !239, line: 272, type: !240, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !242, variables: !245)
!239 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!240 = !DISubroutineType(types: !241)
!241 = !{!46, !46, !46, null}
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, globals: !244)
!243 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!244 = !{!236}
!245 = !{!246, !247, !248, !261, !262, !265, !268, !271}
!246 = !DILocalVariable(name: "fd", arg: 1, scope: !238, file: !239, line: 272, type: !46)
!247 = !DILocalVariable(name: "action", arg: 2, scope: !238, file: !239, line: 272, type: !46)
!248 = !DILocalVariable(name: "arg", scope: !238, file: !239, line: 274, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !250, line: 30, baseType: !251)
!250 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !243, line: 274, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 192, elements: !259)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !243, line: 274, size: 192, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !253, file: !243, line: 274, baseType: !201, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !253, file: !243, line: 274, baseType: !201, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !253, file: !243, line: 274, baseType: !40, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !253, file: !243, line: 274, baseType: !40, size: 64, offset: 128)
!259 = !{!260}
!260 = !DISubrange(count: 1)
!261 = !DILocalVariable(name: "result", scope: !238, file: !239, line: 275, type: !46)
!262 = !DILocalVariable(name: "target", scope: !263, file: !239, line: 322, type: !46)
!263 = distinct !DILexicalBlock(scope: !264, file: !239, line: 321, column: 7)
!264 = distinct !DILexicalBlock(scope: !238, file: !239, line: 278, column: 5)
!265 = !DILocalVariable(name: "flags", scope: !266, file: !239, line: 359, type: !46)
!266 = distinct !DILexicalBlock(scope: !267, file: !239, line: 358, column: 11)
!267 = distinct !DILexicalBlock(scope: !263, file: !239, line: 357, column: 13)
!268 = !DILocalVariable(name: "saved_errno", scope: !269, file: !239, line: 362, type: !46)
!269 = distinct !DILexicalBlock(scope: !270, file: !239, line: 361, column: 15)
!270 = distinct !DILexicalBlock(scope: !266, file: !239, line: 360, column: 17)
!271 = !DILocalVariable(name: "p", scope: !272, file: !239, line: 404, type: !40)
!272 = distinct !DILexicalBlock(scope: !264, file: !239, line: 402, column: 7)
!273 = !DIGlobalVariableExpression(var: !274)
!274 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !275, file: !619, line: 120, type: !620, isLocal: true, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !277, retainedTypes: !616, globals: !618)
!276 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!277 = !{!278}
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !279, line: 41, size: 32, elements: !280)
!279 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!281 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!282 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!283 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!284 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!285 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!286 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!287 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!288 = !DIEnumerator(name: "DAY_1", value: 131079)
!289 = !DIEnumerator(name: "DAY_2", value: 131080)
!290 = !DIEnumerator(name: "DAY_3", value: 131081)
!291 = !DIEnumerator(name: "DAY_4", value: 131082)
!292 = !DIEnumerator(name: "DAY_5", value: 131083)
!293 = !DIEnumerator(name: "DAY_6", value: 131084)
!294 = !DIEnumerator(name: "DAY_7", value: 131085)
!295 = !DIEnumerator(name: "ABMON_1", value: 131086)
!296 = !DIEnumerator(name: "ABMON_2", value: 131087)
!297 = !DIEnumerator(name: "ABMON_3", value: 131088)
!298 = !DIEnumerator(name: "ABMON_4", value: 131089)
!299 = !DIEnumerator(name: "ABMON_5", value: 131090)
!300 = !DIEnumerator(name: "ABMON_6", value: 131091)
!301 = !DIEnumerator(name: "ABMON_7", value: 131092)
!302 = !DIEnumerator(name: "ABMON_8", value: 131093)
!303 = !DIEnumerator(name: "ABMON_9", value: 131094)
!304 = !DIEnumerator(name: "ABMON_10", value: 131095)
!305 = !DIEnumerator(name: "ABMON_11", value: 131096)
!306 = !DIEnumerator(name: "ABMON_12", value: 131097)
!307 = !DIEnumerator(name: "MON_1", value: 131098)
!308 = !DIEnumerator(name: "MON_2", value: 131099)
!309 = !DIEnumerator(name: "MON_3", value: 131100)
!310 = !DIEnumerator(name: "MON_4", value: 131101)
!311 = !DIEnumerator(name: "MON_5", value: 131102)
!312 = !DIEnumerator(name: "MON_6", value: 131103)
!313 = !DIEnumerator(name: "MON_7", value: 131104)
!314 = !DIEnumerator(name: "MON_8", value: 131105)
!315 = !DIEnumerator(name: "MON_9", value: 131106)
!316 = !DIEnumerator(name: "MON_10", value: 131107)
!317 = !DIEnumerator(name: "MON_11", value: 131108)
!318 = !DIEnumerator(name: "MON_12", value: 131109)
!319 = !DIEnumerator(name: "AM_STR", value: 131110)
!320 = !DIEnumerator(name: "PM_STR", value: 131111)
!321 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!322 = !DIEnumerator(name: "D_FMT", value: 131113)
!323 = !DIEnumerator(name: "T_FMT", value: 131114)
!324 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!325 = !DIEnumerator(name: "ERA", value: 131116)
!326 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!327 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!328 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!329 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!330 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!331 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!332 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!333 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!334 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!335 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!336 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!337 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!338 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!339 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!340 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!341 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!342 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!343 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!344 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!345 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!346 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!347 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!348 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!349 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!350 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!351 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!352 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!353 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!354 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!355 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!356 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!357 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!358 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!359 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!360 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!361 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!362 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!363 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!364 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!365 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!366 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!367 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!368 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!369 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!370 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!371 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!372 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!373 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!374 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!375 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!376 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!377 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!378 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!379 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!380 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!381 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!382 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!383 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!384 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!385 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!386 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!387 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!388 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!389 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!390 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!391 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!392 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!393 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!394 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!395 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!396 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!397 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!398 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!399 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!400 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!401 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!402 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!403 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!404 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!405 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!406 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!407 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!408 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!409 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!410 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!411 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!412 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!413 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!414 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!415 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!416 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!417 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!418 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!419 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!420 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!421 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!422 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!423 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!424 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!425 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!426 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!427 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!428 = !DIEnumerator(name: "CODESET", value: 14)
!429 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!430 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!431 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!432 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!450 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!451 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!452 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!453 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!454 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!470 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!471 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!472 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!473 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!474 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!475 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!476 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!477 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!478 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!479 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!480 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!481 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!482 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!483 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!484 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!485 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!490 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!491 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!492 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!493 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!494 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!495 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!496 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!497 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!498 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!499 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!500 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!501 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!502 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!503 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!504 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!505 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!506 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!507 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!508 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!509 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!510 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!511 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!512 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!513 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!514 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!515 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!516 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!517 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!518 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!519 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!520 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!521 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!522 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!529 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!535 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!538 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!539 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!540 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!541 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!542 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!543 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!544 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!545 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!546 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!547 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!548 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!549 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!550 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!551 = !DIEnumerator(name: "THOUSEP", value: 65537)
!552 = !DIEnumerator(name: "__GROUPING", value: 65538)
!553 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!554 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!555 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!556 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!557 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!558 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!559 = !DIEnumerator(name: "__YESSTR", value: 327682)
!560 = !DIEnumerator(name: "__NOSTR", value: 327683)
!561 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!562 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!563 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!564 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!565 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!566 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!567 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!568 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!569 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!570 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!571 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!572 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!573 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!574 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!575 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!576 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!577 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!578 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!579 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!580 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!581 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!582 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!583 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!584 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!585 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!586 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!587 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!588 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!589 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!590 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!591 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!592 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!593 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!594 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!595 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!596 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!597 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!604 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!605 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!607 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!609 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!610 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!611 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!612 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!613 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!614 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!615 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!616 = !{!40, !39, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!618 = !{!273}
!619 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!620 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !623)
!622 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!623 = !{!12}
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121)
!625 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121)
!627 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !630, retainedTypes: !635)
!629 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!630 = !{!631}
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !632, line: 41, size: 32, elements: !633)
!632 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!633 = !{!634}
!634 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!635 = !{!40}
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !638, retainedTypes: !652)
!637 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!638 = !{!639}
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !641, file: !640, line: 192, size: 32, elements: !650)
!640 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = distinct !DISubprogram(name: "x2nrealloc", scope: !640, file: !640, line: 180, type: !642, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !636, variables: !645)
!642 = !DISubroutineType(types: !643)
!643 = !{!40, !40, !644, !47}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!645 = !{!646, !647, !648, !649}
!646 = !DILocalVariable(name: "p", arg: 1, scope: !641, file: !640, line: 180, type: !40)
!647 = !DILocalVariable(name: "pn", arg: 2, scope: !641, file: !640, line: 180, type: !644)
!648 = !DILocalVariable(name: "s", arg: 3, scope: !641, file: !640, line: 180, type: !47)
!649 = !DILocalVariable(name: "n", scope: !641, file: !640, line: 182, type: !47)
!650 = !{!651}
!651 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!652 = !{!47, !39, !40}
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121)
!654 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !635)
!656 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121)
!658 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !635)
!660 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !635)
!662 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !665)
!664 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!665 = !{!47}
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121)
!667 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !121, retainedTypes: !670)
!669 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = !{!47, !50, !52, !36}
!671 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!672 = !{i32 2, !"Dwarf Version", i32 4}
!673 = !{i32 2, !"Debug Info Version", i32 3}
!674 = !{i32 1, !"PIC Level", i32 2}
!675 = !{i32 1, !"PIE Level", i32 2}
!676 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 81, type: !44, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !677)
!677 = !{!678}
!678 = !DILocalVariable(name: "status", arg: 1, scope: !676, file: !3, line: 81, type: !46)
!679 = !DIExpression()
!680 = !DILocation(line: 81, column: 12, scope: !676)
!681 = !DILocation(line: 83, column: 14, scope: !682)
!682 = distinct !DILexicalBlock(scope: !676, file: !3, line: 83, column: 7)
!683 = !DILocation(line: 83, column: 7, scope: !676)
!684 = !DILocation(line: 84, column: 5, scope: !685)
!685 = !DILexicalBlockFile(scope: !686, file: !3, discriminator: 1)
!686 = distinct !DILexicalBlock(scope: !682, file: !3, line: 84, column: 5)
!687 = !{!688, !688, i64 0}
!688 = !{!"any pointer", !689, i64 0}
!689 = !{!"omnipotent char", !690, i64 0}
!690 = !{!"Simple C/C++ TBAA"}
!691 = !DILocation(line: 84, column: 5, scope: !692)
!692 = !DILexicalBlockFile(scope: !686, file: !3, discriminator: 3)
!693 = !DILocation(line: 84, column: 5, scope: !694)
!694 = !DILexicalBlockFile(scope: !686, file: !3, discriminator: 2)
!695 = !DILocation(line: 87, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !682, file: !3, line: 86, column: 5)
!697 = !DILocation(line: 87, column: 7, scope: !698)
!698 = !DILexicalBlockFile(scope: !696, file: !3, discriminator: 1)
!699 = !DILocation(line: 88, column: 7, scope: !696)
!700 = !DILocation(line: 88, column: 7, scope: !698)
!701 = !DILocation(line: 94, column: 7, scope: !696)
!702 = !DILocation(line: 94, column: 7, scope: !698)
!703 = !DILocation(line: 98, column: 7, scope: !696)
!704 = !DILocation(line: 98, column: 7, scope: !698)
!705 = !DILocation(line: 99, column: 7, scope: !696)
!706 = !DILocation(line: 99, column: 7, scope: !698)
!707 = !DILocation(line: 100, column: 7, scope: !696)
!708 = !DILocation(line: 100, column: 7, scope: !698)
!709 = !DILocation(line: 642, column: 15, scope: !65, inlinedAt: !710)
!710 = distinct !DILocation(line: 112, column: 7, scope: !696)
!711 = !DILocation(line: 651, column: 3, scope: !65, inlinedAt: !710)
!712 = !DILocation(line: 651, column: 3, scope: !713, inlinedAt: !710)
!713 = !DILexicalBlockFile(scope: !65, file: !66, discriminator: 1)
!714 = !DILocation(line: 655, column: 29, scope: !65, inlinedAt: !710)
!715 = !DILocation(line: 655, column: 15, scope: !65, inlinedAt: !710)
!716 = !DILocation(line: 656, column: 7, scope: !85, inlinedAt: !710)
!717 = !DILocation(line: 656, column: 19, scope: !85, inlinedAt: !710)
!718 = !DILocation(line: 656, column: 22, scope: !719, inlinedAt: !710)
!719 = !DILexicalBlockFile(scope: !85, file: !66, discriminator: 16)
!720 = !DILocation(line: 656, column: 7, scope: !721, inlinedAt: !710)
!721 = !DILexicalBlockFile(scope: !65, file: !66, discriminator: 16)
!722 = !DILocation(line: 662, column: 7, scope: !723, inlinedAt: !710)
!723 = distinct !DILexicalBlock(scope: !85, file: !66, line: 657, column: 5)
!724 = !DILocation(line: 662, column: 7, scope: !725, inlinedAt: !710)
!725 = !DILexicalBlockFile(scope: !723, file: !66, discriminator: 1)
!726 = !DILocation(line: 664, column: 5, scope: !723, inlinedAt: !710)
!727 = !DILocation(line: 665, column: 3, scope: !65, inlinedAt: !710)
!728 = !DILocation(line: 665, column: 3, scope: !713, inlinedAt: !710)
!729 = !DILocation(line: 667, column: 3, scope: !65, inlinedAt: !710)
!730 = !DILocation(line: 667, column: 3, scope: !713, inlinedAt: !710)
!731 = !DILocation(line: 114, column: 3, scope: !676)
!732 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 118, type: !733, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !736)
!733 = !DISubroutineType(types: !734)
!734 = !{!46, !46, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!736 = !{!737, !738, !739, !740}
!737 = !DILocalVariable(name: "argc", arg: 1, scope: !732, file: !3, line: 118, type: !46)
!738 = !DILocalVariable(name: "argv", arg: 2, scope: !732, file: !3, line: 118, type: !735)
!739 = !DILocalVariable(name: "ok", scope: !732, file: !3, line: 120, type: !58)
!740 = !DILocalVariable(name: "optc", scope: !732, file: !3, line: 121, type: !46)
!741 = !DILocalVariable(name: "buffer", scope: !742, file: !3, line: 188, type: !818)
!742 = distinct !DISubprogram(name: "tee_files", scope: !3, file: !3, line: 184, type: !743, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{!58, !46, !735}
!745 = !{!746, !747, !748, !749, !741, !804, !808, !809, !810, !811, !817}
!746 = !DILocalVariable(name: "nfiles", arg: 1, scope: !742, file: !3, line: 184, type: !46)
!747 = !DILocalVariable(name: "files", arg: 2, scope: !742, file: !3, line: 184, type: !735)
!748 = !DILocalVariable(name: "n_outputs", scope: !742, file: !3, line: 186, type: !47)
!749 = !DILocalVariable(name: "descriptors", scope: !742, file: !3, line: 187, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !753, line: 49, baseType: !754)
!753 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !755, line: 241, size: 1728, elements: !756)
!755 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !777, !778, !779, !780, !784, !785, !787, !789, !792, !794, !795, !796, !797, !798, !799, !800}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !754, file: !755, line: 242, baseType: !46, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !754, file: !755, line: 247, baseType: !39, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !754, file: !755, line: 248, baseType: !39, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !754, file: !755, line: 249, baseType: !39, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !754, file: !755, line: 250, baseType: !39, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !754, file: !755, line: 251, baseType: !39, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !754, file: !755, line: 252, baseType: !39, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !754, file: !755, line: 253, baseType: !39, size: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !754, file: !755, line: 254, baseType: !39, size: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !754, file: !755, line: 256, baseType: !39, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !754, file: !755, line: 257, baseType: !39, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !754, file: !755, line: 258, baseType: !39, size: 64, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !754, file: !755, line: 260, baseType: !770, size: 64, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !755, line: 156, size: 192, elements: !772)
!772 = !{!773, !774, !776}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !771, file: !755, line: 157, baseType: !770, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !771, file: !755, line: 158, baseType: !775, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !771, file: !755, line: 162, baseType: !46, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !754, file: !755, line: 262, baseType: !775, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !754, file: !755, line: 264, baseType: !46, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !754, file: !755, line: 268, baseType: !46, size: 32, offset: 928)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !754, file: !755, line: 270, baseType: !781, size: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !782, line: 140, baseType: !783)
!782 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!783 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !754, file: !755, line: 274, baseType: !184, size: 16, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !754, file: !755, line: 275, baseType: !786, size: 8, offset: 1040)
!786 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !754, file: !755, line: 276, baseType: !788, size: 8, offset: 1048)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, elements: !259)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !754, file: !755, line: 280, baseType: !790, size: 64, offset: 1088)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !755, line: 150, baseType: null)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !754, file: !755, line: 289, baseType: !793, size: 64, offset: 1152)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !782, line: 141, baseType: !783)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !754, file: !755, line: 297, baseType: !40, size: 64, offset: 1216)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !754, file: !755, line: 298, baseType: !40, size: 64, offset: 1280)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !754, file: !755, line: 299, baseType: !40, size: 64, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !754, file: !755, line: 300, baseType: !40, size: 64, offset: 1408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !754, file: !755, line: 302, baseType: !47, size: 64, offset: 1472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !754, file: !755, line: 303, baseType: !46, size: 32, offset: 1536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !754, file: !755, line: 305, baseType: !801, size: 160, offset: 1568)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 20)
!804 = !DILocalVariable(name: "bytes_read", scope: !742, file: !3, line: 189, type: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !806, line: 109, baseType: !807)
!806 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !782, line: 181, baseType: !783)
!808 = !DILocalVariable(name: "i", scope: !742, file: !3, line: 190, type: !46)
!809 = !DILocalVariable(name: "ok", scope: !742, file: !3, line: 191, type: !58)
!810 = !DILocalVariable(name: "mode_string", scope: !742, file: !3, line: 192, type: !36)
!811 = !DILocalVariable(name: "w_errno", scope: !812, file: !3, line: 243, type: !46)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 242, column: 11)
!813 = distinct !DILexicalBlock(scope: !814, file: !3, line: 240, column: 13)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 239, column: 7)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 239, column: 7)
!816 = distinct !DILexicalBlock(scope: !742, file: !3, line: 230, column: 5)
!817 = !DILocalVariable(name: "fail", scope: !812, file: !3, line: 244, type: !58)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 65536, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 8192)
!821 = !DILocation(line: 188, column: 8, scope: !742, inlinedAt: !822)
!822 = distinct !DILocation(line: 172, column: 8, scope: !732)
!823 = !DILocation(line: 118, column: 11, scope: !732)
!824 = !DILocation(line: 118, column: 24, scope: !732)
!825 = !DILocation(line: 124, column: 21, scope: !732)
!826 = !DILocation(line: 124, column: 3, scope: !732)
!827 = !DILocation(line: 125, column: 3, scope: !732)
!828 = !DILocation(line: 126, column: 3, scope: !732)
!829 = !DILocation(line: 127, column: 3, scope: !732)
!830 = !DILocation(line: 129, column: 3, scope: !732)
!831 = !DILocation(line: 134, column: 3, scope: !732)
!832 = !DILocation(line: 134, column: 18, scope: !833)
!833 = !DILexicalBlockFile(scope: !732, file: !3, discriminator: 1)
!834 = !DILocation(line: 121, column: 7, scope: !732)
!835 = !DILocation(line: 134, column: 3, scope: !833)
!836 = !DILocation(line: 140, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !838, file: !3, line: 137, column: 9)
!838 = distinct !DILexicalBlock(scope: !732, file: !3, line: 135, column: 5)
!839 = !DILocation(line: 144, column: 11, scope: !837)
!840 = !DILocation(line: 147, column: 15, scope: !841)
!841 = distinct !DILexicalBlock(scope: !837, file: !3, line: 147, column: 15)
!842 = !DILocation(line: 147, column: 15, scope: !837)
!843 = !DILocation(line: 148, column: 28, scope: !841)
!844 = !{!689, !689, i64 0}
!845 = !DILocation(line: 148, column: 13, scope: !841)
!846 = !DILocation(line: 152, column: 11, scope: !837)
!847 = distinct !{!847, !831, !848}
!848 = !DILocation(line: 161, column: 5, scope: !732)
!849 = !DILocation(line: 154, column: 9, scope: !837)
!850 = !DILocation(line: 156, column: 9, scope: !837)
!851 = !DILocation(line: 156, column: 9, scope: !852)
!852 = !DILexicalBlockFile(scope: !837, file: !3, discriminator: 1)
!853 = !DILocation(line: 159, column: 11, scope: !837)
!854 = !DILocation(line: 163, column: 7, scope: !732)
!855 = !DILocation(line: 164, column: 5, scope: !856)
!856 = distinct !DILexicalBlock(scope: !732, file: !3, line: 163, column: 7)
!857 = !DILocation(line: 166, column: 7, scope: !858)
!858 = distinct !DILexicalBlock(scope: !732, file: !3, line: 166, column: 7)
!859 = !DILocation(line: 166, column: 20, scope: !858)
!860 = !DILocation(line: 166, column: 7, scope: !732)
!861 = !DILocation(line: 167, column: 5, scope: !858)
!862 = !DILocation(line: 172, column: 26, scope: !732)
!863 = !{!864, !864, i64 0}
!864 = !{!"int", !689, i64 0}
!865 = !DILocation(line: 172, column: 24, scope: !732)
!866 = !DILocation(line: 184, column: 16, scope: !742, inlinedAt: !822)
!867 = !DILocation(line: 184, column: 31, scope: !742, inlinedAt: !822)
!868 = !DILocation(line: 186, column: 10, scope: !742, inlinedAt: !822)
!869 = !DILocation(line: 188, column: 3, scope: !742, inlinedAt: !822)
!870 = !DILocation(line: 189, column: 11, scope: !742, inlinedAt: !822)
!871 = !DILocation(line: 191, column: 8, scope: !742, inlinedAt: !822)
!872 = !DILocation(line: 195, column: 9, scope: !742, inlinedAt: !822)
!873 = !DILocation(line: 192, column: 15, scope: !742, inlinedAt: !822)
!874 = !DILocation(line: 199, column: 12, scope: !742, inlinedAt: !822)
!875 = !DILocation(line: 199, column: 3, scope: !742, inlinedAt: !822)
!876 = !DILocalVariable(name: "s", arg: 2, scope: !877, file: !640, line: 105, type: !47)
!877 = distinct !DISubprogram(name: "xnmalloc", scope: !640, file: !640, line: 105, type: !878, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{!40, !47, !47}
!880 = !{!881, !876}
!881 = !DILocalVariable(name: "n", arg: 1, scope: !877, file: !640, line: 105, type: !47)
!882 = !DILocation(line: 105, column: 28, scope: !877, inlinedAt: !883)
!883 = distinct !DILocation(line: 204, column: 17, scope: !742, inlinedAt: !822)
!884 = !DILocation(line: 107, column: 7, scope: !885, inlinedAt: !883)
!885 = distinct !DILexicalBlock(scope: !877, file: !640, line: 107, column: 7)
!886 = !DILocation(line: 107, column: 7, scope: !877, inlinedAt: !883)
!887 = !DILocation(line: 108, column: 5, scope: !885, inlinedAt: !883)
!888 = !DILocation(line: 172, column: 35, scope: !732)
!889 = !DILocation(line: 204, column: 34, scope: !742, inlinedAt: !822)
!890 = !DILocation(line: 204, column: 27, scope: !742, inlinedAt: !822)
!891 = !DILocation(line: 109, column: 21, scope: !877, inlinedAt: !883)
!892 = !DILocation(line: 109, column: 10, scope: !877, inlinedAt: !883)
!893 = !DILocation(line: 204, column: 17, scope: !742, inlinedAt: !822)
!894 = !DILocation(line: 187, column: 10, scope: !742, inlinedAt: !822)
!895 = !DILocation(line: 205, column: 8, scope: !742, inlinedAt: !822)
!896 = !DILocation(line: 206, column: 20, scope: !742, inlinedAt: !822)
!897 = !DILocation(line: 206, column: 18, scope: !742, inlinedAt: !822)
!898 = !DILocation(line: 207, column: 24, scope: !742, inlinedAt: !822)
!899 = !DILocation(line: 207, column: 12, scope: !742, inlinedAt: !822)
!900 = !DILocation(line: 208, column: 12, scope: !742, inlinedAt: !822)
!901 = !DILocation(line: 208, column: 3, scope: !742, inlinedAt: !822)
!902 = !DILocation(line: 190, column: 7, scope: !742, inlinedAt: !822)
!903 = !DILocation(line: 211, column: 17, scope: !904, inlinedAt: !822)
!904 = !DILexicalBlockFile(scope: !905, file: !3, discriminator: 1)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 211, column: 3)
!906 = distinct !DILexicalBlock(scope: !742, file: !3, line: 211, column: 3)
!907 = !DILocation(line: 211, column: 3, scope: !908, inlinedAt: !822)
!908 = !DILexicalBlockFile(scope: !906, file: !3, discriminator: 1)
!909 = !DILocation(line: 214, column: 31, scope: !910, inlinedAt: !822)
!910 = distinct !DILexicalBlock(scope: !905, file: !3, line: 212, column: 5)
!911 = !DILocation(line: 214, column: 24, scope: !910, inlinedAt: !822)
!912 = !DILocation(line: 214, column: 7, scope: !910, inlinedAt: !822)
!913 = !DILocation(line: 214, column: 22, scope: !910, inlinedAt: !822)
!914 = !DILocation(line: 215, column: 26, scope: !915, inlinedAt: !822)
!915 = distinct !DILexicalBlock(scope: !910, file: !3, line: 215, column: 11)
!916 = !DILocation(line: 215, column: 11, scope: !910, inlinedAt: !822)
!917 = !DILocation(line: 217, column: 18, scope: !918, inlinedAt: !822)
!918 = distinct !DILexicalBlock(scope: !915, file: !3, line: 216, column: 9)
!919 = !DILocation(line: 218, column: 18, scope: !918, inlinedAt: !822)
!920 = !DILocation(line: 218, column: 18, scope: !921, inlinedAt: !822)
!921 = !DILexicalBlockFile(scope: !918, file: !3, discriminator: 2)
!922 = !DILocation(line: 219, column: 18, scope: !918, inlinedAt: !822)
!923 = !DILocation(line: 219, column: 31, scope: !918, inlinedAt: !822)
!924 = !DILocation(line: 219, column: 31, scope: !925, inlinedAt: !822)
!925 = !DILexicalBlockFile(scope: !918, file: !3, discriminator: 1)
!926 = !DILocation(line: 217, column: 11, scope: !925, inlinedAt: !822)
!927 = !DILocation(line: 221, column: 9, scope: !918, inlinedAt: !822)
!928 = !DILocation(line: 224, column: 11, scope: !929, inlinedAt: !822)
!929 = distinct !DILexicalBlock(scope: !915, file: !3, line: 223, column: 9)
!930 = !DILocation(line: 225, column: 20, scope: !929, inlinedAt: !822)
!931 = !DILocation(line: 211, column: 29, scope: !932, inlinedAt: !822)
!932 = !DILexicalBlockFile(scope: !905, file: !3, discriminator: 2)
!933 = distinct !{!933, !934, !935}
!934 = !DILocation(line: 211, column: 3, scope: !906)
!935 = !DILocation(line: 227, column: 5, scope: !906)
!936 = !DILocation(line: 229, column: 3, scope: !937, inlinedAt: !822)
!937 = !DILexicalBlockFile(scope: !742, file: !3, discriminator: 1)
!938 = !DILocation(line: 231, column: 20, scope: !816, inlinedAt: !822)
!939 = !DILocation(line: 232, column: 22, scope: !940, inlinedAt: !822)
!940 = distinct !DILexicalBlock(scope: !816, file: !3, line: 232, column: 11)
!941 = !DILocation(line: 232, column: 26, scope: !940, inlinedAt: !822)
!942 = !DILocation(line: 232, column: 29, scope: !943, inlinedAt: !822)
!943 = !DILexicalBlockFile(scope: !940, file: !3, discriminator: 1)
!944 = !DILocation(line: 232, column: 11, scope: !945, inlinedAt: !822)
!945 = !DILexicalBlockFile(scope: !816, file: !3, discriminator: 1)
!946 = distinct !{!946, !947, !948}
!947 = !DILocation(line: 229, column: 3, scope: !742)
!948 = !DILocation(line: 259, column: 5, scope: !742)
!949 = !DILocation(line: 234, column: 22, scope: !950, inlinedAt: !822)
!950 = distinct !DILexicalBlock(scope: !816, file: !3, line: 234, column: 11)
!951 = !DILocation(line: 234, column: 11, scope: !816, inlinedAt: !822)
!952 = !DILocation(line: 239, column: 7, scope: !953, inlinedAt: !822)
!953 = !DILexicalBlockFile(scope: !815, file: !3, discriminator: 1)
!954 = !DILocation(line: 240, column: 13, scope: !813, inlinedAt: !822)
!955 = !DILocation(line: 241, column: 13, scope: !813, inlinedAt: !822)
!956 = !DILocation(line: 241, column: 16, scope: !957, inlinedAt: !822)
!957 = !DILexicalBlockFile(scope: !813, file: !3, discriminator: 1)
!958 = !DILocation(line: 241, column: 63, scope: !957, inlinedAt: !822)
!959 = !DILocation(line: 240, column: 13, scope: !960, inlinedAt: !822)
!960 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 1)
!961 = !DILocation(line: 243, column: 27, scope: !812, inlinedAt: !822)
!962 = !DILocation(line: 243, column: 17, scope: !812, inlinedAt: !822)
!963 = !DILocation(line: 244, column: 31, scope: !812, inlinedAt: !822)
!964 = !DILocation(line: 244, column: 40, scope: !812, inlinedAt: !822)
!965 = !DILocation(line: 244, column: 44, scope: !966, inlinedAt: !822)
!966 = !DILexicalBlockFile(scope: !812, file: !3, discriminator: 1)
!967 = !DILocation(line: 245, column: 43, scope: !812, inlinedAt: !822)
!968 = !DILocation(line: 246, column: 35, scope: !969, inlinedAt: !822)
!969 = distinct !DILexicalBlock(scope: !812, file: !3, line: 246, column: 17)
!970 = !DILocation(line: 246, column: 32, scope: !969, inlinedAt: !822)
!971 = !DILocation(line: 246, column: 17, scope: !812, inlinedAt: !822)
!972 = !DILocation(line: 247, column: 15, scope: !969, inlinedAt: !822)
!973 = !DILocation(line: 248, column: 17, scope: !812, inlinedAt: !822)
!974 = !DILocation(line: 250, column: 24, scope: !975, inlinedAt: !822)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 249, column: 15)
!976 = distinct !DILexicalBlock(scope: !812, file: !3, line: 248, column: 17)
!977 = !DILocation(line: 251, column: 24, scope: !975, inlinedAt: !822)
!978 = !DILocation(line: 251, column: 24, scope: !979, inlinedAt: !822)
!979 = !DILexicalBlockFile(scope: !975, file: !3, discriminator: 2)
!980 = !DILocation(line: 252, column: 39, scope: !975, inlinedAt: !822)
!981 = !DILocation(line: 250, column: 17, scope: !982, inlinedAt: !822)
!982 = !DILexicalBlockFile(scope: !975, file: !3, discriminator: 1)
!983 = !DILocation(line: 253, column: 15, scope: !975, inlinedAt: !822)
!984 = !DILocation(line: 254, column: 28, scope: !812, inlinedAt: !822)
!985 = !DILocation(line: 255, column: 17, scope: !812, inlinedAt: !822)
!986 = !DILocation(line: 257, column: 22, scope: !812, inlinedAt: !822)
!987 = !DILocation(line: 258, column: 11, scope: !812, inlinedAt: !822)
!988 = !DILocation(line: 239, column: 33, scope: !989, inlinedAt: !822)
!989 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 2)
!990 = !DILocation(line: 239, column: 21, scope: !960, inlinedAt: !822)
!991 = distinct !{!991, !992, !993}
!992 = !DILocation(line: 239, column: 7, scope: !815)
!993 = !DILocation(line: 258, column: 11, scope: !815)
!994 = !DILocation(line: 261, column: 18, scope: !995, inlinedAt: !822)
!995 = distinct !DILexicalBlock(scope: !742, file: !3, line: 261, column: 7)
!996 = !DILocation(line: 261, column: 7, scope: !742, inlinedAt: !822)
!997 = !DILocation(line: 263, column: 17, scope: !998, inlinedAt: !822)
!998 = distinct !DILexicalBlock(scope: !995, file: !3, line: 262, column: 5)
!999 = !DILocation(line: 263, column: 24, scope: !1000, inlinedAt: !822)
!1000 = !DILexicalBlockFile(scope: !998, file: !3, discriminator: 1)
!1001 = !DILocation(line: 263, column: 7, scope: !1002, inlinedAt: !822)
!1002 = !DILexicalBlockFile(scope: !998, file: !3, discriminator: 2)
!1003 = !DILocation(line: 265, column: 5, scope: !998, inlinedAt: !822)
!1004 = !DILocation(line: 268, column: 3, scope: !1005, inlinedAt: !822)
!1005 = !DILexicalBlockFile(scope: !1006, file: !3, discriminator: 1)
!1006 = distinct !DILexicalBlock(scope: !742, file: !3, line: 268, column: 3)
!1007 = !DILocation(line: 269, column: 9, scope: !1008, inlinedAt: !822)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 269, column: 9)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 268, column: 3)
!1010 = !DILocation(line: 269, column: 24, scope: !1008, inlinedAt: !822)
!1011 = !DILocation(line: 269, column: 27, scope: !1012, inlinedAt: !822)
!1012 = !DILexicalBlockFile(scope: !1008, file: !3, discriminator: 1)
!1013 = !DILocation(line: 269, column: 51, scope: !1012, inlinedAt: !822)
!1014 = !DILocation(line: 269, column: 9, scope: !1015, inlinedAt: !822)
!1015 = !DILexicalBlockFile(scope: !1009, file: !3, discriminator: 1)
!1016 = !DILocation(line: 271, column: 19, scope: !1017, inlinedAt: !822)
!1017 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 270, column: 7)
!1018 = !DILocation(line: 271, column: 32, scope: !1017, inlinedAt: !822)
!1019 = !DILocation(line: 271, column: 32, scope: !1020, inlinedAt: !822)
!1020 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 1)
!1021 = !DILocation(line: 271, column: 9, scope: !1022, inlinedAt: !822)
!1022 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 2)
!1023 = !DILocation(line: 273, column: 7, scope: !1017, inlinedAt: !822)
!1024 = !DILocation(line: 268, column: 29, scope: !1025, inlinedAt: !822)
!1025 = !DILexicalBlockFile(scope: !1009, file: !3, discriminator: 2)
!1026 = !DILocation(line: 268, column: 17, scope: !1015, inlinedAt: !822)
!1027 = distinct !{!1027, !1028, !1029}
!1028 = !DILocation(line: 268, column: 3, scope: !1006)
!1029 = !DILocation(line: 273, column: 7, scope: !1006)
!1030 = !DILocation(line: 275, column: 3, scope: !742, inlinedAt: !822)
!1031 = !DILocation(line: 278, column: 1, scope: !742, inlinedAt: !822)
!1032 = !DILocation(line: 173, column: 7, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !732, file: !3, line: 173, column: 7)
!1034 = !DILocation(line: 173, column: 28, scope: !1033)
!1035 = !DILocation(line: 173, column: 7, scope: !732)
!1036 = !DILocation(line: 174, column: 5, scope: !1033)
!1037 = !DILocation(line: 174, column: 5, scope: !1038)
!1038 = !DILexicalBlockFile(scope: !1033, file: !3, discriminator: 1)
!1039 = !DILocation(line: 174, column: 5, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1033, file: !3, discriminator: 2)
!1041 = !DILocation(line: 277, column: 10, scope: !742, inlinedAt: !822)
!1042 = !DILocation(line: 176, column: 10, scope: !732)
!1043 = !DILocation(line: 177, column: 1, scope: !732)
!1044 = distinct !DISubprogram(name: "__argmatch_die", scope: !130, file: !130, line: 62, type: !134, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !121)
!1045 = !DILocation(line: 64, column: 3, scope: !1044)
!1046 = !DILocation(line: 65, column: 1, scope: !1044)
!1047 = distinct !DISubprogram(name: "argmatch", scope: !130, file: !130, line: 84, type: !1048, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !1052)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !36, !1051, !36, !47}
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !48, line: 51, baseType: !783)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!1052 = !{!1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1067}
!1053 = !DILocalVariable(name: "arg", arg: 1, scope: !1047, file: !130, line: 84, type: !36)
!1054 = !DILocalVariable(name: "arglist", arg: 2, scope: !1047, file: !130, line: 84, type: !1051)
!1055 = !DILocalVariable(name: "vallist", arg: 3, scope: !1047, file: !130, line: 85, type: !36)
!1056 = !DILocalVariable(name: "valsize", arg: 4, scope: !1047, file: !130, line: 85, type: !47)
!1057 = !DILocalVariable(name: "i", scope: !1047, file: !130, line: 87, type: !47)
!1058 = !DILocalVariable(name: "arglen", scope: !1047, file: !130, line: 88, type: !47)
!1059 = !DILocalVariable(name: "matchind", scope: !1047, file: !130, line: 89, type: !1050)
!1060 = !DILocalVariable(name: "ambiguous", scope: !1047, file: !130, line: 90, type: !58)
!1061 = !DILocalVariable(name: "__s1_len", scope: !1062, file: !130, line: 97, type: !47)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !130, line: 97, column: 12)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !130, line: 97, column: 11)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !130, line: 96, column: 5)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !130, line: 95, column: 3)
!1066 = distinct !DILexicalBlock(scope: !1047, file: !130, line: 95, column: 3)
!1067 = !DILocalVariable(name: "__s2_len", scope: !1062, file: !130, line: 97, type: !47)
!1068 = !DILocation(line: 84, column: 23, scope: !1047)
!1069 = !DILocation(line: 84, column: 47, scope: !1047)
!1070 = !DILocation(line: 85, column: 23, scope: !1047)
!1071 = !DILocation(line: 85, column: 39, scope: !1047)
!1072 = !DILocation(line: 89, column: 13, scope: !1047)
!1073 = !DILocation(line: 90, column: 8, scope: !1047)
!1074 = !DILocation(line: 92, column: 12, scope: !1047)
!1075 = !DILocation(line: 88, column: 10, scope: !1047)
!1076 = !DILocation(line: 87, column: 10, scope: !1047)
!1077 = !DILocation(line: 95, column: 15, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1065, file: !130, discriminator: 1)
!1079 = !DILocation(line: 95, column: 3, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1066, file: !130, discriminator: 1)
!1081 = !DILocation(line: 97, column: 12, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1063, file: !130, discriminator: 4)
!1083 = !DILocation(line: 97, column: 11, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1064, file: !130, discriminator: 4)
!1085 = !DILocation(line: 99, column: 15, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !130, line: 99, column: 15)
!1087 = distinct !DILexicalBlock(scope: !1063, file: !130, line: 98, column: 9)
!1088 = !DILocation(line: 99, column: 35, scope: !1086)
!1089 = !DILocation(line: 99, column: 15, scope: !1087)
!1090 = !DILocation(line: 102, column: 29, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !130, line: 102, column: 20)
!1092 = !DILocation(line: 102, column: 20, scope: !1086)
!1093 = !DILocation(line: 109, column: 19, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !130, line: 108, column: 19)
!1095 = distinct !DILexicalBlock(scope: !1091, file: !130, line: 106, column: 13)
!1096 = !DILocation(line: 109, column: 48, scope: !1097)
!1097 = !DILexicalBlockFile(scope: !1094, file: !130, discriminator: 1)
!1098 = !DILocation(line: 109, column: 38, scope: !1097)
!1099 = !DILocation(line: 110, column: 48, scope: !1094)
!1100 = !DILocation(line: 110, column: 38, scope: !1094)
!1101 = !DILocation(line: 109, column: 22, scope: !1097)
!1102 = !DILocation(line: 108, column: 19, scope: !1103)
!1103 = !DILexicalBlockFile(scope: !1095, file: !130, discriminator: 1)
!1104 = !DILocation(line: 115, column: 17, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1094, file: !130, line: 111, column: 17)
!1106 = !DILocation(line: 95, column: 28, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1065, file: !130, discriminator: 2)
!1108 = distinct !{!1108, !1109, !1110}
!1109 = !DILocation(line: 95, column: 3, scope: !1066)
!1110 = !DILocation(line: 118, column: 5, scope: !1066)
!1111 = !DILocation(line: 119, column: 7, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1047, file: !130, line: 119, column: 7)
!1113 = !DILocation(line: 122, column: 5, scope: !1112)
!1114 = !DILocation(line: 123, column: 1, scope: !1047)
!1115 = distinct !DISubprogram(name: "argmatch_invalid", scope: !130, file: !130, line: 131, type: !1116, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !1118)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !36, !36, !1050}
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DILocalVariable(name: "context", arg: 1, scope: !1115, file: !130, line: 131, type: !36)
!1120 = !DILocalVariable(name: "value", arg: 2, scope: !1115, file: !130, line: 131, type: !36)
!1121 = !DILocalVariable(name: "problem", arg: 3, scope: !1115, file: !130, line: 131, type: !1050)
!1122 = !DILocalVariable(name: "format", scope: !1115, file: !130, line: 133, type: !36)
!1123 = !DILocation(line: 131, column: 31, scope: !1115)
!1124 = !DILocation(line: 131, column: 52, scope: !1115)
!1125 = !DILocation(line: 131, column: 69, scope: !1115)
!1126 = !DILocation(line: 133, column: 33, scope: !1115)
!1127 = !DILocation(line: 133, column: 25, scope: !1115)
!1128 = !DILocation(line: 135, column: 27, scope: !1115)
!1129 = !DILocation(line: 133, column: 15, scope: !1115)
!1130 = !DILocation(line: 137, column: 24, scope: !1115)
!1131 = !DILocation(line: 138, column: 10, scope: !1115)
!1132 = !DILocation(line: 137, column: 3, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1115, file: !130, discriminator: 1)
!1134 = !DILocation(line: 139, column: 1, scope: !1115)
!1135 = distinct !DISubprogram(name: "argmatch_valid", scope: !130, file: !130, line: 146, type: !1136, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !1138)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !1051, !36, !47}
!1138 = !{!1139, !1140, !1141, !1142, !1143}
!1139 = !DILocalVariable(name: "arglist", arg: 1, scope: !1135, file: !130, line: 146, type: !1051)
!1140 = !DILocalVariable(name: "vallist", arg: 2, scope: !1135, file: !130, line: 147, type: !36)
!1141 = !DILocalVariable(name: "valsize", arg: 3, scope: !1135, file: !130, line: 147, type: !47)
!1142 = !DILocalVariable(name: "i", scope: !1135, file: !130, line: 149, type: !47)
!1143 = !DILocalVariable(name: "last_val", scope: !1135, file: !130, line: 150, type: !36)
!1144 = !DILocation(line: 146, column: 36, scope: !1135)
!1145 = !DILocation(line: 147, column: 29, scope: !1135)
!1146 = !DILocation(line: 147, column: 45, scope: !1135)
!1147 = !DILocation(line: 150, column: 15, scope: !1135)
!1148 = !DILocation(line: 154, column: 3, scope: !1135)
!1149 = !DILocation(line: 154, column: 3, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1135, file: !130, discriminator: 1)
!1151 = !DILocation(line: 149, column: 10, scope: !1135)
!1152 = !DILocation(line: 155, column: 15, scope: !1153)
!1153 = !DILexicalBlockFile(scope: !1154, file: !130, discriminator: 1)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !130, line: 155, column: 3)
!1155 = distinct !DILexicalBlock(scope: !1135, file: !130, line: 155, column: 3)
!1156 = !DILocation(line: 155, column: 3, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1155, file: !130, discriminator: 1)
!1158 = !DILocation(line: 156, column: 12, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1154, file: !130, line: 156, column: 9)
!1160 = !DILocation(line: 159, column: 9, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1159, file: !130, line: 158, column: 7)
!1162 = !DILocation(line: 157, column: 9, scope: !1159)
!1163 = !DILocation(line: 157, column: 12, scope: !1164)
!1164 = !DILexicalBlockFile(scope: !1159, file: !130, discriminator: 1)
!1165 = !DILocation(line: 156, column: 9, scope: !1153)
!1166 = !DILocation(line: 159, column: 9, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1161, file: !130, discriminator: 1)
!1168 = !DILocation(line: 161, column: 7, scope: !1161)
!1169 = !DILocation(line: 164, column: 9, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1159, file: !130, line: 163, column: 7)
!1171 = !DILocation(line: 164, column: 9, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1170, file: !130, discriminator: 1)
!1173 = !DILocation(line: 155, column: 28, scope: !1174)
!1174 = !DILexicalBlockFile(scope: !1154, file: !130, discriminator: 2)
!1175 = distinct !{!1175, !1176, !1177}
!1176 = !DILocation(line: 155, column: 3, scope: !1155)
!1177 = !DILocation(line: 165, column: 7, scope: !1155)
!1178 = !DILocation(line: 166, column: 3, scope: !1135)
!1179 = !DILocalVariable(name: "__c", arg: 1, scope: !1180, file: !1181, line: 98, type: !46)
!1180 = distinct !DISubprogram(name: "putc_unlocked", scope: !1181, file: !1181, line: 98, type: !1182, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !1224)
!1181 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!46, !46, !1184}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !753, line: 49, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !755, line: 241, size: 1728, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1186, file: !755, line: 242, baseType: !46, size: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1186, file: !755, line: 247, baseType: !39, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1186, file: !755, line: 248, baseType: !39, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1186, file: !755, line: 249, baseType: !39, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1186, file: !755, line: 250, baseType: !39, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1186, file: !755, line: 251, baseType: !39, size: 64, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1186, file: !755, line: 252, baseType: !39, size: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1186, file: !755, line: 253, baseType: !39, size: 64, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1186, file: !755, line: 254, baseType: !39, size: 64, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1186, file: !755, line: 256, baseType: !39, size: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1186, file: !755, line: 257, baseType: !39, size: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1186, file: !755, line: 258, baseType: !39, size: 64, offset: 704)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1186, file: !755, line: 260, baseType: !1201, size: 64, offset: 768)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !755, line: 156, size: 192, elements: !1203)
!1203 = !{!1204, !1205, !1207}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1202, file: !755, line: 157, baseType: !1201, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1202, file: !755, line: 158, baseType: !1206, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1202, file: !755, line: 162, baseType: !46, size: 32, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1186, file: !755, line: 262, baseType: !1206, size: 64, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1186, file: !755, line: 264, baseType: !46, size: 32, offset: 896)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1186, file: !755, line: 268, baseType: !46, size: 32, offset: 928)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1186, file: !755, line: 270, baseType: !781, size: 64, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1186, file: !755, line: 274, baseType: !184, size: 16, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1186, file: !755, line: 275, baseType: !786, size: 8, offset: 1040)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1186, file: !755, line: 276, baseType: !788, size: 8, offset: 1048)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1186, file: !755, line: 280, baseType: !790, size: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1186, file: !755, line: 289, baseType: !793, size: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1186, file: !755, line: 297, baseType: !40, size: 64, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1186, file: !755, line: 298, baseType: !40, size: 64, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1186, file: !755, line: 299, baseType: !40, size: 64, offset: 1344)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1186, file: !755, line: 300, baseType: !40, size: 64, offset: 1408)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1186, file: !755, line: 302, baseType: !47, size: 64, offset: 1472)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1186, file: !755, line: 303, baseType: !46, size: 32, offset: 1536)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1186, file: !755, line: 305, baseType: !801, size: 160, offset: 1568)
!1224 = !{!1179, !1225}
!1225 = !DILocalVariable(name: "__stream", arg: 2, scope: !1180, file: !1181, line: 98, type: !1184)
!1226 = !DILocation(line: 98, column: 20, scope: !1180, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 166, column: 3, scope: !1135)
!1228 = !DILocation(line: 98, column: 31, scope: !1180, inlinedAt: !1227)
!1229 = !DILocation(line: 100, column: 10, scope: !1180, inlinedAt: !1227)
!1230 = !{!1231, !688, i64 40}
!1231 = !{!"_IO_FILE", !864, i64 0, !688, i64 8, !688, i64 16, !688, i64 24, !688, i64 32, !688, i64 40, !688, i64 48, !688, i64 56, !688, i64 64, !688, i64 72, !688, i64 80, !688, i64 88, !688, i64 96, !688, i64 104, !864, i64 112, !864, i64 116, !1232, i64 120, !1233, i64 128, !689, i64 130, !689, i64 131, !688, i64 136, !1232, i64 144, !688, i64 152, !688, i64 160, !688, i64 168, !688, i64 176, !1232, i64 184, !864, i64 192, !689, i64 196}
!1232 = !{!"long", !689, i64 0}
!1233 = !{!"short", !689, i64 0}
!1234 = !{!1231, !688, i64 48}
!1235 = !{!"branch_weights", i32 2000, i32 1}
!1236 = !DILocation(line: 100, column: 10, scope: !1237, inlinedAt: !1227)
!1237 = !DILexicalBlockFile(scope: !1180, file: !1181, discriminator: 1)
!1238 = !DILocation(line: 100, column: 10, scope: !1239, inlinedAt: !1227)
!1239 = !DILexicalBlockFile(scope: !1180, file: !1181, discriminator: 2)
!1240 = !DILocation(line: 167, column: 1, scope: !1135)
!1241 = distinct !DISubprogram(name: "__xargmatch_internal", scope: !130, file: !130, line: 176, type: !1242, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !1244)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!1050, !36, !36, !1051, !36, !47, !131}
!1244 = !{!1245, !1246, !1247, !1248, !1249, !1250, !1251}
!1245 = !DILocalVariable(name: "context", arg: 1, scope: !1241, file: !130, line: 176, type: !36)
!1246 = !DILocalVariable(name: "arg", arg: 2, scope: !1241, file: !130, line: 177, type: !36)
!1247 = !DILocalVariable(name: "arglist", arg: 3, scope: !1241, file: !130, line: 177, type: !1051)
!1248 = !DILocalVariable(name: "vallist", arg: 4, scope: !1241, file: !130, line: 178, type: !36)
!1249 = !DILocalVariable(name: "valsize", arg: 5, scope: !1241, file: !130, line: 178, type: !47)
!1250 = !DILocalVariable(name: "exit_fn", arg: 6, scope: !1241, file: !130, line: 179, type: !131)
!1251 = !DILocalVariable(name: "res", scope: !1241, file: !130, line: 181, type: !1050)
!1252 = !DILocation(line: 176, column: 35, scope: !1241)
!1253 = !DILocation(line: 177, column: 35, scope: !1241)
!1254 = !DILocation(line: 177, column: 59, scope: !1241)
!1255 = !DILocation(line: 178, column: 35, scope: !1241)
!1256 = !DILocation(line: 178, column: 51, scope: !1241)
!1257 = !DILocation(line: 179, column: 40, scope: !1241)
!1258 = !DILocation(line: 181, column: 19, scope: !1241)
!1259 = !DILocation(line: 181, column: 13, scope: !1241)
!1260 = !DILocation(line: 182, column: 11, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1241, file: !130, line: 182, column: 7)
!1262 = !DILocation(line: 182, column: 7, scope: !1241)
!1263 = !DILocation(line: 131, column: 31, scope: !1115, inlinedAt: !1264)
!1264 = distinct !DILocation(line: 187, column: 3, scope: !1241)
!1265 = !DILocation(line: 131, column: 52, scope: !1115, inlinedAt: !1264)
!1266 = !DILocation(line: 131, column: 69, scope: !1115, inlinedAt: !1264)
!1267 = !DILocation(line: 133, column: 33, scope: !1115, inlinedAt: !1264)
!1268 = !DILocation(line: 133, column: 25, scope: !1115, inlinedAt: !1264)
!1269 = !DILocation(line: 135, column: 27, scope: !1115, inlinedAt: !1264)
!1270 = !DILocation(line: 133, column: 15, scope: !1115, inlinedAt: !1264)
!1271 = !DILocation(line: 137, column: 24, scope: !1115, inlinedAt: !1264)
!1272 = !DILocation(line: 138, column: 10, scope: !1115, inlinedAt: !1264)
!1273 = !DILocation(line: 137, column: 3, scope: !1133, inlinedAt: !1264)
!1274 = !DILocation(line: 188, column: 3, scope: !1241)
!1275 = !DILocation(line: 189, column: 3, scope: !1241)
!1276 = !DILocation(line: 191, column: 3, scope: !1241)
!1277 = !DILocation(line: 192, column: 1, scope: !1241)
