!llvm.dbg.cu = !{!2, !87, !235, !241, !249, !670, !256, !263, !673, !316, !681, !692, !694, !696, !698, !700, !702, !704, !707, !709, !325}
!llvm.ident = !{!712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712, !712}
!llvm.module.flags = !{!713, !714, !715, !716}
!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 61, type: !73, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !42)
!3 = !DIFile(filename: "src/unexpand.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!8 = !DIEnumerator(name: "_ISupper", value: 256)
!9 = !DIEnumerator(name: "_ISlower", value: 512)
!10 = !DIEnumerator(name: "_ISalpha", value: 1024)
!11 = !DIEnumerator(name: "_ISdigit", value: 2048)
!12 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!13 = !DIEnumerator(name: "_ISspace", value: 8192)
!14 = !DIEnumerator(name: "_ISprint", value: 16384)
!15 = !DIEnumerator(name: "_ISgraph", value: 32768)
!16 = !DIEnumerator(name: "_ISblank", value: 1)
!17 = !DIEnumerator(name: "_IScntrl", value: 2)
!18 = !DIEnumerator(name: "_ISpunct", value: 4)
!19 = !DIEnumerator(name: "_ISalnum", value: 8)
!20 = !{!21, !23, !24, !25, !30, !32, !34, !37, !39, !40, !41, !36}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !26, line: 136, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !28, line: 62, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 62, baseType: !29)
!31 = !DIFile(filename: "/usr/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!42 = !{!43, !0}
!43 = !DIGlobalVariableExpression(var: !44)
!44 = distinct !DIGlobalVariable(name: "infomap", scope: !45, file: !46, line: 632, type: !70, isLocal: true, isDefinition: true)
!45 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !46, file: !46, line: 630, type: !47, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !49)
!46 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!47 = !DISubroutineType(types: !48)
!48 = !{null, !37}
!49 = !{!50, !51, !52, !59, !61, !62, !63, !66, !67, !69}
!50 = !DILocalVariable(name: "program", arg: 1, scope: !45, file: !46, line: 630, type: !37)
!51 = !DILocalVariable(name: "node", scope: !45, file: !46, line: 642, type: !37)
!52 = !DILocalVariable(name: "map_prog", scope: !45, file: !46, line: 643, type: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !45, file: !46, line: 632, size: 128, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !55, file: !46, line: 632, baseType: !37, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !55, file: !46, line: 632, baseType: !37, size: 64, offset: 64)
!59 = !DILocalVariable(name: "__s1_len", scope: !60, file: !46, line: 645, type: !30)
!60 = distinct !DILexicalBlock(scope: !45, file: !46, line: 645, column: 33)
!61 = !DILocalVariable(name: "__s2_len", scope: !60, file: !46, line: 645, type: !30)
!62 = !DILocalVariable(name: "lc_messages", scope: !45, file: !46, line: 655, type: !37)
!63 = !DILocalVariable(name: "__s1_len", scope: !64, file: !46, line: 656, type: !30)
!64 = distinct !DILexicalBlock(scope: !65, file: !46, line: 656, column: 22)
!65 = distinct !DILexicalBlock(scope: !45, file: !46, line: 656, column: 7)
!66 = !DILocalVariable(name: "__s2_len", scope: !64, file: !46, line: 656, type: !30)
!67 = !DILocalVariable(name: "__s2", scope: !68, file: !46, line: 656, type: !34)
!68 = distinct !DILexicalBlock(scope: !64, file: !46, line: 656, column: 22)
!69 = !DILocalVariable(name: "__result", scope: !68, file: !46, line: 656, type: !39)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 896, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 7)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1536, elements: !83)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !76, line: 104, size: 256, elements: !77)
!76 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!77 = !{!78, !79, !80, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !76, line: 106, baseType: !37, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !75, file: !76, line: 109, baseType: !39, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !75, file: !76, line: 110, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !75, file: !76, line: 111, baseType: !39, size: 32, offset: 192)
!83 = !{!84}
!84 = !DISubrange(count: 6)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !87, file: !88, line: 32, type: !224, isDefinition: true)
!87 = distinct !DICompileUnit(language: DW_LANG_C99, file: !88, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !89, retainedTypes: !126, globals: !128)
!88 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!89 = !{!5, !90, !104, !113}
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !91, line: 32, size: 32, elements: !92)
!91 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!93 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!94 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!95 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!96 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!97 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!98 = !DIEnumerator(name: "c_quoting_style", value: 5)
!99 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!100 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!101 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!102 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!103 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 45, size: 32, elements: !106)
!105 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !{!107, !108, !109, !110, !111, !112}
!107 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!108 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!109 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!110 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!111 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!112 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !115, file: !114, line: 192, size: 32, elements: !124)
!114 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!115 = distinct !DISubprogram(name: "x2nrealloc", scope: !114, file: !114, line: 180, type: !116, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !119)
!116 = !DISubroutineType(types: !117)
!117 = !{!23, !23, !118, !30}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(name: "p", arg: 1, scope: !115, file: !114, line: 180, type: !23)
!121 = !DILocalVariable(name: "pn", arg: 2, scope: !115, file: !114, line: 180, type: !118)
!122 = !DILocalVariable(name: "s", arg: 3, scope: !115, file: !114, line: 180, type: !30)
!123 = !DILocalVariable(name: "n", scope: !115, file: !114, line: 182, type: !30)
!124 = !{!125}
!125 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!126 = !{!39, !40, !127, !24, !23, !25, !30, !32, !34, !37}
!127 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!128 = !{!85, !129, !131, !210, !212, !214, !216, !218, !220, !222, !225, !230}
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "exit_status", scope: !87, file: !88, line: 68, type: !39, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "prev_file", scope: !133, file: !88, line: 280, type: !21, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "next_file", scope: !88, file: !88, line: 278, type: !134, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !190)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !138, line: 49, baseType: !139)
!138 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !140, line: 241, size: 1728, elements: !141)
!140 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !162, !163, !164, !165, !168, !169, !171, !175, !178, !180, !181, !182, !183, !184, !185, !186}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !139, file: !140, line: 242, baseType: !39, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !139, file: !140, line: 247, baseType: !21, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !139, file: !140, line: 248, baseType: !21, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !139, file: !140, line: 249, baseType: !21, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !139, file: !140, line: 250, baseType: !21, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !139, file: !140, line: 251, baseType: !21, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !139, file: !140, line: 252, baseType: !21, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !139, file: !140, line: 253, baseType: !21, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !139, file: !140, line: 254, baseType: !21, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !139, file: !140, line: 256, baseType: !21, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !139, file: !140, line: 257, baseType: !21, size: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !139, file: !140, line: 258, baseType: !21, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !139, file: !140, line: 260, baseType: !155, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !140, line: 156, size: 192, elements: !157)
!157 = !{!158, !159, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !156, file: !140, line: 157, baseType: !155, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !156, file: !140, line: 158, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !156, file: !140, line: 162, baseType: !39, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !139, file: !140, line: 262, baseType: !160, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !139, file: !140, line: 264, baseType: !39, size: 32, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !139, file: !140, line: 268, baseType: !39, size: 32, offset: 928)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !139, file: !140, line: 270, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 140, baseType: !167)
!167 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !139, file: !140, line: 274, baseType: !40, size: 16, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !139, file: !140, line: 275, baseType: !170, size: 8, offset: 1040)
!170 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !139, file: !140, line: 276, baseType: !172, size: 8, offset: 1048)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 1)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !139, file: !140, line: 280, baseType: !176, size: 64, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !140, line: 150, baseType: null)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !139, file: !140, line: 289, baseType: !179, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 141, baseType: !167)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !139, file: !140, line: 297, baseType: !23, size: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !139, file: !140, line: 298, baseType: !23, size: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !139, file: !140, line: 299, baseType: !23, size: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !139, file: !140, line: 300, baseType: !23, size: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !139, file: !140, line: 302, baseType: !30, size: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !139, file: !140, line: 303, baseType: !39, size: 32, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !139, file: !140, line: 305, baseType: !187, size: 160, offset: 1568)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 20)
!190 = !{!191, !192, !193, !198, !199, !201, !202, !206, !207, !209}
!191 = !DILocalVariable(name: "fp", arg: 1, scope: !133, file: !88, line: 278, type: !136)
!192 = !DILocalVariable(name: "file", scope: !133, file: !88, line: 281, type: !21)
!193 = !DILocalVariable(name: "__s1_len", scope: !194, file: !88, line: 290, type: !30)
!194 = distinct !DILexicalBlock(scope: !195, file: !88, line: 290, column: 11)
!195 = distinct !DILexicalBlock(scope: !196, file: !88, line: 290, column: 11)
!196 = distinct !DILexicalBlock(scope: !197, file: !88, line: 284, column: 5)
!197 = distinct !DILexicalBlock(scope: !133, file: !88, line: 283, column: 7)
!198 = !DILocalVariable(name: "__s2_len", scope: !194, file: !88, line: 290, type: !30)
!199 = !DILocalVariable(name: "__s2", scope: !200, file: !88, line: 290, type: !34)
!200 = distinct !DILexicalBlock(scope: !194, file: !88, line: 290, column: 11)
!201 = !DILocalVariable(name: "__result", scope: !200, file: !88, line: 290, type: !39)
!202 = !DILocalVariable(name: "__s1_len", scope: !203, file: !88, line: 301, type: !30)
!203 = distinct !DILexicalBlock(scope: !204, file: !88, line: 301, column: 11)
!204 = distinct !DILexicalBlock(scope: !205, file: !88, line: 301, column: 11)
!205 = distinct !DILexicalBlock(scope: !133, file: !88, line: 300, column: 5)
!206 = !DILocalVariable(name: "__s2_len", scope: !203, file: !88, line: 301, type: !30)
!207 = !DILocalVariable(name: "__s2", scope: !208, file: !88, line: 301, type: !34)
!208 = distinct !DILexicalBlock(scope: !203, file: !88, line: 301, column: 11)
!209 = !DILocalVariable(name: "__result", scope: !208, file: !88, line: 301, type: !39)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "max_column_width", scope: !87, file: !88, line: 41, type: !30, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !87, file: !88, line: 53, type: !30, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "tab_list", scope: !87, file: !88, line: 46, type: !24, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !87, file: !88, line: 49, type: !30, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "extend_size", scope: !87, file: !88, line: 38, type: !25, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "tab_size", scope: !87, file: !88, line: 35, type: !25, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !87, file: !88, line: 65, type: !224, isLocal: true, isDefinition: true)
!224 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!225 = !DIGlobalVariableExpression(var: !226)
!226 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !87, file: !88, line: 59, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "file_list", scope: !87, file: !88, line: 56, type: !232, isLocal: true, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!233 = !DIGlobalVariableExpression(var: !234)
!234 = distinct !DIGlobalVariable(name: "Version", scope: !235, file: !236, line: 2, type: !37, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, globals: !238)
!236 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!237 = !{}
!238 = !{!233}
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "file_name", scope: !241, file: !246, line: 36, type: !37, isLocal: true, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, globals: !243)
!242 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = !{!239, !244}
!244 = !DIGlobalVariableExpression(var: !245)
!245 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !241, file: !246, line: 46, type: !224, isLocal: true, isDefinition: true)
!246 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!247 = !DIGlobalVariableExpression(var: !248)
!248 = distinct !DIGlobalVariable(name: "exit_failure", scope: !249, file: !252, line: 24, type: !253, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, globals: !251)
!250 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!251 = !{!247}
!252 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!253 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "program_name", scope: !256, file: !260, line: 33, type: !37, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !258, globals: !259)
!257 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!258 = !{!23, !21}
!259 = !{!254}
!260 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !263, file: !275, line: 77, type: !310, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !265, retainedTypes: !271, globals: !272)
!264 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!265 = !{!90, !266, !5}
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !91, line: 242, size: 32, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!269 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!270 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!271 = !{!39, !40, !30, !21}
!272 = !{!261, !273, !280, !292, !294, !299, !306, !308}
!273 = !DIGlobalVariableExpression(var: !274)
!274 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !263, file: !275, line: 93, type: !276, isDefinition: true)
!275 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !278)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!278 = !{!279}
!279 = !DISubrange(count: 10)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !263, file: !275, line: 1043, type: !282, isDefinition: true)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !275, line: 57, size: 448, elements: !283)
!283 = !{!284, !285, !286, !290, !291}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !282, file: !275, line: 60, baseType: !90, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !282, file: !275, line: 63, baseType: !39, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !282, file: !275, line: 67, baseType: !287, size: 256, offset: 64)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 256, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !282, file: !275, line: 70, baseType: !37, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !282, file: !275, line: 73, baseType: !37, size: 64, offset: 384)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !263, file: !275, line: 108, type: !282, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295)
!295 = distinct !DIGlobalVariable(name: "slot0", scope: !263, file: !275, line: 834, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 256)
!299 = !DIGlobalVariableExpression(var: !300)
!300 = distinct !DIGlobalVariable(name: "slotvec", scope: !263, file: !275, line: 837, type: !301, isLocal: true, isDefinition: true)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !275, line: 826, size: 128, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !302, file: !275, line: 828, baseType: !30, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !302, file: !275, line: 829, baseType: !21, size: 64, offset: 64)
!306 = !DIGlobalVariableExpression(var: !307)
!307 = distinct !DIGlobalVariable(name: "nslots", scope: !263, file: !275, line: 835, type: !39, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309)
!309 = distinct !DIGlobalVariable(name: "slotvec0", scope: !263, file: !275, line: 836, type: !302, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 704, elements: !312)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!312 = !{!313}
!313 = !DISubrange(count: 11)
!314 = !DIGlobalVariableExpression(var: !315)
!315 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !316, file: !319, line: 26, type: !320, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, globals: !318)
!317 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!318 = !{!314}
!319 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 376, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 47)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !325, file: !668, line: 120, type: !669, isLocal: true, isDefinition: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !666, globals: !667)
!326 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!327 = !{!328}
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !329, line: 41, size: 32, elements: !330)
!329 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!331 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!332 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!333 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!334 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!335 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!336 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!337 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!338 = !DIEnumerator(name: "DAY_1", value: 131079)
!339 = !DIEnumerator(name: "DAY_2", value: 131080)
!340 = !DIEnumerator(name: "DAY_3", value: 131081)
!341 = !DIEnumerator(name: "DAY_4", value: 131082)
!342 = !DIEnumerator(name: "DAY_5", value: 131083)
!343 = !DIEnumerator(name: "DAY_6", value: 131084)
!344 = !DIEnumerator(name: "DAY_7", value: 131085)
!345 = !DIEnumerator(name: "ABMON_1", value: 131086)
!346 = !DIEnumerator(name: "ABMON_2", value: 131087)
!347 = !DIEnumerator(name: "ABMON_3", value: 131088)
!348 = !DIEnumerator(name: "ABMON_4", value: 131089)
!349 = !DIEnumerator(name: "ABMON_5", value: 131090)
!350 = !DIEnumerator(name: "ABMON_6", value: 131091)
!351 = !DIEnumerator(name: "ABMON_7", value: 131092)
!352 = !DIEnumerator(name: "ABMON_8", value: 131093)
!353 = !DIEnumerator(name: "ABMON_9", value: 131094)
!354 = !DIEnumerator(name: "ABMON_10", value: 131095)
!355 = !DIEnumerator(name: "ABMON_11", value: 131096)
!356 = !DIEnumerator(name: "ABMON_12", value: 131097)
!357 = !DIEnumerator(name: "MON_1", value: 131098)
!358 = !DIEnumerator(name: "MON_2", value: 131099)
!359 = !DIEnumerator(name: "MON_3", value: 131100)
!360 = !DIEnumerator(name: "MON_4", value: 131101)
!361 = !DIEnumerator(name: "MON_5", value: 131102)
!362 = !DIEnumerator(name: "MON_6", value: 131103)
!363 = !DIEnumerator(name: "MON_7", value: 131104)
!364 = !DIEnumerator(name: "MON_8", value: 131105)
!365 = !DIEnumerator(name: "MON_9", value: 131106)
!366 = !DIEnumerator(name: "MON_10", value: 131107)
!367 = !DIEnumerator(name: "MON_11", value: 131108)
!368 = !DIEnumerator(name: "MON_12", value: 131109)
!369 = !DIEnumerator(name: "AM_STR", value: 131110)
!370 = !DIEnumerator(name: "PM_STR", value: 131111)
!371 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!372 = !DIEnumerator(name: "D_FMT", value: 131113)
!373 = !DIEnumerator(name: "T_FMT", value: 131114)
!374 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!375 = !DIEnumerator(name: "ERA", value: 131116)
!376 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!377 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!378 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!379 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!380 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!381 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!382 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!383 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!384 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!385 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!386 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!387 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!388 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!389 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!390 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!391 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!392 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!393 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!394 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!395 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!396 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!397 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!398 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!399 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!400 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!401 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!402 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!403 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!404 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!405 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!406 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!407 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!408 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!409 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!410 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!411 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!412 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!413 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!414 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!415 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!416 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!417 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!418 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!419 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!420 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!421 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!422 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!423 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!424 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!425 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!426 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!427 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!428 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!429 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!430 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!431 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!432 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!433 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!434 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!435 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!436 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!437 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!438 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!439 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!440 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!441 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!442 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!443 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!444 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!445 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!446 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!447 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!448 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!449 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!450 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!451 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!452 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!453 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!454 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!455 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!456 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!457 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!458 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!459 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!460 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!461 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!462 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!463 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!464 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!466 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!467 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!469 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!470 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!472 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!473 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!474 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!475 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!476 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!477 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!478 = !DIEnumerator(name: "CODESET", value: 14)
!479 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!480 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!481 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!482 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!534 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!535 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!550 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!551 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!552 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!553 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!554 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!555 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!556 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!557 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!558 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!559 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!560 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!561 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!562 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!563 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!564 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!565 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!566 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!567 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!568 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!569 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!570 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!571 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!572 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!589 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!590 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!593 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!594 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!595 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!596 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!597 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!598 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!599 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!600 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!601 = !DIEnumerator(name: "THOUSEP", value: 65537)
!602 = !DIEnumerator(name: "__GROUPING", value: 65538)
!603 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!604 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!605 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!606 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!607 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!608 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!609 = !DIEnumerator(name: "__YESSTR", value: 327682)
!610 = !DIEnumerator(name: "__NOSTR", value: 327683)
!611 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!612 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!613 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!614 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!615 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!616 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!617 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!618 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!619 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!620 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!623 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!624 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!625 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!628 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!629 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!633 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!634 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!635 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!636 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!637 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!638 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!639 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!640 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!641 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!642 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!643 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!644 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!645 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!646 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!647 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!664 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!665 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!666 = !{!23, !21, !41}
!667 = !{!323}
!668 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !672)
!671 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = !{!104}
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !675, retainedTypes: !680)
!674 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!675 = !{!676}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !677, line: 41, size: 32, elements: !678)
!677 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = !{!679}
!679 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!680 = !{!23}
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !683, retainedTypes: !691)
!682 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!683 = !{!684}
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !685, file: !114, line: 192, size: 32, elements: !124)
!685 = distinct !DISubprogram(name: "x2nrealloc", scope: !114, file: !114, line: 180, type: !116, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !681, variables: !686)
!686 = !{!687, !688, !689, !690}
!687 = !DILocalVariable(name: "p", arg: 1, scope: !685, file: !114, line: 180, type: !23)
!688 = !DILocalVariable(name: "pn", arg: 2, scope: !685, file: !114, line: 180, type: !118)
!689 = !DILocalVariable(name: "s", arg: 3, scope: !685, file: !114, line: 180, type: !30)
!690 = !DILocalVariable(name: "n", scope: !685, file: !114, line: 182, type: !30)
!691 = !{!30, !21, !23}
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237)
!693 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237)
!695 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !680)
!697 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237)
!699 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !680)
!701 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !680)
!703 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !706)
!705 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!706 = !{!30}
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237)
!708 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 4.0.1 (tags/RELEASE_401/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !711)
!710 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !{!30, !32, !34, !37}
!712 = !{!"clang version 4.0.1 (tags/RELEASE_401/final)"}
!713 = !{i32 2, !"Dwarf Version", i32 4}
!714 = !{i32 2, !"Debug Info Version", i32 3}
!715 = !{i32 1, !"PIC Level", i32 2}
!716 = !{i32 1, !"PIE Level", i32 2}
!717 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 72, type: !718, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !39}
!720 = !{!721}
!721 = !DILocalVariable(name: "status", arg: 1, scope: !717, file: !3, line: 72, type: !39)
!722 = !DIExpression()
!723 = !DILocation(line: 72, column: 12, scope: !717)
!724 = !DILocation(line: 74, column: 14, scope: !725)
!725 = distinct !DILexicalBlock(scope: !717, file: !3, line: 74, column: 7)
!726 = !DILocation(line: 74, column: 7, scope: !717)
!727 = !DILocation(line: 75, column: 5, scope: !728)
!728 = !DILexicalBlockFile(scope: !729, file: !3, discriminator: 1)
!729 = distinct !DILexicalBlock(scope: !725, file: !3, line: 75, column: 5)
!730 = !{!731, !731, i64 0}
!731 = !{!"any pointer", !732, i64 0}
!732 = !{!"omnipotent char", !733, i64 0}
!733 = !{!"Simple C/C++ TBAA"}
!734 = !DILocation(line: 75, column: 5, scope: !735)
!735 = !DILexicalBlockFile(scope: !729, file: !3, discriminator: 3)
!736 = !DILocation(line: 75, column: 5, scope: !737)
!737 = !DILexicalBlockFile(scope: !729, file: !3, discriminator: 2)
!738 = !DILocation(line: 78, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !725, file: !3, line: 77, column: 5)
!740 = !DILocation(line: 78, column: 7, scope: !741)
!741 = !DILexicalBlockFile(scope: !739, file: !3, discriminator: 1)
!742 = !DILocation(line: 82, column: 7, scope: !739)
!743 = !DILocation(line: 82, column: 7, scope: !741)
!744 = !DILocation(line: 580, column: 3, scope: !745, inlinedAt: !748)
!745 = distinct !DISubprogram(name: "emit_stdin_note", scope: !46, file: !46, line: 578, type: !746, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !237)
!746 = !DISubroutineType(types: !747)
!747 = !{null}
!748 = distinct !DILocation(line: 86, column: 7, scope: !739)
!749 = !DILocation(line: 580, column: 3, scope: !750, inlinedAt: !748)
!750 = !DILexicalBlockFile(scope: !745, file: !46, discriminator: 1)
!751 = !DILocation(line: 587, column: 3, scope: !752, inlinedAt: !753)
!752 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !46, file: !46, line: 585, type: !746, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !237)
!753 = distinct !DILocation(line: 87, column: 7, scope: !739)
!754 = !DILocation(line: 587, column: 3, scope: !755, inlinedAt: !753)
!755 = !DILexicalBlockFile(scope: !752, file: !46, discriminator: 1)
!756 = !DILocation(line: 89, column: 7, scope: !739)
!757 = !DILocation(line: 89, column: 7, scope: !741)
!758 = !DILocation(line: 95, column: 7, scope: !739)
!759 = !DILocation(line: 95, column: 7, scope: !741)
!760 = !DILocation(line: 96, column: 7, scope: !739)
!761 = !DILocation(line: 96, column: 7, scope: !741)
!762 = !DILocation(line: 642, column: 15, scope: !45, inlinedAt: !763)
!763 = distinct !DILocation(line: 97, column: 7, scope: !739)
!764 = !DILocation(line: 651, column: 3, scope: !45, inlinedAt: !763)
!765 = !DILocation(line: 651, column: 3, scope: !766, inlinedAt: !763)
!766 = !DILexicalBlockFile(scope: !45, file: !46, discriminator: 1)
!767 = !DILocation(line: 655, column: 29, scope: !45, inlinedAt: !763)
!768 = !DILocation(line: 655, column: 15, scope: !45, inlinedAt: !763)
!769 = !DILocation(line: 656, column: 7, scope: !65, inlinedAt: !763)
!770 = !DILocation(line: 656, column: 19, scope: !65, inlinedAt: !763)
!771 = !DILocation(line: 656, column: 22, scope: !772, inlinedAt: !763)
!772 = !DILexicalBlockFile(scope: !65, file: !46, discriminator: 16)
!773 = !DILocation(line: 656, column: 7, scope: !774, inlinedAt: !763)
!774 = !DILexicalBlockFile(scope: !45, file: !46, discriminator: 16)
!775 = !DILocation(line: 662, column: 7, scope: !776, inlinedAt: !763)
!776 = distinct !DILexicalBlock(scope: !65, file: !46, line: 657, column: 5)
!777 = !DILocation(line: 662, column: 7, scope: !778, inlinedAt: !763)
!778 = !DILexicalBlockFile(scope: !776, file: !46, discriminator: 1)
!779 = !DILocation(line: 664, column: 5, scope: !776, inlinedAt: !763)
!780 = !DILocation(line: 665, column: 3, scope: !45, inlinedAt: !763)
!781 = !DILocation(line: 665, column: 3, scope: !766, inlinedAt: !763)
!782 = !DILocation(line: 667, column: 3, scope: !45, inlinedAt: !763)
!783 = !DILocation(line: 667, column: 3, scope: !766, inlinedAt: !763)
!784 = !DILocation(line: 99, column: 3, scope: !717)
!785 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 257, type: !786, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{!39, !39, !232}
!788 = !{!789, !790, !791, !792, !793, !794}
!789 = !DILocalVariable(name: "argc", arg: 1, scope: !785, file: !3, line: 257, type: !39)
!790 = !DILocalVariable(name: "argv", arg: 2, scope: !785, file: !3, line: 257, type: !232)
!791 = !DILocalVariable(name: "have_tabval", scope: !785, file: !3, line: 259, type: !224)
!792 = !DILocalVariable(name: "tabval", scope: !785, file: !3, line: 260, type: !25)
!793 = !DILocalVariable(name: "c", scope: !785, file: !3, line: 261, type: !39)
!794 = !DILocalVariable(name: "convert_first_only", scope: !785, file: !3, line: 265, type: !224)
!795 = !DILocation(line: 257, column: 11, scope: !785)
!796 = !DILocation(line: 257, column: 24, scope: !785)
!797 = !DILocation(line: 259, column: 8, scope: !785)
!798 = !DILocation(line: 265, column: 8, scope: !785)
!799 = !DILocation(line: 268, column: 21, scope: !785)
!800 = !DILocation(line: 268, column: 3, scope: !785)
!801 = !DILocation(line: 269, column: 3, scope: !785)
!802 = !DILocation(line: 270, column: 3, scope: !785)
!803 = !DILocation(line: 271, column: 3, scope: !785)
!804 = !DILocation(line: 273, column: 3, scope: !785)
!805 = !DILocation(line: 275, column: 3, scope: !785)
!806 = !DILocation(line: 260, column: 13, scope: !785)
!807 = !DILocation(line: 275, column: 15, scope: !808)
!808 = !DILexicalBlockFile(scope: !785, file: !3, discriminator: 1)
!809 = !DILocation(line: 261, column: 7, scope: !785)
!810 = !DILocation(line: 275, column: 3, scope: !808)
!811 = distinct !{!811, !805, !812}
!812 = !DILocation(line: 309, column: 5, scope: !785)
!813 = !DILocation(line: 281, column: 11, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 279, column: 9)
!815 = distinct !DILexicalBlock(scope: !785, file: !3, line: 277, column: 5)
!816 = !DILocation(line: 283, column: 31, scope: !814)
!817 = !{!818, !818, i64 0}
!818 = !{!"_Bool", !732, i64 0}
!819 = !DILocation(line: 284, column: 11, scope: !814)
!820 = !DILocation(line: 286, column: 31, scope: !814)
!821 = !DILocation(line: 287, column: 28, scope: !814)
!822 = !DILocation(line: 287, column: 11, scope: !814)
!823 = !DILocation(line: 288, column: 11, scope: !814)
!824 = !DILocation(line: 293, column: 15, scope: !825)
!825 = distinct !DILexicalBlock(scope: !814, file: !3, line: 293, column: 15)
!826 = !DILocation(line: 293, column: 15, scope: !814)
!827 = !DILocation(line: 294, column: 13, scope: !825)
!828 = !DILocation(line: 297, column: 9, scope: !814)
!829 = !DILocation(line: 298, column: 9, scope: !814)
!830 = !DILocation(line: 298, column: 9, scope: !831)
!831 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 1)
!832 = !DILocation(line: 300, column: 16, scope: !833)
!833 = distinct !DILexicalBlock(scope: !814, file: !3, line: 300, column: 15)
!834 = !DILocation(line: 300, column: 15, scope: !814)
!835 = !DILocation(line: 305, column: 16, scope: !836)
!836 = distinct !DILexicalBlock(scope: !814, file: !3, line: 305, column: 15)
!837 = !DILocation(line: 305, column: 16, scope: !838)
!838 = !DILexicalBlockFile(scope: !836, file: !3, discriminator: 1)
!839 = !DILocation(line: 305, column: 15, scope: !840)
!840 = !DILexicalBlockFile(scope: !814, file: !3, discriminator: 4)
!841 = !DILocation(line: 306, column: 13, scope: !836)
!842 = !DILocation(line: 306, column: 13, scope: !838)
!843 = !DILocation(line: 311, column: 7, scope: !844)
!844 = distinct !DILexicalBlock(scope: !785, file: !3, line: 311, column: 7)
!845 = !DILocation(line: 311, column: 7, scope: !785)
!846 = !DILocation(line: 312, column: 25, scope: !844)
!847 = !DILocation(line: 312, column: 5, scope: !844)
!848 = !DILocation(line: 314, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !785, file: !3, line: 314, column: 7)
!850 = !DILocation(line: 314, column: 7, scope: !785)
!851 = !DILocation(line: 315, column: 5, scope: !849)
!852 = !DILocation(line: 317, column: 3, scope: !785)
!853 = !DILocation(line: 319, column: 20, scope: !785)
!854 = !{!855, !855, i64 0}
!855 = !{!"int", !732, i64 0}
!856 = !DILocation(line: 319, column: 27, scope: !785)
!857 = !DILocation(line: 319, column: 38, scope: !808)
!858 = !DILocation(line: 319, column: 19, scope: !785)
!859 = !DILocation(line: 319, column: 3, scope: !860)
!860 = !DILexicalBlockFile(scope: !785, file: !3, discriminator: 3)
!861 = !DILocation(line: 109, column: 14, scope: !862, inlinedAt: !922)
!862 = distinct !DISubprogram(name: "unexpand", scope: !3, file: !3, line: 106, type: !746, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !863)
!863 = !{!864, !905, !906, !908, !909, !910, !911, !912, !913, !914, !915, !919}
!864 = !DILocalVariable(name: "fp", scope: !862, file: !3, line: 109, type: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !138, line: 49, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !140, line: 241, size: 1728, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !867, file: !140, line: 242, baseType: !39, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !867, file: !140, line: 247, baseType: !21, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !867, file: !140, line: 248, baseType: !21, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !867, file: !140, line: 249, baseType: !21, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !867, file: !140, line: 250, baseType: !21, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !867, file: !140, line: 251, baseType: !21, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !867, file: !140, line: 252, baseType: !21, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !867, file: !140, line: 253, baseType: !21, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !867, file: !140, line: 254, baseType: !21, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !867, file: !140, line: 256, baseType: !21, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !867, file: !140, line: 257, baseType: !21, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !867, file: !140, line: 258, baseType: !21, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !867, file: !140, line: 260, baseType: !882, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !140, line: 156, size: 192, elements: !884)
!884 = !{!885, !886, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !883, file: !140, line: 157, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !883, file: !140, line: 158, baseType: !887, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !883, file: !140, line: 162, baseType: !39, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !867, file: !140, line: 262, baseType: !887, size: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !867, file: !140, line: 264, baseType: !39, size: 32, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !867, file: !140, line: 268, baseType: !39, size: 32, offset: 928)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !867, file: !140, line: 270, baseType: !166, size: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !867, file: !140, line: 274, baseType: !40, size: 16, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !867, file: !140, line: 275, baseType: !170, size: 8, offset: 1040)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !867, file: !140, line: 276, baseType: !172, size: 8, offset: 1048)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !867, file: !140, line: 280, baseType: !176, size: 64, offset: 1088)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !867, file: !140, line: 289, baseType: !179, size: 64, offset: 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !867, file: !140, line: 297, baseType: !23, size: 64, offset: 1216)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !867, file: !140, line: 298, baseType: !23, size: 64, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !867, file: !140, line: 299, baseType: !23, size: 64, offset: 1344)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !867, file: !140, line: 300, baseType: !23, size: 64, offset: 1408)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !867, file: !140, line: 302, baseType: !30, size: 64, offset: 1472)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !867, file: !140, line: 303, baseType: !39, size: 32, offset: 1536)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !867, file: !140, line: 305, baseType: !187, size: 160, offset: 1568)
!905 = !DILocalVariable(name: "pending_blank", scope: !862, file: !3, line: 114, type: !21)
!906 = !DILocalVariable(name: "c", scope: !907, file: !3, line: 127, type: !39)
!907 = distinct !DILexicalBlock(scope: !862, file: !3, line: 125, column: 5)
!908 = !DILocalVariable(name: "convert", scope: !907, file: !3, line: 130, type: !224)
!909 = !DILocalVariable(name: "column", scope: !907, file: !3, line: 137, type: !25)
!910 = !DILocalVariable(name: "next_tab_column", scope: !907, file: !3, line: 140, type: !25)
!911 = !DILocalVariable(name: "tab_index", scope: !907, file: !3, line: 143, type: !30)
!912 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !907, file: !3, line: 146, type: !224)
!913 = !DILocalVariable(name: "prev_blank", scope: !907, file: !3, line: 151, type: !224)
!914 = !DILocalVariable(name: "pending", scope: !907, file: !3, line: 154, type: !30)
!915 = !DILocalVariable(name: "blank", scope: !916, file: !3, line: 166, type: !224)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 165, column: 13)
!917 = distinct !DILexicalBlock(scope: !918, file: !3, line: 164, column: 15)
!918 = distinct !DILexicalBlock(scope: !907, file: !3, line: 160, column: 9)
!919 = !DILocalVariable(name: "last_tab", scope: !920, file: !3, line: 170, type: !224)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 169, column: 17)
!921 = distinct !DILexicalBlock(scope: !916, file: !3, line: 168, column: 19)
!922 = distinct !DILocation(line: 321, column: 3, scope: !785)
!923 = !DILocation(line: 109, column: 9, scope: !862, inlinedAt: !922)
!924 = !DILocation(line: 116, column: 8, scope: !925, inlinedAt: !922)
!925 = distinct !DILexicalBlock(scope: !862, file: !3, line: 116, column: 7)
!926 = !DILocation(line: 116, column: 7, scope: !862, inlinedAt: !922)
!927 = !DILocation(line: 122, column: 28, scope: !862, inlinedAt: !922)
!928 = !{!929, !929, i64 0}
!929 = !{!"long", !732, i64 0}
!930 = !DILocation(line: 122, column: 19, scope: !862, inlinedAt: !922)
!931 = !DILocation(line: 114, column: 9, scope: !862, inlinedAt: !922)
!932 = !DILocation(line: 124, column: 3, scope: !862, inlinedAt: !922)
!933 = !DILocation(line: 130, column: 12, scope: !907, inlinedAt: !922)
!934 = !DILocation(line: 137, column: 17, scope: !907, inlinedAt: !922)
!935 = !DILocation(line: 140, column: 17, scope: !907, inlinedAt: !922)
!936 = !DILocation(line: 143, column: 7, scope: !907, inlinedAt: !922)
!937 = !DILocation(line: 143, column: 14, scope: !907, inlinedAt: !922)
!938 = !DILocation(line: 146, column: 12, scope: !907, inlinedAt: !922)
!939 = !DILocation(line: 151, column: 12, scope: !907, inlinedAt: !922)
!940 = !DILocation(line: 154, column: 14, scope: !907, inlinedAt: !922)
!941 = !DILocation(line: 159, column: 7, scope: !907, inlinedAt: !922)
!942 = distinct !{!942, !943, !944}
!943 = !DILocation(line: 159, column: 7, scope: !907)
!944 = !DILocation(line: 252, column: 23, scope: !907)
!945 = !DILocation(line: 161, column: 11, scope: !918, inlinedAt: !922)
!946 = !DILocalVariable(name: "__fp", arg: 1, scope: !947, file: !948, line: 63, type: !865)
!947 = distinct !DISubprogram(name: "getc_unlocked", scope: !948, file: !948, line: 63, type: !949, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !951)
!948 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!949 = !DISubroutineType(types: !950)
!950 = !{!39, !865}
!951 = !{!946}
!952 = !DILocation(line: 63, column: 22, scope: !947, inlinedAt: !953)
!953 = distinct !DILocation(line: 161, column: 23, scope: !954, inlinedAt: !922)
!954 = !DILexicalBlockFile(scope: !918, file: !3, discriminator: 1)
!955 = !DILocation(line: 65, column: 10, scope: !947, inlinedAt: !953)
!956 = !{!957, !731, i64 8}
!957 = !{!"_IO_FILE", !855, i64 0, !731, i64 8, !731, i64 16, !731, i64 24, !731, i64 32, !731, i64 40, !731, i64 48, !731, i64 56, !731, i64 64, !731, i64 72, !731, i64 80, !731, i64 88, !731, i64 96, !731, i64 104, !855, i64 112, !855, i64 116, !929, i64 120, !958, i64 128, !732, i64 130, !732, i64 131, !731, i64 136, !929, i64 144, !731, i64 152, !731, i64 160, !731, i64 168, !731, i64 176, !929, i64 184, !855, i64 192, !732, i64 196}
!958 = !{!"short", !732, i64 0}
!959 = !{!957, !731, i64 16}
!960 = !{!"branch_weights", i32 2000, i32 1}
!961 = !DILocation(line: 65, column: 10, scope: !962, inlinedAt: !953)
!962 = !DILexicalBlockFile(scope: !947, file: !948, discriminator: 2)
!963 = !{!732, !732, i64 0}
!964 = !DILocation(line: 127, column: 11, scope: !907, inlinedAt: !922)
!965 = !DILocation(line: 161, column: 38, scope: !954, inlinedAt: !922)
!966 = !DILocation(line: 65, column: 10, scope: !967, inlinedAt: !953)
!967 = !DILexicalBlockFile(scope: !947, file: !948, discriminator: 1)
!968 = !DILocation(line: 161, column: 34, scope: !954, inlinedAt: !922)
!969 = !DILocation(line: 161, column: 47, scope: !970, inlinedAt: !922)
!970 = !DILexicalBlockFile(scope: !918, file: !3, discriminator: 2)
!971 = !DILocation(line: 161, column: 38, scope: !970, inlinedAt: !922)
!972 = !DILocation(line: 161, column: 11, scope: !973, inlinedAt: !922)
!973 = !DILexicalBlockFile(scope: !918, file: !3, discriminator: 3)
!974 = distinct !{!974, !975, !976}
!975 = !DILocation(line: 161, column: 11, scope: !918)
!976 = !DILocation(line: 162, column: 13, scope: !918)
!977 = !DILocation(line: 164, column: 15, scope: !917, inlinedAt: !922)
!978 = !DILocation(line: 164, column: 15, scope: !918, inlinedAt: !922)
!979 = !DILocation(line: 166, column: 31, scope: !916, inlinedAt: !922)
!980 = !{!958, !958, i64 0}
!981 = !DILocation(line: 166, column: 29, scope: !916, inlinedAt: !922)
!982 = !DILocation(line: 166, column: 20, scope: !916, inlinedAt: !922)
!983 = !DILocation(line: 168, column: 19, scope: !916, inlinedAt: !922)
!984 = !DIExpression(DW_OP_deref)
!985 = !DILocation(line: 170, column: 24, scope: !920, inlinedAt: !922)
!986 = !DILocation(line: 170, column: 19, scope: !920, inlinedAt: !922)
!987 = !DILocation(line: 172, column: 37, scope: !920, inlinedAt: !922)
!988 = !DILocation(line: 175, column: 23, scope: !989, inlinedAt: !922)
!989 = distinct !DILexicalBlock(scope: !920, file: !3, line: 175, column: 23)
!990 = !{i8 0, i8 2}
!991 = !DILocation(line: 175, column: 23, scope: !920, inlinedAt: !922)
!992 = !DILocation(line: 178, column: 23, scope: !993, inlinedAt: !922)
!993 = distinct !DILexicalBlock(scope: !920, file: !3, line: 178, column: 23)
!994 = !DILocation(line: 178, column: 23, scope: !920, inlinedAt: !922)
!995 = !DILocation(line: 180, column: 43, scope: !996, inlinedAt: !922)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 180, column: 27)
!997 = distinct !DILexicalBlock(scope: !993, file: !3, line: 179, column: 21)
!998 = !DILocation(line: 180, column: 27, scope: !997, inlinedAt: !922)
!999 = !DILocation(line: 181, column: 25, scope: !996, inlinedAt: !922)
!1000 = !DILocation(line: 181, column: 25, scope: !1001, inlinedAt: !922)
!1001 = !DILexicalBlockFile(scope: !996, file: !3, discriminator: 1)
!1002 = !DILocation(line: 183, column: 29, scope: !1003, inlinedAt: !922)
!1003 = distinct !DILexicalBlock(scope: !997, file: !3, line: 183, column: 27)
!1004 = !DILocation(line: 183, column: 27, scope: !997, inlinedAt: !922)
!1005 = !DILocation(line: 187, column: 31, scope: !1006, inlinedAt: !922)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 187, column: 31)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 184, column: 25)
!1008 = !DILocation(line: 187, column: 31, scope: !1007, inlinedAt: !922)
!1009 = !DILocation(line: 192, column: 33, scope: !1010, inlinedAt: !922)
!1010 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 191, column: 25)
!1011 = !DILocation(line: 194, column: 34, scope: !1012, inlinedAt: !922)
!1012 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 194, column: 31)
!1013 = !DILocation(line: 194, column: 55, scope: !1014, inlinedAt: !922)
!1014 = !DILexicalBlockFile(scope: !1012, file: !3, discriminator: 1)
!1015 = !DILocation(line: 194, column: 45, scope: !1012, inlinedAt: !922)
!1016 = !DILocation(line: 211, column: 33, scope: !997, inlinedAt: !922)
!1017 = !DILocation(line: 212, column: 21, scope: !997, inlinedAt: !922)
!1018 = !DILocation(line: 213, column: 17, scope: !921, inlinedAt: !922)
!1019 = !DILocation(line: 214, column: 26, scope: !1020, inlinedAt: !922)
!1020 = distinct !DILexicalBlock(scope: !921, file: !3, line: 214, column: 24)
!1021 = !DILocation(line: 214, column: 24, scope: !921, inlinedAt: !922)
!1022 = !DILocation(line: 218, column: 30, scope: !1023, inlinedAt: !922)
!1023 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 215, column: 17)
!1024 = !DILocation(line: 218, column: 29, scope: !1023, inlinedAt: !922)
!1025 = !DILocation(line: 218, column: 26, scope: !1023, inlinedAt: !922)
!1026 = !DILocation(line: 220, column: 34, scope: !1023, inlinedAt: !922)
!1027 = !DILocation(line: 220, column: 33, scope: !1023, inlinedAt: !922)
!1028 = !DILocation(line: 220, column: 32, scope: !1023, inlinedAt: !922)
!1029 = !DILocation(line: 220, column: 29, scope: !1023, inlinedAt: !922)
!1030 = !DILocation(line: 221, column: 17, scope: !1023, inlinedAt: !922)
!1031 = !DILocation(line: 224, column: 25, scope: !1032, inlinedAt: !922)
!1032 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 223, column: 17)
!1033 = !DILocation(line: 225, column: 24, scope: !1034, inlinedAt: !922)
!1034 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 225, column: 23)
!1035 = !DILocation(line: 225, column: 23, scope: !1032, inlinedAt: !922)
!1036 = !DILocation(line: 226, column: 21, scope: !1034, inlinedAt: !922)
!1037 = !DILocation(line: 226, column: 21, scope: !1038, inlinedAt: !922)
!1038 = !DILexicalBlockFile(scope: !1034, file: !3, discriminator: 1)
!1039 = !DILocation(line: 229, column: 19, scope: !916, inlinedAt: !922)
!1040 = !DILocation(line: 231, column: 38, scope: !1041, inlinedAt: !922)
!1041 = !DILexicalBlockFile(scope: !1042, file: !3, discriminator: 1)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 231, column: 23)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 230, column: 17)
!1044 = distinct !DILexicalBlock(scope: !916, file: !3, line: 229, column: 19)
!1045 = !DILocation(line: 231, column: 23, scope: !1046, inlinedAt: !922)
!1046 = !DILexicalBlockFile(scope: !1043, file: !3, discriminator: 1)
!1047 = !DILocation(line: 232, column: 38, scope: !1042, inlinedAt: !922)
!1048 = !DILocation(line: 232, column: 21, scope: !1042, inlinedAt: !922)
!1049 = !DILocation(line: 233, column: 23, scope: !1050, inlinedAt: !922)
!1050 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 233, column: 23)
!1051 = !DILocation(line: 233, column: 66, scope: !1050, inlinedAt: !922)
!1052 = !DILocation(line: 233, column: 23, scope: !1043, inlinedAt: !922)
!1053 = !DILocation(line: 234, column: 21, scope: !1050, inlinedAt: !922)
!1054 = !DILocation(line: 234, column: 21, scope: !1055, inlinedAt: !922)
!1055 = !DILexicalBlockFile(scope: !1050, file: !3, discriminator: 1)
!1056 = !DILocation(line: 234, column: 21, scope: !1057, inlinedAt: !922)
!1057 = !DILexicalBlockFile(scope: !1050, file: !3, discriminator: 2)
!1058 = !DILocation(line: 240, column: 26, scope: !916, inlinedAt: !922)
!1059 = !DILocation(line: 240, column: 46, scope: !916, inlinedAt: !922)
!1060 = !DILocation(line: 240, column: 46, scope: !1061, inlinedAt: !922)
!1061 = !DILexicalBlockFile(scope: !916, file: !3, discriminator: 2)
!1062 = !DILocation(line: 240, column: 23, scope: !1061, inlinedAt: !922)
!1063 = !DILocation(line: 198, column: 35, scope: !1064, inlinedAt: !922)
!1064 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 195, column: 29)
!1065 = !DILocation(line: 200, column: 58, scope: !1064, inlinedAt: !922)
!1066 = !DILocation(line: 200, column: 52, scope: !1064, inlinedAt: !922)
!1067 = !DILocation(line: 200, column: 31, scope: !1064, inlinedAt: !922)
!1068 = !DILocation(line: 200, column: 56, scope: !1064, inlinedAt: !922)
!1069 = !DILocation(line: 243, column: 17, scope: !1070, inlinedAt: !922)
!1070 = distinct !DILexicalBlock(scope: !918, file: !3, line: 243, column: 15)
!1071 = !DILocation(line: 243, column: 15, scope: !918, inlinedAt: !922)
!1072 = !DILocation(line: 245, column: 15, scope: !1073, inlinedAt: !922)
!1073 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 244, column: 13)
!1074 = !DILocation(line: 253, column: 5, scope: !862, inlinedAt: !922)
!1075 = !DILocalVariable(name: "__c", arg: 1, scope: !1076, file: !948, line: 105, type: !39)
!1076 = distinct !DISubprogram(name: "putchar_unlocked", scope: !948, file: !948, line: 105, type: !1077, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1079)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!39, !39}
!1079 = !{!1075}
!1080 = !DILocation(line: 105, column: 23, scope: !1076, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 249, column: 15, scope: !1082, inlinedAt: !922)
!1082 = distinct !DILexicalBlock(scope: !918, file: !3, line: 249, column: 15)
!1083 = !DILocation(line: 107, column: 10, scope: !1076, inlinedAt: !1081)
!1084 = !{!957, !731, i64 40}
!1085 = !{!957, !731, i64 48}
!1086 = !DILocation(line: 107, column: 10, scope: !1087, inlinedAt: !1081)
!1087 = !DILexicalBlockFile(scope: !1076, file: !948, discriminator: 2)
!1088 = !DILocation(line: 249, column: 15, scope: !918, inlinedAt: !922)
!1089 = !DILocation(line: 107, column: 10, scope: !1090, inlinedAt: !1081)
!1090 = !DILexicalBlockFile(scope: !1076, file: !948, discriminator: 1)
!1091 = !DILocation(line: 249, column: 27, scope: !1082, inlinedAt: !922)
!1092 = !DILocation(line: 250, column: 13, scope: !1082, inlinedAt: !922)
!1093 = !DILocation(line: 250, column: 13, scope: !1094, inlinedAt: !922)
!1094 = !DILexicalBlockFile(scope: !1082, file: !3, discriminator: 1)
!1095 = !DILocation(line: 250, column: 13, scope: !1096, inlinedAt: !922)
!1096 = !DILexicalBlockFile(scope: !1082, file: !3, discriminator: 2)
!1097 = !DILocation(line: 252, column: 16, scope: !907, inlinedAt: !922)
!1098 = !DILocation(line: 251, column: 9, scope: !954, inlinedAt: !922)
!1099 = !DILocation(line: 323, column: 3, scope: !785)
!1100 = !DILocation(line: 325, column: 10, scope: !785)
!1101 = !DILocation(line: 326, column: 1, scope: !785)
!1102 = distinct !DISubprogram(name: "add_tab_stop", scope: !88, file: !88, line: 74, type: !1103, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !1105)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !25}
!1105 = !{!1106, !1107, !1108}
!1106 = !DILocalVariable(name: "tabval", arg: 1, scope: !1102, file: !88, line: 74, type: !25)
!1107 = !DILocalVariable(name: "prev_column", scope: !1102, file: !88, line: 76, type: !25)
!1108 = !DILocalVariable(name: "column_width", scope: !1102, file: !88, line: 77, type: !25)
!1109 = !DILocation(line: 74, column: 25, scope: !1102)
!1110 = !DILocation(line: 76, column: 27, scope: !1102)
!1111 = !DILocation(line: 76, column: 44, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1102, file: !88, discriminator: 1)
!1113 = !DILocation(line: 76, column: 68, scope: !1112)
!1114 = !DILocation(line: 76, column: 27, scope: !1112)
!1115 = !DILocation(line: 76, column: 27, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1102, file: !88, discriminator: 3)
!1117 = !DILocation(line: 76, column: 13, scope: !1102)
!1118 = !DILocation(line: 77, column: 40, scope: !1102)
!1119 = !DILocation(line: 77, column: 59, scope: !1112)
!1120 = !DILocation(line: 77, column: 28, scope: !1102)
!1121 = !DILocation(line: 77, column: 13, scope: !1102)
!1122 = !DILocation(line: 79, column: 25, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1102, file: !88, line: 79, column: 7)
!1124 = !DILocation(line: 79, column: 22, scope: !1123)
!1125 = !DILocation(line: 79, column: 7, scope: !1102)
!1126 = !DILocation(line: 80, column: 16, scope: !1123)
!1127 = !DILocation(line: 180, column: 19, scope: !115, inlinedAt: !1128)
!1128 = distinct !DILocation(line: 80, column: 16, scope: !1123)
!1129 = !DILocation(line: 180, column: 30, scope: !115, inlinedAt: !1128)
!1130 = !DILocation(line: 180, column: 41, scope: !115, inlinedAt: !1128)
!1131 = !DILocation(line: 182, column: 10, scope: !115, inlinedAt: !1128)
!1132 = !DILocation(line: 184, column: 9, scope: !1133, inlinedAt: !1128)
!1133 = distinct !DILexicalBlock(scope: !115, file: !114, line: 184, column: 7)
!1134 = !DILocation(line: 184, column: 7, scope: !115, inlinedAt: !1128)
!1135 = !DILocation(line: 186, column: 11, scope: !1136, inlinedAt: !1128)
!1136 = distinct !DILexicalBlock(scope: !1133, file: !114, line: 185, column: 5)
!1137 = !DILocation(line: 205, column: 11, scope: !1138, inlinedAt: !1128)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !114, line: 204, column: 11)
!1139 = distinct !DILexicalBlock(scope: !1133, file: !114, line: 199, column: 5)
!1140 = !DILocation(line: 204, column: 11, scope: !1139, inlinedAt: !1128)
!1141 = !DILocation(line: 206, column: 9, scope: !1138, inlinedAt: !1128)
!1142 = !DILocation(line: 207, column: 14, scope: !1139, inlinedAt: !1128)
!1143 = !DILocation(line: 207, column: 18, scope: !1139, inlinedAt: !1128)
!1144 = !DILocation(line: 207, column: 9, scope: !1139, inlinedAt: !1128)
!1145 = !DILocation(line: 210, column: 7, scope: !115, inlinedAt: !1128)
!1146 = !DILocation(line: 211, column: 25, scope: !115, inlinedAt: !1128)
!1147 = !DILocation(line: 211, column: 10, scope: !115, inlinedAt: !1128)
!1148 = !DILocation(line: 80, column: 14, scope: !1123)
!1149 = !DILocation(line: 80, column: 5, scope: !1123)
!1150 = !DILocation(line: 81, column: 26, scope: !1102)
!1151 = !DILocation(line: 81, column: 3, scope: !1102)
!1152 = !DILocation(line: 81, column: 30, scope: !1102)
!1153 = !DILocation(line: 83, column: 7, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1102, file: !88, line: 83, column: 7)
!1155 = !DILocation(line: 83, column: 24, scope: !1154)
!1156 = !DILocation(line: 83, column: 7, scope: !1102)
!1157 = !DILocation(line: 87, column: 24, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1154, file: !88, line: 84, column: 5)
!1159 = !DILocation(line: 88, column: 5, scope: !1158)
!1160 = !DILocation(line: 89, column: 1, scope: !1102)
!1161 = distinct !DISubprogram(name: "parse_tab_stops", scope: !88, file: !88, line: 111, type: !47, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1179}
!1163 = !DILocalVariable(name: "stops", arg: 1, scope: !1161, file: !88, line: 111, type: !37)
!1164 = !DILocalVariable(name: "have_tabval", scope: !1161, file: !88, line: 113, type: !224)
!1165 = !DILocalVariable(name: "tabval", scope: !1161, file: !88, line: 114, type: !25)
!1166 = !DILocalVariable(name: "extend_tabval", scope: !1161, file: !88, line: 115, type: !224)
!1167 = !DILocalVariable(name: "num_start", scope: !1161, file: !88, line: 116, type: !37)
!1168 = !DILocalVariable(name: "ok", scope: !1161, file: !88, line: 117, type: !224)
!1169 = !DILocalVariable(name: "len", scope: !1170, file: !88, line: 160, type: !30)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !88, line: 159, column: 13)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !88, line: 158, column: 15)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !88, line: 149, column: 9)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !88, line: 148, column: 16)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !88, line: 138, column: 16)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !88, line: 121, column: 11)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !88, line: 120, column: 5)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !88, line: 119, column: 3)
!1178 = distinct !DILexicalBlock(scope: !1161, file: !88, line: 119, column: 3)
!1179 = !DILocalVariable(name: "bad_num", scope: !1170, file: !88, line: 161, type: !21)
!1180 = !DILocation(line: 111, column: 30, scope: !1161)
!1181 = !DILocation(line: 113, column: 8, scope: !1161)
!1182 = !DILocation(line: 114, column: 13, scope: !1161)
!1183 = !DILocation(line: 115, column: 8, scope: !1161)
!1184 = !DILocation(line: 116, column: 15, scope: !1161)
!1185 = !DILocation(line: 117, column: 8, scope: !1161)
!1186 = !DILocation(line: 119, column: 3, scope: !1161)
!1187 = !DILocation(line: 119, column: 10, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1177, file: !88, discriminator: 1)
!1189 = !DILocation(line: 119, column: 3, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1178, file: !88, discriminator: 1)
!1191 = !DILocation(line: 121, column: 28, scope: !1192)
!1192 = !DILexicalBlockFile(scope: !1175, file: !88, discriminator: 1)
!1193 = !DILocation(line: 121, column: 11, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1176, file: !88, discriminator: 1)
!1195 = !DILocation(line: 123, column: 15, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !88, line: 123, column: 15)
!1197 = distinct !DILexicalBlock(scope: !1175, file: !88, line: 122, column: 9)
!1198 = !DILocation(line: 123, column: 15, scope: !1197)
!1199 = !DILocation(line: 125, column: 19, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !88, line: 125, column: 19)
!1201 = distinct !DILexicalBlock(scope: !1196, file: !88, line: 124, column: 13)
!1202 = !DILocation(line: 125, column: 19, scope: !1201)
!1203 = !DILocalVariable(name: "tabval", arg: 1, scope: !1204, file: !88, line: 92, type: !25)
!1204 = distinct !DISubprogram(name: "set_extend_size", scope: !88, file: !88, line: 92, type: !1205, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !1207)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!224, !25}
!1207 = !{!1203, !1208}
!1208 = !DILocalVariable(name: "ok", scope: !1204, file: !88, line: 94, type: !224)
!1209 = !DILocation(line: 92, column: 28, scope: !1204, inlinedAt: !1210)
!1210 = distinct !DILocation(line: 127, column: 25, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !88, line: 127, column: 23)
!1212 = distinct !DILexicalBlock(scope: !1200, file: !88, line: 126, column: 17)
!1213 = !DILocation(line: 94, column: 8, scope: !1204, inlinedAt: !1210)
!1214 = !DILocation(line: 96, column: 7, scope: !1215, inlinedAt: !1210)
!1215 = distinct !DILexicalBlock(scope: !1204, file: !88, line: 96, column: 7)
!1216 = !DILocation(line: 96, column: 7, scope: !1204, inlinedAt: !1210)
!1217 = !DILocation(line: 103, column: 15, scope: !1204, inlinedAt: !1210)
!1218 = !DILocation(line: 127, column: 23, scope: !1212)
!1219 = !DILocation(line: 99, column: 14, scope: !1220, inlinedAt: !1210)
!1220 = distinct !DILexicalBlock(scope: !1215, file: !88, line: 97, column: 5)
!1221 = !DILocation(line: 98, column: 7, scope: !1220, inlinedAt: !1210)
!1222 = !DILocation(line: 74, column: 25, scope: !1102, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 134, column: 17, scope: !1200)
!1224 = !DILocation(line: 76, column: 27, scope: !1102, inlinedAt: !1223)
!1225 = !DILocation(line: 76, column: 44, scope: !1112, inlinedAt: !1223)
!1226 = !DILocation(line: 76, column: 68, scope: !1112, inlinedAt: !1223)
!1227 = !DILocation(line: 76, column: 27, scope: !1112, inlinedAt: !1223)
!1228 = !DILocation(line: 76, column: 27, scope: !1116, inlinedAt: !1223)
!1229 = !DILocation(line: 76, column: 13, scope: !1102, inlinedAt: !1223)
!1230 = !DILocation(line: 77, column: 40, scope: !1102, inlinedAt: !1223)
!1231 = !DILocation(line: 77, column: 59, scope: !1112, inlinedAt: !1223)
!1232 = !DILocation(line: 77, column: 28, scope: !1102, inlinedAt: !1223)
!1233 = !DILocation(line: 77, column: 13, scope: !1102, inlinedAt: !1223)
!1234 = !DILocation(line: 79, column: 25, scope: !1123, inlinedAt: !1223)
!1235 = !DILocation(line: 79, column: 22, scope: !1123, inlinedAt: !1223)
!1236 = !DILocation(line: 79, column: 7, scope: !1102, inlinedAt: !1223)
!1237 = !DILocation(line: 80, column: 16, scope: !1123, inlinedAt: !1223)
!1238 = !DILocation(line: 180, column: 19, scope: !115, inlinedAt: !1239)
!1239 = distinct !DILocation(line: 80, column: 16, scope: !1123, inlinedAt: !1223)
!1240 = !DILocation(line: 180, column: 30, scope: !115, inlinedAt: !1239)
!1241 = !DILocation(line: 180, column: 41, scope: !115, inlinedAt: !1239)
!1242 = !DILocation(line: 182, column: 10, scope: !115, inlinedAt: !1239)
!1243 = !DILocation(line: 184, column: 9, scope: !1133, inlinedAt: !1239)
!1244 = !DILocation(line: 184, column: 7, scope: !115, inlinedAt: !1239)
!1245 = !DILocation(line: 186, column: 11, scope: !1136, inlinedAt: !1239)
!1246 = !DILocation(line: 205, column: 11, scope: !1138, inlinedAt: !1239)
!1247 = !DILocation(line: 204, column: 11, scope: !1139, inlinedAt: !1239)
!1248 = !DILocation(line: 206, column: 9, scope: !1138, inlinedAt: !1239)
!1249 = !DILocation(line: 207, column: 14, scope: !1139, inlinedAt: !1239)
!1250 = !DILocation(line: 207, column: 18, scope: !1139, inlinedAt: !1239)
!1251 = !DILocation(line: 207, column: 9, scope: !1139, inlinedAt: !1239)
!1252 = !DILocation(line: 210, column: 7, scope: !115, inlinedAt: !1239)
!1253 = !DILocation(line: 211, column: 25, scope: !115, inlinedAt: !1239)
!1254 = !DILocation(line: 211, column: 10, scope: !115, inlinedAt: !1239)
!1255 = !DILocation(line: 80, column: 14, scope: !1123, inlinedAt: !1223)
!1256 = !DILocation(line: 80, column: 5, scope: !1123, inlinedAt: !1223)
!1257 = !DILocation(line: 81, column: 26, scope: !1102, inlinedAt: !1223)
!1258 = !DILocation(line: 81, column: 3, scope: !1102, inlinedAt: !1223)
!1259 = !DILocation(line: 81, column: 30, scope: !1102, inlinedAt: !1223)
!1260 = !DILocation(line: 83, column: 7, scope: !1154, inlinedAt: !1223)
!1261 = !DILocation(line: 83, column: 24, scope: !1154, inlinedAt: !1223)
!1262 = !DILocation(line: 83, column: 7, scope: !1102, inlinedAt: !1223)
!1263 = !DILocation(line: 87, column: 24, scope: !1158, inlinedAt: !1223)
!1264 = !DILocation(line: 88, column: 5, scope: !1158, inlinedAt: !1223)
!1265 = !DILocation(line: 138, column: 23, scope: !1174)
!1266 = !DILocation(line: 138, column: 16, scope: !1175)
!1267 = !DILocation(line: 140, column: 15, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !88, line: 140, column: 15)
!1269 = distinct !DILexicalBlock(scope: !1174, file: !88, line: 139, column: 9)
!1270 = !DILocation(line: 140, column: 15, scope: !1269)
!1271 = !DILocation(line: 142, column: 28, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1268, file: !88, line: 141, column: 13)
!1273 = !DILocation(line: 143, column: 22, scope: !1272)
!1274 = !DILocation(line: 142, column: 15, scope: !1275)
!1275 = !DILexicalBlockFile(scope: !1272, file: !88, discriminator: 1)
!1276 = !DILocation(line: 145, column: 13, scope: !1272)
!1277 = !DILocation(line: 138, column: 16, scope: !1174)
!1278 = !DILocation(line: 148, column: 16, scope: !1173)
!1279 = !DILocation(line: 148, column: 16, scope: !1174)
!1280 = !DILocation(line: 150, column: 16, scope: !1281)
